package utils;

import ttjj.dto.CondEtfAdrCount;
import ttjj.dto.EtfAdrCountVo;
import ttjj.service.EtfAdrCountService;

import java.math.BigDecimal;
import java.util.*;
import java.util.stream.Collectors;

import static utils.Content.*;

/**
 * 常量-ETF头部数据
 */
public class ContMapEtfTop {
    /**
     * 指数
     */
    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘
    static {
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.87     累涨：51.10     18.09     19.63     13.38     10日：5.28      0.85      0.85      1         累涨修正：61.48     净值区间：76      87      93      97      93      1
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：13.14     累涨：35.56     7.02      21.62     6.92      10日：3.39      2.35      2.07      2         累涨修正：51.93     净值区间：79      82      88      97      97      2
        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：5.06      累涨：43.56     13.83     20.48     9.25      10日：2.26      1.08      0.39      3         累涨修正：49.54     净值区间：13      6       42      75      75      3
//        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：16.22     累涨：39.26     10.21     17.81     11.24     10日：4.44      0.83      0.83      4         累涨修正：48.68     净值区间：74      89      94      98      98      4
//        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.88      累涨：33.15     6.32      20.45     6.38      10日：2.85      2.02      1.93      8         累涨修正：47.76     净值区间：92      93      94      99      92      5
//        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：14.55     累涨：31.64     5.55      18.65     7.44      10日：3.36      2.16      1.86      6         累涨修正：46.76     净值区间：93      94      96      99      99      6
//        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：14.27     累涨：32.08     6.07      18.82     7.19      10日：3.05      1.94      1.80      9         累涨修正：46.21     净值区间：91      92      94      99      99      7
//        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：7.86      累涨：33.19     7.80      18.96     6.43      10日：3.08      1.98      1.43      7         累涨修正：45.95     净值区间：75      84      87      97      97      8
//        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：16.08     累涨：42.10     9.68      22.38     10.04     10日：1.23      0.66      0.08      5         累涨修正：44.97     净值区间：69      39      61      86      86      9
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：10.24     累涨：38.42     15.48     12.51     10.43     10日：0.87      0.58                10        累涨修正：40.45     净值区间：18      11      17      33      30      10
//        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：5.61      累涨：33.70     8.63      17.31     7.76      10日：2.17      0.82      0.52      11        累涨修正：39.59     净值区间：86      87      95      99      91      11
//        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：8.44      累涨：29.39     10.16     14.08     5.15      10日：0.70      0.10      0.10      12        累涨修正：30.69     净值区间：33      17      8       34      29      12
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：8.84      累涨：                                        10日：                              13        累涨修正：0         净值区间：73      62      77      93      89      13
    }
    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股
    static {
        INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：6.62      累涨：91.36     42.39     25.84     23.13     10日：11.64     9.55      5.04      1         累涨修正：142.26    净值区间：82      87      79      88      78      1
        INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：6.47      累涨：74.34     30.38     21.14     22.82     10日：7.36      2.21      1.64      3         累涨修正：92.68     净值区间：58      61      76      82      74      2
        INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：99.70     累涨：54.56     12.28     26.82     15.46     10日：4.39      3.13      3.06      2         累涨修正：77.45     净值区间：93      93      97      98      98      3
//        INDEX_CN_NOT_USA.put("159941", "指数-外盘-美股        ");//纳指ETF               市值：260.99    累涨：46.95     11.38     23.84     11.73     10日：3.45      2.25      2.25      4         累涨修正：63.9      净值区间：96      96      98      99      99      4
//        INDEX_CN_NOT_USA.put("513350", "指数-外盘-美股        ");//标普油气ETF           市值：6.36      累涨：50.03     11.56     24.26     14.21     10日：2.68      2.13      1.68      1         累涨修正：63.69     净值区间：92      55      71      69      49      5
//        INDEX_CN_NOT_USA.put("513100", "指数-外盘-美股        ");//纳指ETF               市值：150.94    累涨：46.63     11.01     23.86     11.76     10日：3.43      2.20      2.20      5         累涨修正：63.26     净值区间：92      92      97      99      99      6
//        INDEX_CN_NOT_USA.put("159518", "指数-外盘-美股        ");//标普油气ETF           市值：8.53      累涨：47.90     9.51      24.39     14.00     10日：2.67      2.10      1.75      2         累涨修正：61.77     净值区间：88      56      71      69      63      7
//        INDEX_CN_NOT_USA.put("513390", "指数-外盘-美股        ");//纳指100ETF            市值：28.74     累涨：47.28     11.80     23.75     11.73     10日：2.93      1.52      1.52      8         累涨修正：59.33     净值区间：92      92      97      99      93      8
//        INDEX_CN_NOT_USA.put("159696", "指数-外盘-美股        ");//纳指ETF易方达         市值：29.82     累涨：45.52     8.73      25.09     11.70     10日：3.12      1.78      1.78      6         累涨修正：59.32     净值区间：90      90      97      98      98      9
//        INDEX_CN_NOT_USA.put("159659", "指数-外盘-美股        ");//纳斯达克100ETF        市值：50.93     累涨：45.33     8.98      25.16     11.19     10日：2.99      1.77      1.77      7         累涨修正：58.94     净值区间：93      93      98      99      99      10
//        INDEX_CN_NOT_USA.put("159632", "指数-外盘-美股        ");//纳斯达克ETF           市值：95.83     累涨：46.97     11.53     24.04     11.40     10日：2.70      1.49      1.49      15        累涨修正：58.61     净值区间：93      93      98      99      99      11
//        INDEX_CN_NOT_USA.put("513300", "指数-外盘-美股        ");//纳斯达克ETF           市值：94.79     累涨：45.16     10.60     24.22     10.34     10日：2.83      1.62      1.62      11        累涨修正：57.71     净值区间：93      93      97      99      99      12
//        INDEX_CN_NOT_USA.put("159513", "指数-外盘-美股        ");//纳斯达克100指数ETF    市值：61.83     累涨：46.53     9.64      25.98     10.91     10日：2.66      1.41      1.41      13        累涨修正：57.65     净值区间：93      93      98      99      99      13
//        INDEX_CN_NOT_USA.put("513870", "指数-外盘-美股        ");//纳指ETF富国           市值：18.30     累涨：45.08     8.66      25.16     11.26     10日：2.77      1.60      1.60      14        累涨修正：57.45     净值区间：92      92      97      99      99      14
//        INDEX_CN_NOT_USA.put("513110", "指数-外盘-美股        ");//纳斯达克100ETF        市值：40.08     累涨：45.31     8.91      25.07     11.33     10日：2.85      1.54      1.54      12        累涨修正：57.4      净值区间：94      94      98      99      99      15
//        INDEX_CN_NOT_USA.put("159577", "指数-外盘-美股        ");//美国50ETF             市值：11.34     累涨：44.17     8.49      25.38     10.30     10日：3.14      1.66      1.66      9         累涨修正：57.27     净值区间：91      91      96      98      97      16
//        INDEX_CN_NOT_USA.put("159501", "指数-外盘-美股        ");//纳斯达克指数ETF       市值：75.68     累涨：45.06     8.91      24.65     11.50     10日：2.80      1.54      1.54      10        累涨修正：57.1      净值区间：94      94      98      99      99      17
//        INDEX_CN_NOT_USA.put("159660", "指数-外盘-美股        ");//纳指100ETF            市值：30.15     累涨：43.06     8.68      24.23     10.15     10日：2.58      1.56      1.56      16        累涨修正：55        净值区间：93      93      97      99      99      18
//        INDEX_CN_NOT_USA.put("513850", "指数-外盘-美股        ");//美国50ETF             市值：20.51     累涨：43.43     8.27      25.59     9.57      10日：2.60      1.41      1.41      17        累涨修正：54.49     净值区间：94      94      97      99      99      19
//        INDEX_CN_NOT_USA.put("159502", "指数-外盘-美股        ");//标普生物科技ETF       市值：13.22     累涨：41.99     8.49      22.35     11.15     10日：6.56      0.94      0.94      34        累涨修正：54.19     净值区间：86      70      56      67      49      20
//        INDEX_CN_NOT_USA.put("513290", "指数-外盘-美股        ");//纳指生物科技ETF       市值：12.50     累涨：39.60     7.74      20.88     10.98     10日：6.66      1.01      1.01      33        累涨修正：52.32     净值区间：100     80      76      72      52      21
//        INDEX_CN_NOT_USA.put("513650", "指数-外盘-美股        ");//标普500ETF南方        市值：35.42     累涨：40.60     8.38      23.24     8.98      10日：3.09      1.32      1.32      18        累涨修正：51.61     净值区间：93      93      97      99      93      22
//        INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：191.16    累涨：39.13     7.60      22.34     9.19      10日：2.90      1.30      1.30      20        累涨修正：49.83     净值区间：92      92      97      99      90      23
//        INDEX_CN_NOT_USA.put("159655", "指数-外盘-美股        ");//标普ETF               市值：34.15     累涨：40.19     9.21      22.55     8.43      10日：2.80      1.11      1.11      19        累涨修正：49.65     净值区间：95      95      98      99      85      24
//        INDEX_CN_NOT_USA.put("513400", "指数-外盘-美股        ");//道琼斯ETF             市值：17.01     累涨：34.98     6.46      20.66     7.86      10日：3.39      1.01      1.01      21        累涨修正：44.43     净值区间：88      72      86      94      74      25
//        INDEX_CN_NOT_USA.put("562060", "指数-外盘-美股        ");//标普红利ETF           市值：14.72     累涨：18.52     5.40      6.15      6.97      10日：2.98      0.99      0.99      17        累涨修正：27.44     净值区间：94      93      97      98      98      26
    }
    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘
    static {
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.46      累涨：48.55     11.54     16.87     20.14     10日：4.56      1.03      1.03      1         累涨修正：59.29     净值区间：96      69      83      92      92      2
//        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.51      累涨：38.84     10.22     15.55     13.07     10日：4.15      1.80      1.80      3         累涨修正：53.79     净值区间：100     100     100     100     95      3
//        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.15      累涨：39.53     13.12     12.42     13.99     10日：3.78      1.68      1.68      5         累涨修正：53.39     净值区间：96      92      79      88      77      4
//        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：1.83      累涨：38.77     10.56     15.59     12.62     10日：4.31      1.50      1.50      2         累涨修正：52.08     净值区间：100     100     100     100     99      5
//        INDEX_CN_1000.put("513650", "指数-中小盘           ");//标普500ETF南方        市值：35.42     累涨：40.60     8.38      23.24     8.98      10日：3.09      1.32      1.32      18        累涨修正：51.61     净值区间：93      93      97      99      93      6
//        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：5.68      累涨：38.97     10.41     15.13     13.43     10日：3.92      1.38      1.38      4         累涨修正：51.17     净值区间：100     97      98      99      82      7
//        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.18      累涨：41.79     13.46     15.95     12.38     10日：3.36      0.98      0.98      6         累涨修正：51.03     净值区间：100     79      87      95      60      8
//        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：18.74     累涨：37.23     9.81      14.80     12.62     10日：4.14      1.57      1.57      7         累涨修正：50.79     净值区间：100     100     100     100     81      9
//        INDEX_CN_1000.put("513500", "指数-中小盘           ");//标普500ETF            市值：191.16    累涨：39.13     7.60      22.34     9.19      10日：2.90      1.30      1.30      20        累涨修正：49.83     净值区间：92      92      97      99      90      10
//        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.27      累涨：38.66     9.95      14.10     14.61     10日：3.23      1.14      1.14      10        累涨修正：48.73     净值区间：100     100     83      93      88      11
//        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.66      累涨：37.51     11.47     13.36     12.68     10日：3.55      1.16      1.16      8         累涨修正：48.02     净值区间：98      98      92      97      82      12
//        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF指数       市值：0.23      累涨：35.70     9.94      14.83     10.93     10日：3.45      1.42      1.42      11        累涨修正：47.67     净值区间：88      88      94      90      81      13
//        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.43      累涨：39.56     12.46     16.43     10.67     10日：3.38      0.70      0.70      9         累涨修正：47.14     净值区间：100     67      64      83      53      14
//        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.59      累涨：35.08     10.15     12.09     12.84     10日：4.09      1.29      1.29      12        累涨修正：46.91     净值区间：100     90      96      99      82      15
//        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.54      累涨：34.75     9.51      12.90     12.34     10日：3.99      1.05      1.05      13        累涨修正：45.04     净值区间：100     88      74      88      81      16
//        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.59      累涨：31.87     8.84      13.75     9.28      10日：2.78      1.15      1.15      14        累涨修正：41.55     净值区间：91      91      65      86      68      17
//        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.14      累涨：38.09     10.49     16.25     11.35     10日：2.46      0.09                16        累涨修正：40.73     净值区间：97      47      68      85      83      18
//        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：6.64      累涨：31.45     9.35      11.85     10.25     10日：2.48      0.77      0.77      15        累涨修正：38.55     净值区间：100     86      80      87      66      19
//        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.33      累涨：32.67     9.40      13.63     9.64      10日：1.61      0.61      0.61      19        累涨修正：37.94     净值区间：86      63      69      90      73      20
//        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.11      累涨：31.84     9.62      12.86     9.36      10日：2.31      0.47      0.47      17        累涨修正：36.97     净值区间：97      91      79      93      56      21
//        INDEX_CN_1000.put("159521", "指数-中小盘           ");//国证2000ETF指数基金   市值：0.18      累涨：30.56     9.69      12.42     8.45      10日：2.22      0.51      0.51      18        累涨修正：35.84     净值区间：100     75      76      71      61      22
//        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：3.21      累涨：29.76     7.69      13.67     8.40      10日：1.94      0.59      0.59      21        累涨修正：35.24     净值区间：100     80      70      89      77      23
//        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.20      累涨：30.08     10.31     11.50     8.27      10日：1.75      0.49      0.49      25        累涨修正：34.77     净值区间：100     69      84      89      75      24
//        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.15      累涨：30.38     7.30      13.38     9.70      10日：2.31      0.34      0.34      27        累涨修正：34.73     净值区间：47      44      67      87      74      25
//        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.12      累涨：29.13     10.08     12.47     6.58      10日：2.36      0.46      0.46      20        累涨修正：34.25     净值区间：93      40      55      81      65      26
//        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.12      累涨：28.66     9.51      9.98      9.17      10日：2.00      0.55      0.55      23        累涨修正：33.96     净值区间：97      91      59      77      56      27
//        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.37      累涨：28.54     7.75      14.12     6.67      10日：1.82      0.58      0.58      29        累涨修正：33.84     净值区间：90      92      90      92      74      28
//        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.32      累涨：27.42     7.69      10.88     8.85      10日：2.25      0.68      0.68      22        累涨修正：33.75     净值区间：100     70      72      81      62      29
//        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.42      累涨：30.53     10.05     13.12     7.36      10日：1.78      0.18      0.18      32        累涨修正：33.39     净值区间：90      68      41      62      62      30
//        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：111.78    累涨：26.95     7.72      11.12     8.11      10日：1.96      0.66      0.66      26        累涨修正：32.87     净值区间：98      68      70      81      62      31
//        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：1.07      累涨：27.49     8.88      11.15     7.46      10日：2.01      0.51      0.51      24        累涨修正：32.56     净值区间：96      78      63      76      66      32
//        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.35      累涨：27.99     8.51      12.27     7.21      10日：1.75      0.39      0.39      33        累涨修正：32.08     净值区间：91      65      64      80      67      33
//        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：630.27    累涨：26.59     7.65      10.48     8.46      10日：2.01      0.58      0.58      28        累涨修正：32.08     净值区间：98      72      69      81      62      34
//        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：288.61    累涨：26.25     7.26      10.58     8.41      10日：1.95      0.61      0.61      30        累涨修正：31.86     净值区间：98      72      71      81      63      35
//        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：18.86     累涨：26.16     7.31      10.54     8.31      10日：1.93      0.57      0.57      31        累涨修正：31.51     净值区间：96      68      70      81      62      36
//        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：365.80    累涨：26.31     7.43      11.05     7.83      10日：1.91      0.37      0.37      34        累涨修正：30.44     净值区间：96      68      71      81      62      37
//        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：0.92      累涨：25.42     7.40      9.77      8.25      10日：1.89      0.45      0.45      35        累涨修正：30.01     净值区间：94      69      67      82      50      38
//        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.49      累涨：27.69     8.18      12.49     7.02      10日：1.15      0.10      0.10      37        累涨修正：29.44     净值区间：91      74      44      77      64      39
//        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.13      累涨：23.28     7.82      10.29     5.17      10日：1.90      0.56      0.56      41        累涨修正：28.54     净值区间：79      82      88      77      73      40
//        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.42      累涨：25.37     7.34      11.18     6.85      10日：1.86      0.19      0.19      36        累涨修正：28.37     净值区间：100     76      82      92      80      41
//        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.25      累涨：21.87     6.79      9.31      5.77      10日：1.47      0.70      0.70      40        累涨修正：27.54     净值区间：24      24      29      62      58      42
//        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.28      累涨：23.33     8.01      9.83      5.49      10日：2.03      0.43      0.32      39        累涨修正：27.5      净值区间：89      91      93      78      75      43
//        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.73      累涨：24.04     8.44      9.08      6.52      10日：1.45      0.31      0.31      38        累涨修正：27.35     净值区间：32      32      54      79      72      44
//        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.62      累涨：23.90     8.13      8.75      7.02      10日：1.49      0.23      0.23      43        累涨修正：26.77     净值区间：40      42      67      90      78      45
//        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.30      累涨：22.58     7.76      10.01     4.81      10日：1.17      0.43      0.43      54        累涨修正：26.33     净值区间：79      79      81      75      68      46
//        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.58      累涨：24.09     8.26      9.91      5.92      10日：1.06      0.17      0.17      47        累涨修正：26.17     净值区间：86      71      55      75      54      47
//        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：104.62    累涨：21.80     6.33      9.44      6.03      10日：1.27      0.49      0.49      42        累涨修正：26.01     净值区间：85      75      60      75      58      48
//        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.15      累涨：22.60     7.27      9.89      5.44      10日：1.97      0.30      0.20      48        累涨修正：25.97     净值区间：68      42      42      62      62      49
//        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.86      累涨：22.41     6.79      8.75      6.87      10日：1.45      0.34      0.34      12        累涨修正：25.9      净值区间：71      48      54      64      54      50
//        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.64      累涨：21.77     7.59      7.84      6.34      10日：1.20      0.48      0.48      46        累涨修正：25.85     净值区间：88      64      59      58      57      51
//        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.23      累涨：22.51     7.02      9.61      5.88      10日：1.23      0.34      0.34      45        累涨修正：25.78     净值区间：70      67      55      54      54      52
//        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.51      累涨：19.43     6.52      7.73      5.18      10日：2.44      0.61      0.61      53        累涨修正：25.53     净值区间：90      72      83      85      77      53
//        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：2.89      累涨：23.81     8.42      8.76      6.63      10日：1.48                          44        累涨修正：25.29     净值区间：41      31      62      84      70      54
//        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：3.82      累涨：23.56     8.40      9.04      6.12      10日：1.17                          49        累涨修正：24.73     净值区间：35      32      66      87      69      55
//        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.73      累涨：23.01     5.51      9.72      7.78      10日：1.72                          50        累涨修正：24.73     净值区间：8       8       25      49      49      56
//        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：10.18     累涨：20.79     5.76      9.01      6.02      10日：1.30      0.44      0.44      51        累涨修正：24.73     净值区间：81      72      57      75      58      57
//        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.37      累涨：21.11     5.73      10.11     5.27      10日：1.29      0.30      0.30      60        累涨修正：24.2      净值区间：91      85      67      81      74      58
//        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.15      累涨：19.26     5.79      8.16      5.31      10日：1.76      0.52      0.52      59        累涨修正：24.14     净值区间：63      53      76      74      62      59
//        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：2.91      累涨：20.19     5.99      8.48      5.72      10日：1.30      0.41      0.41      55        累涨修正：23.95     净值区间：93      81      62      77      60      60
//        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：12.20     累涨：20.83     5.88      9.59      5.36      10日：1.12      0.32      0.32      62        累涨修正：23.87     净值区间：84      75      57      74      57      61
//        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：21.07     累涨：20.69     5.93      9.17      5.59      10日：1.15      0.32      0.32      56        累涨修正：23.76     净值区间：83      71      56      73      57      62
//        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：28.23     累涨：20.93     5.85      9.42      5.66      10日：1.12      0.25      0.25      58        累涨修正：23.55     净值区间：82      71      58      74      58      63
//        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：5.28      累涨：21.95     7.13      9.57      5.25      10日：1.03      0.22                63        累涨修正：23.42     净值区间：25      25      32      70      58      64
//        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：3.93      累涨：21.59     6.50      8.68      6.41      10日：1.81                          52        累涨修正：23.4      净值区间：40      40      62      70      56      65
//        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：117.77    累涨：20.90     5.94      9.29      5.67      10日：1.04      0.23      0.23      61        累涨修正：23.32     净值区间：82      71      59      74      58      66
//        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：1.09      累涨：20.00     5.90      8.48      5.62      10日：1.24      0.34      0.34      57        累涨修正：23.28     净值区间：83      71      36      67      60      67
//        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.71      累涨：21.93     8.38      7.81      5.74      10日：0.89      0.07      0.07      68        累涨修正：23.24     净值区间：93      25      25      50      42      68
//        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.35      累涨：17.55     4.88      7.87      4.80      10日：1.85      0.62      0.62      67        累涨修正：23.12     净值区间：100     100     100     80      77      69
//        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.49      累涨：21.62     7.59      9.03      5.00      10日：0.91      0.07      0.07      77        累涨修正：22.95     净值区间：95      78      20      47      47      70
//        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.84      累涨：19.86     6.29      8.29      5.28      10日：0.99      0.30      0.30      75        累涨修正：22.65     净值区间：84      71      46      68      54      71
//        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：6.66      累涨：21.03     6.32      9.30      5.41      10日：0.95      0.11      0.11      71        累涨修正：22.64     净值区间：79      71      58      75      59      72
//        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：18.43     累涨：21.30     6.34      9.40      5.56      10日：0.89      0.06      0.06      72        累涨修正：22.55     净值区间：81      70      59      74      58      73
//        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1099.09   累涨：20.57     6.00      8.97      5.60      10日：0.95      0.16      0.16      70        累涨修正：22.48     净值区间：82      71      58      74      57      74
//        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.79      累涨：20.54     6.02      9.01      5.51      10日：0.75      0.19      0.19      80        累涨修正：22.43     净值区间：77      68      62      78      67      75
//        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.24      累涨：19.46     5.18      8.71      5.57      10日：1.08      0.24      0.24      73        累涨修正：21.98     净值区间：81      48      59      72      58      76
//        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.58      累涨：21.27     7.08      9.18      5.01      10日：0.68                          87        累涨修正：21.95     净值区间：90      63      64      75      75      77
//        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：6.83      累涨：19.58     6.40      8.11      5.07      10日：0.99      0.22      0.22      81        累涨修正：21.89     净值区间：82      70      62      70      56      78
//        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.78      累涨：19.74     6.15      8.96      4.63      10日：1.25      0.11      0.11      69        累涨修正：21.65     净值区间：90      90      80      75      64      79
//        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.32      累涨：20.65     6.31      8.81      5.53      10日：0.96                          74        累涨修正：21.61     净值区间：70      67      50      74      53      80
//        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.31      累涨：18.66     5.21      7.31      6.14      10日：1.18      0.25      0.25      64        累涨修正：21.34     净值区间：56      56      72      86      79      81
//        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：2.11      累涨：16.31     3.89      6.50      5.92      10日：1.66      0.49      0.49      66        累涨修正：20.91     净值区间：42      48      74      89      89      82
//        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500指数ETF           市值：146.33    累涨：19.76     5.48      8.33      5.95      10日：1.13                          65        累涨修正：20.89     净值区间：40      40      57      81      66      83
//        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：9.44      累涨：19.21     5.36      8.36      5.49      10日：1.00                          89        累涨修正：20.21     净值区间：28      28      49      77      65      84
//        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：167.65    累涨：19.20     5.44      7.97      5.79      10日：0.90                          85        累涨修正：20.1      净值区间：38      38      56      81      66      85
//        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：25.16     累涨：18.83     5.27      7.74      5.82      10日：1.00                          78        累涨修正：19.83     净值区间：29      29      51      79      66      86
//        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.43      累涨：18.65     5.21      7.79      5.65      10日：0.86                          99        累涨修正：19.51     净值区间：39      32      54      79      69      87
//        INDEX_CN_1000.put("563360", "指数-中小盘           ");//中证A500ETF基金       市值：87.12     累涨：18.61     5.12      7.92      5.57      10日：0.90                          98        累涨修正：19.51     净值区间：36      36      55      81      67      88
//        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：59.07     累涨：18.33     5.14      7.27      5.92      10日：1.15                          76        累涨修正：19.48     净值区间：29      29      52      80      65      89
//        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：55.39     累涨：18.42     5.52      7.21      5.69      10日：1.02                          82        累涨修正：19.44     净值区间：32      32      53      80      66      90
//        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.58      累涨：16.83     5.24      7.12      4.47      10日：0.86      0.27      0.27      106       累涨修正：19.31     净值区间：96      68      59      68      58      91
//        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：98.53     累涨：18.21     5.20      7.01      6.00      10日：1.06                          79        累涨修正：19.27     净值区间：32      32      52      80      65      92
//        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：202.04    累涨：18.21     5.81      6.75      5.65      10日：1.05                          84        累涨修正：19.26     净值区间：40      40      55      81      66      93
//        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：23.37     累涨：18.13     5.07      7.33      5.73      10日：1.11                          86        累涨修正：19.24     净值区间：38      37      54      81      66      94
//        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：160.33    累涨：18.08     5.50      6.73      5.85      10日：1.01                          83        累涨修正：19.09     净值区间：32      32      53      80      66      95
//        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：181.16    累涨：18.12     5.22      7.12      5.78      10日：0.95                          90        累涨修正：19.07     净值区间：29      29      51      79      64      96
//        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：163.68    累涨：18.19     5.56      7.06      5.57      10日：0.84                          101       累涨修正：19.03     净值区间：33      33      53      80      65      97
//        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.49      累涨：18.05     6.30      6.63      5.12      10日：0.96                          102       累涨修正：19.01     净值区间：36      37      44      73      60      98
//        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：4.13      累涨：17.92     5.34      6.90      5.68      10日：1.06                          88        累涨修正：18.98     净值区间：34      33      50      79      65      99
//        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：45.76     累涨：17.88     5.38      6.88      5.62      10日：1.00                          91        累涨修正：18.88     净值区间：38      36      51      77      65      100
//        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：52.35     累涨：17.81     5.18      7.11      5.52      10日：1.01                          96        累涨修正：18.82     净值区间：46      46      59      82      67      101
//        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：1.81      累涨：17.81     4.98      7.43      5.40      10日：0.90                          107       累涨修正：18.71     净值区间：23      23      51      78      66      102
//        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：38.76     累涨：17.79     5.25      7.07      5.47      10日：0.90                          105       累涨修正：18.69     净值区间：36      36      58      82      66      103
//        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：28.71     累涨：17.67     4.84      7.05      5.78      10日：1.00                          94        累涨修正：18.67     净值区间：32      32      55      81      66      104
//        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：5.23      累涨：17.63     4.84      6.93      5.86      10日：0.98                          95        累涨修正：18.61     净值区间：33      33      52      80      64      105
//        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：32.84     累涨：17.48     4.62      7.01      5.85      10日：1.00                          93        累涨修正：18.48     净值区间：36      36      56      79      64      106
//        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：129.33    累涨：17.19     5.29      5.94      5.96      10日：0.93                          92        累涨修正：18.12     净值区间：36      36      53      80      66      107
//        INDEX_CN_1000.put("560530", "指数-中小盘           ");//中证A500ETF摩根       市值：78.31     累涨：17.13     5.05      6.37      5.71      10日：0.93                          104       累涨修正：18.06     净值区间：28      28      51      78      62      108
//        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：5.42      累涨：17.09     4.66      6.56      5.87      10日：0.96                          100       累涨修正：18.05     净值区间：37      37      50      75      63      109
//        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：1.22      累涨：16.67     5.21      5.92      5.54      10日：1.08                          97        累涨修正：17.75     净值区间：31      31      53      80      67      110
//        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：65.42     累涨：16.52     4.99      5.96      5.57      10日：0.95                          109       累涨修正：17.47     净值区间：33      33      54      79      63      111
//        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：13.73     累涨：16.83     5.27      6.24      5.32      10日：0.60                          110       累涨修正：17.43     净值区间：33      33      45      77      64      112
//        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：37.09     累涨：16.45     4.53      6.15      5.77      10日：0.90                          108       累涨修正：17.35     净值区间：36      36      53      80      66      113
//        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：16.29     5.33      5.50      5.46      10日：1.03                          103       累涨修正：17.32     净值区间：43      35      57      69      69      114
//        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：14.25     累涨：15.90     4.92      5.72      5.26      10日：0.88                          112       累涨修正：16.78     净值区间：31      11      30      60      60      115
//        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：143.03    累涨：15.94     5.20      5.28      5.46      10日：0.83                          111       累涨修正：16.77     净值区间：36      36      54      80      66      116
//        INDEX_CN_1000.put("563650", "指数-中小盘           ");//中证A500龙头ETF       市值：2.16      累涨：                              5.71      10日：1.11                          181       累涨修正：6.82      净值区间：25      25      53                      117
//        INDEX_CN_1000.put("563660", "指数-中小盘           ");//A500ETF银河           市值：2.83      累涨：                              5.83      10日：0.91                          186       累涨修正：6.74      净值区间：29      29      53                      118
//        INDEX_CN_1000.put("159215", "指数-中小盘           ");//中证A500ETF指数基金   市值：20.37     累涨：                              5.38      10日：0.80                          191       累涨修正：6.18      净值区间：32      32      53                      119
//        INDEX_CN_1000.put("563680", "指数-中小盘           ");//800自由现金流ETF      市值：0.58      累涨：                                        10日：          0.69      0.69                累涨修正：          净值区间：61      61                              120
//        INDEX_CN_1000.put("159226", "指数-中小盘           ");//中证A500增强ETF       市值：5.70      累涨：                                        10日：                                        累涨修正：          净值区间：                                        121
//        INDEX_CN_1000.put("563550", "指数-中小盘           ");//A500增强ETF摩根       市值：6.67      累涨：                                        10日：                                        累涨修正：          净值区间：43      38                              122
//        INDEX_CN_1000.put("563990", "指数-中小盘           ");//800现金流ETF          市值：1.27      累涨：                                        10日：                                        累涨修正：          净值区间：                                        123
//        INDEX_CN_1000.put("516460", "指数-中小盘           ");//现金流ETF800          市值：0.56      累涨：                                        10日：                                        累涨修正：          净值区间：                                        124
    }
    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板
    static {
        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.20      累涨：40.31     10.66     16.67     12.98     10日：2.48      1.16      1.16      3         累涨修正：49.75     净值区间：100     100     41      63      57      1
//        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.14      累涨：38.50     10.60     14.61     13.29     10日：2.82      1.25      1.25      1         累涨修正：48.82     净值区间：100     100     81      82      58      2
//        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.57      累涨：38.57     10.43     15.74     12.40     10日：2.61      1.23      1.23      4         累涨修正：48.56     净值区间：100     100     75      56      56      3
//        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.28      累涨：40.11     10.85     16.08     13.18     10日：2.54      0.98      0.98      2         累涨修正：48.53     净值区间：98      98      78      81      58      4
//        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.66      累涨：40.35     11.85     20.13     8.37      10日：1.50      0.39      0.39      13        累涨修正：44.19     净值区间：100     81      59      73      53      5
//        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.20      累涨：36.89     9.60      16.88     10.41     10日：1.93      0.09                7         累涨修正：39        净值区间：100     64      59      62      50      6
//        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.30      累涨：34.32     8.99      10.77     14.56     10日：4.05                          5         累涨修正：38.37     净值区间：27      16      41      66      56      7
//        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：39.17     累涨：33.16     8.22      14.58     10.36     10日：1.68      0.25      0.25      9         累涨修正：36.34     净值区间：56      43      39      70      54      8
//        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.47      累涨：32.27     7.76      13.66     10.85     10日：1.43      0.18      0.18      16        累涨修正：34.78     净值区间：54      48      62      81      61      9
//        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.86      累涨：32.07     7.90      12.96     11.21     10日：1.42      0.18      0.18      14        累涨修正：34.57     净值区间：66      57      54      66      58      10
//        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.43      累涨：31.55     8.34      12.30     10.91     10日：1.94      0.46                6         累涨修正：34.41     净值区间：57      51      71      76      66      11
//        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.41      累涨：30.97     6.26      12.03     12.68     10日：1.99                          11        累涨修正：32.96     净值区间：39      33      52      74      59      12
//        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：245.35    累涨：30.58     7.73      10.72     12.13     10日：1.99                          8         累涨修正：32.57     净值区间：35      29      51      74      57      13
//        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：45.37     累涨：30.04     6.99      10.93     12.12     10日：1.81                          10        累涨修正：31.85     净值区间：34      28      51      74      57      14
//        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.77      累涨：30.11     7.77      10.13     12.21     10日：1.72                          12        累涨修正：31.83     净值区间：28      22      26      50      50      15
//        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：13.89     累涨：29.56     7.55      10.02     11.99     10日：1.91                          15        累涨修正：31.47     净值区间：32      26      50      74      57      16
//        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：2.33      累涨：29.05     7.47      9.27      12.31     10日：1.91                          17        累涨修正：30.96     净值区间：27      25      52      76      60      17
//        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：3.72      累涨：28.98     7.19      9.71      12.08     10日：1.87                          18        累涨修正：30.85     净值区间：33      27      50      74      56      18
//        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.34      累涨：27.85     5.91      10.63     11.31     10日：1.58      0.23      0.23      23        累涨修正：30.81     净值区间：53      44      57      72      56      19
//        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.83      累涨：29.03     6.89      11.66     10.48     10日：1.59                          19        累涨修正：30.62     净值区间：47      39      56      72      56      20
//        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：6.73      累涨：29.32     7.68      10.62     11.02     10日：1.02                          20        累涨修正：30.34     净值区间：53      47      57      73      56      21
//        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：3.55      累涨：28.41     7.18      9.12      12.11     10日：1.80                          21        累涨修正：30.21     净值区间：29      24      50      73      56      22
//        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.47      累涨：26.81     6.87      10.34     9.60      10日：1.77      0.24      0.24      25        累涨修正：30.02     净值区间：50      41      50      67      54      23
//        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：4.79      累涨：25.83     5.46      12.11     8.26      10日：1.11      0.45      0.45      35        累涨修正：29.64     净值区间：53      44      50      66      49      24
//        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：97.98     累涨：27.97     7.21      10.45     10.31     10日：1.55                          27        累涨修正：29.52     净值区间：43      35      52      73      56      25
//        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.28      累涨：27.91     7.01      10.49     10.41     10日：1.55                          22        累涨修正：29.46     净值区间：44      36      50      73      56      26
//        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：831.61    累涨：27.79     6.83      10.45     10.51     10日：1.59                          24        累涨修正：29.38     净值区间：45      36      53      73      56      27
//        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.24      累涨：27.83     7.28      10.91     9.64      10日：1.44                          26        累涨修正：29.27     净值区间：73      73      65      80      64      28
//        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.19      累涨：27.12     6.67      10.11     10.34     10日：1.79                          28        累涨修正：28.91     净值区间：53      41      46      58      55      29
//        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：2.02      累涨：28.17     8.13      11.00     9.04      10日：0.72                          32        累涨修正：28.89     净值区间：64      61      57      68      50      30
//        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：45.01     累涨：26.92     6.86      9.70      10.36     10日：1.61                          30        累涨修正：28.53     净值区间：44      36      53      74      57      31
//        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：4.94      累涨：26.97     6.79      9.88      10.30     10日：1.52                          36        累涨修正：28.49     净值区间：43      36      51      71      56      32
//        INDEX_300.put("159957", "指数-创业板           ");//创业板ETF华夏         市值：16.83     累涨：26.81     6.95      9.54      10.32     10日：1.59                          31        累涨修正：28.4      净值区间：43      34      53      73      55      33
//        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.05      累涨：26.53     6.47      9.53      10.53     10日：1.68                          29        累涨修正：28.21     净值区间：41      32      30      56      56      34
//        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：20.11     累涨：26.59     6.93      9.46      10.20     10日：1.53                          37        累涨修正：28.12     净值区间：41      34      52      73      56      35
//        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：25.04     累涨：26.44     6.92      9.19      10.33     10日：1.63                          32        累涨修正：28.07     净值区间：43      35      53      73      55      36
//        INDEX_300.put("159836", "指数-创业板           ");//创业板300ETF天弘      市值：1.80      累涨：26.65     6.76      9.81      10.08     10日：1.38                          40        累涨修正：28.03     净值区间：64      52      59      69      56      37
//        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：89.98     累涨：26.37     6.64      9.36      10.37     10日：1.61                          34        累涨修正：27.98     净值区间：42      34      52      72      55      38
//        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.20      累涨：26.24     7.34      9.38      9.52      10日：1.12                          38        累涨修正：27.36     净值区间：54      45      58      74      61      39
//        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：0.93      累涨：24.36     6.02      9.67      8.67      10日：2.13                          33        累涨修正：26.49     净值区间：27      26      56      78      67      40
//        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：22.67     累涨：24.05     6.39      10.10     7.56      10日：0.92      0.19      0.19      41        累涨修正：26.11     净值区间：53      48      39      72      47      41
//        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：14.34     累涨：23.97     6.33      10.24     7.40      10日：0.84      0.12      0.12      42        累涨修正：25.53     净值区间：52      45      37      74      49      42
//        INDEX_300.put("159368", "指数-创业板           ");//创业板新能源ETF华夏   市值：1.22      累涨：                    12.75     10.73     10日：1.52                          12        累涨修正：25        净值区间：32      22      34      61              43
//        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.21      累涨：23.12     5.87      10.06     7.19      10日：0.91                          44        累涨修正：24.03     净值区间：54      47      40      76      49      44
//        INDEX_300.put("159377", "指数-创业板           ");//创业板医药ETF国泰     市值：0.24      累涨：                              9.89      10日：4.50      2.44      1.17      43        累涨修正：23.95     净值区间：100     100     100                     45
//        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.15      累涨：22.71     5.32      10.46     6.93      10日：0.74                          43        累涨修正：23.45     净值区间：53      45      39      72      48      46
    }
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板
    static {
//        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：31.63     累涨：43.18     15.41     17.06     10.71     10日：2.07      0.69      0.35      6         累涨修正：48.03     净值区间：64      48      25      67      10      1
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：2.49      累涨：38.69     11.07     18.03     9.59      10日：1.99      0.74      0.74      1         累涨修正：45.12     净值区间：98      98      64      86      71      2
//        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.33      累涨：37.42     10.19     17.22     10.01     10日：1.95      0.59      0.59      2         累涨修正：42.91     净值区间：97      97      53      82      71      3
//        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.25      累涨：35.91     10.85     16.40     8.66      10日：1.64      0.46      0.46      3         累涨修正：40.31     净值区间：98      98      62      85      70      4
//        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：3.74      累涨：35.09     12.32     16.58     6.19      10日：1.44      0.34      0.34      8         累涨修正：38.57     净值区间：97      97      35      72      71      5
//        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.37      累涨：33.82     9.02      17.85     6.95      10日：1.92      0.36      0.36      5         累涨修正：37.9      净值区间：97      71      38      80      62      6
//        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.39      累涨：32.54     9.75      15.75     7.04      10日：1.87      0.53      0.53      4         累涨修正：37.59     净值区间：88      58      28      72      58      7
//        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：49.75     累涨：32.46     9.22      16.30     6.94      10日：1.78      0.42      0.42      7         累涨修正：36.76     净值区间：93      72      33      70      56      8
//        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：2.46      累涨：29.71     11.33     12.79     5.59      10日：1.46      0.93      0.93      47        累涨修正：36.75     净值区间：67      49      20      60      41      9
//        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：2.97      累涨：32.30     9.86      15.52     6.92      10日：1.88      0.42      0.42      6         累涨修正：36.7      净值区间：100     76      36      67      58      10
//        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：2.22      累涨：34.14     12.61     15.79     5.74      10日：1.31      0.18      0.18      19        累涨修正：36.53     净值区间：100     92      36      73      69      11
//        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：62.75     累涨：32.12     8.92      16.66     6.54      10日：1.78      0.42      0.42      9         累涨修正：36.42     净值区间：100     76      37      74      57      12
//        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：2.74      累涨：32.66     8.94      16.52     7.20      10日：1.81      0.32      0.32      10        累涨修正：36.39     净值区间：96      75      37      74      57      13
//        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.63      累涨：30.24     6.44      15.49     8.31      10日：1.20      0.69      0.69      11        累涨修正：35.58     净值区间：93      54      38      78      63      14
//        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.35      累涨：33.61     11.67     16.11     5.83      10日：1.18      0.20                20        累涨修正：35.19     净值区间：79      79      34      72      67      15
//        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：32.44     累涨：31.95     9.07      16.22     6.66      10日：1.47      0.21      0.21      13        累涨修正：34.68     净值区间：97      76      35      74      57      16
//        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：10.73     累涨：31.77     8.61      16.85     6.31      10日：1.57      0.21      0.21      16        累涨修正：34.6      净值区间：97      74      36      74      56      17
//        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.32      累涨：31.62     9.04      15.94     6.64      10日：1.52      0.22      0.22      14        累涨修正：34.46     净值区间：96      73      36      74      57      18
//        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：32.44     累涨：31.55     8.42      16.30     6.83      10日：1.51      0.22      0.22      12        累涨修正：34.38     净值区间：96      72      35      74      57      19
//        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.30      累涨：29.57     10.47     13.88     5.22      10日：0.93      0.47      0.47      56        累涨修正：33.32     净值区间：64      69      38      59      41      20
//        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.75      累涨：29.45     6.35      15.42     7.68      10日：1.17      0.34      0.34      15        累涨修正：32.66     净值区间：69      50      31      78      63      21
//        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.69      累涨：32.11     10.13     12.47     9.51      10日：0.39                          2         累涨修正：32.5      净值区间：50      29      17      47      34      22
//        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.29      累涨：31.67     9.49      12.76     9.42      10日：0.33                          3         累涨修正：32        净值区间：44      28      15      46      34      23
//        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：114.56    累涨：25.30     9.47      11.08     4.75      10日：1.19      0.70      0.70      22        累涨修正：30.69     净值区间：64      55      23      65      44      24
//        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：800.12    累涨：26.11     9.35      11.92     4.84      10日：0.88      0.49      0.49      28        累涨修正：29.93     净值区间：75      60      24      67      45      25
//        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：611.95    累涨：25.16     9.31      10.98     4.87      10日：1.00      0.60      0.60      25        累涨修正：29.76     净值区间：74      61      24      68      46      26
//        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：6.35      累涨：27.56     10.46     12.68     4.42      10日：0.27      0.27      0.27      45        累涨修正：29.45     净值区间：69      52      21      61      48      27
//        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：43.47     累涨：24.85     9.26      11.06     4.53      10日：0.98      0.59      0.59      27        累涨修正：29.37     净值区间：71      59      23      66      45      28
//        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：1.83      累涨：24.23     10.03     9.95      4.25      10日：0.89      0.50      0.50      36        累涨修正：28.12     净值区间：71      61      20      58      45      29
//        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：57.77     累涨：25.11     9.54      11.04     4.53      10日：0.95      0.32      0.32      37        累涨修正：27.98     净值区间：61      52      22      64      44      30
//        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：32.19     累涨：24.36     8.70      11.21     4.45      10日：0.78      0.47      0.47      40        累涨修正：27.96     净值区间：65      52      22      65      45      31
//        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.00      累涨：25.10     10.05     10.16     4.89      10日：1.00      0.30      0.30      33        累涨修正：27.9      净值区间：89      65      26      55      51      32
//        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：40.11     累涨：24.13     6.34      10.09     7.70      10日：0.75      0.38      0.38      31        累涨修正：27.16     净值区间：53      48      41      73      48      33
//        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：81.93     累涨：25.07     6.92      10.58     7.57      10日：0.94      0.19      0.19      35        累涨修正：27.15     净值区间：56      50      44      74      49      34
//        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.24      累涨：24.53     8.95      11.17     4.41      10日：0.84      0.28      0.28      49        累涨修正：27.05     净值区间：63      52      22      64      44      35
//        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：28.41     累涨：                    16.07     5.92      10日：1.31      0.55      0.55      17        累涨修正：26.6      净值区间：91      77      36      80              36
//        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：8.46      累涨：                    16.55     6.21      10日：1.19      0.43      0.43      18        累涨修正：26.53     净值区间：95      78      35      80              37
//        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：17.29     累涨：24.42     6.52      10.78     7.12      10日：0.73      0.19      0.19      46        累涨修正：26.29     净值区间：47      43      38      71      46      38
//        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：22.67     累涨：24.05     6.39      10.10     7.56      10日：0.92      0.19      0.19      41        累涨修正：26.11     净值区间：53      48      39      72      47      39
//        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.47      累涨：23.15     5.51      10.20     7.44      10日：0.86      0.35      0.35      34        累涨修正：26.11     净值区间：55      50      40      71      45      40
//        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：0.94      累涨：23.74     8.17      11.40     4.17      10日：0.48      0.24      0.24      57        累涨修正：25.66     净值区间：67      48      22      54      34      41
//        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：14.34     累涨：23.97     6.33      10.24     7.40      10日：0.84      0.12      0.12      42        累涨修正：25.53     净值区间：52      45      37      74      49      42
//        INDEX_688.put("589060", "指数-科创板           ");//科创综指ETF东财       市值：1.97      累涨：                    15.64     5.43      10日：1.24      0.52      0.52      23        累涨修正：25.43     净值区间：96      78      40      82              43
//        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.71      累涨：23.93     9.07      10.75     4.11      10日：0.58      0.15      0.15      60        累涨修正：25.41     净值区间：69      48      20      64      45      44
//        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.31      累涨：23.06     6.20      9.56      7.30      10日：0.87      0.18      0.18      48        累涨修正：25.01     净值区间：53      45      38      72      48      45
//        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：2.24      累涨：24.03     9.30      10.66     4.07      10日：0.49                          61        累涨修正：24.52     净值区间：70      53      18      59      47      46
//        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.21      累涨：23.12     5.87      10.06     7.19      10日：0.91                          44        累涨修正：24.03     净值区间：54      47      40      76      49      47
//        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：3.16      累涨：20.34     5.97      6.89      7.48      10日：1.56      0.35      0.35      24        累涨修正：24        净值区间：100     79      59      79      52      48
//        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：17.19     累涨：23.23     6.14      9.82      7.27      10日：0.74                          52        累涨修正：23.97     净值区间：47      43      36      71      46      49
//        INDEX_688.put("589630", "指数-科创板           ");//科创综指ETF国泰       市值：12.07     累涨：                    16.09     5.69      10日：0.86      0.22      0.22      38        累涨修正：23.96     净值区间：100     76      35      78              50
//        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：43.14     累涨：23.01     5.65      10.04     7.32      10日：0.93                          47        累涨修正：23.94     净值区间：50      43      38      71      47      51
//        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：8.35      累涨：                    14.96     5.87      10日：0.97      0.33      0.33      32        累涨修正：23.78     净值区间：100     81      36      79              52
//        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：21.71     累涨：23.05     6.35      9.38      7.32      10日：0.72                          50        累涨修正：23.77     净值区间：50      45      38      84      65      53
//        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：8.66      累涨：                    14.61     5.96      10日：1.28      0.32      0.32      26        累涨修正：23.77     净值区间：95      78      36      79              54
//        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：6.48      累涨：                    14.41     6.27      10日：1.06      0.32      0.32      29        累涨修正：23.66     净值区间：100     79      44      82              55
//        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.15      累涨：22.71     5.32      10.46     6.93      10日：0.74                          43        累涨修正：23.45     净值区间：53      45      39      72      48      56
//        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.66      累涨：22.53     6.23      9.32      6.98      10日：0.85                          51        累涨修正：23.38     净值区间：55      48      41      72      46      57
//        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：22.04     累涨：                    14.49     5.69      10日：1.19      0.33      0.33      30        累涨修正：23.35     净值区间：100     79      38      79              58
//        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：7.30      累涨：                    15.29     5.55      10日：0.97      0.22      0.22      39        累涨修正：23.13     净值区间：100     77      38      79              59
//        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：10.87     累涨：22.33     5.77      9.15      7.41      10日：0.74                          55        累涨修正：23.07     净值区间：53      45      36      72      47      60
//        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：7.76      累涨：                    14.89     5.58      10日：0.97      0.22      0.22      43        累涨修正：22.76     净值区间：95      61      33      77      61      61
//        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：8.52      累涨：                    13.94     5.63      10日：0.98      0.22      0.22      42        累涨修正：21.87     净值区间：91      71      34      78              62
//        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：27.32     累涨：                    15.05     5.85      10日：0.96                          44        累涨修正：21.86     净值区间：100     79      38      79              63
//        INDEX_688.put("589600", "指数-科创板           ");//科创综指ETF富国       市值：17.64     累涨：                    14.54     5.45      10日：0.66      0.11      0.11      58        累涨修正：21.31     净值区间：95      75      37      79              64
//        INDEX_688.put("588770", "指数-科创板           ");//科创信息技术ETF摩根   市值：3.23      累涨：                    12.55     5.09      10日：0.75      0.43      0.43      62        累涨修正：20.97     净值区间：63      46      20      62              65
//        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：14.40     累涨：                    14.13     5.64      10日：0.85                          54        累涨修正：20.62     净值区间：100     85      40      80      62      66
//        INDEX_688.put("588660", "指数-科创板           ");//科创创业50ETF基金     市值：3.36      累涨：                    11.90     7.45      10日：0.87                          41        累涨修正：20.22     净值区间：52      46      38      74              67
//        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：13.81     累涨：                    13.72     5.15      10日：0.87                          56        累涨修正：19.74     净值区间：95      75      37      80              68
//        INDEX_688.put("588840", "指数-科创板           ");//科创板50ETF基金       市值：1.83      累涨：                    11.04     4.45      10日：0.55      0.11      0.11      62        累涨修正：16.7      净值区间：69      61      28      64              69
//        INDEX_688.put("588170", "指数-科创板           ");//科创半导体ETF         市值：2.68      累涨：                              6.75      10日：2.18      0.94      0.94      21        累涨修正：14.57     净值区间：92      59      27                      70
//        INDEX_688.put("588850", "指数-科创板           ");//科创机械ETF           市值：0.23      累涨：                              8.23      10日：0.97      0.49      0.49      42        累涨修正：12.14     净值区间：63      43      27                      71
//        INDEX_688.put("588910", "指数-科创板           ");//科创价值ETF           市值：9.47      累涨：                              6.66      10日：0.63      0.21      0.21      59        累涨修正：8.55      净值区间：83      57      34                      72
//        INDEX_688.put("589300", "指数-科创板           ");//科创综指ETF嘉实       市值：0.58      累涨：                              5.72      10日：0.99      0.20      0.20      53        累涨修正：7.91      净值区间：41      41      26                      73
//        INDEX_688.put("588040", "指数-科创板           ");//科创50ETF指数         市值：0.23      累涨：                              4.31      10日：0.78      0.20      0.20      63        累涨修正：6.29      净值区间：69      8       8                       74
//        INDEX_688.put("588720", "指数-科创板           ");//科创50ETF中银         市值：3.75      累涨：                              3.74      10日：0.40                          64        累涨修正：4.14      净值区间：73      47      39                      75
//        INDEX_688.put("589980", "指数-科创板           ");//科创100ETF汇添富      市值：7.77      累涨：                                        10日：1.84      0.41      0.41                累涨修正：          净值区间：100     82                              76
    }
    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股
//    static {
//        INDEX_HK.put("513750", "指数-港股             ");//港股非银ETF           市值：17.60     累涨：44.90     15.28     14.40     15.22     10日：3.21      1.83      1.83      1         累涨修正：59.09     净值区间：98      98      99      100     95      1
//        INDEX_HK.put("159788", "指数-港股             ");//港股通100ETF          市值：1.26      累涨：52.81     14.31     30.05     8.45      10日：2.80      0.48      0.48      4         累涨修正：58.49     净值区间：58      52      73      54      50      2
//        INDEX_HK.put("513980", "指数-港股             ");//港股科技50ETF         市值：139.28    累涨：50.71     18.02     21.56     11.13     10日：3.85      0.44      0.44      2         累涨修正：57.2      净值区间：42      39      45      78      58      3
//        INDEX_HK.put("159636", "指数-港股             ");//港股通科技30ETF       市值：219.33    累涨：48.75     18.02     19.82     10.91     10日：3.08      0.72      0.72      3         累涨修正：56.15     净值区间：58      51      48      76      53      4
//        INDEX_HK.put("159568", "指数-港股             ");//港股互联网ETF         市值：3.21      累涨：47.64     18.97     16.91     11.76     10日：2.43      0.80      0.80      5         累涨修正：54.87     净值区间：85      67      62      83      52      5
//        INDEX_HK.put("159792", "指数-港股             ");//港股通互联网ETF       市值：459.06    累涨：47.17     18.86     15.92     12.39     10日：2.61      0.84      0.84      4         累涨修正：54.82     净值区间：79      63      53      78      49      6
//        INDEX_HK.put("520520", "指数-港股             ");//恒生消费ETF华泰柏瑞   市值：0.76      累涨：38.96     17.12     13.85     7.99      10日：3.12      1.93      1.93      1         累涨修正：53.66     净值区间：93      93      95      98      85      7
//        INDEX_HK.put("513150", "指数-港股             ");//港股通科技ETF华泰柏瑞 市值：1.37      累涨：48.97     17.47     20.82     10.68     10日：3.60      0.18      0.18      7         累涨修正：53.65     净值区间：46      42      50      80      60      8
//        INDEX_HK.put("513860", "指数-港股             ");//港股通科技ETF         市值：17.71     累涨：49.60     16.99     22.04     10.57     10日：3.13      0.15      0.15      18        累涨修正：53.63     净值区间：49      47      53      80      60      9
//        INDEX_HK.put("513770", "指数-港股             ");//港股互联网ETF         市值：47.25     累涨：47.77     18.95     17.02     11.80     10日：2.13      0.49      0.49      6         累涨修正：52.84     净值区间：83      65      61      83      50      10
//        INDEX_HK.put("513020", "指数-港股             ");//港股科技ETF           市值：11.59     累涨：47.68     16.89     20.56     10.23     10日：3.29      0.19      0.19      20        累涨修正：52.11     净值区间：41      38      44      78      58      11
//        INDEX_HK.put("159688", "指数-港股             ");//恒生互联网ETF         市值：8.50      累涨：47.85     20.85     15.83     11.17     10日：1.65      0.42      0.42      14        累涨修正：52.02     净值区间：95      79      53      64      40      12
//        INDEX_HK.put("513320", "指数-港股             ");//恒生新经济ETF         市值：1.57      累涨：45.80     15.37     19.34     11.09     10日：2.88      0.48      0.48      12        累涨修正：51.56     净值区间：51      45      58      81      59      13
//        INDEX_HK.put("513330", "指数-港股             ");//恒生互联网ETF         市值：238.02    累涨：46.42     20.02     15.37     11.03     10日：1.90      0.43      0.43      10        累涨修正：50.9      净值区间：95      80      56      67      42      14
//        INDEX_HK.put("159751", "指数-港股             ");//港股科技ETF           市值：5.64      累涨：46.02     16.47     19.74     9.81      10日：3.65      0.20      0.20      22        累涨修正：50.87     净值区间：44      41      50      79      60      15
//        INDEX_HK.put("513970", "指数-港股             ");//恒生消费ETF           市值：18.09     累涨：38.35     16.74     14.19     7.42      10日：2.71      1.62      1.62      4         累涨修正：50.78     净值区间：94      94      96      99      88      16
//        INDEX_HK.put("159750", "指数-港股             ");//港股科技50ETF         市值：5.65      累涨：45.70     17.09     18.49     10.12     10日：3.21      0.31      0.31      17        累涨修正：50.77     净值区间：52      46      58      81      58      17
//        INDEX_HK.put("159735", "指数-港股             ");//港股消费ETF           市值：6.49      累涨：45.17     17.04     16.27     11.86     10日：2.56      0.50      0.50      2         累涨修正：50.73     净值区间：53      42      58      82      60      18
//        INDEX_HK.put("513580", "指数-港股             ");//恒生科技ETF指数基金   市值：23.40     累涨：45.27     17.31     17.36     10.60     10日：1.71      0.58      0.58      11        累涨修正：50.46     净值区间：86      66      49      72      46      19
//        INDEX_HK.put("513900", "指数-港股             ");//港股通100ETF          市值：1.55      累涨：44.46     14.02     21.04     9.40      10日：2.15      0.62      0.62      3         累涨修正：50.33     净值区间：76      59      79      81      74      20
//        INDEX_HK.put("159699", "指数-港股             ");//恒生消费ETF           市值：13.75     累涨：36.36     15.00     13.11     8.25      10日：2.98      1.69      1.69      5         累涨修正：49.48     净值区间：95      95      97      99      92      21
//        INDEX_HK.put("159741", "指数-港股             ");//恒生科技ETF基金       市值：8.00      累涨：44.66     17.16     17.39     10.11     10日：1.87      0.44      0.44      19        累涨修正：49.17     净值区间：86      65      53      76      47      22
//        INDEX_HK.put("513070", "指数-港股             ");//港股消费ETF易方达     市值：6.37      累涨：43.48     16.29     16.31     10.88     10日：2.55      0.46      0.46      3         累涨修正：48.79     净值区间：37      37      56      81      57      23
//        INDEX_HK.put("159712", "指数-港股             ");//港股通50ETF           市值：0.33      累涨：44.93     12.31     24.58     8.04      10日：1.80      0.26      0.26      34        累涨修正：48.29     净值区间：40      35      64      58      58      24
//        INDEX_HK.put("513260", "指数-港股             ");//恒生科技ETF基金       市值：44.23     累涨：44.69     17.60     17.07     10.02     10日：1.62      0.30      0.30      24        累涨修正：48.11     净值区间：87      65      48      73      46      25
//        INDEX_HK.put("513160", "指数-港股             ");//港股科技30ETF         市值：10.97     累涨：44.78     17.64     16.46     10.68     10日：1.40      0.29      0.29      26        累涨修正：47.92     净值区间：92      62      33      66      39      26
//        INDEX_HK.put("513180", "指数-港股             ");//恒生科技指数ETF       市值：272.72    累涨：43.76     16.74     16.95     10.07     10日：1.55      0.43      0.43      28        累涨修正：47.89     净值区间：86      66      54      73      46      27
//        INDEX_HK.put("513380", "指数-港股             ");//恒生科技ETF龙头       市值：48.86     累涨：45.19     17.16     17.55     10.48     10日：1.71      0.16      0.16      23        累涨修正：47.86     净值区间：85      65      50      72      10      28
//        INDEX_HK.put("513130", "指数-港股             ");//恒生科技ETF           市值：253.49    累涨：44.47     17.50     17.07     9.90      10日：1.57      0.29      0.29      27        累涨修正：47.78     净值区间：86      66      50      76      47      29
//        INDEX_HK.put("159312", "指数-港股             ");//恒生ETF港股通         市值：0.68      累涨：42.59     12.25     21.25     9.09      10日：2.53      0.44      0.44      11        累涨修正：47.76     净值区间：65      55      77      62      62      30
//        INDEX_HK.put("159318", "指数-港股             ");//恒生港股通ETF         市值：0.53      累涨：41.76     11.97     20.83     8.96      10日：2.66      0.55      0.55      8         累涨修正：47.72     净值区间：61      56      78      62      62      31
//        INDEX_HK.put("159711", "指数-港股             ");//港股通ETF             市值：0.66      累涨：41.42     12.73     19.59     9.10      10日：2.48      0.56      0.56      5         累涨修正：47.26     净值区间：59      46      72      83      73      32
//        INDEX_HK.put("513010", "指数-港股             ");//恒生科技ETF易方达     市值：113.09    累涨：44.13     17.24     16.88     10.01     10日：1.38      0.28      0.28      29        累涨修正：47.19     净值区间：87      65      52      72      46      33
//        INDEX_HK.put("517390", "指数-港股             ");//云计算ETF沪港深       市值：3.09      累涨：41.45     14.14     14.63     12.68     10日：1.19      0.74      0.74      11        累涨修正：47.08     净值区间：57      38      31      67      40      34
//        INDEX_HK.put("513230", "指数-港股             ");//港股消费ETF           市值：3.33      累涨：42.25     16.30     16.03     9.92      10日：2.47      0.39      0.39      8         累涨修正：47.06     净值区间：45      37      56      82      58      35
//        INDEX_HK.put("159742", "指数-港股             ");//恒生科技指数ETF       市值：19.64     累涨：43.78     16.60     17.23     9.95      10日：1.38      0.28      0.28      31        累涨修正：46.84     净值区间：83      63      52      73      47      36
//        INDEX_HK.put("159740", "指数-港股             ");//恒生科技ETF           市值：73.99     累涨：42.90     16.82     16.41     9.67      10日：1.43      0.29      0.29      32        累涨修正：46.07     净值区间：81      63      54      74      47      37
//        INDEX_HK.put("517360", "指数-港股             ");//沪港深科技ETF         市值：0.35      累涨：39.94     14.53     14.99     10.42     10日：3.10      0.49      0.49      25        累涨修正：45.98     净值区间：40      43      45      76      69      38
//        INDEX_HK.put("513210", "指数-港股             ");//恒生ETF易方达         市值：0.50      累涨：40.26     12.97     18.16     9.13      10日：2.35      0.49      0.49      7         累涨修正：45.55     净值区间：69      54      78      80      71      39
//        INDEX_HK.put("513890", "指数-港股             ");//恒生科技HKETF         市值：4.23      累涨：42.47     16.43     16.26     9.78      10日：1.22      0.10      0.10      34        累涨修正：44.29     净值区间：86      66      53      72      46      40
//        INDEX_HK.put("513990", "指数-港股             ");//港股通ETF             市值：1.03      累涨：37.91     13.33     17.12     7.46      10日：1.97      0.38      0.38      30        累涨修正：42.16     净值区间：59      51      74      91      54      41
//        INDEX_HK.put("159569", "指数-港股             ");//港股红利低波ETF       市值：1.25      累涨：32.08     9.23      10.78     12.07     10日：4.21      0.88      0.88      2         累涨修正：41.57     净值区间：59      88      95      97      97      42
//        INDEX_HK.put("513550", "指数-港股             ");//港股通50ETF           市值：24.51     累涨：36.22     12.46     14.98     8.78      10日：1.90      0.48      0.48      23        累涨修正：41        净值区间：53      39      69      88      71      43
//        INDEX_HK.put("520900", "指数-港股             ");//红利ETF港股           市值：20.10     累涨：24.87     6.41      8.24      10.22     10日：4.67      1.79      1.79      12        累涨修正：40.28     净值区间：71      87      93      96      96      44
//        INDEX_HK.put("513910", "指数-港股             ");//港股央企红利ETF       市值：25.45     累涨：28.20     7.82      10.59     9.79      10日：3.67      1.36      1.36      6         累涨修正：40.03     净值区间：68      85      93      96      96      45
//        INDEX_HK.put("520990", "指数-港股             ");//港股央企红利50ETF     市值：47.67     累涨：25.43     6.39      8.81      10.23     10日：4.73      1.56      1.56      9         累涨修正：39.52     净值区间：70      87      93      96      96      46
//        INDEX_HK.put("159726", "指数-港股             ");//恒生红利ETF           市值：4.86      累涨：30.10     10.73     11.29     8.08      10日：3.10      1.03      1.03      18        累涨修正：39.38     净值区间：88      93      96      98      98      47
//        INDEX_HK.put("159954", "指数-港股             ");//H股ETF                市值：4.14      累涨：33.83     12.83     12.58     8.42      10日：2.36      0.52      0.52      19        累涨修正：39.31     净值区间：58      49      71      88      63      48
//        INDEX_HK.put("159691", "指数-港股             ");//港股红利ETF           市值：61.11     累涨：27.71     8.11      11.43     8.17      10日：4.03      1.22      1.22      13        累涨修正：39.06     净值区间：100     89      94      97      97      49
//        INDEX_HK.put("513600", "指数-港股             ");//恒生指数ETF           市值：15.79     累涨：34.35     12.71     13.00     8.64      10日：2.13      0.38      0.38      25        累涨修正：38.76     净值区间：56      42      72      89      68      50
//        INDEX_HK.put("513660", "指数-港股             ");//恒生ETF               市值：40.58     累涨：33.99     12.46     13.14     8.39      10日：2.25      0.38      0.38      27        累涨修正：38.52     净值区间：51      42      71      89      72      51
//        INDEX_HK.put("159920", "指数-港股             ");//恒生ETF               市值：159.91    累涨：33.89     12.65     12.35     8.89      10日：2.08      0.42      0.42      28        累涨修正：38.49     净值区间：63      48      76      90      71      52
//        INDEX_HK.put("159850", "指数-港股             ");//恒生国企ETF           市值：8.16      累涨：34.67     12.97     12.85     8.85      10日：2.32      0.23      0.23      21        累涨修正：38.37     净值区间：57      50      73      87      62      53
//        INDEX_HK.put("159960", "指数-港股             ");//恒生中国企业ETF       市值：5.33      累涨：33.59     12.11     12.85     8.63      10日：2.64      0.35      0.35      24        累涨修正：38.33     净值区间：55      49      67      86      65      54
//        INDEX_HK.put("513140", "指数-港股             ");//港股金融ETF           市值：0.79      累涨：32.84     10.32     13.29     9.23      10日：1.70      0.59      0.59      2         累涨修正：38.08     净值区间：64      70      91      96      96      55
//        INDEX_HK.put("517550", "指数-港股             ");//消费ETF沪港深         市值：0.51      累涨：33.41     14.87     9.96      8.58      10日：2.14      0.38      0.38      11        累涨修正：37.83     净值区间：62      43      45      69      42      56
//        INDEX_HK.put("159331", "指数-港股             ");//红利港股ETF           市值：0.73      累涨：29.21     5.91      13.36     9.94      10日：3.53      0.83      0.83      10        累涨修正：37.72     净值区间：75      92      96      98      98      57
//        INDEX_HK.put("510900", "指数-港股             ");//H股ETF                市值：92.15     累涨：33.53     12.84     12.35     8.34      10日：2.28      0.28      0.28      29        累涨修正：37.49     净值区间：56      47      71      86      61      58
//        INDEX_HK.put("520660", "指数-港股             ");//港股通央企红利ETF南方 市值：10.79     累涨：24.02     6.09      7.64      10.29     10日：4.39      1.48      1.48      16        累涨修正：37.29     净值区间：67      85      92      95      95      59
//        INDEX_HK.put("159333", "指数-港股             ");//港股央企红利ETF       市值：5.63      累涨：26.00     6.00      9.87      10.13     10日：3.74      1.18      1.18      15        累涨修正：36.82     净值区间：80      63      80      89      89      60
//        INDEX_HK.put("513820", "指数-港股             ");//港股红利ETF基金       市值：26.04     累涨：27.64     6.06      11.57     10.01     10日：3.53      0.86      0.86      14        累涨修正：36.33     净值区间：67      80      91      95      95      61
//        INDEX_HK.put("513530", "指数-港股             ");//港股通红利ETF         市值：19.54     累涨：27.80     6.24      10.92     10.64     10日：3.46      0.69      0.69      17        累涨修正：35.4      净值区间：63      89      95      97      97      62
//        INDEX_HK.put("517350", "指数-港股             ");//科技ETF沪港深         市值：0.86      累涨：33.14     11.81     12.69     8.64      10日：1.61                          36        累涨修正：34.75     净值区间：65      55      53      66      47      63
//        INDEX_HK.put("513810", "指数-港股             ");//港股国企ETF           市值：0.74      累涨：30.70     7.35      16.75     6.60      10日：1.87      0.28      0.28      39        累涨修正：34.25     净值区间：50      78      89      65      65      64
//        INDEX_HK.put("513920", "指数-港股             ");//港股通央企红利ETF     市值：31.09     累涨：27.12     8.24      11.23     7.65      10日：2.42      0.78      0.78      31        累涨修正：34.22     净值区间：92      95      98      99      81      65
//        INDEX_HK.put("159302", "指数-港股             ");//港股高股息ETF         市值：1.12      累涨：27.77     6.03      11.86     9.88      10日：2.88      0.59      0.59      22        累涨修正：34.19     净值区间：46      29      49      64      64      66
//        INDEX_HK.put("513950", "指数-港股             ");//恒生红利ETF           市值：12.57     累涨：25.41     7.33      9.52      8.56      10日：2.66      1.01      0.78      26        累涨修正：33.21     净值区间：70      84      93      97      97      67
//        INDEX_HK.put("517660", "指数-港股             ");//物联网ETF沪港深       市值：0.46      累涨：31.91     10.44     12.46     9.01      10日：1.15                          21        累涨修正：33.06     净值区间：59      45      56      68      48      68
//        INDEX_HK.put("513190", "指数-港股             ");//港股通金融ETF         市值：9.30      累涨：28.96     10.00     10.64     8.32      10日：1.66      0.33      0.33      3         累涨修正：32.6      净值区间：38      50      77      88      80      69
//        INDEX_HK.put("513690", "指数-港股             ");//港股红利ETF博时       市值：40.15     累涨：24.58     7.18      9.14      8.26      10日：2.81      0.83      0.83      33        累涨修正：32.37     净值区间：79      86      94      97      97      70
//        INDEX_HK.put("520550", "指数-港股             ");//港股红利低波ETF       市值：4.10      累涨：24.12     7.30      8.29      8.53      10日：2.58      0.92      0.92      32        累涨修正：32.22     净值区间：61      76      91      95      95      71
//        INDEX_HK.put("159545", "指数-港股             ");//恒生红利低波ETF       市值：14.84     累涨：25.75     7.81      9.86      8.08      10日：2.17      0.62      0.62      35        累涨修正：31.64     净值区间：65      81      92      97      97      72
//        INDEX_HK.put("520890", "指数-港股             ");//港股通红利低波ETF     市值：0.57      累涨：25.84     7.51      9.86      8.47      10日：2.12      0.47      0.47      37        累涨修正：30.78     净值区间：64      76      76      88      88      73
//        INDEX_HK.put("159519", "指数-港股             ");//港股国企ETF           市值：1.95      累涨：23.62     8.15      8.46      7.01      10日：2.19      0.68      0.68      36        累涨修正：29.89     净值区间：60      76      89      76      76      74
//        INDEX_HK.put("513170", "指数-港股             ");//恒生央企ETF           市值：6.22      累涨：23.73     8.38      9.20      6.15      10日：2.16      0.54      0.54      38        累涨修正：29.13     净值区间：62      76      86      93      72      75
//        INDEX_HK.put("513630", "指数-港股             ");//港股红利指数ETF       市值：104.49    累涨：24.39     7.14      10.40     6.85      10日：1.89      0.44      0.44      40        累涨修正：28.92     净值区间：33      39      76      90      90      76
//        INDEX_HK.put("513830", "指数-港股             ");//港股红利ETF           市值：2.72      累涨：                    11.28     9.55      10日：3.40      0.83      0.74      20        累涨修正：28.85     净值区间：46      75      87      93              77
//        INDEX_HK.put("517010", "指数-港股             ");//沪港深500ETF易方达    市值：0.73      累涨：24.04     8.44      9.08      6.52      10日：1.45      0.31      0.31      38        累涨修正：27.35     净值区间：32      32      54      79      72      78
//        INDEX_HK.put("517000", "指数-港股             ");//沪港深500ETF          市值：3.62      累涨：23.90     8.13      8.75      7.02      10日：1.49      0.23      0.23      43        累涨修正：26.77     净值区间：40      42      67      90      78      79
//        INDEX_HK.put("517170", "指数-港股             ");//沪港深ETF             市值：0.36      累涨：24.03     8.36      9.30      6.37      10日：1.14                          41        累涨修正：25.17     净值区间：45      38      44      68      68      80
//        INDEX_HK.put("517080", "指数-港股             ");//沪港深500ETF基金      市值：3.82      累涨：23.56     8.40      9.04      6.12      10日：1.17                          49        累涨修正：24.73     净值区间：35      32      66      87      69      81
//        INDEX_HK.put("517030", "指数-港股             ");//沪港深300ETF易方达    市值：0.69      累涨：21.85     7.33      7.78      6.74      10日：1.25                          42        累涨修正：23.1      净值区间：24      19      29      54      54      82
//        INDEX_HK.put("517300", "指数-港股             ");//沪港深300ETF          市值：26.19     累涨：20.08     6.99      7.50      5.59      10日：1.00                          43        累涨修正：21.08     净值区间：32      30      63      85      71      83
//        INDEX_HK.put("159202", "指数-港股             ");//恒生互联网科技ETF     市值：1.51      累涨：                              10.46     10日：1.46      0.49      0.20      30        累涨修正：13.7      净值区间：98      77      55                      84
//        INDEX_HK.put("513040", "指数-港股             ");//港股通互联网ETF       市值：7.04      累涨：                                        10日：                              40        累涨修正：0         净值区间：84      64      57      81      51      85
//        INDEX_HK.put("159220", "指数-港股             ");//港股通红利ETF         市值：2.25      累涨：                                        10日：1.67      0.20      0.20                累涨修正：          净值区间：44      68                              86
//    }
    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘
    static {
        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.36      累涨：27.21     7.50      10.40     9.31      10日：2.66      1.73      1.61      1         累涨修正：39.77     净值区间：9       9       33      46      46      1
//        INDEX_CN_BIG.put("515780", "指数-大盘             ");//浦银MSCI中国ETF       市值：0.08      累涨：20.92     6.51      5.49      8.92      10日：3.97      1.98      1.90      7         累涨修正：36.45     净值区间：100     100     57      61      47      2
//        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：2.20      累涨：29.53     7.80      10.70     11.03     10日：1.42      0.83      0.83      13        累涨修正：35.93     净值区间：100     77      49      68      49      3
//        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.15      累涨：30.38     7.30      13.38     9.70      10日：2.31      0.34      0.34      27        累涨修正：34.73     净值区间：47      44      67      87      74      4
//        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：2.65      累涨：29.72     7.71      10.93     11.08     10日：1.17      0.59      0.59      20        累涨修正：34.43     净值区间：95      70      47      67      47      5
//        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：14.99     累涨：29.26     7.93      10.61     10.72     10日：1.23      0.62      0.62      19        累涨修正：34.21     净值区间：82      69      47      65      45      6
//        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.04      累涨：23.46     4.36      11.27     7.83      10日：4.55      0.94      0.94      5         累涨修正：33.65     净值区间：47      22      40      40      40      7
//        INDEX_CN_BIG.put("159966", "指数-大盘             ");//创业板价值ETF         市值：4.79      累涨：25.83     5.46      12.11     8.26      10日：1.11      0.45      0.45      35        累涨修正：29.64     净值区间：53      44      50      66      49      8
//        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波ETF基金       市值：1.84      累涨：21.61     5.87      8.90      6.84      10日：2.20      1.10      0.85      2         累涨修正：29.41     净值区间：50      59      80      90      90      9
//        INDEX_CN_BIG.put("159836", "指数-大盘             ");//创业板300ETF天弘      市值：1.80      累涨：26.65     6.76      9.81      10.08     10日：1.38                          40        累涨修正：28.03     净值区间：64      52      59      69      56      10
//        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.54      累涨：21.78     5.99      9.47      6.32      10日：1.99      0.70      0.70      3         累涨修正：27.97     净值区间：88      75      84      83      83      11
//        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：4.92      累涨：22.80     5.69      11.48     5.63      10日：1.90      0.53      0.53      28        累涨修正：27.88     净值区间：83      71      82      46      46      12
//        INDEX_CN_BIG.put("560500", "指数-大盘             ");//500质量成长ETF        市值：5.28      累涨：23.33     8.01      9.83      5.49      10日：2.03      0.43      0.32      39        累涨修正：27.5      净值区间：89      91      93      78      75      13
//        INDEX_CN_BIG.put("562060", "指数-大盘             ");//标普红利ETF           市值：14.72     累涨：18.52     5.40      6.15      6.97      10日：2.98      0.99      0.99      17        累涨修正：27.44     净值区间：94      93      97      98      98      14
//        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.65      累涨：25.18     7.14      12.46     5.58      10日：1.95      0.05      0.05      20        累涨修正：27.43     净值区间：13      13      38      65      61      15
//        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：2.72      累涨：21.02     3.67      11.33     6.02      10日：2.06      0.69      0.69      24        累涨修正：27.22     净值区间：59      57      78      92      90      16
//        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.35      累涨：20.91     6.39      6.46      8.06      10日：2.77      1.75                22        累涨修正：27.18     净值区间：39      23      51      70      70      17
//        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.72      累涨：19.84     4.75      8.46      6.63      10日：2.27      1.01      0.76      8         累涨修正：27.17     净值区间：41      58      79      89      89      18
//        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：166.80    累涨：19.87     4.91      8.42      6.54      10日：2.28      0.96      0.61      9         累涨修正：26.51     净值区间：39      55      78      89      89      19
//        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.47      累涨：21.31     7.07      8.52      5.72      10日：2.55      0.84      0.15      4         累涨修正：26.14     净值区间：20      17      50      55      47      20
//        INDEX_CN_BIG.put("159721", "指数-大盘             ");//深证100ETF永赢        市值：0.83      累涨：24.46     7.10      8.14      9.22      10日：1.57                          39        累涨修正：26.03     净值区间：27      27      58      68      56      21
//        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：8.06      累涨：18.89     4.73      7.28      6.88      10日：2.44      1.04      0.61      11        累涨修正：25.85     净值区间：57      58      83      89      89      22
//        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.54      累涨：22.77     8.34      7.87      6.56      10日：1.76      0.21      0.21      29        累涨修正：25.79     净值区间：31      29      24      49      49      23
//        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：16.23     累涨：18.77     4.73      7.60      6.44      10日：2.17      1.00      0.67      15        累涨修正：25.62     净值区间：52      67      83      91      91      24
//        INDEX_CN_BIG.put("562530", "指数-大盘             ");//中证1000价值ETF       市值：0.51      累涨：19.43     6.52      7.73      5.18      10日：2.44      0.61      0.61      53        累涨修正：25.53     净值区间：90      72      83      85      77      25
//        INDEX_CN_BIG.put("512360", "指数-大盘             ");//MSCI中国A股ETF基金    市值：0.62      累涨：22.55     6.96      10.00     5.59      10日：1.83      0.14      0.14      18        累涨修正：25.22     净值区间：34      13      49      66      66      26
//        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：1.02      累涨：18.23     4.75      7.69      5.79      10日：2.64      0.66      0.66      18        累涨修正：24.83     净值区间：28      26      61      86      86      27
//        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：2.46      累涨：18.50     4.70      7.28      6.52      10日：2.06      0.84      0.56      23        累涨修正：24.48     净值区间：52      66      83      91      91      28
//        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.49      累涨：18.43     4.53      7.96      5.94      10日：1.97      0.66      0.66      25        累涨修正：24.36     净值区间：28      28      65      81      81      29
//        INDEX_CN_BIG.put("562330", "指数-大盘             ");//中证500价值ETF        市值：0.15      累涨：19.26     5.79      8.16      5.31      10日：1.76      0.52      0.52      59        累涨修正：24.14     净值区间：63      53      76      74      62      30
//        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.09      累涨：21.88     7.33      7.26      7.29      10日：1.82      0.09                6         累涨修正：23.88     净值区间：14      14      43      76      70      31
//        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.63      累涨：20.23     5.40      7.56      7.27      10日：1.47      0.49      0.20      16        累涨修正：23.48     净值区间：27      27      53      72      72      32
//        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：3.31      累涨：21.90     6.33      8.30      7.27      10日：1.48                          12        累涨修正：23.38     净值区间：28      28      56      72      60      33
//        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：1.90      累涨：21.81     6.35      8.09      7.37      10日：1.55                          10        累涨修正：23.36     净值区间：24      23      54      73      60      34
//        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：4.02      累涨：18.97     5.41      7.63      5.93      10日：2.09      0.38      0.38      22        累涨修正：23.34     净值区间：37      37      65      83      83      35
//        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.12      累涨：20.77     6.11      6.95      7.71      10日：2.46                          13        累涨修正：23.23     净值区间：35      32      57      65      35      36
//        INDEX_CN_BIG.put("159617", "指数-大盘             ");//500价值ETF            市值：0.35      累涨：17.55     4.88      7.87      4.80      10日：1.85      0.62      0.62      67        累涨修正：23.12     净值区间：100     100     100     80      77      37
//        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.69      累涨：21.85     7.33      7.78      6.74      10日：1.25                          42        累涨修正：23.1      净值区间：24      19      29      54      54      38
//        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.36      累涨：19.54     6.33      7.75      5.46      10日：1.87      0.33      0.22      31        累涨修正：22.95     净值区间：81      85      93      97      92      39
//        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.48      累涨：18.79     4.74      9.40      4.65      10日：1.69      0.38      0.38      21        累涨修正：22.76     净值区间：25      18      59      79      78      40
//        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：31.21     累涨：19.15     7.71      6.72      4.72      10日：1.65      0.31      0.31      50        累涨修正：22.66     净值区间：32      32      52      71      62      41
//        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：1.11      累涨：17.20     3.88      7.83      5.49      10日：1.80      0.60      0.60      64        累涨修正：22.6      净值区间：67      73      84      94      91      42
//        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.71      累涨：21.02     6.39      7.40      7.23      10日：1.49                          21        累涨修正：22.51     净值区间：29      28      49      66      44      43
//        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：0.88      累涨：20.14     5.12      8.55      6.47      10日：1.30      0.35      0.09      34        累涨修正：22.5      净值区间：22      22      65      82      82      44
//        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：0.94      累涨：19.26     5.49      7.92      5.85      10日：2.05      0.56                14        累涨修正：22.43     净值区间：11      11      18      38      38      45
//        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.61      累涨：20.72     6.67      7.68      6.37      10日：1.64                          19        累涨修正：22.36     净值区间：18      17      45      44      44      46
//        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.63      累涨：19.37     7.11      6.94      5.32      10日：1.29      0.41      0.21      57        累涨修正：22.32     净值区间：44      43      71      88      88      47
//        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：6.97      累涨：17.66     4.96      7.86      4.84      10日：1.28      0.56      0.56      84        累涨修正：22.3      净值区间：65      63      70      86      81      48
//        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.61      累涨：21.23     7.43      7.81      5.99      10日：1.06                          40        累涨修正：22.29     净值区间：31      31      49      77      76      49
//        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：47.07     累涨：20.93     6.95      7.62      6.36      10日：1.32                          32        累涨修正：22.25     净值区间：18      18      48      79      74      50
//        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：6.74      累涨：16.78     4.33      7.06      5.39      10日：1.68      0.63      0.63      80        累涨修正：22.24     净值区间：64      68      85      72      62      51
//        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：6.84      累涨：18.61     4.32      9.42      4.87      10日：1.87      0.29      0.29      72        累涨修正：22.22     净值区间：32      32      57      84      84      52
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.54      累涨：20.35     7.07      6.06      7.22      10日：1.81                          26        累涨修正：22.16     净值区间：27      27      55      78      64      53
//        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.24      累涨：20.16     6.28      7.96      5.92      10日：1.35      0.30                27        累涨修正：22.11     净值区间：33      33      66      84      84      54
//        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：1.96      累涨：20.82     5.94      7.77      7.11      10日：1.27                          36        累涨修正：22.09     净值区间：53      49      62      72      56      55
//        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：0.95      累涨：19.71     5.07      7.56      7.08      10日：1.26      0.42      0.07      38        累涨修正：22.09     净值区间：25      25      68      84      84      56
//        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：63.25     累涨：20.51     6.32      6.76      7.43      10日：1.52                          33        累涨修正：22.03     净值区间：32      31      54      68      55      57
//        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：0.99      累涨：18.38     5.08      8.97      4.33      10日：1.20      0.40      0.40      89        累涨修正：21.98     净值区间：59      47      54      79      79      58
//        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.51      累涨：20.35     7.37      5.86      7.12      10日：1.61                          29        累涨修正：21.96     净值区间：33      21      32      57      54      59
//        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.37      累涨：20.20     6.77      6.75      6.68      10日：1.65                          28        累涨修正：21.85     净值区间：32      32      59      82      68      60
//        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.32      累涨：20.13     5.72      7.35      7.06      10日：1.62                          30        累涨修正：21.75     净值区间：28      28      48      67      53      61
        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：10.04     累涨：20.25     7.03      6.90      6.32      10日：1.47                          39        累涨修正：21.72     净值区间：19      19      49      80      75      62
//        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：0.68      累涨：20.68     6.01      8.50      6.17      10日：1.02                          48        累涨修正：21.7      净值区间：69      66      73      88      70      63
//        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：8.14      累涨：17.71     4.48      7.14      6.09      10日：1.65      0.39      0.39      54        累涨修正：21.7      净值区间：61      58      83      91      85      64
//        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：16.50     累涨：17.85     5.33      7.07      5.45      10日：1.91      0.32      0.32      63        累涨修正：21.68     净值区间：63      65      83      79      74      65
//        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：5.10      累涨：20.58     5.75      7.88      6.95      10日：1.07                          47        累涨修正：21.65     净值区间：53      47      60      70      55      66
//        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：1.14      累涨：19.15     5.11      7.96      6.08      10日：1.70      0.20      0.10      35        累涨修正：21.65     净值区间：22      25      63      78      78      67
//        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：39.70     累涨：20.08     6.89      6.64      6.55      10日：1.56                          37        累涨修正：21.64     净值区间：21      21      51      79      74      68
//        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：32.07     累涨：20.17     6.77      7.18      6.22      10日：1.44                          42        累涨修正：21.61     净值区间：17      17      47      77      72      69
//        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.21      累涨：18.33     6.88      5.49      5.96      10日：0.81      0.41      0.41      87        累涨修正：21.6      净值区间：69      64      52      59      46      70
//        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：87.44     累涨：17.11     4.53      6.97      5.61      10日：1.95      0.56      0.35      62        累涨修正：21.58     净值区间：23      38      64      82      82      71
//        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：34.96     累涨：20.32     7.67      6.50      6.15      10日：1.21                          49        累涨修正：21.53     净值区间：18      18      50      78      70      72
//        INDEX_CN_BIG.put("560350", "指数-大盘             ");//中证A50ETF指数基金    市值：28.88     累涨：20.19     7.07      6.89      6.23      10日：1.33                          45        累涨修正：21.52     净值区间：22      22      52      80      72      73
//        INDEX_CN_BIG.put("562890", "指数-大盘             ");//中证A50指数ETF        市值：4.33      累涨：20.01     7.35      6.31      6.35      10日：1.48                          41        累涨修正：21.49     净值区间：16      16      47      77      71      74
//        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：61.21     累涨：17.45     3.80      8.74      4.91      10日：1.56      0.41      0.41      83        累涨修正：21.47     净值区间：41      41      68      86      86      75
//        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.48      累涨：17.39     3.64      8.29      5.46      10日：1.83      0.37      0.37      69        累涨修正：21.44     净值区间：35      35      68      84      84      76
//        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：0.87      累涨：16.12     4.62      4.95      6.55      10日：1.96      0.56      0.56      60        累涨修正：21.44     净值区间：59      55      83      92      80      77
//        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：17.68     累涨：20.00     7.04      6.66      6.30      10日：1.42                          46        累涨修正：21.42     净值区间：19      19      50      77      68      78
//        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.42      累涨：20.09     7.05      7.65      5.39      10日：1.29                          66        累涨修正：21.38     净值区间：11      11      28      54      54      79
//        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.31      累涨：18.66     5.21      7.31      6.14      10日：1.18      0.25      0.25      64        累涨修正：21.34     净值区间：56      56      72      86      79      80
//        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：25.05     累涨：19.98     7.07      6.77      6.14      10日：1.22                          53        累涨修正：21.2      净值区间：18      18      51      77      71      81
//        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.16      累涨：19.69     5.41      7.27      7.01      10日：1.49                          43        累涨修正：21.18     净值区间：24      24      23      45      44      82
//        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：26.19     累涨：20.08     6.99      7.50      5.59      10日：1.00                          43        累涨修正：21.08     净值区间：32      30      63      85      71      83
//        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：49.53     累涨：19.83     7.39      6.11      6.33      10日：1.21                          56        累涨修正：21.04     净值区间：26      26      55      81      73      84
//        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：1.55      累涨：19.39     5.76      7.36      6.27      10日：1.04      0.24                52        累涨修正：20.91     净值区间：29      32      64      83      83      85
//        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：2.11      累涨：16.31     3.89      6.50      5.92      10日：1.66      0.49      0.49      66        累涨修正：20.91     净值区间：42      48      74      89      89      86
//        INDEX_CN_BIG.put("159351", "指数-大盘             ");//A500指数ETF           市值：146.33    累涨：19.76     5.48      8.33      5.95      10日：1.13                          65        累涨修正：20.89     净值区间：40      40      57      81      66      87
//        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：2.12      累涨：19.80     6.15      8.36      5.29      10日：1.07                          82        累涨修正：20.87     净值区间：26      26      48      81      78      88
//        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.70      累涨：18.20     4.56      8.95      4.69      10日：1.57      0.18      0.18      86        累涨修正：20.85     净值区间：24      24      59      82      82      89
//        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：1.85      累涨：19.62     7.21      6.64      5.77      10日：0.97      0.10                74        累涨修正：20.79     净值区间：26      26      27      56      56      90
//        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.27      累涨：19.59     6.95      6.50      6.14      10日：1.17                          67        累涨修正：20.76     净值区间：20      20      66      85      80      91
//        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：1.08      累涨：17.89     5.74      6.89      5.26      10日：1.61      0.61                61        累涨修正：20.72     净值区间：25      35      35      64      64      92
//        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：18.08     累涨：19.86     7.84      6.39      5.63      10日：0.82                          102       累涨修正：20.68     净值区间：35      35      52      80      80      93
//        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.48      累涨：19.21     6.40      5.90      6.91      10日：1.44                          51        累涨修正：20.65     净值区间：26      25      51      66      52      94
//        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：9.72      累涨：16.14     4.08      7.23      4.83      10日：1.63      0.48      0.48      99        累涨修正：20.65     净值区间：45      45      74      89      89      95
//        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.21      累涨：19.39     5.90      6.73      6.76      10日：1.23                          58        累涨修正：20.62     净值区间：38      36      55      68      51      96
//        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：10.94     累涨：19.25     7.10      6.00      6.15      10日：1.34                          59        累涨修正：20.59     净值区间：18      18      49      78      71      97
//        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：1.95      累涨：17.11     6.28      5.05      5.78      10日：2.30      0.59                44        累涨修正：20.59     净值区间：20      19      58      71      69      98
//        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF指数         市值：0.75      累涨：19.50     7.16      6.86      5.48      10日：0.89      0.09                97        累涨修正：20.57     净值区间：16      65      55      79      79      99
//        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.26      累涨：19.19     6.96      5.69      6.54      10日：1.02      0.06      0.06      78        累涨修正：20.57     净值区间：15      15      50      75      75      100
//        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：10.39     累涨：19.10     7.11      5.55      6.44      10日：1.39                          55        累涨修正：20.49     净值区间：26      26      55      80      72      101
//        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.10      累涨：19.22     6.05      7.48      5.69      10日：1.22                          70        累涨修正：20.44     净值区间：32      32      32      60      60      102
//        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：70.30     累涨：19.17     7.31      5.63      6.23      10日：1.21                          68        累涨修正：20.38     净值区间：18      18      51      79      71      103
//        INDEX_CN_BIG.put("515300", "指数-大盘             ");//300红利低波ETF        市值：56.73     累涨：15.64     3.67      6.18      5.79      10日：1.85      0.85      0.28      73        累涨修正：20.31     净值区间：20      35      66      83      83      104
//        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.36      累涨：18.09     7.61      6.11      4.37      10日：1.41      0.13      0.13      88        累涨修正：20.28     净值区间：28      28      50      73      65      105
//        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.30      累涨：17.46     4.40      7.25      5.81      10日：1.12      0.52      0.16      81        累涨修正：20.26     净值区间：18      18      67      81      81      106
//        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1637.06   累涨：19.04     7.24      6.26      5.54      10日：0.98      0.11                90        累涨修正：20.24     净值区间：20      20      44      77      77      107
//        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.63      累涨：18.47     5.95      7.87      4.65      10日：0.86      0.15      0.15      111       累涨修正：20.23     净值区间：71      66      58      73      66      108
//        INDEX_CN_BIG.put("563860", "指数-大盘             ");//A500ETF海富通         市值：9.44      累涨：19.21     5.36      8.36      5.49      10日：1.00                          89        累涨修正：20.21     净值区间：28      28      49      77      65      109
//        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波ETF天弘       市值：38.00     累涨：16.17     3.83      7.69      4.65      10日：1.39      0.44      0.44      107       累涨修正：20.2      净值区间：35      35      67      86      86      110
//        INDEX_CN_BIG.put("159352", "指数-大盘             ");//中证A500ETF南方       市值：167.65    累涨：19.20     5.44      7.97      5.79      10日：0.90                          85        累涨修正：20.1      净值区间：38      38      56      81      66      111
//        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：5.68      累涨：17.77     4.50      7.80      5.47      10日：0.83      0.25      0.25      130       累涨修正：20.1      净值区间：38      38      62      82      82      112
//        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.03      累涨：17.45     4.99      5.63      6.83      10日：1.53      0.40      0.07      65        累涨修正：20.06     净值区间：31      31      66      82      82      113
//        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：2.76      累涨：18.59     4.89      8.70      5.00      10日：0.80      0.10      0.10      139       累涨修正：19.99     净值区间：32      32      54      83      79      114
//        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.80      累涨：18.71     5.51      7.59      5.61      10日：1.22                          85        累涨修正：19.93     净值区间：32      29      51      80      68      115
//        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.46      累涨：18.77     6.32      6.19      6.26      10日：1.10                          79        累涨修正：19.87     净值区间：52      21      21      47      47      116
//        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.83      累涨：16.53     4.53      7.62      4.38      10日：1.54      0.36      0.27      98        累涨修正：19.87     净值区间：12      23      35      65      65      117
//        INDEX_CN_BIG.put("159358", "指数-大盘             ");//中证A500ETF基金       市值：25.16     累涨：18.83     5.27      7.74      5.82      10日：1.00                          78        累涨修正：19.83     净值区间：29      29      51      79      66      118
//        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：201.08    累涨：17.16     4.56      7.55      5.05      10日：1.60      0.19      0.16      94        累涨修正：19.78     净值区间：27      27      59      80      80      119
//        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：6.71      累涨：18.48     7.27      5.20      6.01      10日：1.29                          76        累涨修正：19.77     净值区间：18      18      51      77      69      120
//        INDEX_CN_BIG.put("512550", "指数-大盘             ");//A50ETF基金            市值：3.40      累涨：18.59     7.15      4.83      6.61      10日：1.16                          75        累涨修正：19.75     净值区间：13      13      48      75      75      121
//        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.81      累涨：17.30     5.20      7.32      4.78      10日：1.06      0.23      0.23      116       累涨修正：19.74     净值区间：50      50      69      87      81      122
//        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.36      累涨：18.26     4.75      8.15      5.36      10日：0.77      0.10      0.10      151       累涨修正：19.63     净值区间：60      55      56      84      66      123
//        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：5.91      累涨：18.43     6.36      6.54      5.53      10日：0.94      0.11                109       累涨修正：19.59     净值区间：26      32      51      81      81      124
//        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：2.03      累涨：18.66     7.04      5.99      5.63      10日：0.80      0.06                127       累涨修正：19.58     净值区间：24      23      55      77      76      125
//        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：87.65     累涨：16.66     4.27      7.56      4.83      10日：1.54      0.22      0.22      106       累涨修正：19.52     净值区间：36      36      60      82      82      126
//        INDEX_CN_BIG.put("563360", "指数-大盘             ");//中证A500ETF基金       市值：87.12     累涨：18.61     5.12      7.92      5.57      10日：0.90                          98        累涨修正：19.51     净值区间：36      36      55      81      67      127
//        INDEX_CN_BIG.put("159339", "指数-大盘             ");//A500ETF               市值：59.07     累涨：18.33     5.14      7.27      5.92      10日：1.15                          76        累涨修正：19.48     净值区间：29      29      52      80      65      128
//        INDEX_CN_BIG.put("563880", "指数-大盘             ");//中证A500指数ETF       市值：55.39     累涨：18.42     5.52      7.21      5.69      10日：1.02                          82        累涨修正：19.44     净值区间：32      32      53      80      66      129
//        INDEX_CN_BIG.put("560610", "指数-大盘             ");//A500指数ETF           市值：98.53     累涨：18.21     5.20      7.01      6.00      10日：1.06                          79        累涨修正：19.27     净值区间：32      32      52      80      65      130
//        INDEX_CN_BIG.put("159338", "指数-大盘             ");//中证A500ETF           市值：202.04    累涨：18.21     5.81      6.75      5.65      10日：1.05                          84        累涨修正：19.26     净值区间：40      40      55      81      66      131
//        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：50.58     累涨：18.53     4.30      9.74      4.49      10日：0.72                          175       累涨修正：19.25     净值区间：41      41      57      82      65      132
//        INDEX_CN_BIG.put("159362", "指数-大盘             ");//A500ETF工银           市值：23.37     累涨：18.13     5.07      7.33      5.73      10日：1.11                          86        累涨修正：19.24     净值区间：38      37      54      81      66      133
//        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.28      累涨：16.72     5.24      5.59      5.89      10日：1.43      0.18      0.18      92        累涨修正：19.23     净值区间：33      33      68      84      80      134
//        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.30      累涨：18.22     6.18      6.61      5.43      10日：0.91                          133       累涨修正：19.13     净值区间：21      20      47      74      62      135
//        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：5.65      累涨：18.31     5.48      7.61      5.22      10日：0.80                          140       累涨修正：19.11     净值区间：30      30      50      82      78      136
//        INDEX_CN_BIG.put("563220", "指数-大盘             ");//中证A500ETF富国       市值：160.33    累涨：18.08     5.50      6.73      5.85      10日：1.01                          83        累涨修正：19.09     净值区间：32      32      53      80      66      137
//        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：17.89     累涨：18.17     4.37      8.85      4.95      10日：0.49      0.07      0.07      167       累涨修正：19.08     净值区间：50      43      49      77      59      138
//        INDEX_CN_BIG.put("563800", "指数-大盘             ");//中证A500ETF龙头       市值：181.16    累涨：18.12     5.22      7.12      5.78      10日：0.95                          90        累涨修正：19.07     净值区间：29      29      51      79      64      139
//        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：4.10      累涨：18.10     5.24      7.21      5.65      10日：0.97                          115       累涨修正：19.07     净值区间：25      25      50      80      71      140
//        INDEX_CN_BIG.put("512050", "指数-大盘             ");//A500ETF基金           市值：163.68    累涨：18.19     5.56      7.06      5.57      10日：0.84                          101       累涨修正：19.03     净值区间：33      33      53      80      65      141
//        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：71.22     累涨：16.39     4.37      7.27      4.75      10日：1.44      0.20      0.20      119       累涨修正：19.03     净值区间：33      33      59      82      82      142
//        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2620.41   累涨：18.03     5.99      6.39      5.65      10日：0.97                          110       累涨修正：19        净值区间：26      26      51      78      66      143
//        INDEX_CN_BIG.put("159376", "指数-大盘             ");//A500ETF指数基金       市值：4.13      累涨：17.92     5.34      6.90      5.68      10日：1.06                          88        累涨修正：18.98     净值区间：34      33      50      79      65      144
//        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：1.84      累涨：17.96     6.74      5.49      5.73      10日：0.94      0.03                118       累涨修正：18.96     净值区间：26      44      47      77      77      145
//        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：15.89     累涨：16.56     4.55      6.41      5.60      10日：1.56      0.20      0.10      96        累涨修正：18.92     净值区间：26      29      62      77      77      146
//        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：2.97      累涨：17.59     6.38      5.35      5.86      10日：1.25                          91        累涨修正：18.84     净值区间：20      19      45      75      66      147
//        INDEX_CN_BIG.put("159356", "指数-大盘             ");//A500ETF基金           市值：52.35     累涨：17.81     5.18      7.11      5.52      10日：1.01                          96        累涨修正：18.82     净值区间：46      46      59      82      67      148
//        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.44      累涨：17.19     4.59      7.19      5.41      10日：0.79      0.14      0.14      165       累涨修正：18.82     净值区间：46      41      55      79      58      149
//        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：33.01     累涨：15.94     4.10      6.48      5.36      10日：0.77      0.35      0.35      179       累涨修正：18.81     净值区间：63      59      53      77      60      150
//        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：1.88      累涨：17.54     5.79      5.97      5.78      10日：1.20                          104       累涨修正：18.74     净值区间：25      23      48      76      64      151
//        INDEX_CN_BIG.put("159386", "指数-大盘             ");//A500ETF永赢           市值：1.81      累涨：17.81     4.98      7.43      5.40      10日：0.90                          107       累涨修正：18.71     净值区间：23      23      51      78      66      152
//        INDEX_CN_BIG.put("510800", "指数-大盘             ");//50ETF基金             市值：4.95      累涨：17.75     6.43      5.73      5.59      10日：0.80      0.08                142       累涨修正：18.71     净值区间：21      15      47      76      76      153
//        INDEX_CN_BIG.put("159357", "指数-大盘             ");//中证A500指数ETF       市值：38.76     累涨：17.79     5.25      7.07      5.47      10日：0.90                          105       累涨修正：18.69     净值区间：36      36      58      82      66      154
//        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1938.47   累涨：17.79     5.93      6.19      5.67      10日：0.90                          129       累涨修正：18.69     净值区间：27      27      51      78      70      155
//        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.55      累涨：15.39     4.79      4.45      6.15      10日：1.56      0.29      0.29      93        累涨修正：18.69     净值区间：76      64      82      92      85      156
//        INDEX_CN_BIG.put("159359", "指数-大盘             ");//中证A500ETF华安       市值：28.71     累涨：17.67     4.84      7.05      5.78      10日：1.00                          94        累涨修正：18.67     净值区间：32      32      55      81      66      157
//        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：0.91      累涨：17.51     7.43      4.70      5.38      10日：0.88      0.14                137       累涨修正：18.67     净值区间：18      18      44      80      80      158
//        INDEX_CN_BIG.put("159379", "指数-大盘             ");//A500ETF融通           市值：5.23      累涨：17.63     4.84      6.93      5.86      10日：0.98                          95        累涨修正：18.61     净值区间：33      33      52      80      64      159
//        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：21.10     累涨：17.73     5.36      6.99      5.38      10日：0.84                          159       累涨修正：18.57     净值区间：72      65      77      91      87      160
//        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.49      累涨：17.59     5.21      7.14      5.24      10日：0.96                          156       累涨修正：18.55     净值区间：42      15      18      40      40      161
//        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利100ETF            市值：0.75      累涨：16.03     4.08      7.28      4.67      10日：1.35      0.19      0.19      132       累涨修正：18.52     净值区间：47      47      55      80      80      162
//        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：2.27      累涨：17.46     5.51      6.38      5.57      10日：1.05                          128       累涨修正：18.51     净值区间：21      21      52      78      72      163
//        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.31      累涨：17.11     6.06      5.20      5.85      10日：1.39                          45        累涨修正：18.5      净值区间：22      22      49      68      67      164
//        INDEX_CN_BIG.put("159360", "指数-大盘             ");//中证A500ETF天弘       市值：32.84     累涨：17.48     4.62      7.01      5.85      10日：1.00                          93        累涨修正：18.48     净值区间：36      36      56      79      64      165
//        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：25.10     累涨：17.42     5.64      6.04      5.74      10日：1.05                          114       累涨修正：18.47     净值区间：24      23      46      76      65      166
//        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：0.95      累涨：17.02     4.29      7.51      5.22      10日：0.72      0.18      0.09      173       累涨修正：18.46     净值区间：32      32      67      84      73      167
//        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：3.72      累涨：17.48     6.66      5.22      5.60      10日：0.97                          131       累涨修正：18.45     净值区间：32      32      51      77      65      168
//        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：40.77     累涨：17.32     5.01      7.18      5.13      10日：1.08                          143       累涨修正：18.4      净值区间：87      81      92      97      97      169
//        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：7.38      累涨：17.13     5.81      5.38      5.94      10日：1.26                          100       累涨修正：18.39     净值区间：38      38      62      83      79      170
//        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：41.67     累涨：17.12     5.15      5.68      6.29      10日：1.25                          105       累涨修正：18.37     净值区间：25      25      31      63      63      171
//        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.55      累涨：17.58     7.54      4.21      5.83      10日：0.77                          124       累涨修正：18.35     净值区间：36      10      28      50      50      172
//        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：38.31     累涨：17.48     5.73      6.26      5.49      10日：0.86                          157       累涨修正：18.34     净值区间：25      25      51      78      70      173
//        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.14      累涨：17.17     6.10      5.34      5.73      10日：1.17                          112       累涨修正：18.34     净值区间：29      27      52      80      61      174
//        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：76.26     累涨：17.34     5.37      6.10      5.87      10日：0.96                          125       累涨修正：18.3      净值区间：25      25      49      78      69      175
//        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.23      累涨：17.28     5.36      6.37      5.55      10日：1.00                          49        累涨修正：18.28     净值区间：24      24      50      78      69      176
//        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：2.82      累涨：17.14     5.38      6.26      5.50      10日：1.01                          141       累涨修正：18.15     净值区间：37      37      56      81      70      177
//        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：5.78      累涨：17.23     5.67      5.88      5.68      10日：0.90                          144       累涨修正：18.13     净值区间：26      26      52      78      69      178
//        INDEX_CN_BIG.put("159353", "指数-大盘             ");//中证A500ETF景顺       市值：129.33    累涨：17.19     5.29      5.94      5.96      10日：0.93                          92        累涨修正：18.12     净值区间：36      36      53      80      66      179
//        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.46      累涨：17.28     5.56      6.93      4.79      10日：0.81                          170       累涨修正：18.09     净值区间：30      30      49      79      74      180
//        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.91      累涨：16.73     4.47      6.83      5.43      10日：1.22      0.07                136       累涨修正：18.09     净值区间：45      24      45      62      48      181
//        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.31      累涨：16.85     4.91      6.27      5.67      10日：1.22                          123       累涨修正：18.07     净值区间：12      12      39      70      63      182
//        INDEX_CN_BIG.put("560530", "指数-大盘             ");//中证A500ETF摩根       市值：78.31     累涨：17.13     5.05      6.37      5.71      10日：0.93                          104       累涨修正：18.06     净值区间：28      28      51      78      62      183
//        INDEX_CN_BIG.put("515330", "指数-大盘             ");//沪深300ETF天弘        市值：93.05     累涨：17.13     5.65      5.82      5.66      10日：0.92                          149       累涨修正：18.05     净值区间：30      30      54      80      71      184
//        INDEX_CN_BIG.put("159380", "指数-大盘             ");//A500ETF东财           市值：5.42      累涨：17.09     4.66      6.56      5.87      10日：0.96                          100       累涨修正：18.05     净值区间：37      37      50      75      63      185
//        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：10.52     累涨：17.01     5.24      6.04      5.73      10日：1.03                          134       累涨修正：18.04     净值区间：28      28      51      78      70      186
//        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：0.99      累涨：17.02     6.60      4.90      5.52      10日：0.99                          138       累涨修正：18.01     净值区间：23      23      45      74      62      187
//        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.42      累涨：17.04     5.74      5.59      5.71      10日：0.96                          48        累涨修正：18        净值区间：19      19      46      74      63      188
//        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.40      累涨：17.00     5.19      6.32      5.49      10日：1.00                          155       累涨修正：18        净值区间：28      26      49      80      68      189
//        INDEX_CN_BIG.put("530080", "指数-大盘             ");//上证180ETF天弘        市值：0.46      累涨：16.91     5.07      6.68      5.16      10日：0.96                          171       累涨修正：17.87     净值区间：29      29      48      82      78      190
//        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：3.95      累涨：16.54     5.34      5.73      5.47      10日：0.95      0.06      0.06      172       累涨修正：17.85     净值区间：28      28      52      80      70      191
//        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：2.84      累涨：16.13     5.06      5.62      5.45      10日：1.42      0.05      0.05      148       累涨修正：17.85     净值区间：28      21      47      69      53      192
//        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.39      累涨：16.52     5.57      6.64      4.31      10日：0.87      0.19                164       累涨修正：17.77     净值区间：33      55      55      52      52      193
//        INDEX_CN_BIG.put("560750", "指数-大盘             ");//A500ETF申万菱信       市值：1.22      累涨：16.67     5.21      5.92      5.54      10日：1.08                          97        累涨修正：17.75     净值区间：31      31      53      80      67      194
//        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：35.00     累涨：16.76     5.54      5.49      5.73      10日：0.96                          145       累涨修正：17.72     净值区间：27      27      50      56      56      195
//        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：35.69     累涨：16.73     5.28      5.78      5.67      10日：0.98                          152       累涨修正：17.71     净值区间：25      25      50      78      69      196
//        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.74      累涨：16.65     5.21      5.79      5.65      10日：1.02                          153       累涨修正：17.67     净值区间：28      28      53      77      64      197
//        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF基金       市值：18.07     累涨：16.59     4.30      7.23      5.06      10日：0.63      0.07      0.07      184       累涨修正：17.64     净值区间：52      44      53      71      58      198
//        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：19.82     累涨：15.83     5.69      4.37      5.77      10日：1.09      0.12      0.12      122       累涨修正：17.64     净值区间：32      32      56      80      72      199
//        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：204.75    累涨：16.83     5.52      6.62      4.69      10日：0.80                          177       累涨修正：17.63     净值区间：30      30      48      80      65      200
//        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.48      累涨：16.74     5.82      5.45      5.47      10日：0.88                          51        累涨修正：17.62     净值区间：33      50      58      82      81      201
//        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：54.65     累涨：16.67     4.30      7.41      4.96      10日：0.85                          178       累涨修正：17.52     净值区间：43      42      59      83      64      202
//        INDEX_CN_BIG.put("560510", "指数-大盘             ");//中证A500ETF           市值：65.42     累涨：16.52     4.99      5.96      5.57      10日：0.95                          109       累涨修正：17.47     净值区间：33      33      54      79      63      203
//        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：5.67      累涨：16.51     5.65      5.08      5.78      10日：0.95                          150       累涨修正：17.46     净值区间：25      25      50      78      71      204
//        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：2.05      累涨：16.38     5.66      5.24      5.48      10日：1.06                          50        累涨修正：17.44     净值区间：24      24      50      80      71      205
//        INDEX_CN_BIG.put("563500", "指数-大盘             ");//中证A500ETF华宝       市值：13.73     累涨：16.83     5.27      6.24      5.32      10日：0.60                          110       累涨修正：17.43     净值区间：33      33      45      77      64      206
//        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1680.75   累涨：16.48     5.75      5.04      5.69      10日：0.94                          158       累涨修正：17.42     净值区间：26      26      50      78      62      207
//        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：37.48     累涨：16.43     5.99      4.70      5.74      10日：0.97                          135       累涨修正：17.4      净值区间：27      27      51      79      71      208
//        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：21.58     累涨：16.37     5.36      5.38      5.63      10日：1.00                          160       累涨修正：17.37     净值区间：28      28      50      78      70      209
//        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.09      累涨：16.33     5.78      5.16      5.39      10日：1.04                          161       累涨修正：17.37     净值区间：26      18      51      73      60      210
//        INDEX_CN_BIG.put("512020", "指数-大盘             ");//A500ETF指数           市值：37.09     累涨：16.45     4.53      6.15      5.77      10日：0.90                          108       累涨修正：17.35     净值区间：36      36      53      80      66      211
//        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：16.12     累涨：15.64     5.43      4.79      5.42      10日：1.69                          126       累涨修正：17.33     净值区间：21      21      40      68      62      212
//        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3780.19   累涨：16.37     5.82      4.97      5.58      10日：0.90                          168       累涨修正：17.27     净值区间：28      28      51      78      70      213
//        INDEX_CN_BIG.put("159661", "指数-大盘             ");//中证A100指数ETF       市值：0.29      累涨：16.09     6.37      3.96      5.76      10日：1.05                          121       累涨修正：17.14     净值区间：22      22      47      75      60      214
//        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：28.06     累涨：16.28     3.91      7.79      4.58      10日：0.85                          180       累涨修正：17.13     净值区间：46      46      57      85      66      215
//        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：4.83      累涨：16.19     4.88      6.05      5.26      10日：0.93                          183       累涨修正：17.12     净值区间：31      30      52      77      66      216
//        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.55      累涨：15.98     6.55      4.14      5.29      10日：0.84      0.09                174       累涨修正：17        净值区间：38      38      45      77      77      217
//        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：9.12      累涨：16.03     5.20      5.10      5.73      10日：0.95                          166       累涨修正：16.98     净值区间：28      28      52      78      68      218
//        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.64      累涨：16.09     5.25      5.22      5.62      10日：0.88                          176       累涨修正：16.97     净值区间：28      28      52      79      66      219
//        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.10      累涨：15.66     5.32      4.67      5.67      10日：1.17                          154       累涨修正：16.83     净值区间：57      57      64      72      61      220
//        INDEX_CN_BIG.put("512080", "指数-大盘             ");//A500ETF中金           市值：14.25     累涨：15.90     4.92      5.72      5.26      10日：0.88                          112       累涨修正：16.78     净值区间：31      11      30      60      60      221
//        INDEX_CN_BIG.put("159361", "指数-大盘             ");//A500ETF易方达         市值：143.03    累涨：15.94     5.20      5.28      5.46      10日：0.83                          111       累涨修正：16.77     净值区间：36      36      54      80      66      222
//        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.30      累涨：15.92     3.97      6.76      5.19      10日：0.71                          188       累涨修正：16.63     净值区间：56      40      55      75      54      223
//        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：24.99     累涨：14.47     3.96      6.37      4.14      10日：1.47      0.10      0.10      169       累涨修正：16.54     净值区间：36      36      59      82      82      224
//        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.39      累涨：15.63     6.00      4.48      5.15      10日：0.85                          182       累涨修正：16.48     净值区间：28      26      23      47      47      225
//        INDEX_CN_BIG.put("159209", "指数-大盘             ");//中证红利质量ETF       市值：2.17      累涨：                    6.74      5.88      10日：1.80      0.30      0.30      77        累涨修正：16.22     净值区间：75      82      92      96              226
//        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：3.06      累涨：14.58     4.40      5.41      4.77      10日：0.70      0.09      0.09      189       累涨修正：15.82     净值区间：63      57      73      90      87      227
//        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：1.55      累涨：14.92     5.02      5.27      4.63      10日：0.68                          190       累涨修正：15.6      净值区间：36      36      51      58      58      228
//        INDEX_CN_BIG.put("159207", "指数-大盘             ");//高股息ETF             市值：3.22      累涨：                              6.35      10日：2.90      0.96      0.96      71        累涨修正：15.01     净值区间：76      82      91                      229
//        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：0.84      累涨：                    8.22      4.38      10日：0.49                          185       累涨修正：13.09     净值区间：57      48      64      85              230
//        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：43.04     累涨：118.22    107.15    5.51      5.56      10日：0.96      0.15                101       累涨修正：12.33     净值区间：21      21      47      76      95      231
//        INDEX_CN_BIG.put("159391", "指数-大盘             ");//大盘价值ETF           市值：0.24      累涨：                              6.94      10日：1.33      0.48      0.29      103       累涨修正：10.39     净值区间：14      21      41                      232
//        INDEX_CN_BIG.put("560820", "指数-大盘             ");//中证A50ETF新华        市值：0.25      累涨：                              6.70      10日：1.72      0.19      0.19      95        累涨修正：9.56      净值区间：17      20      73                      233
//        INDEX_CN_BIG.put("159216", "指数-大盘             ");//深证100ETF大成        市值：0.25      累涨：                              7.23      10日：1.58                          108       累涨修正：8.81      净值区间：31      31      58                      234
//        INDEX_CN_BIG.put("159212", "指数-大盘             ");//深100ETF南方          市值：1.14      累涨：                              7.34      10日：1.43                          117       累涨修正：8.77      净值区间：27      27      52                      235
//        INDEX_CN_BIG.put("159211", "指数-大盘             ");//深证100ETF富国        市值：0.18      累涨：                              7.15      10日：1.52                          113       累涨修正：8.67      净值区间：37      37      50                      236
//        INDEX_CN_BIG.put("512250", "指数-大盘             ");//中证A50ETF招商        市值：0.15      累涨：                              6.36      10日：1.31                          147       累涨修正：7.67      净值区间：26      26      53                      237
//        INDEX_CN_BIG.put("512240", "指数-大盘             ");//A50ETF龙头            市值：0.53      累涨：                              6.14      10日：1.49                          146       累涨修正：7.63      净值区间：17      17      56                      238
//        INDEX_CN_BIG.put("159390", "指数-大盘             ");//A50指数ETF            市值：2.70      累涨：                              5.95      10日：1.31                          162       累涨修正：7.26      净值区间：21      21      45                      239
//        INDEX_CN_BIG.put("563650", "指数-大盘             ");//中证A500龙头ETF       市值：2.16      累涨：                              5.71      10日：1.11                          181       累涨修正：6.82      净值区间：25      25      53                      240
//        INDEX_CN_BIG.put("563660", "指数-大盘             ");//A500ETF银河           市值：2.83      累涨：                              5.83      10日：0.91                          186       累涨修正：6.74      净值区间：29      29      53                      241
//        INDEX_CN_BIG.put("510320", "指数-大盘             ");//沪深300ETF中金        市值：4.70      累涨：                              5.59      10日：1.06                          187       累涨修正：6.65      净值区间：27      27      51                      242
//        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：2.70      累涨：                    294.08    5.62      10日：0.95                          120       累涨修正：6.57      净值区间：31      31      51      76              243
//        INDEX_CN_BIG.put("159215", "指数-大盘             ");//中证A500ETF指数基金   市值：20.37     累涨：                              5.38      10日：0.80                          191       累涨修正：6.18      净值区间：32      32      53                      244
//        INDEX_CN_BIG.put("563700", "指数-大盘             ");//红利价值ETF           市值：0.77      累涨：                                        10日：1.87      0.49      0.20      163       累涨修正：3.65      净值区间：42      48      76                      245
//        INDEX_CN_BIG.put("159226", "指数-大盘             ");//中证A500增强ETF       市值：5.70      累涨：                                        10日：                                        累涨修正：          净值区间：                                        246
//        INDEX_CN_BIG.put("563060", "指数-大盘             ");//央企50ETF             市值：0.72      累涨：                                        10日：          0.30      0.30                累涨修正：          净值区间：33                                      247
//        INDEX_CN_BIG.put("563550", "指数-大盘             ");//A500增强ETF摩根       市值：6.67      累涨：                                        10日：                                        累涨修正：          净值区间：43      38                              248
//        INDEX_CN_BIG.put("159219", "指数-大盘             ");//深证100ETF融通        市值：0.47      累涨：                                        10日：1.48                                    累涨修正：          净值区间：29      29                              249
//        INDEX_CN_BIG.put("563900", "指数-大盘             ");//沪深300自由现金流ETF摩根市值：1.83      累涨：                                        10日：2.05      0.10      0.10                累涨修正：          净值区间：17      29                              250
//        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：76.95     累涨：                                        10日：                                        累涨修正：          净值区间：                                        251
//        INDEX_CN_BIG.put("562080", "指数-大盘             ");//300现金流ETF          市值：1.68      累涨：                                        10日：                                        累涨修正：          净值区间：                                        252
    }

    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_NOT_USA);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_HK);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
//        INDEX.putAll(INDEX_CN_CITY);
    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金
    static {
        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：1.02      累涨：66.35     19.95     34.11     12.29     10日：8.02      1.83      0.73      2         累涨修正：80.95     净值区间：28      54      59      66      68      1
//        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：1.42      累涨：63.14     18.61     32.33     12.20     10日：8.19      1.78      0.98      3         累涨修正：78.81     净值区间：37      60      63      65      67      2
//        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金股票ETF基金       市值：0.31      累涨：62.65     20.39     29.72     12.54     10日：8.16      1.83      0.96      1         累涨修正：78.31     净值区间：28      53      74      68      69      3
//        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：6.17      累涨：63.19     18.97     31.48     12.74     10日：8.05      1.29      0.45      5         累涨修正：75.62     净值区间：35      57      61      67      69      4
//        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：42.94     累涨：62.50     19.02     30.54     12.94     10日：7.75      1.41      0.42      4         累涨修正：74.75     净值区间：31      54      62      67      69      5
//        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.47      累涨：59.40     17.99     28.82     12.59     10日：8.11      1.72      0.77      6         累涨修正：74.03     净值区间：30      55      61      67      68      6
//        JINRONG_GOLD.put("518680", "金融-黄金             ");//金ETF                 市值：25.65     累涨：41.14     6.94      25.02     9.18      10日：5.76      0.35      0.14      8         累涨修正：48.16     净值区间：19      41      41      49      58      7
//        JINRONG_GOLD.put("518600", "金融-黄金             ");//上海金ETF             市值：19.18     累涨：38.02     7.01      21.92     9.09      10日：5.78      0.24      0.14      14        累涨修正：44.84     净值区间：18      39      41      33      46      8
//        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：9.62      累涨：37.98     6.96      21.95     9.07      10日：5.72      0.28      0.11      16        累涨修正：44.7      净值区间：18      34      46      41      54      9
//        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：20.56     累涨：37.50     7.04      21.09     9.37      10日：6.05      0.23      0.11      9         累涨修正：44.45     净值区间：20      27      42      39      54      10
//        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：34.54     累涨：37.25     7.30      20.86     9.09      10日：5.75      0.27      0.12      13        累涨修正：44.02     净值区间：22      42      41      40      55      11
//        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：257.17    累涨：37.05     7.13      20.91     9.01      10日：5.70      0.33      0.15      12        累涨修正：44.01     净值区间：18      41      41      40      54      12
//        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：180.00    累涨：36.97     7.15      20.71     9.11      10日：5.77      0.34      0.14      7         累涨修正：43.98     净值区间：18      40      41      43      66      13
//        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：44.38     累涨：36.97     7.14      20.71     9.12      10日：5.75      0.28      0.14      11        累涨修正：43.84     净值区间：20      41      41      41      54      14
//        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：587.38    累涨：36.87     7.08      20.65     9.14      10日：5.77      0.32      0.12      10        累涨修正：43.76     净值区间：19      41      40      41      54      15
//        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：280.75    累涨：36.65     7.12      20.56     8.97      10日：5.67      0.32      0.16      17        累涨修正：43.6      净值区间：18      41      40      39      54      16
//        JINRONG_GOLD.put("159831", "金融-黄金             ");//上海金ETF基金         市值：6.50      累涨：37.00     7.01      21.10     8.89      10日：5.60      0.28      0.05      19        累涨修正：43.36     净值区间：21      32      40      39      54      17
//        JINRONG_GOLD.put("159830", "金融-黄金             ");//上海金ETF             市值：14.17     累涨：36.77     6.96      20.88     8.93      10日：5.70      0.28      0.07      18        累涨修正：43.31     净值区间：18      38      41      42      55      18
//        JINRONG_GOLD.put("518890", "金融-黄金             ");//中银上海金ETF         市值：19.52     累涨：36.51     7.04      20.34     9.13      10日：5.78      0.19      0.14      15        累涨修正：43.23     净值区间：17      22      38      41      54      19
//        JINRONG_GOLD.put("159834", "金融-黄金             ");//金ETF                 市值：9.81      累涨：36.45     6.99      20.65     8.81      10日：5.61      0.19      0.09      20        累涨修正：42.8      净值区间：20      39      40      40      54      20
    }
    public static Map<String, String> JINRONG_BANK = new HashMap<>();
    static {
        JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：2.30      累涨：27.50     8.95      8.24      10.31     10日：3.11      1.75      1.01      1         累涨修正：38.15     净值区间：28      40      79      87      87      1
//        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.24      累涨：27.17     7.20      10.37     9.60      10日：2.64      1.76      0.74      3         累涨修正：36.29     净值区间：24      16      59      71      71      2
//        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：15.57     累涨：27.24     6.96      10.26     10.02     10日：2.50      1.59      0.61      4         累涨修正：35.36     净值区间：25      31      77      86      86      3
//        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：42.08     累涨：26.94     7.28      9.75      9.91      10日：2.58      1.60      0.63      2         累涨修正：35.24     净值区间：23      27      76      86      86      4
//        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF基金           市值：3.83      累涨：26.23     7.22      9.30      9.71      10日：2.36      1.41      0.53      6         累涨修正：33.53     净值区间：16      21      68      80      80      5
//        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：8.05      累涨：26.48     7.35      9.68      9.45      10日：2.28      1.35      0.50      7         累涨修正：33.46     净值区间：23      27      75      85      85      6
//        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：80.41     累涨：25.73     7.50      8.55      9.68      10日：2.43      1.43      0.56      5         累涨修正：33.26     净值区间：26      31      77      86      86      7
//        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：14.77     累涨：26.05     7.43      9.00      9.62      10日：2.23      1.30      0.50      8         累涨修正：32.88     净值区间：21      23      75      85      85      8
//        JINRONG_BANK.put("512730", "金融-银行             ");//中证银行ETF           市值：0.81      累涨：25.56     7.00      9.22      9.34      10日：2.25      1.34      0.49      9         累涨修正：32.45     净值区间：23      29      76      73      73      9
//        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：4.92      累涨：25.30     7.08      8.77      9.45      10日：2.29      1.14      0.46      10        累涨修正：31.71     净值区间：25      29      76      86      86      10
    }
    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券
    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：73.67     累涨：40.47     12.98     15.21     12.28     10日：1.90      0.53      0.53      1         累涨修正：45.55     净值区间：96      96      78      90      67      1
//        JINRONG_ZHENGQUAN.put("513140", "金融-证券             ");//港股金融ETF           市值：0.79      累涨：32.84     10.32     13.29     9.23      10日：1.70      0.59      0.59      2         累涨修正：38.08     净值区间：64      70      91      96      96      2
//        JINRONG_ZHENGQUAN.put("513190", "金融-证券             ");//港股通金融ETF         市值：9.30      累涨：28.96     10.00     10.64     8.32      10日：1.66      0.33      0.33      3         累涨修正：32.6      净值区间：38      50      77      88      80      3
//        JINRONG_ZHENGQUAN.put("510650", "金融-证券             ");//金融地产ETF           市值：0.40      累涨：23.26     6.80      7.77      8.69      10日：1.39      1.00      0.36      5         累涨修正：28.09     净值区间：25      24      64      81      81      4
//        JINRONG_ZHENGQUAN.put("159931", "金融-证券             ");//金融ETF               市值：0.58      累涨：23.34     6.89      7.57      8.88      10日：2.02      0.44      0.44      9         累涨修正：28        净值区间：39      31      51      72      71      5
//        JINRONG_ZHENGQUAN.put("159940", "金融-证券             ");//金融地产ETF           市值：10.04     累涨：23.73     6.09      10.18     7.46      10日：1.03      0.60      0.43      7         累涨修正：27.68     净值区间：56      48      72      81      81      6
//        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：67.05     累涨：25.83     8.69      7.29      9.85      10日：0.52      0.13      0.13      5         累涨修正：27.13     净值区间：42      31      40      63      58      7
//        JINRONG_ZHENGQUAN.put("159933", "金融-证券             ");//国投金融地产ETF       市值：1.44      累涨：23.39     6.86      8.28      8.25      10日：1.28      0.54      0.29      8         累涨修正：26.91     净值区间：28      28      74      77      77      8
//        JINRONG_ZHENGQUAN.put("510230", "金融-证券             ");//金融ETF               市值：47.38     累涨：21.07     6.36      6.36      8.35      10日：1.40      0.88      0.44      22        累涨修正：25.99     净值区间：30      29      63      79      79      9
//        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.86      累涨：22.41     6.79      8.75      6.87      10日：1.45      0.34      0.34      12        累涨修正：25.9      净值区间：71      48      54      64      54      10
//        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.08      累涨：24.69     7.56      8.05      9.08      10日：0.36      0.12      0.12      4         累涨修正：25.77     净值区间：50      33      24      53      41      11
//        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.36      累涨：24.58     7.27      8.31      9.00      10日：0.10      0.10      0.10      11        累涨修正：25.28     净值区间：50      33      26      55      41      12
//        JINRONG_ZHENGQUAN.put("512640", "金融-证券             ");//金融地产ETF基金       市值：0.69      累涨：21.47     6.54      7.52      7.41      10日：0.96      0.57      0.35      15        累涨修正：24.97     净值区间：30      28      55      81      81      13
//        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.45      累涨：24.35     7.57      7.91      8.87      10日：0.15                          7         累涨修正：24.5      净值区间：44      29      22      52      41      14
//        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：9.76      累涨：24.19     7.64      7.89      8.66      10日：0.24                          8         累涨修正：24.43     净值区间：44      29      21      51      39      15
//        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：64.66     累涨：24.11     7.64      7.71      8.76      10日：0.19                          10        累涨修正：24.3      净值区间：48      28      21      52      39      16
//        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：285.92    累涨：24.19     7.64      7.90      8.65      10日：0.09                          14        累涨修正：24.28     净值区间：50      32      22      52      40      17
//        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：227.29    累涨：24.07     7.51      7.99      8.57      10日：0.10                          15        累涨修正：24.17     净值区间：52      33      22      52      40      18
//        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：18.43     累涨：23.91     7.20      8.01      8.70      10日：0.18                          13        累涨修正：24.09     净值区间：47      30      20      50      39      19
//        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.65      累涨：23.61     7.80      6.73      9.08      10日：0.32                          6         累涨修正：23.93     净值区间：48      33      36      60      52      20
//        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：60.92     累涨：23.82     7.33      7.87      8.62      10日：0.10                          19        累涨修正：23.92     净值区间：50      32      22      53      41      21
//        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.73      累涨：23.80     7.51      7.95      8.34      10日：0.10                          16        累涨修正：23.9      净值区间：48      31      22      52      40      22
//        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：17.35     累涨：23.60     7.23      7.73      8.64      10日：0.30                          17        累涨修正：23.9      净值区间：46      30      22      53      41      23
//        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：14.69     累涨：23.74     7.21      8.03      8.50      10日：0.09                          20        累涨修正：23.83     净值区间：46      29      26      53      43      24
//        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：3.75      累涨：23.55     7.51      7.78      8.26      10日：0.20                          18        累涨修正：23.75     净值区间：46      29      21      51      39      25
//        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：3.57      累涨：23.67     7.35      8.34      7.98      10日：                              21        累涨修正：23.67     净值区间：43      28      23      53      41      26
//        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：7.58      累涨：23.41     7.30      7.74      8.37      10日：0.09                          23        累涨修正：23.5      净值区间：48      33      22      53      41      27
//        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.20      累涨：23.09     6.99      7.36      8.74      10日：                              24        累涨修正：23.09     净值区间：54      34      24      55      42      28
//        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.45      累涨：22.09     6.38      8.23      7.48      10日：0.09                          25        累涨修正：22.18     净值区间：43      29      22      55      41      29
    }
    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();
    static {
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：6.51      累涨：30.19     6.96      17.65     5.58      10日：2.35      0.79      0.79      1         累涨修正：37.28     净值区间：91      42      22      44      40      1
//        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.66      累涨：22.18     3.79      9.83      8.56      10日：3.65      1.87      1.66      3         累涨修正：36.21     净值区间：93      93      97      98      98      2
//        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：65.33     累涨：29.07     6.73      16.46     5.88      10日：2.22      0.60      0.60      2         累涨修正：34.89     净值区间：86      34      19      45      39      3
//        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.70      累涨：23.35     3.76      11.97     7.62      10日：2.68      1.09      1.09      4         累涨修正：32.57     净值区间：86      84      93      97      97      4
//        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.69      累涨：21.11     3.35      8.65      9.11      10日：2.76      1.13      1.13      6         累涨修正：30.65     净值区间：90      87      81      89      89      5
//        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.40      累涨：23.26     6.80      7.77      8.69      10日：1.39      1.00      0.36      5         累涨修正：28.09     净值区间：25      24      64      81      81      6
//        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.04     累涨：23.73     6.09      10.18     7.46      10日：1.03      0.60      0.43      7         累涨修正：27.68     净值区间：56      48      72      81      81      7
//        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.72      累涨：26.71     7.29      16.06     3.36      10日：0.85                          13        累涨修正：27.56     净值区间：78      35      16      35      29      8
//        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.44      累涨：23.39     6.86      8.28      8.25      10日：1.28      0.54      0.29      8         累涨修正：26.91     净值区间：28      28      74      77      77      9
//        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.55      累涨：20.78     4.78      9.76      6.24      10日：2.94      0.40      0.40      9         累涨修正：26.12     净值区间：42      42      66      85      85      10
//        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：6.62      累涨：25.10     6.18      15.75     3.17      10日：0.76                          18        累涨修正：25.86     净值区间：67      33      15      32      27      11
//        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：5.37      累涨：24.35     8.17      11.80     4.38      10日：1.22                          10        累涨修正：25.57     净值区间：42      29      22      52      38      12
//        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.52      累涨：24.11     8.84      11.74     3.53      10日：0.96                          11        累涨修正：25.07     净值区间：54      39      29      46      36      13
//        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF基金       市值：0.69      累涨：21.47     6.54      7.52      7.41      10日：0.96      0.57      0.35      15        累涨修正：24.97     净值区间：30      28      55      81      81      14
//        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.52      累涨：18.79     4.50      9.07      5.22      10日：2.48      0.54      0.54      16        累涨修正：24.51     净值区间：23      35      59      83      83      15
//        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：0.54      累涨：20.05     4.55      10.11     5.39      10日：2.30      0.33      0.33      14        累涨修正：24.33     净值区间：50      43      66      86      86      16
//        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：23.51     累涨：20.89     4.56      10.89     5.44      10日：1.13      0.38      0.38      12        累涨修正：24.3      净值区间：63      41      47      79      62      17
//        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.51      累涨：23.12     7.93      11.49     3.70      10日：0.80                          17        累涨修正：23.92     净值区间：46      33      25      54      40      18
//        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：5.40      累涨：18.35     3.86      9.44      5.05      10日：0.97      0.49      0.49      19        累涨修正：22.26     净值区间：57      43      33      75      57      19
//        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.05      累涨：18.28     3.93      9.31      5.04      10日：0.76      0.33      0.33      21        累涨修正：21.02     净值区间：56      42      36      75      57      20
//        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：0.95      累涨：19.14     4.67      9.91      4.56      10日：0.60      0.10      0.10      20        累涨修正：20.34     净值区间：63      32      35      72      56      21
    }

    public static Map<String, String> JINRONG_CASH = new HashMap<>();

//    static {
//        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：15.73     累涨：3.41                          3.41      3.31      2.10      1
//        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：23.23     累涨：3.69                          3.69      2.89      1.19      2
//        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：31.68     累涨：0.59      0.02      0.35      0.23      0.14      0.13      3
//        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：0.36      0.10      0.12      0.14      0.10      0.07      4
//        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：611.01    累涨：0.42      0.14      0.17      0.11      0.06      0.02      5
//        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：12.90     累涨：0.19      0.05      0.09      0.05      0.04      0.01      6
//        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.54      累涨：0.15      0.03      0.07      0.05      0.03      0.02      7
//        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：683.98    累涨：0.19      0.03      0.11      0.05      0.02      0.01      8
//        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.14      累涨：16.28     0.26      15.95     0.07      0.02      0.01      9
//        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.44      累涨：16.24     0.06      16.18     0.04      0.02      0.01      10
//        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.59      累涨：0.11      0.03      0.05      0.03      0.02      0.01      11
//        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：5.97      累涨：0.16      0.06      0.07      0.03      0.02      0.01      12
//        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.54      累涨：10.52     0.04      9.90      0.58      0.01                13
//        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.16      累涨：7.74      0.25      7.45      0.04      0.01                14
//        JINRONG_CASH.put("511670", "金融-现金             ");//华泰天天金ETF         市值：0.17      累涨：18.67     0.02      18.58     0.07      0.01                15
//        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.28      累涨：3.49      0.06      3.39      0.04      0.01                16
//        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.30      累涨：10.32     0.14      10.15     0.03      0.01                17
//        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：7.58      累涨：0.20      0.07      0.10      0.03      0.01                18
//        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.23      累涨：9.32      0.04      9.25      0.03      0.01                19
//        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：109.28    累涨：0.14      0.05      0.06      0.03      0.01                20
//        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.21      累涨：13.09     0.08      12.96     0.05      0.01                21
//        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：1.68      累涨：0.23      0.05      0.15      0.04      0.01                22
//        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.37      累涨：0.10      0.04      0.05      0.01      0.01                23
//        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.43      累涨：0.10      0.05      0.04      0.01      0.01                24
//        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.35      累涨：17.18     0.06      17.10     0.02                          25
//        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.60      累涨：                                                            26
//        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.82      累涨：                                                            27
//        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：9.90      累涨：                                                            28
//        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.26      累涨：25.15     0.07      25.07     0.01                          29
//        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.94      累涨：0.09      0.03      0.06                                    30
//        JINRONG_CASH.put("562080", "金融-现金             ");//N300现金流ETF
//        JINRONG_CASH.put("159225", "金融-现金             ");//现金流ETF基金         市值：3.99      累涨：                                                            1
//        JINRONG_CASH.put("159222", "金融-现金             ");//自由现金流ETF易方达   市值：10.47     累涨：                                                            2
//    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();

    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
    }

    /**
     * 资源
     */
    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();//资源-石油

    static {
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：6.36      累涨：50.03     11.56     24.26     14.21     10日：2.68      2.13      1.68      1         累涨修正：63.69     净值区间：92      55      71      69      49      1
//        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：8.53      累涨：47.90     9.51      24.39     14.00     10日：2.67      2.10      1.75      2         累涨修正：61.77     净值区间：88      56      71      69      63      2
//        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.22      累涨：23.99     7.20      9.74      7.05      10日：2.66      1.67      1.67      5         累涨修正：36.67     净值区间：83      86      93      80      66      3
//        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：0.56      累涨：22.33     7.54      6.97      7.82      10日：3.01      1.72      1.72      3         累涨修正：35.66     净值区间：22      22      36      62      62      4
//        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.24      累涨：23.13     7.46      8.60      7.07      10日：2.78      1.67      1.45      4         累涨修正：35.05     净值区间：19      20      32      52      52      5
//        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：0.72      累涨：22.38     6.20      9.07      7.11      10日：2.71      1.35      1.35      6         累涨修正：33.19     净值区间：94      94      95      73      60      6
//        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：0.60      累涨：21.45     6.61      8.29      6.55      10日：2.42      1.21      1.21      7         累涨修正：31.13     净值区间：82      82      97      78      71      7
//        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：1.00      累涨：20.92     5.80      8.45      6.67      10日：2.10      0.90      0.90      8         累涨修正：28.42     净值区间：53      53      73      69      61      8
//        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.12      累涨：20.25     7.01      6.80      6.44      10日：2.24      0.96      0.96      9         累涨修正：28.25     净值区间：100     100     88      78      73      9
//        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.31      累涨：17.42     5.11      7.43      4.88      10日：0.75                          10        累涨修正：18.17     净值区间：43      35      36      62      47      10
    }

    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();

    static {
        ZIYUAN_NONGYE.put("159587", "资源-农业             ");//粮食50ETF             市值：0.55      累涨：31.91     6.05      17.42     8.44      10日：3.89      1.68      1.68      1         累涨修正：45.88     净值区间：59      49      85      37      37      1
//        ZIYUAN_NONGYE.put("159616", "资源-农业             ");//农牧ETF               市值：0.59      累涨：29.08     9.47      13.60     6.01      10日：3.19      1.94      1.94      2         累涨修正：43.91     净值区间：58      65      72      52      52      2
//        ZIYUAN_NONGYE.put("159698", "资源-农业             ");//粮食ETF               市值：3.62      累涨：30.43     5.26      17.50     7.67      10日：3.54      1.37      1.37      3         累涨修正：42.19     净值区间：56      48      65      23      23      3
//        ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.29      累涨：32.01     9.56      17.16     5.29      10日：2.87      0.80      0.80      5         累涨修正：39.68     净值区间：42      25      42      49      50      4
//        ZIYUAN_NONGYE.put("159867", "资源-农业             ");//畜牧ETF               市值：5.70      累涨：29.98     9.12      15.50     5.36      10日：3.00      1.00      1.00      4         累涨修正：38.98     净值区间：50      33      50      44      51      5
//        ZIYUAN_NONGYE.put("516670", "资源-农业             ");//畜牧养殖ETF           市值：6.30      累涨：30.47     8.94      16.43     5.10      10日：2.92      0.77      0.77      7         累涨修正：38.01     净值区间：50      32      50      42      47      6
//        ZIYUAN_NONGYE.put("159827", "资源-农业             ");//农业50ETF             市值：1.01      累涨：28.01     9.18      14.08     4.75      10日：2.30      0.95      0.95      8         累涨修正：36.01     净值区间：69      59      63      51      53      7
//        ZIYUAN_NONGYE.put("159865", "资源-农业             ");//养殖ETF               市值：34.97     累涨：29.35     9.10      14.64     5.61      10日：3.05      0.51      0.51      6         累涨修正：35.46     净值区间：55      33      48      44      51      8
//        ZIYUAN_NONGYE.put("516810", "资源-农业             ");//农业50ETF             市值：1.80      累涨：26.10     8.79      12.55     4.76      10日：2.59      1.01      1.01      9         累涨修正：34.75     净值区间：83      69      71      52      54      9
//        ZIYUAN_NONGYE.put("159825", "资源-农业             ");//农业ETF               市值：20.66     累涨：27.48     9.08      13.57     4.83      10日：2.19      0.73      0.73      11        累涨修正：34.05     净值区间：82      67      72      52      52      10
//        ZIYUAN_NONGYE.put("516550", "资源-农业             ");//农业ETF               市值：2.05      累涨：22.18     7.70      9.83      4.65      10日：2.93      1.22      1.22      10        累涨修正：32.43     净值区间：91      96      96      98      98      11
//        ZIYUAN_NONGYE.put("562900", "资源-农业             ");//农业ETF易方达         市值：0.72      累涨：25.96     8.38      12.80     4.78      10日：2.31      0.54      0.54      12        累涨修正：31.51     净值区间：42      28      46      27      36      12
    }

    public static Map<String, String> ZIYUAN_XIYOU = new HashMap<>();

    static {
//        ZIYUAN_XIYOU.put("159652", "资源-稀有             ");//有色50ETF             市值：2.52      累涨：36.33     13.92     14.49     7.92      10日：3.17      0.22                1         累涨修正：39.94     净值区间：27      26      42      75      61      1
//        ZIYUAN_XIYOU.put("159876", "资源-稀有             ");//有色龙头ETF           市值：0.64      累涨：34.70     13.33     13.48     7.89      10日：3.06      0.54      0.27      2         累涨修正：39.92     净值区间：24      23      41      75      61      2
        ZIYUAN_XIYOU.put("516780", "资源-稀有             ");//稀土ETF               市值：9.02      累涨：32.43     11.76     9.37      11.30     10日：1.71      0.96      0.96      5         累涨修正：39.9      净值区间：70      33      56      71      55      3
//        ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：18.05     累涨：34.31     12.56     10.93     10.82     10日：1.01      0.65      0.65      6         累涨修正：39.22     净值区间：70      35      55      71      53      4
//        ZIYUAN_XIYOU.put("512400", "资源-稀有             ");//有色金属ETF           市值：44.54     累涨：34.92     13.64     13.94     7.34      10日：2.65      0.09                8         累涨修正：37.75     净值区间：33      33      46      78      63      5
//        ZIYUAN_XIYOU.put("516650", "资源-稀有             ");//有色金属ETF基金       市值：1.11      累涨：33.54     13.58     12.67     7.29      10日：2.81      0.29      0.19      4         累涨修正：37.69     净值区间：31      29      43      76      63      6
//        ZIYUAN_XIYOU.put("159880", "资源-稀有             ");//有色ETF基金           市值：0.89      累涨：32.91     13.34     12.11     7.46      10日：3.20      0.19      0.19      7         累涨修正：37.25     净值区间：28      24      40      75      62      7
//        ZIYUAN_XIYOU.put("159871", "资源-稀有             ");//有色金属ETF           市值：0.80      累涨：33.11     13.51     12.55     7.05      10日：2.76      0.27      0.18      9         累涨修正：37.13     净值区间：24      24      40      75      62      8
//        ZIYUAN_XIYOU.put("159881", "资源-稀有             ");//有色60ETF             市值：0.50      累涨：32.96     13.30     12.08     7.58      10日：2.99      0.38                3         累涨修正：36.71     净值区间：29      27      46      74      62      9
//        ZIYUAN_XIYOU.put("560860", "资源-稀有             ");//工业有色ETF           市值：3.86      累涨：31.13     12.89     10.85     7.39      10日：2.07      0.49      0.49      10        累涨修正：36.14     净值区间：45      34      55      64      51      10
//        ZIYUAN_XIYOU.put("159715", "资源-稀有             ");//稀土ETF易方达         市值：1.95      累涨：33.09     11.56     10.39     11.14     10日：0.98      0.28      0.28      12        累涨修正：35.75     净值区间：67      32      54      71      56      11
//        ZIYUAN_XIYOU.put("159713", "资源-稀有             ");//稀土ETF               市值：3.28      累涨：30.63     11.77     8.04      10.82     10日：1.15      0.52      0.52      11        累涨修正：34.9      净值区间：67      33      55      71      56      12
//        ZIYUAN_XIYOU.put("159608", "资源-稀有             ");//稀有金属ETF           市值：2.12      累涨：28.75     11.74     8.54      8.47      10日：1.22      0.35      0.35      13        累涨修正：32.07     净值区间：42      35      50      71      49      13
//        ZIYUAN_XIYOU.put("159671", "资源-稀有             ");//稀有金属ETF基金       市值：4.92      累涨：30.44     12.16     10.26     8.02      10日：0.72      0.14      0.14      14        累涨修正：32        净值区间：36      30      47      70      47      14
//        ZIYUAN_XIYOU.put("561800", "资源-稀有             ");//稀有金属ETF基金       市值：0.88      累涨：30.67     13.12     9.79      7.76      10日：0.56                          16        累涨修正：31.23     净值区间：35      26      43      66      45      15
//        ZIYUAN_XIYOU.put("562800", "资源-稀有             ");//稀有金属ETF           市值：8.68      累涨：28.77     11.52     8.96      8.29      10日：1.20      0.20      0.20      15        累涨修正：31.17     净值区间：38      30      48      69      46      16
//        ZIYUAN_XIYOU.put("159980", "资源-稀有             ");//有色ETF               市值：8.15      累涨：20.75     7.69      9.27      3.79      10日：1.08      0.24      0.18      17        累涨修正：23.03     净值区间：47      32      45      65      56      17
    }

    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();

    static {
        ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.16      累涨：36.33     13.72     14.83     7.78      10日：3.14      0.47      0.19      1         累涨修正：41.17     净值区间：25      25      25      63      55      1
//        ZIYUAN_COMMON.put("561330", "资源-通用             ");//矿业ETF               市值：0.78      累涨：34.37     13.24     13.65     7.48      10日：3.37      0.29                2         累涨修正：38.32     净值区间：33      27      37      77      64      2
//        ZIYUAN_COMMON.put("510410", "资源-通用             ");//资源ETF               市值：3.40      累涨：31.03     10.31     13.60     7.12      10日：2.92      0.50      0.50      3         累涨修正：36.95     净值区间：44      40      63      86      75      3
//        ZIYUAN_COMMON.put("588010", "资源-通用             ");//科创新材料ETF         市值：2.63      累涨：30.24     6.44      15.49     8.31      10日：1.20      0.69      0.69      11        累涨修正：35.58     净值区间：93      54      38      78      63      4
//        ZIYUAN_COMMON.put("510170", "资源-通用             ");//大宗商品ETF           市值：1.51      累涨：28.79     9.70      12.37     6.72      10日：2.18      0.46      0.46      5         累涨修正：33.73     净值区间：38      36      62      83      65      5
//        ZIYUAN_COMMON.put("515220", "资源-通用             ");//煤炭ETF               市值：37.71     累涨：26.59     10.82     8.72      7.05      10日：3.24      0.61      0.61      4         累涨修正：33.49     净值区间：44      42      61      63      51      6
//        ZIYUAN_COMMON.put("159945", "资源-通用             ");//能源ETF基金           市值：0.27      累涨：23.73     7.49      9.95      6.29      10日：2.93      1.07      1.07      6         累涨修正：33.08     净值区间：58      58      78      76      71      7
//        ZIYUAN_COMMON.put("159930", "资源-通用             ");//能源ETF               市值：2.52      累涨：23.73     7.59      9.75      6.39      10日：2.89      1.04      1.04      7         累涨修正：32.86     净值区间：50      56      76      88      80      8
//        ZIYUAN_COMMON.put("588160", "资源-通用             ");//科创材料ETF           市值：1.75      累涨：29.45     6.35      15.42     7.68      10日：1.17      0.34      0.34      15        累涨修正：32.66     净值区间：69      50      31      78      63      9
//        ZIYUAN_COMMON.put("159985", "资源-通用             ");//豆粕ETF               市值：26.84     累涨：22.29     7.61      11.43     3.25      10日：2.47      0.73      0.73      9         累涨修正：29.14     净值区间：39      58      58      17      17      10
//        ZIYUAN_COMMON.put("516480", "资源-通用             ");//新材料ETF基金         市值：0.12      累涨：26.68     9.23      10.29     7.16      10日：1.69      0.34                8         累涨修正：29.05     净值区间：28      24      37      44      35      11
//        ZIYUAN_COMMON.put("159981", "资源-通用             ");//能源化工ETF           市值：4.30      累涨：24.59     5.03      9.46      10.10     10日：1.39      0.39      0.39      12        累涨修正：28.32     净值区间：88      43      50      52      41      12
//        ZIYUAN_COMMON.put("562010", "资源-通用             ");//绿色能源ETF           市值：0.14      累涨：24.16     7.32      8.22      8.62      10日：2.90                          10        累涨修正：27.06     净值区间：10      9       32      62      51      13
//        ZIYUAN_COMMON.put("159944", "资源-通用             ");//材料ETF               市值：0.24      累涨：24.26     8.82      9.61      5.83      10日：1.50                          11        累涨修正：25.76     净值区间：25      21      30      64      53      14
//        ZIYUAN_COMMON.put("515210", "资源-通用             ");//钢铁ETF               市值：20.28     累涨：24.17     7.66      10.66     5.85      10日：1.06      0.08      0.08      13        累涨修正：25.71     净值区间：27      23      20      63      50      15
//        ZIYUAN_COMMON.put("562850", "资源-通用             ");//央企能源ETF           市值：1.02      累涨：18.23     4.75      7.69      5.79      10日：2.64      0.66      0.66      18        累涨修正：24.83     净值区间：28      26      61      86      86      16
//        ZIYUAN_COMMON.put("159703", "资源-通用             ");//新材料ETF             市值：0.55      累涨：22.47     6.82      8.67      6.98      10日：1.55                          14        累涨修正：24.02     净值区间：35      28      29      46      38      17
//        ZIYUAN_COMMON.put("159761", "资源-通用             ");//新材料50ETF           市值：1.36      累涨：21.93     6.65      8.17      7.11      10日：1.60                          15        累涨修正：23.53     净值区间：24      19      27      52      39      18
//        ZIYUAN_COMMON.put("159763", "资源-通用             ");//新材料ETF基金         市值：0.52      累涨：22.44     6.88      9.02      6.54      10日：1.08                          17        累涨修正：23.52     净值区间：25      20      24      50      36      19
//        ZIYUAN_COMMON.put("516710", "资源-通用             ");//新材料50ETF           市值：0.40      累涨：21.83     7.13      7.90      6.80      10日：1.47                          16        累涨修正：23.3      净值区间：31      25      36      52      39      20
//        ZIYUAN_COMMON.put("561790", "资源-通用             ");//央企现代能源ETF       市值：0.48      累涨：18.79     4.74      9.40      4.65      10日：1.69      0.38      0.38      21        累涨修正：22.76     净值区间：25      18      59      79      78      21
//        ZIYUAN_COMMON.put("561260", "资源-通用             ");//能源ETF               市值：0.45      累涨：16.55     5.33      5.98      5.24      10日：1.98      0.66      0.66      23        累涨修正：22.49     净值区间：25      31      65      83      82      22
//        ZIYUAN_COMMON.put("516020", "资源-通用             ");//化工ETF               市值：4.40      累涨：21.59     6.70      9.47      5.42      10日：0.67                          19        累涨修正：22.26     净值区间：53      42      41      54      43      23
//        ZIYUAN_COMMON.put("516120", "资源-通用             ");//化工50ETF             市值：1.82      累涨：21.09     6.45      9.31      5.33      10日：0.66                          25        累涨修正：21.75     净值区间：44      37      32      58      46      24
//        ZIYUAN_COMMON.put("516890", "资源-通用             ");//新材料ETF指数基金     市值：0.23      累涨：20.55     6.97      7.30      6.28      10日：1.20                          20        累涨修正：21.75     净值区间：25      20      24      53      37      25
//        ZIYUAN_COMMON.put("159870", "资源-通用             ");//化工ETF               市值：14.00     累涨：20.82     6.21      8.88      5.73      10日：0.71                          24        累涨修正：21.53     净值区间：50      41      38      54      42      26
//        ZIYUAN_COMMON.put("516360", "资源-通用             ");//新材料ETF             市值：0.54      累涨：20.03     6.54      6.92      6.57      10日：1.20                          22        累涨修正：21.23     净值区间：36      29      31      55      32      27
//        ZIYUAN_COMMON.put("516220", "资源-通用             ");//化工龙头ETF           市值：1.13      累涨：20.53     6.41      8.43      5.69      10日：0.64                          26        累涨修正：21.17     净值区间：50      42      41      54      42      28
//        ZIYUAN_COMMON.put("516570", "资源-通用             ");//化工行业ETF           市值：0.62      累涨：18.46     5.81      7.85      4.80      10日：0.70                          27        累涨修正：19.16     净值区间：31      22      23      55      48      29
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();

    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_NONGYE);
        ZIYUAN.putAll(ZIYUAN_XIYOU);
        ZIYUAN.putAll(ZIYUAN_COMMON);
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI = new HashMap<>();
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用

    static {
//        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.56      累涨：25.38     4.25      10.42     10.71     10日：3.45      1.63      1.63      2         累涨修正：38.61     净值区间：85      87      75      86      86      1
//        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.72      累涨：23.82     4.56      9.09      10.17     10日：3.57      1.68      1.68      3         累涨修正：37.47     净值区间：100     100     92      94      94      2
//        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.36      累涨：29.43     13.58     10.14     5.71      10日：2.02      0.90      0.90      12        累涨修正：36.85     净值区间：94      80      54      81      56      3
//        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：4.42      累涨：25.99     11.50     9.94      4.55      10日：1.96      1.14      1.14      4         累涨修正：34.79     净值区间：53      43      42      76      59      4
//        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.05      累涨：22.92     6.49      9.93      6.50      10日：3.89      1.21      1.21      5         累涨修正：34.07     净值区间：94      83      91      95      96      5
//        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.34      累涨：29.89     10.80     10.82     8.27      10日：3.18      0.41                1         累涨修正：33.89     净值区间：14      14      49      77      69      6
//        XIAOFEI_COMMON.put("561120", "消费-通用             ");//家电ETF               市值：1.02      累涨：26.12     9.31      8.64      8.17      10日：2.15      0.17      0.17      7         累涨修正：29.29     净值区间：24      24      59      71      64      7
//        XIAOFEI_COMMON.put("159996", "消费-通用             ");//家电ETF               市值：13.08     累涨：27.10     9.78      8.83      8.49      10日：2.14                          6         累涨修正：29.24     净值区间：27      27      63      71      60      8
//        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.19      累涨：24.83     8.87      8.46      7.50      10日：3.01      0.43                8         累涨修正：28.7      净值区间：16      16      50      75      68      9
//        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：23.19     累涨：22.46     8.52      8.40      5.54      10日：1.86      0.68      0.68      9         累涨修正：28.4      净值区间：31      31      62      85      80      10
//        XIAOFEI_COMMON.put("159730", "消费-通用             ");//龙头家电ETF           市值：0.37      累涨：24.26     8.98      7.30      7.98      10日：2.31      0.30      0.30      11        累涨修正：28.37     净值区间：19      19      60      65      61      11
//        XIAOFEI_COMMON.put("560880", "消费-通用             ");//家电ETF龙头           市值：4.16      累涨：25.53     8.79      8.51      8.23      10日：1.98                          10        累涨修正：27.51     净值区间：30      30      62      72      65      12
//        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：0.81      累涨：21.50     9.02      7.01      5.47      10日：1.78      0.63      0.63      12        累涨修正：27.06     净值区间：26      35      60      84      73      13
//        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.34      累涨：21.01     8.24      7.19      5.58      10日：1.81      0.76      0.67      14        累涨修正：27.02     净值区间：32      32      59      84      71      14
//        XIAOFEI_COMMON.put("159328", "消费-通用             ");//家电ETF易方达         市值：1.19      累涨：23.58     9.11      6.98      7.49      10日：1.81      0.20      0.20      17        累涨修正：26.59     净值区间：26      26      64      67      61      15
//        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：136.44    累涨：22.04     9.78      8.61      3.65      10日：1.46      0.49      0.49      15        累涨修正：26.44     净值区间：47      42      33      65      55      16
//        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.76      累涨：21.89     10.55     7.47      3.87      10日：1.42      0.52      0.52      16        累涨修正：26.43     净值区间：50      41      33      65      55      17
//        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.78      累涨：21.84     9.80      8.30      3.74      10日：1.29      0.52      0.52      19        累涨修正：26.25     净值区间：43      38      25      63      50      18
//        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：4.92      累涨：21.28     10.05     7.35      3.88      10日：1.45      0.58      0.58      13        累涨修正：26.21     净值区间：46      40      27      63      53      19
//        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.78      累涨：24.89     7.63      10.15     7.11      10日：1.18                          41        累涨修正：26.07     净值区间：50      41      19      58      47      20
//        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.62      累涨：20.26     8.33      6.65      5.28      10日：1.75      0.62      0.62      20        累涨修正：25.73     净值区间：36      36      64      86      77      21
//        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.25      累涨：21.23     9.65      8.22      3.36      10日：1.01      0.34      0.34      21        累涨修正：24.28     净值区间：41      39      30      59      53      22
//        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：16.59     累涨：19.96     7.83      6.45      5.68      10日：2.06      0.56      0.19      18        累涨修正：23.9      净值区间：38      41      68      84      74      23
//        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.00      累涨：18.87     8.47      5.49      4.91      10日：1.29      0.39      0.39      22        累涨修正：22.5      净值区间：32      32      62      84      59      24
//        XIAOFEI_COMMON.put("516600", "消费-通用             ");//消费服务ETF           市值：0.82      累涨：19.10     7.62      6.48      5.00      10日：1.32                          23        累涨修正：20.42     净值区间：54      54      71      89      70      25
    }

    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒

    static {
        XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.32      累涨：42.73     13.20     14.14     15.39     10日：7.65      5.14      2.93      1         累涨修正：72.38     净值区间：87      92      89      92      57      1
//        XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：15.27     累涨：41.68     12.32     14.09     15.27     10日：7.23      4.80      2.96      2         累涨修正：70.35     净值区间：87      92      83      92      56      2
//        XIAOFEI_MEDIA.put("159869", "消费-文娱传媒         ");//游戏ETF               市值：63.59     累涨：40.66     12.58     13.27     14.81     10日：7.18      4.95      2.94      3         累涨修正：69.5      净值区间：89      93      85      91      55      3
//        XIAOFEI_MEDIA.put("512980", "消费-文娱传媒         ");//传媒ETF               市值：25.62     累涨：36.18     12.80     11.91     11.47     10日：4.04      2.40      1.90      6         累涨修正：52.62     净值区间：100     97      56      81      56      4
//        XIAOFEI_MEDIA.put("159805", "消费-文娱传媒         ");//传媒ETF               市值：1.35      累涨：35.18     12.91     11.66     10.61     10日：4.13      2.42      1.71      4         累涨修正：50.99     净值区间：96      93      61      83      59      5
//        XIAOFEI_MEDIA.put("516190", "消费-文娱传媒         ");//文娱传媒ETF           市值：0.17      累涨：34.76     11.37     11.93     11.46     10日：4.22      2.06      1.65      7         累涨修正：49.7      净值区间：96      97      55      83      55      6
//        XIAOFEI_MEDIA.put("159855", "消费-文娱传媒         ");//影视ETF               市值：0.56      累涨：35.12     12.99     13.79     8.34      10日：3.67      1.43      1.43      5         累涨修正：47.37     净值区间：96      76      58      63      44      7
//        XIAOFEI_MEDIA.put("516620", "消费-文娱传媒         ");//影视ETF               市值：0.49      累涨：35.30     12.83     13.51     8.96      10日：3.61      1.39      1.39      8         累涨修正：47.25     净值区间：100     82      55      63      44      8
//        XIAOFEI_MEDIA.put("517770", "消费-文娱传媒         ");//游戏传媒ETF           市值：0.29      累涨：36.18     15.35     12.14     8.69      10日：2.39      1.35      1.35      9         累涨修正：46.67     净值区间：100     100     56      82      42      9
    }

    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐

    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.15      累涨：32.66     8.52      18.36     5.78      10日：3.11      1.49      1.49      1         累涨修正：44.71     净值区间：100     76      78      53      53      1
//        XIAOFEI_WINE.put("516900", "消费-吃喝玩乐         ");//食品饮料ETF基金       市值：0.74      累涨：29.12     15.09     9.37      4.66      10日：1.61      0.97      0.97      4         累涨修正：36.55     净值区间：50      33      38      64      38      2
//        XIAOFEI_WINE.put("159736", "消费-吃喝玩乐         ");//食品饮料ETF天弘       市值：48.03     累涨：24.77     10.24     9.52      5.01      10日：2.36      1.25      1.25      2         累涨修正：34.63     净值区间：71      63      58      73      56      3
//        XIAOFEI_WINE.put("159862", "消费-吃喝玩乐         ");//食品ETF               市值：0.41      累涨：26.03     10.79     10.50     4.74      10日：1.73      1.01      1.01      3         累涨修正：33.82     净值区间：71      48      36      64      52      4
//        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：108.29    累涨：24.50     12.05     8.09      4.36      10日：1.19      0.85      0.85      7         累涨修正：30.79     净值区间：53      30      20      20      12      5
//        XIAOFEI_WINE.put("515170", "消费-吃喝玩乐         ");//食品饮料ETF           市值：32.76     累涨：24.08     11.47     8.21      4.40      10日：1.36      0.85      0.85      5         累涨修正：30.54     净值区间：50      40      32      69      49      6
//        XIAOFEI_WINE.put("515710", "消费-吃喝玩乐         ");//食品ETF               市值：8.68      累涨：25.13     11.29     9.37      4.47      10日：1.28      0.64      0.64      6         累涨修正：30.25     净值区间：50      41      32      69      49      7
//        XIAOFEI_WINE.put("159843", "消费-吃喝玩乐         ");//食品饮料ETF           市值：2.73      累涨：23.90     10.87     8.85      4.18      10日：1.35      0.75      0.75      8         累涨修正：29.75     净值区间：53      42      33      69      48      8
//        XIAOFEI_WINE.put("159766", "消费-吃喝玩乐         ");//旅游ETF               市值：28.56     累涨：                                        10日：                              9         累涨修正：0         净值区间：92      71      74      52      52      9
    }

    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
//        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_MEDIA);
        XIAOFEI.putAll(XIAOFEI_WINE);
    }


    /**
     * 医疗
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗

    static {
        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：36.51     累涨：72.14     20.55     32.52     19.07     10日：14.41     4.42      3.88      1         累涨修正：110.91    净值区间：100     100     100     100     100     1
//        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：16.91     累涨：71.19     21.17     32.07     17.95     10日：13.62     3.89      3.42      3         累涨修正：106.27    净值区间：100     100     100     100     100     2
//        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：4.87      累涨：71.11     20.26     32.12     18.73     10日：14.23     3.85      3.04      2         累涨修正：105.2     净值区间：98      99      99      99      99      3
//        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：102.04    累涨：69.42     20.08     30.78     18.56     10日：14.28     3.88      3.16      4         累涨修正：104.1     净值区间：99      99      99      100     100     4
//        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：2.72      累涨：69.16     19.84     31.79     17.53     10日：13.79     3.58      2.99      5         累涨修正：102.07    净值区间：99      99      99      100     100     5
//        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：5.12      累涨：69.30     19.52     32.68     17.10     10日：12.60     3.04      2.89      6         累涨修正：99.54     净值区间：99      99      99      83      83      6
//        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：20.33     累涨：67.88     21.92     29.08     16.88     10日：12.54     3.12      2.93      7         累涨修正：98.38     净值区间：100     100     100     100     100     7
//        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：42.32     累涨：62.60     19.00     27.88     15.72     10日：11.57     3.04      2.73      8         累涨修正：91.17     净值区间：100     100     100     100     100     8
//        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.27      累涨：63.10     18.94     29.12     15.04     10日：11.01     2.65      2.65      9         累涨修正：90.01     净值区间：98      99      99      100     100     9
//        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：2.96      累涨：63.20     19.21     29.30     14.69     10日：10.80     2.59      2.37      10        累涨修正：88.66     净值区间：98      99      99      100     100     10
//        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：2.55      累涨：57.03     17.96     24.68     14.39     10日：10.10     2.91      2.77      11        累涨修正：84.03     净值区间：100     100     100     100     100     11
//        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：28.41     累涨：57.69     17.52     25.42     14.75     10日：10.48     2.57      2.34      12        累涨修正：82.67     净值区间：98      99      99      100     100     12
//        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.24      累涨：57.31     17.58     25.67     14.06     10日：9.76      2.48      2.48      13        累涨修正：81.95     净值区间：100     100     100     100     100     13
//        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：90.92     累涨：58.48     17.16     26.13     15.19     10日：9.50      2.03      2.03      15        累涨修正：80.16     净值区间：100     100     100     100     100     14
//        YILIAO_COMMON.put("159316", "医疗-通用             ");//恒生创新药ETF         市值：2.06      累涨：                    30.51     16.99     10日：13.50     3.68      2.84      18        累涨修正：79.72     净值区间：100     100     100     100             15
//        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：10.34     累涨：56.66     17.28     25.88     13.50     10日：9.68      2.33      2.14      14        累涨修正：79.56     净值区间：100     100     100     100     100     16
//        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.66      累涨：58.69     17.78     27.92     12.99     10日：9.09      1.94      1.94      16        累涨修正：79.42     净值区间：99      99      99      93      93      17
//        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：0.62      累涨：55.66     17.22     25.21     13.23     10日：9.08      2.20      2.20      17        累涨修正：77.94     净值区间：100     100     100     100     100     18
//        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：2.82      累涨：45.01     12.81     19.12     13.08     10日：8.11      2.31      1.96      22        累涨修正：65.58     净值区间：93      96      97      94      94      19
//        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药ETF国泰         市值：2.54      累涨：44.66     13.94     17.59     13.13     10日：8.04      2.36      1.86      20        累涨修正：64.86     净值区间：86      91      92      96      96      20
//        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：3.86      累涨：45.14     12.70     20.00     12.44     10日：7.79      2.40      1.77      21        累涨修正：64.81     净值区间：97      98      98      96      96      21
//        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：1.99      累涨：43.81     13.13     18.59     12.09     10日：8.05      2.35      1.80      23        累涨修正：63.76     净值区间：98      99      99      97      97      22
//        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药ETF天弘         市值：4.05      累涨：40.28     12.14     16.63     11.51     10日：8.18      3.18      0.83      19        累涨修正：58.14     净值区间：100     100     100     99      99      23
//        YILIAO_COMMON.put("159217", "医疗-通用             ");//港股通创新药ETF工银   市值：41.14     累涨：                              19.49     10日：14.64     4.32      3.47      25        累涨修正：56.65     净值区间：100     100     100                     24
//        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：13.22     累涨：41.99     8.49      22.35     11.15     10日：6.56      0.94      0.94      34        累涨修正：54.19     净值区间：86      70      56      67      49      25
//        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：12.50     累涨：39.60     7.74      20.88     10.98     10日：6.66      1.01      1.01      33        累涨修正：52.32     净值区间：100     80      76      72      52      26
//        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：100.03    累涨：35.16     10.73     14.00     10.43     10日：6.17      1.59      1.46      24        累涨修正：50.35     净值区间：97      98      99      99      99      27
//        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：3.04      累涨：38.02     10.92     18.30     8.80      10日：4.99      1.18      1.18      32        累涨修正：50.09     净值区间：94      96      96      98      98      28
//        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.40      累涨：33.60     9.86      13.11     10.63     10日：6.56      1.88      1.37      26        累涨修正：49.4      净值区间：93      96      96      98      98      29
//        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：2.77      累涨：38.21     10.03     19.55     8.63      10日：4.63      0.94      0.94      35        累涨修正：48.48     净值区间：100     100     100     100     100     30
//        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：1.97      累涨：33.33     10.61     12.21     10.51     10日：6.14      1.52      1.35      27        累涨修正：47.91     净值区间：93      96      97      98      98      31
//        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：36.74     累涨：33.84     10.81     13.06     9.97      10日：6.10      1.42      1.24      28        累涨修正：47.74     净值区间：96      98      98      99      99      32
//        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.30      累涨：33.51     10.36     13.61     9.54      10日：6.10      1.47      0.98      29        累涨修正：46.47     净值区间：95      97      98      99      99      33
//        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.16      累涨：31.93     10.21     12.32     9.40      10日：6.04      1.70      1.19      31        累涨修正：46.13     净值区间：100     100     100     100     100     34
//        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：0.96      累涨：32.17     11.15     11.56     9.46      10日：5.65      1.35      1.16      30        累涨修正：45.16     净值区间：96      98      98      99      99      35
//        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.63      累涨：28.90     8.25      11.25     9.40      10日：5.90      1.47      1.47      36        累涨修正：43.62     净值区间：97      98      98      87      87      36
//        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.35      累涨：32.56     9.84      13.67     9.05      10日：4.93      1.00      0.75      37        累涨修正：42.49     净值区间：100     100     100     92      92      37
//        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.20      累涨：28.23     7.86      12.65     7.72      10日：5.65      1.40      1.40      39        累涨修正：42.28     净值区间：100     100     100     84      84      38
//        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.54      累涨：26.47     10.48     8.37      7.62      10日：4.54      1.92      1.78      38        累涨修正：41.97     净值区间：100     100     100     67      62      39
//        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.35      累涨：27.58     8.86      10.71     8.01      10日：3.86      1.28      1.28      42        累涨修正：39.12     净值区间：100     100     100     80      80      40
//        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.19      累涨：27.65     8.78      10.78     8.09      10日：4.07      1.14      0.98      48        累涨修正：37.92     净值区间：94      96      97      58      56      41
//        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：38.01     累涨：27.18     9.97      8.63      8.58      10日：3.63      1.17      1.17      46        累涨修正：37.83     净值区间：97      98      99      90      90      42
//        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.13      累涨：28.60     10.36     9.86      8.38      10日：3.97      0.86      0.86      51        累涨修正：37.73     净值区间：95      97      98      79      79      43
//        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：34.78     累涨：25.99     9.59      8.59      7.81      10日：4.30      1.42      1.14      45        累涨修正：37.69     净值区间：93      95      96      67      62      44
//        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.79      累涨：28.82     9.83      10.21     8.78      10日：4.66      0.84      0.63      44        累涨修正：37.68     净值区间：100     100     100     81      81      45
//        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.58      累涨：25.82     8.69      8.68      8.45      10日：4.09      1.24      1.24      50        累涨修正：37.35     净值区间：89      90      94      57      54      46
//        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.19      累涨：25.76     7.52      10.44     7.80      10日：3.93      1.26      1.26      54        累涨修正：37.25     净值区间：94      96      98      60      57      47
//        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：12.82     累涨：28.75     10.04     10.19     8.52      10日：3.99      0.88      0.66      47        累涨修正：37.14     净值区间：94      96      97      80      80      48
//        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.30      累涨：26.62     9.31      9.14      8.17      10日：4.70      1.20      0.80      41        累涨修正：36.92     净值区间：88      92      94      92      92      49
//        YILIAO_COMMON.put("588250", "医疗-通用             ");//科创生物医药ETF       市值：1.59      累涨：                    17.88     8.87      10日：4.77      0.79      0.79      49        累涨修正：36.26     净值区间：96      97      97      99              50
//        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.44      累涨：26.72     9.78      8.55      8.39      10日：4.50      0.94      0.71      52        累涨修正：35.94     净值区间：93      95      97      98      98      51
//        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：15.44     累涨：27.18     10.59     8.64      7.95      10日：4.07      0.87      0.58      53        累涨修正：35.31     净值区间：91      94      96      91      91      52
//        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：6.18      累涨：24.15     8.77      8.28      7.10      10日：3.68      1.22      1.22      61        累涨修正：35.15     净值区间：100     100     100     68      63      53
//        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：50.70     累涨：25.41     8.79      8.97      7.65      10日：3.70      0.96      0.96      60        累涨修正：34.87     净值区间：94      96      97      93      93      54
//        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.75      累涨：26.64     7.89      10.46     8.29      10日：2.33      1.17      0.39      59        累涨修正：32.87     净值区间：100     100     100     77      66      55
//        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：16.39     累涨：27.53     11.06     7.80      8.67      10日：2.36      0.87      0.25      56        累涨修正：32.63     净值区间：95      96      98      64      53      56
//        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.86      累涨：24.69     9.23      8.45      7.01      10日：3.42      0.72      0.72      69        累涨修正：32.43     净值区间：98      99      99      99      99      57
//        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：262.68    累涨：26.76     10.73     7.55      8.48      10日：2.49      0.93      0.31      57        累涨修正：32.35     净值区间：88      91      95      62      51      58
//        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：22.81     累涨：25.77     10.56     6.84      8.37      10日：2.51      1.00      0.50      58        累涨修正：32.28     净值区间：100     100     100     64      52      59
//        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：9.82      累涨：26.63     10.73     7.55      8.35      10日：2.40      1.07      0.27      55        累涨修正：32.25     净值区间：100     100     100     65      54      60
//        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.84      累涨：26.83     8.68      10.35     7.80      10日：1.98      0.90      0.36      65        累涨修正：32.05     净值区间：100     100     93      67      50      61
//        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：21.66     累涨：23.52     8.54      7.63      7.35      10日：3.58      0.93      0.70      71        累涨修正：31.76     净值区间：86      90      94      92      92      62
//        YILIAO_COMMON.put("159647", "医疗-通用             ");//中药ETF               市值：7.25      累涨：22.04     5.56      10.65     5.83      10日：3.41      1.24      0.83      62        累涨修正：31.25     净值区间：76      73      87      92      89      63
//        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：16.41     累涨：25.23     7.27      10.46     7.50      10日：1.90      1.06      0.42      64        累涨修正：30.93     净值区间：90      91      97      70      60      64
//        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.78      累涨：24.63     9.96      7.47      7.20      10日：3.11      0.85      0.34      70        累涨修正：30.8      净值区间：88      92      95      93      93      65
//        YILIAO_COMMON.put("560080", "医疗-通用             ");//中药ETF               市值：18.74     累涨：22.44     6.02      10.74     5.68      10日：3.15      1.05      0.76      68        累涨修正：30.73     净值区间：77      74      88      93      92      66
//        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.69      累涨：24.91     8.82      8.00      8.09      10日：2.20      0.96      0.41      67        累涨修正：30.67     净值区间：100     100     100     72      49      67
//        YILIAO_COMMON.put("562390", "医疗-通用             ");//中药50ETF             市值：0.61      累涨：21.88     5.81      10.17     5.90      10日：3.34      1.25      0.73      66        累涨修正：30.64     净值区间：78      72      87      85      85      68
//        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：6.53      累涨：23.75     9.06      8.01      6.68      10日：3.18      0.68      0.57      72        累涨修正：30.57     净值区间：84      89      93      92      92      69
//        YILIAO_COMMON.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.86      累涨：22.00     5.25      10.74     6.01      10日：3.51      1.17      0.68      63        累涨修正：30.57     净值区间：72      69      86      92      90      70
//        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.83      累涨：25.37     8.80      9.70      6.87      10日：1.61      0.72      0.36      73        累涨修正：29.86     净值区间：100     100     90      68      54      71
//        YILIAO_COMMON.put("159366", "医疗-通用             ");//港股医疗ETF           市值：0.24      累涨：                              10.13     10日：5.54      2.24      2.24      40        累涨修正：29.11     净值区间：68      71      75                      72
//        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.14      累涨：25.04     8.36      10.17     6.51      10日：1.80      0.54      0.18      75        累涨修正：28.64     净值区间：91      85      90      68      55      73
//        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.84      累涨：24.12     8.95      8.25      6.92      10日：1.49      0.64      0.21      74        累涨修正：27.73     净值区间：100     100     96      66      52      74
//        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：2.05      累涨：22.87     9.57      7.07      6.23      10日：2.53      0.36      0.18      76        累涨修正：26.84     净值区间：81      88      91      91      91      75
//        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.17      累涨：22.70     6.76      8.70      7.24      10日：1.43      0.24                77        累涨修正：24.61     净值区间：89      89      91      63      45      76
//        YILIAO_COMMON.put("159377", "医疗-通用             ");//创业板医药ETF国泰     市值：0.24      累涨：                              9.89      10日：4.50      2.44      1.17      43        累涨修正：23.95     净值区间：100     100     100                     77
//        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.53      累涨：20.79     8.49      5.39      6.91      10日：1.45      0.48      0.12      78        累涨修正：23.68     净值区间：100     100     100     72      60      78
//        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：213.39    累涨：                                        10日：                              79        累涨修正：0         净值区间：67      75      85      91      91      79
//        YILIAO_COMMON.put("588130", "医疗-通用             ");//科创医药ETF基金       市值：1.32      累涨：                                        10日：                                        累涨修正：          净值区间：                                        80
    }

    public static Map<String, String> YILIAO = new HashMap<>();//医疗

    static {
        YILIAO.putAll(YILIAO_COMMON);
    }


    /**
     * 科技
     */
    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港科技

    static {
        KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：6.16      累涨：63.76     21.44     22.90     19.42     10日：2.87      0.86                1         累涨修正：68.35     净值区间：17      16      37      41      41      1
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：139.28    累涨：50.71     18.02     21.56     11.13     10日：3.85      0.44      0.44      2         累涨修正：57.2      净值区间：42      39      45      78      58      2
//        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：219.33    累涨：48.75     18.02     19.82     10.91     10日：3.08      0.72      0.72      3         累涨修正：56.15     净值区间：58      51      48      76      53      3
//        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.21      累涨：47.64     18.97     16.91     11.76     10日：2.43      0.80      0.80      5         累涨修正：54.87     净值区间：85      67      62      83      52      4
//        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：459.06    累涨：47.17     18.86     15.92     12.39     10日：2.61      0.84      0.84      4         累涨修正：54.82     净值区间：79      63      53      78      49      5
//        KEJI_HK.put("520520", "科技-香港             ");//恒生消费ETF华泰柏瑞   市值：0.76      累涨：38.96     17.12     13.85     7.99      10日：3.12      1.93      1.93      1         累涨修正：53.66     净值区间：93      93      95      98      85      6
//        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.37      累涨：48.97     17.47     20.82     10.68     10日：3.60      0.18      0.18      7         累涨修正：53.65     净值区间：46      42      50      80      60      7
//        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：17.71     累涨：49.60     16.99     22.04     10.57     10日：3.13      0.15      0.15      18        累涨修正：53.63     净值区间：49      47      53      80      60      8
//        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：47.25     累涨：47.77     18.95     17.02     11.80     10日：2.13      0.49      0.49      6         累涨修正：52.84     净值区间：83      65      61      83      50      9
//        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：340.07    累涨：47.09     19.82     15.28     11.99     10日：1.64      0.58      0.58      8         累涨修正：52.21     净值区间：42      32      46      70      48      10
//        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：11.59     累涨：47.68     16.89     20.56     10.23     10日：3.29      0.19      0.19      20        累涨修正：52.11     净值区间：41      38      44      78      58      11
//        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：5.09      累涨：47.67     16.67     20.82     10.18     10日：3.46      0.16      0.16      21        累涨修正：52.09     净值区间：44      40      48      81      60      12
//        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：8.50      累涨：47.85     20.85     15.83     11.17     10日：1.65      0.42      0.42      14        累涨修正：52.02     净值区间：95      79      53      64      40      13
//        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：4.00      累涨：46.32     17.07     18.62     10.63     10日：3.16      0.37      0.37      13        累涨修正：51.7      净值区间：50      43      55      79      57      14
//        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：11.14     累涨：46.90     20.29     14.98     11.63     10日：1.79      0.48      0.48      9         累涨修正：51.57     净值区间：55      42      52      74      52      15
//        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：1.57      累涨：45.80     15.37     19.34     11.09     10日：2.88      0.48      0.48      12        累涨修正：51.56     净值区间：51      45      58      81      59      16
//        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：48.11     累涨：47.25     20.66     14.29     12.30     10日：1.69      0.38      0.38      15        累涨修正：51.22     净值区间：56      42      56      74      52      17
//        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：238.02    累涨：46.42     20.02     15.37     11.03     10日：1.90      0.43      0.43      10        累涨修正：50.9      净值区间：95      80      56      67      42      18
//        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：5.64      累涨：46.02     16.47     19.74     9.81      10日：3.65      0.20      0.20      22        累涨修正：50.87     净值区间：44      41      50      79      60      19
//        KEJI_HK.put("513970", "科技-香港             ");//恒生消费ETF           市值：18.09     累涨：38.35     16.74     14.19     7.42      10日：2.71      1.62      1.62      4         累涨修正：50.78     净值区间：94      94      96      99      88      20
//        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：5.65      累涨：45.70     17.09     18.49     10.12     10日：3.21      0.31      0.31      17        累涨修正：50.77     净值区间：52      46      58      81      58      21
//        KEJI_HK.put("159735", "科技-香港             ");//港股消费ETF           市值：6.49      累涨：45.17     17.04     16.27     11.86     10日：2.56      0.50      0.50      2         累涨修正：50.73     净值区间：53      42      58      82      60      22
//        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：23.40     累涨：45.27     17.31     17.36     10.60     10日：1.71      0.58      0.58      11        累涨修正：50.46     净值区间：86      66      49      72      46      23
//        KEJI_HK.put("159699", "科技-香港             ");//恒生消费ETF           市值：13.75     累涨：36.36     15.00     13.11     8.25      10日：2.98      1.69      1.69      5         累涨修正：49.48     净值区间：95      95      97      99      92      24
//        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：8.00      累涨：44.66     17.16     17.39     10.11     10日：1.87      0.44      0.44      19        累涨修正：49.17     净值区间：86      65      53      76      47      25
//        KEJI_HK.put("513070", "科技-香港             ");//港股消费ETF易方达     市值：6.37      累涨：43.48     16.29     16.31     10.88     10日：2.55      0.46      0.46      3         累涨修正：48.79     净值区间：37      37      56      81      57      26
//        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.69      累涨：44.48     18.53     13.90     12.05     10日：1.77      0.41      0.41      16        累涨修正：48.71     净值区间：46      34      48      69      48      27
//        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：44.23     累涨：44.69     17.60     17.07     10.02     10日：1.62      0.30      0.30      24        累涨修正：48.11     净值区间：87      65      48      73      46      28
//        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：10.97     累涨：44.78     17.64     16.46     10.68     10日：1.40      0.29      0.29      26        累涨修正：47.92     净值区间：92      62      33      66      39      29
//        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：272.72    累涨：43.76     16.74     16.95     10.07     10日：1.55      0.43      0.43      28        累涨修正：47.89     净值区间：86      66      54      73      46      30
//        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：48.86     累涨：45.19     17.16     17.55     10.48     10日：1.71      0.16      0.16      23        累涨修正：47.86     净值区间：85      65      50      72      10      31
//        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：253.49    累涨：44.47     17.50     17.07     9.90      10日：1.57      0.29      0.29      27        累涨修正：47.78     净值区间：86      66      50      76      47      32
//        KEJI_HK.put("513590", "科技-香港             ");//香港消费ETF           市值：3.66      累涨：44.61     16.62     17.52     10.47     10日：2.03      0.11      0.11      6         累涨修正：47.3      净值区间：48      40      61      85      61      33
//        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：113.09    累涨：44.13     17.24     16.88     10.01     10日：1.38      0.28      0.28      29        累涨修正：47.19     净值区间：87      65      52      72      46      34
//        KEJI_HK.put("513230", "科技-香港             ");//港股消费ETF           市值：3.33      累涨：42.25     16.30     16.03     9.92      10日：2.47      0.39      0.39      8         累涨修正：47.06     净值区间：45      37      56      82      58      35
//        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：19.64     累涨：43.78     16.60     17.23     9.95      10日：1.38      0.28      0.28      31        累涨修正：46.84     净值区间：83      63      52      73      47      36
//        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：73.99     累涨：42.90     16.82     16.41     9.67      10日：1.43      0.29      0.29      32        累涨修正：46.07     净值区间：81      63      54      74      47      37
//        KEJI_HK.put("517360", "科技-香港             ");//沪港深科技ETF         市值：0.35      累涨：39.94     14.53     14.99     10.42     10日：3.10      0.49      0.49      25        累涨修正：45.98     净值区间：40      43      45      76      69      38
//        KEJI_HK.put("159725", "科技-香港             ");//线上消费ETF           市值：0.52      累涨：32.85     10.78     12.09     9.98      10日：3.30      1.40      1.40      9         累涨修正：44.55     净值区间：77      59      40      77      45      39
//        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：4.23      累涨：42.47     16.43     16.26     9.78      10日：1.22      0.10      0.10      34        累涨修正：44.29     净值区间：86      66      53      72      46      40
//        KEJI_HK.put("159728", "科技-香港             ");//在线消费ETF           市值：0.58      累涨：35.16     10.60     12.71     11.85     10日：2.90      1.51      0.76      7         累涨修正：44.12     净值区间：57      47      42      66      45      41
//        KEJI_HK.put("159793", "科技-香港             ");//线上消费ETF基金       市值：0.34      累涨：37.10     15.33     13.78     7.99      10日：0.79      0.23      0.23      10        累涨修正：39.27     净值区间：68      52      28      66      43      42
//        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.82      累涨：37.65     14.69     12.15     10.81     10日：1.43                          33        累涨修正：39.08     净值区间：85      46      36      69      44      43
//        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.18      累涨：38.06     17.00     12.04     9.02      10日：0.84                          37        累涨修正：38.9      净值区间：90      62      36      70      37      44
//        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：4.34      累涨：36.40     14.78     11.85     9.77      10日：1.01      0.13      0.13      38        累涨修正：38.19     净值区间：83      63      36      69      40      45
//        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：2.86      累涨：37.17     14.78     12.40     9.99      10日：1.00                          35        累涨修正：38.17     净值区间：86      61      34      71      41      46
//        KEJI_HK.put("517550", "科技-香港             ");//消费ETF沪港深         市值：0.51      累涨：33.41     14.87     9.96      8.58      10日：2.14      0.38      0.38      11        累涨修正：37.83     净值区间：62      43      45      69      42      47
//        KEJI_HK.put("517350", "科技-香港             ");//科技ETF沪港深         市值：0.86      累涨：33.14     11.81     12.69     8.64      10日：1.61                          36        累涨修正：34.75     净值区间：65      55      53      66      47      48
//        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.51      累涨：26.12     7.99      10.23     7.90      10日：0.84                          39        累涨修正：26.96     净值区间：56      53      39      68      43      49
//        KEJI_HK.put("159202", "科技-香港             ");//恒生互联网科技ETF     市值：1.51      累涨：                              10.46     10日：1.46      0.49      0.20      30        累涨修正：13.7      净值区间：98      77      55                      50
//        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：7.04      累涨：                                        10日：                              40        累涨修正：0         净值区间：84      64      57      81      51      51
    }

    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();//科技-军工

    static {
        KEJI_JUNGONG.put("159638", "科技-军工             ");//高端装备ETF           市值：11.87     累涨：42.02     10.72     14.42     16.88     10日：2.87      1.31      1.31      1         累涨修正：52.75     净值区间：93      54      52      66      60      1
//        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：45.60     累涨：43.79     13.71     13.82     16.26     10日：2.54      0.85      0.85      2         累涨修正：51.43     净值区间：93      48      48      63      59      2
//        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：96.88     累涨：43.65     12.32     14.13     17.20     10日：2.44      0.65      0.65      3         累涨修正：49.99     净值区间：86      48      52      67      67      3
//        KEJI_JUNGONG.put("159378", "科技-军工             ");//通用航空ETF           市值：7.33      累涨：38.97     8.90      14.93     15.14     10日：2.24      1.13      0.94      4         累涨修正：47.23     净值区间：100     92      70      81      68      4
//        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：139.23    累涨：37.85     9.65      13.52     14.68     10日：2.04      0.97      0.97      5         累涨修正：45.71     净值区间：100     66      52      67      65      5
//        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：45.91     累涨：36.96     9.71      12.57     14.68     10日：2.17      0.95      0.95      6         累涨修正：44.83     净值区间：100     63      50      67      65      6
//        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.38      累涨：36.91     9.53      13.03     14.35     10日：1.75      0.92      0.92      7         累涨修正：44.18     净值区间：96      62      50      67      66      7
//        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：6.61      累涨：36.74     9.74      13.00     14.00     10日：1.75      0.64      0.64      8         累涨修正：42.33     净值区间：100     65      50      66      66      8
//        KEJI_JUNGONG.put("516320", "科技-军工             ");//高端装备ETF           市值：0.73      累涨：21.57     5.00      8.41      8.16      10日：1.11                          12        累涨修正：22.68     净值区间：36      29      33      54      47      9
//        KEJI_JUNGONG.put("562910", "科技-军工             ");//高端制造ETF           市值：0.94      累涨：21.39     5.03      8.20      8.16      10日：0.96                          11        累涨修正：22.35     净值区间：38      31      36      58      46      10
//        KEJI_JUNGONG.put("159231", "科技-军工             ");//通用航空ETF华宝       市值：0.40      累涨：                                        10日：2.30      0.97      0.97      9         累涨修正：8.12      净值区间：100     89      71                      11
//        KEJI_JUNGONG.put("159208", "科技-军工             ");//航天航空ETF           市值：0.65      累涨：                                        10日：1.59      0.40      0.30      10        累涨修正：3.59      净值区间：97      85                              12
//        KEJI_JUNGONG.put("159392", "科技-军工             ");//航空ETF               市值：2.15      累涨：                                        10日：3.18      0.93      0.93                累涨修正：          净值区间：100     94                              13
//        KEJI_JUNGONG.put("159227", "科技-军工             ");//航空航天ETF           市值：3.93      累涨：                                        10日：          0.91      0.40                累涨修正：          净值区间：97      88                              14
//        KEJI_JUNGONG.put("159241", "科技-军工             ");//航空航天ETF天弘       市值：3.50      累涨：                                        10日：                                        累涨修正：          净值区间：                                        15
    }

    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();//科技-通用

    static {
//        KEJI_GONG_YE.put("159542", "科技-通用             ");//工程机械ETF           市值：0.08      累涨：39.47     11.83     11.91     15.73     10日：10.59     0.09      0.09      5         累涨修正：50.6      净值区间：56      43      12      37      37      1
//        KEJI_GONG_YE.put("512330", "科技-通用             ");//信息科技ETF           市值：5.45      累涨：35.27     11.40     13.93     9.94      10日：1.85      1.14      1.14      1         累涨修正：43.96     净值区间：100     70      33      57      44      2
        KEJI_GONG_YE.put("159667", "科技-通用             ");//工业母机ETF           市值：3.95      累涨：40.70     13.48     14.01     13.21     10日：2.12      0.18      0.18      2         累涨修正：43.9      净值区间：58      33      59      80      65      3
        KEJI_GONG_YE.put("159663", "科技-通用             ");//机床ETF               市值：0.79      累涨：40.25     13.20     14.26     12.79     10日：1.78      0.18      0.18      3         累涨修正：43.11     净值区间：62      36      56      79      65      4
//        KEJI_GONG_YE.put("159206", "科技-通用             ");//卫星ETF               市值：1.21      累涨：                    13.36     13.71     10日：2.62      1.97      1.65      6         累涨修正：40.23     净值区间：95      95      78      87              5
//        KEJI_GONG_YE.put("159786", "科技-通用             ");//VRETF                 市值：1.20      累涨：32.88     8.38      13.90     10.60     10日：2.14      0.60      0.60      4         累涨修正：38.62     净值区间：70      58      43      61      45      6
//        KEJI_GONG_YE.put("560280", "科技-通用             ");//工程机械ETF           市值：1.29      累涨：30.84     11.12     12.94     6.78      10日：1.42      0.64      0.64      8         累涨修正：36.1      净值区间：66      62      29      62      44      7
//        KEJI_GONG_YE.put("562380", "科技-通用             ");//央企科技引领ETF       市值：2.20      累涨：29.53     7.80      10.70     11.03     10日：1.42      0.83      0.83      13        累涨修正：35.93     净值区间：100     77      49      68      49      8
//        KEJI_GONG_YE.put("563210", "科技-通用             ");//专精特新ETF           市值：0.27      累涨：29.27     7.93      14.09     7.25      10日：1.41      0.71      0.71      17        累涨修正：34.94     净值区间：96      62      31      71      52      9
//        KEJI_GONG_YE.put("159701", "科技-通用             ");//物联网ETF招商         市值：0.18      累涨：31.92     7.59      15.05     9.28      10日：1.41      0.26      0.26      16        累涨修正：34.89     净值区间：71      48      29      55      45      10
//        KEJI_GONG_YE.put("516050", "科技-通用             ");//科技龙头ETF           市值：4.15      累涨：27.53     9.93      9.45      8.15      10日：1.51      0.91      0.91      12        累涨修正：34.5      净值区间：95      86      56      73      48      11
//        KEJI_GONG_YE.put("159709", "科技-通用             ");//物联网ETF工银         市值：0.74      累涨：29.51     8.58      11.94     8.99      10日：1.49      0.58      0.58      9         累涨修正：34.48     净值区间：100     70      56      78      52      12
//        KEJI_GONG_YE.put("563050", "科技-通用             ");//央企科技50ETF         市值：2.65      累涨：29.72     7.71      10.93     11.08     10日：1.17      0.59      0.59      20        累涨修正：34.43     净值区间：95      70      47      67      47      13
//        KEJI_GONG_YE.put("560170", "科技-通用             ");//央企科技ETF           市值：14.99     累涨：29.26     7.93      10.61     10.72     10日：1.23      0.62      0.62      19        累涨修正：34.21     净值区间：82      69      47      65      45      14
//        KEJI_GONG_YE.put("159723", "科技-通用             ");//科技龙头ETF           市值：0.71      累涨：32.08     11.69     12.31     8.08      10日：1.85                          7         累涨修正：33.93     净值区间：57      46      48      67      48      15
//        KEJI_GONG_YE.put("516260", "科技-通用             ");//物联网50ETF           市值：0.97      累涨：29.30     8.02      11.35     9.93      10日：1.57      0.49      0.49      15        累涨修正：33.81     净值区间：86      56      41      63      44      16
//        KEJI_GONG_YE.put("517660", "科技-通用             ");//物联网ETF沪港深       市值：0.46      累涨：31.91     10.44     12.46     9.01      10日：1.15                          21        累涨修正：33.06     净值区间：59      45      56      68      48      17
//        KEJI_GONG_YE.put("159896", "科技-通用             ");//物联网ETF南方         市值：1.28      累涨：30.70     8.78      11.69     10.23     10日：1.55      0.13      0.13      11        累涨修正：33.03     净值区间：76      50      39      63      44      18
//        KEJI_GONG_YE.put("516330", "科技-通用             ");//物联网ETF             市值：0.14      累涨：30.36     8.69      11.65     10.02     10日：1.25      0.21      0.21      18        累涨修正：32.87     净值区间：83      53      42      62      44      19
//        KEJI_GONG_YE.put("159777", "科技-通用             ");//创科技ETF             市值：0.91      累涨：29.43     6.67      12.46     10.30     10日：1.66      0.60                10        累涨修正：32.29     净值区间：46      42      50      66      51      20
//        KEJI_GONG_YE.put("159895", "科技-通用             ");//物联网ETF易方达       市值：0.66      累涨：29.94     8.52      12.27     9.15      10日：0.84                          24        累涨修正：30.78     净值区间：77      50      37      62      33      21
//        KEJI_GONG_YE.put("515860", "科技-通用             ");//科技ETF基金           市值：1.73      累涨：28.47     9.76      10.88     7.83      10日：1.16      0.18      0.18      23        累涨修正：30.71     净值区间：96      90      68      65      51      22
//        KEJI_GONG_YE.put("516800", "科技-通用             ");//智能制造ETF           市值：1.61      累涨：27.66     9.30      11.67     6.69      10日：0.73      0.37      0.37      26        累涨修正：30.61     净值区间：62      38      19      53      35      23
//        KEJI_GONG_YE.put("516720", "科技-通用             ");//ESGETF                市值：0.23      累涨：24.24     8.51      8.44      7.29      10日：3.26      1.46                14        累涨修正：30.42     净值区间：32      27      58      80      76      24
//        KEJI_GONG_YE.put("515000", "科技-通用             ");//科技ETF               市值：31.20     累涨：26.77     9.56      9.76      7.45      10日：0.87      0.40      0.40      27        累涨修正：30.04     净值区间：79      65      45      69      43      25
//        KEJI_GONG_YE.put("159773", "科技-通用             ");//创业板科技ETF         市值：2.02      累涨：28.17     8.13      11.00     9.04      10日：0.72                          32        累涨修正：28.89     净值区间：64      61      57      68      50      26
//        KEJI_GONG_YE.put("515200", "科技-通用             ");//创新100ETF            市值：1.57      累涨：27.30     8.16      11.59     7.55      10日：1.21                          25        累涨修正：28.51     净值区间：45      33      33      59      41      27
//        KEJI_GONG_YE.put("560810", "科技-通用             ");//央企ESGETF            市值：4.92      累涨：22.80     5.69      11.48     5.63      10日：1.90      0.53      0.53      28        累涨修正：27.88     净值区间：83      71      82      46      46      28
//        KEJI_GONG_YE.put("512770", "科技-通用             ");//战略新兴ETF           市值：2.00      累涨：26.10     8.38      9.94      7.78      10日：1.15      0.08      0.08      31        累涨修正：27.73     净值区间：55      51      47      67      55      29
//        KEJI_GONG_YE.put("159621", "科技-通用             ");//MSCIESGETF            市值：0.35      累涨：20.91     6.39      6.46      8.06      10日：2.77      1.75                22        累涨修正：27.18     净值区间：39      23      51      70      70      30
//        KEJI_GONG_YE.put("159778", "科技-通用             ");//工业互联ETF           市值：0.51      累涨：26.12     7.99      10.23     7.90      10日：0.84                          39        累涨修正：26.96     净值区间：56      53      39      68      43      31
//        KEJI_GONG_YE.put("510770", "科技-通用             ");//G60创新ETF            市值：0.17      累涨：25.31     7.97      11.43     5.91      10日：1.43                          30        累涨修正：26.74     净值区间：67      61      41      74      60      32
//        KEJI_GONG_YE.put("515580", "科技-通用             ");//科技100ETF            市值：4.14      累涨：24.95     7.51      10.75     6.69      10日：0.98      0.12      0.12      35        累涨修正：26.65     净值区间：79      63      50      70      55      33
//        KEJI_GONG_YE.put("515750", "科技-通用             ");//科技50ETF             市值：6.37      累涨：25.41     7.68      10.41     7.32      10日：0.92                          36        累涨修正：26.33     净值区间：62      51      30      63      43      34
//        KEJI_GONG_YE.put("159653", "科技-通用             ");//ESG300ETF             市值：0.54      累涨：22.77     8.34      7.87      6.56      10日：1.76      0.21      0.21      29        累涨修正：25.79     净值区间：31      29      24      49      49      35
//        KEJI_GONG_YE.put("560990", "科技-通用             ");//中金科技先锋ETF       市值：0.27      累涨：22.11     7.41      8.70      6.00      10日：1.21                          38        累涨修正：23.32     净值区间：44      42      44      56      42      36
//        KEJI_GONG_YE.put("516960", "科技-通用             ");//机械ETF               市值：0.16      累涨：21.49     5.75      7.91      7.83      10日：1.80                          33        累涨修正：23.29     净值区间：21      18      27      57      42      37
//        KEJI_GONG_YE.put("159886", "科技-通用             ");//机械ETF               市值：0.53      累涨：21.52     5.97      8.24      7.31      10日：1.74                          34        累涨修正：23.26     净值区间：25      21      29      56      43      38
//        KEJI_GONG_YE.put("560650", "科技-通用             ");//核心50ETF             市值：0.10      累涨：20.69     6.89      9.58      4.22      10日：1.08      0.24      0.24      41        累涨修正：23.21     净值区间：43      56      47      80      64      39
//        KEJI_GONG_YE.put("561500", "科技-通用             ");//漂亮50ETF             市值：0.53      累涨：19.10     7.40      7.09      4.61      10日：1.53      0.31      0.31      37        累涨修正：22.49     净值区间：47      44      39      72      61      40
//        KEJI_GONG_YE.put("159807", "科技-通用             ");//科技ETF               市值：9.69      累涨：20.82     5.50      9.18      6.14      10日：0.41                          47        累涨修正：21.23     净值区间：46      40      37      65      41      41
//        KEJI_GONG_YE.put("159717", "科技-通用             ");//ESGETF                市值：0.50      累涨：19.44     6.59      6.10      6.75      10日：1.38                          40        累涨修正：20.82     净值区间：32      18      22      44      44      42
//        KEJI_GONG_YE.put("510090", "科技-通用             ");//ESGETF基金            市值：0.80      累涨：17.60     6.81      4.75      6.04      10日：1.08      0.40      0.20      43        累涨修正：20.28     净值区间：21      20      67      64      64      43
//        KEJI_GONG_YE.put("561130", "科技-通用             ");//国货ETF               市值：1.59      累涨：19.00     7.44      4.99      6.57      10日：1.14                          44        累涨修正：20.14     净值区间：27      25      49      75      63      44
//        KEJI_GONG_YE.put("510160", "科技-通用             ");//产业升级ETF           市值：2.33      累涨：18.48     4.69      7.74      6.05      10日：1.20                          46        累涨修正：19.68     净值区间：21      21      59      83      79      45
//        KEJI_GONG_YE.put("515090", "科技-通用             ");//可持续发展ETF         市值：0.07      累涨：17.46     6.08      4.80      6.58      10日：1.67                          39        累涨修正：19.13     净值区间：36      24      26      60      60      46
//        KEJI_GONG_YE.put("159791", "科技-通用             ");//300ESGETF             市值：0.31      累涨：17.11     6.06      5.20      5.85      10日：1.39                          45        累涨修正：18.5      净值区间：22      22      49      68      67      47
//        KEJI_GONG_YE.put("560180", "科技-通用             ");//沪深300ESGETF南方     市值：0.23      累涨：17.28     5.36      6.37      5.55      10日：1.00                          49        累涨修正：18.28     净值区间：24      24      50      78      69      48
//        KEJI_GONG_YE.put("561900", "科技-通用             ");//沪深300ESGETF         市值：0.42      累涨：17.04     5.74      5.59      5.71      10日：0.96                          48        累涨修正：18        净值区间：19      19      46      74      63      49
//        KEJI_GONG_YE.put("510990", "科技-通用             ");//180ESGETF             市值：0.48      累涨：16.74     5.82      5.45      5.47      10日：0.88                          51        累涨修正：17.62     净值区间：33      50      58      82      81      50
//        KEJI_GONG_YE.put("516830", "科技-通用             ");//300ESGETF             市值：2.05      累涨：16.38     5.66      5.24      5.48      10日：1.06                          50        累涨修正：17.44     净值区间：24      24      50      80      71      51
//        KEJI_GONG_YE.put("588850", "科技-通用             ");//科创机械ETF           市值：0.23      累涨：                              8.23      10日：0.97      0.49      0.49      42        累涨修正：12.14     净值区间：63      43      27                      52
//        KEJI_GONG_YE.put("159218", "科技-通用             ");//卫星产业ETF           市值：0.77      累涨：                                        10日：          1.11      1.11                累涨修正：          净值区间：96                                      53
    }

    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件

    static {
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：15.09     累涨：48.28     12.76     19.22     16.30     10日：2.96      1.99      1.99      1         累涨修正：63.18     净值区间：100     73      59      74      49      1
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：44.68     累涨：43.53     14.06     15.02     14.45     10日：1.34      1.27      1.27      4         累涨修正：52.49     净值区间：100     100     58      77      53      2
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：5.77      累涨：43.80     14.26     16.27     13.27     10日：1.49      1.06      1.06      3         累涨修正：51.65     净值区间：78      43      32      67      41      3
//        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.79      累涨：33.99     10.79     11.68     11.52     10日：2.56      2.32      2.32      15        累涨修正：50.47     净值区间：67      67      50      59      32      4
//        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.21      累涨：34.83     10.84     12.77     11.22     10日：2.54      2.09      2.09      12        累涨修正：49.91     净值区间：96      62      38      48      25      5
//        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：33.43     累涨：37.92     11.39     14.54     11.99     10日：1.66      1.66      1.66      7         累涨修正：49.54     净值区间：97      67      37      65      34      6
//        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：9.75      累涨：41.36     13.38     14.63     13.35     10日：1.30      1.13      1.13      5         累涨修正：49.44     净值区间：100     100     59      77      53      7
//        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：1.75      累涨：35.97     11.52     13.45     11.00     10日：2.17      1.85      1.85      8         累涨修正：49.24     净值区间：95      85      39      58      28      8
//        KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：2.49      累涨：                    18.46     15.79     10日：3.25      1.88      1.88      2         累涨修正：48.78     净值区间：94      73      58      74              9
//        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：31.63     累涨：43.18     15.41     17.06     10.71     10日：2.07      0.69      0.35      6         累涨修正：48.03     净值区间：64      48      25      67      10      10
//        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：6.03      累涨：36.34     11.51     12.99     11.84     10日：1.90      1.62      1.62      10        累涨修正：47.96     净值区间：100     63      34      62      33      11
//        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算ETF沪港深       市值：3.09      累涨：41.45     14.14     14.63     12.68     10日：1.19      0.74      0.74      11        累涨修正：47.08     净值区间：57      38      31      67      40      12
//        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.57      累涨：34.26     11.05     12.05     11.16     10日：2.50      1.72      1.72      20        累涨修正：47.08     净值区间：100     100     49      63      32      13
//        KEJI_RUAN_JIAN.put("159586", "科技-软件             ");//计算机ETF南方         市值：3.23      累涨：37.70     12.36     12.70     12.64     10日：1.88      1.21      1.21      9         累涨修正：46.84     净值区间：98      76      33      61      37      14
//        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：15.00     累涨：44.00     11.77     18.52     13.71     10日：0.92      0.31      0.31      25        累涨修正：46.78     净值区间：31      20      29      65      52      15
//        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：8.26      累涨：42.53     15.22     16.94     10.37     10日：1.68      0.36      0.36      14        累涨修正：46.37     净值区间：52      44      18      62      46      16
//        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：5.32      累涨：36.71     11.50     13.83     11.38     10日：1.45      1.36      1.36      16        累涨修正：46.32     净值区间：97      62      33      63      33      17
//        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：20.07     累涨：34.57     11.08     12.77     10.72     10日：2.19      1.59      1.59      19        累涨修正：46.3      净值区间：100     64      24      47      24      18
//        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.43      累涨：36.54     11.54     13.60     11.40     10日：1.63      1.35      1.35      13        累涨修正：46.27     净值区间：94      60      31      62      33      19
//        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//云计算50ETF           市值：1.30      累涨：36.90     11.42     14.14     11.34     10日：1.44      1.23      1.23      18        累涨修正：45.72     净值区间：100     60      16      43      33      20
//        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.90      累涨：40.98     12.22     14.84     13.92     10日：0.72      0.63      0.63      24        累涨修正：45.48     净值区间：99      99      48      69      54      21
//        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人50ETF           市值：5.47      累涨：42.82     11.52     17.39     13.91     10日：1.02      0.26      0.26      26        累涨修正：45.4      净值区间：35      23      30      66      51      22
//        KEJI_RUAN_JIAN.put("159998", "科技-软件             ");//计算机ETF             市值：28.74     累涨：32.58     11.10     10.77     10.71     10日：2.12      1.77      1.77      28        累涨修正：45.32     净值区间：88      72      33      57      28      23
//        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.77      累涨：41.19     12.37     16.58     12.24     10日：1.01      0.37      0.37      22        累涨修正：44.42     净值区间：83      52      39      70      40      24
//        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.07      累涨：36.26     12.54     12.02     11.70     10日：1.41      1.11      1.11      21        累涨修正：44.33     净值区间：95      85      40      66      36      25
//        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：4.66      累涨：34.78     12.43     12.20     10.15     10日：1.57      1.33      1.33      23        累涨修正：44.33     净值区间：42      42      35      56      26      26
//        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：4.25      累涨：34.16     10.59     12.87     10.70     10日：1.80      1.36      1.36      30        累涨修正：44.12     净值区间：100     64      21      45      25      27
//        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：5.45      累涨：35.27     11.40     13.93     9.94      10日：1.85      1.14      1.14      1         累涨修正：43.96     净值区间：100     70      33      57      44      28
//        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：7.65      累涨：41.53     14.67     17.20     9.66      10日：1.23      0.19      0.19      33        累涨修正：43.9      净值区间：61      45      22      66      45      29
//        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：2.88      累涨：35.15     12.12     12.91     10.12     10日：1.38      1.14      1.14      32        累涨修正：43.37     净值区间：98      83      37      55      26      30
//        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：1.92      累涨：30.72     10.35     12.10     8.27      10日：2.06      1.72      1.72      38        累涨修正：43.1      净值区间：29      29      29      55      27      31
//        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：14.46     累涨：41.36     15.08     16.94     9.34      10日：1.09      0.18                37        累涨修正：42.81     净值区间：57      44      23      66      45      32
//        KEJI_RUAN_JIAN.put("513360", "科技-软件             ");//教育ETF               市值：5.92      累涨：37.02     16.65     9.82      10.55     10日：2.14      0.60      0.60      29        累涨修正：42.76     净值区间：81      57      59      70      47      33
//        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：0.89      累涨：30.44     10.28     11.93     8.23      10日：1.96      1.70      1.70      42        累涨修正：42.6      净值区间：23      23      21      45      25      34
//        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：54.45     累涨：39.34     12.23     15.19     11.92     10日：1.01      0.34      0.34      31        累涨修正：42.39     净值区间：43      28      33      70      46      35
//        KEJI_RUAN_JIAN.put("512720", "科技-软件             ");//计算机ETF             市值：11.63     累涨：32.97     11.66     10.81     10.50     10日：1.68      1.29      1.29      34        累涨修正：42.39     净值区间：100     67      28      55      27      36
//        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：28.71     累涨：34.87     11.84     11.49     11.54     10日：1.18      1.05      1.05      35        累涨修正：42.35     净值区间：89      58      27      51      27      37
//        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：129.79    累涨：39.63     12.55     15.33     11.75     10日：1.05      0.24      0.24      27        累涨修正：42.12     净值区间：41      27      32      69      46      38
//        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：5.39      累涨：39.50     11.98     15.80     11.72     10日：0.79      0.24      0.24      39        累涨修正：41.73     净值区间：45      29      33      69      46      39
//        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：13.15     累涨：34.92     12.72     11.31     10.89     10日：1.16      0.91      0.91      36        累涨修正：41.54     净值区间：94      73      34      58      29      40
//        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.65      累涨：35.53     12.98     12.38     10.17     10日：1.10      0.81      0.81      40        累涨修正：41.49     净值区间：97      68      29      54      28      41
//        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：3.20      累涨：35.31     12.52     12.31     10.48     10日：1.03      0.78      0.78      43        累涨修正：41.02     净值区间：100     74      35      59      30      42
//        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.51      累涨：38.68     12.06     15.17     11.45     10日：0.81      0.18      0.18      44        累涨修正：40.57     净值区间：41      27      32      69      46      43
//        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.52      累涨：33.40     11.61     10.87     10.92     10日：0.98      0.98      0.98      48        累涨修正：40.26     净值区间：93      57      27      53      29      44
//        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：35.41     累涨：34.79     10.14     13.80     10.85     10日：1.56      0.63      0.63      41        累涨修正：40.13     净值区间：75      63      44      71      42      45
//        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.27      累涨：38.14     11.96     14.50     11.68     10日：0.85      0.11      0.11      45        累涨修正：39.65     净值区间：44      29      32      70      46      46
//        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：160.42    累涨：34.19     10.72     13.15     10.32     10日：1.43      0.55      0.55      46        累涨修正：38.92     净值区间：82      70      45      73      44      47
//        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.34      累涨：32.95     11.29     11.32     10.34     10日：0.90      0.77      0.77      53        累涨修正：38.47     净值区间：96      57      26      53      29      48
//        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：19.43     累涨：34.13     10.94     13.59     9.60      10日：1.15      0.31      0.31      50        累涨修正：37.14     净值区间：68      59      42      69      42      49
//        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：15.55     累涨：29.67     9.23      12.15     8.29      10日：1.33      1.00      1.00      51        累涨修正：37        净值区间：83      60      30      61      38      50
//        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：0.86      累涨：29.83     10.81     11.35     7.67      10日：1.22      0.96      0.96      52        累涨修正：36.81     净值区间：28      28      18      41      25      51
//        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：2.46      累涨：29.71     11.33     12.79     5.59      10日：1.46      0.93      0.93      47        累涨修正：36.75     净值区间：67      49      20      60      41      52
//        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：51.48     累涨：33.25     10.34     13.34     9.57      10日：1.12      0.35      0.35      54        累涨修正：36.47     净值区间：72      61      42      71      41      53
//        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.95      累涨：32.91     12.72     12.17     8.02      10日：0.68                          57        累涨修正：33.59     净值区间：70      68      35      67      38      54
//        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：3.21      累涨：26.48     10.57     8.83      7.08      10日：1.23      0.97      0.97      55        累涨修正：33.53     净值区间：69      69      64      75      41      55
//        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.30      累涨：29.57     10.47     13.88     5.22      10日：0.93      0.47      0.47      56        累涨修正：33.32     净值区间：64      69      38      59      41      56
//        KEJI_RUAN_JIAN.put("560800", "科技-软件             ");//数字经济ETF           市值：7.65      累涨：27.70     9.61      10.89     7.20      10日：1.06      0.67      0.67      59        累涨修正：32.78     净值区间：68      52      23      48      28      57
//        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.31      累涨：28.67     7.98      12.50     8.19      10日：0.95      0.48      0.48      58        累涨修正：32.5      净值区间：25      25      32      55      39      58
//        KEJI_RUAN_JIAN.put("159388", "科技-软件             ");//创业板人工智能ETF国泰 市值：1.96      累涨：                              15.77     10日：2.58      2.16      2.16      17        累涨修正：31.31     净值区间：100     74      59                      59
//        KEJI_RUAN_JIAN.put("159658", "科技-软件             ");//数字经济ETF           市值：1.96      累涨：26.61     9.70      10.07     6.84      10日：0.68      0.43      0.43      63        累涨修正：29.87     净值区间：69      51      23      48      27      60
//        KEJI_RUAN_JIAN.put("589520", "科技-软件             ");//科创人工智能ETF华宝   市值：2.41      累涨：                    16.98     9.77      10日：1.27      0.24      0.24      49        累涨修正：29.46     净值区间：55      44      27      67              61
//        KEJI_RUAN_JIAN.put("588770", "科技-软件             ");//科创信息技术ETF摩根   市值：3.23      累涨：                    12.55     5.09      10日：0.75      0.43      0.43      62        累涨修正：20.97     净值区间：63      46      20      62              62
//        KEJI_RUAN_JIAN.put("560630", "科技-软件             ");//机器人产业ETF         市值：4.86      累涨：                              11.23     10日：0.86      0.33      0.33      60        累涨修正：14.07     净值区间：40      26      33                      63
//        KEJI_RUAN_JIAN.put("589010", "科技-软件             ");//科创人工智能ETF华夏   市值：0.99      累涨：                              9.73      10日：1.38      0.20      0.20      61        累涨修正：12.31     净值区间：58      45      22                      64
//        KEJI_RUAN_JIAN.put("159213", "科技-软件             ");//机器人ETF基金         市值：0.60      累涨：                                        10日：1.15      0.19      0.19      64        累涨修正：2.29      净值区间：48      33                              65
//        KEJI_RUAN_JIAN.put("159382", "科技-软件             ");//创业板人工智能ETF南方 市值：0.60      累涨：                                        10日：2.97      1.97      1.97                累涨修正：          净值区间：100     73                              66
    }

    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片

    static {
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：2.50      累涨：42.90     16.19     19.48     7.23      10日：1.54      0.68      0.68      2         累涨修正：48.52     净值区间：74      49      20      59      50      1
//        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF        市值：4.93      累涨：33.37     7.78      15.58     10.01     10日：2.81      1.95      1.95      1         累涨修正：47.88     净值区间：100     78      65      86      70      2
//        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.73      累涨：31.66     10.05     15.30     6.31      10日：2.27      1.37      1.37      3         累涨修正：42.15     净值区间：88      60      29      57      41      3
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.60      累涨：34.32     11.53     16.05     6.74      10日：1.51      0.64      0.64      5         累涨修正：39.67     净值区间：61      38      18      54      38      4
//        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：3.85      累涨：32.59     9.72      14.01     8.86      10日：1.23      0.87      0.87      8         累涨修正：39.04     净值区间：85      54      21      63      45      5
//        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.38      累涨：34.10     11.72     15.57     6.81      10日：1.39      0.55      0.55      6         累涨修正：38.79     净值区间：67      44      20      53      39      6
//        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：253.27    累涨：33.59     12.41     15.51     5.67      10日：1.21      0.61      0.61      11        累涨修正：38.46     净值区间：78      51      20      58      43      7
//        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：225.16    累涨：31.16     10.47     13.86     6.83      10日：1.78      0.90      0.90      4         累涨修正：38.34     净值区间：69      47      21      52      37      8
//        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：22.84     累涨：29.75     10.20     13.22     6.33      10日：1.99      1.10      1.10      7         累涨修正：38.34     净值区间：89      66      27      51      35      9
//        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：14.53     累涨：33.20     11.10     16.24     5.86      10日：1.31      0.51      0.51      10        累涨修正：37.57     净值区间：73      55      21      60      45      10
//        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：23.38     累涨：33.16     12.43     15.53     5.20      10日：1.10      0.55      0.55      18        累涨修正：37.56     净值区间：79      52      20      59      43      11
//        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：5.54      累涨：32.04     12.29     14.47     5.28      10日：1.25      0.66      0.66      15        累涨修正：37.25     净值区间：100     60      21      60      45      12
//        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：238.00    累涨：29.63     9.48      13.75     6.40      10日：1.91      0.92      0.92      9         累涨修正：37.06     净值区间：53      38      18      47      32      13
//        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：17.00     累涨：32.70     7.94      13.96     10.80     10日：1.69      0.40      0.40      13        累涨修正：36.79     净值区间：75      50      30      58      44      14
//        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.88      累涨：29.82     10.35     13.54     5.93      10日：1.77      0.85      0.85      12        累涨修正：36.69     净值区间：81      58      25      52      35      15
//        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.18      累涨：29.34     10.66     13.11     5.57      10日：1.58      0.88      0.88      19        累涨修正：36.2      净值区间：74      53      19      45      30      16
//        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.32      累涨：29.00     9.78      13.93     5.29      10日：1.70      0.86      0.86      14        累涨修正：35.86     净值区间：89      64      27      52      35      17
//        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：4.45      累涨：27.55     7.92      11.65     7.98      10日：1.66      1.07      1.07      16        累涨修正：35.63     净值区间：65      50      25      57      36      18
//        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：11.99     累涨：28.91     8.71      12.04     8.16      10日：1.59      0.85      0.85      17        累涨修正：35.6      净值区间：97      72      37      65      42      19
//        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.49      累涨：28.88     9.95      12.84     6.09      10日：1.70      0.82      0.82      20        累涨修正：35.5      净值区间：61      42      19      49      31      20
//        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.09     累涨：29.63     9.72      13.67     6.24      10日：1.45      0.73      0.73      21        累涨修正：35.46     净值区间：64      43      20      51      35      21
//        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.92      累涨：31.61     11.19     15.71     4.71      10日：0.94      0.66      0.38      25        累涨修正：35.39     净值区间：60      90      68      68      55      22
//        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.58      累涨：28.40     9.66      13.73     5.01      10日：1.62      0.94      0.86      22        累涨修正：35.34     净值区间：73      61      26      52      36      23
//        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.42      累涨：32.15     11.72     14.60     5.83      10日：1.14      0.29      0.29      23        累涨修正：35.03     净值区间：59      49      20      51      37      24
//        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.43      累涨：31.25     11.63     14.78     4.84      10日：0.96      0.39      0.39      32        累涨修正：34.55     净值区间：76      50      20      59      43      25
//        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.91      累涨：28.77     10.24     13.55     4.98      10日：1.43      0.72      0.72      31        累涨修正：34.52     净值区间：70      51      19      45      30      26
//        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片ETF天弘           市值：9.45      累涨：29.80     9.84      13.81     6.15      10日：1.31      0.49      0.49      27        累涨修正：34.05     净值区间：57      38      17      49      34      27
//        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.18      累涨：28.83     8.79      13.90     6.14      10日：1.55      0.61      0.61      24        累涨修正：34.04     净值区间：65      44      20      49      34      28
//        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：11.68     累涨：30.43     10.31     14.09     6.03      10日：1.08      0.41      0.41      28        累涨修正：33.97     净值区间：63      42      19      49      34      29
//        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：107.16    累涨：29.75     10.01     13.67     6.07      10日：1.42      0.45      0.45      30        累涨修正：33.87     净值区间：64      45      20      51      35      30
//        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：4.80      累涨：29.85     9.80      13.86     6.19      10日：1.38      0.42      0.42      26        累涨修正：33.75     净值区间：57      38      17      48      33      31
//        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：1.41      累涨：27.89     8.68      12.01     7.20      10日：0.90      0.52      0.52      38        累涨修正：31.91     净值区间：70      50      27      53      35      32
//        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.66      累涨：29.10     9.51      14.24     5.35      10日：1.10      0.28      0.28      36        累涨修正：31.88     净值区间：59      41      18      54      40      33
//        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：48.77     累涨：28.96     9.41      13.76     5.79      10日：1.28      0.26      0.26      37        累涨修正：31.8      净值区间：54      38      18      46      31      34
//        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.84      累涨：29.81     7.71      13.92     8.18      10日：1.03      0.13      0.13      33        累涨修正：31.62     净值区间：55      45      23      55      39      35
//        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：3.99      累涨：28.10     8.01      10.30     9.79      10日：1.60      0.32      0.32      29        累涨修正：31.62     净值区间：94      65      41      61      43      36
//        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.02     累涨：28.40     9.69      13.52     5.19      10日：1.00      0.17      0.17      42        累涨修正：30.42     净值区间：55      40      19      46      31      37
//        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.09      累涨：29.53     7.58      13.67     8.28      10日：0.68                          40        累涨修正：30.21     净值区间：62      47      22      56      39      38
//        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：4.07      累涨：29.23     7.00      14.32     7.91      10日：0.96                          34        累涨修正：30.19     净值区间：53      43      22      56      39      39
//        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.87      累涨：29.30     7.06      14.18     8.06      10日：0.88                          35        累涨修正：30.18     净值区间：57      44      22      57      40      40
//        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.57      累涨：27.65     5.85      13.98     7.82      10日：0.66                          39        累涨修正：28.31     净值区间：56      43      22      57      41      41
//        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：1.78      累涨：24.89     7.63      10.15     7.11      10日：1.18                          41        累涨修正：26.07     净值区间：50      41      19      58      47      42
//        KEJI_XIN_PIAN.put("588170", "科技-芯片             ");//科创半导体ETF         市值：2.68      累涨：                              6.75      10日：2.18      0.94      0.94      21        累涨修正：14.57     净值区间：92      59      27                      43
//        KEJI_XIN_PIAN.put("589100", "科技-芯片             ");//科创芯片ETF国泰       市值：1.21      累涨：                              4.93      10日：0.82      0.31      0.31      43        累涨修正：7.61      净值区间：78      49      19                      44
    }

    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();

    static {
        KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：25.30     累涨：42.70     9.62      18.34     14.74     10日：3.38      2.25      2.25      1         累涨修正：59.58     净值区间：95      95      74      87      66      1
//        KEJI_TONG_XIN.put("159583", "科技-通信             ");//通信设备ETF           市值：0.66      累涨：37.96     9.56      15.06     13.34     10日：2.51      1.59      1.59      2         累涨修正：50.01     净值区间：95      76      55      74      59      2
//        KEJI_TONG_XIN.put("515050", "科技-通信             ");//5G通信ETF             市值：61.35     累涨：38.63     9.29      16.23     13.11     10日：1.86      1.19      1.19      3         累涨修正：47.63     净值区间：93      79      56      68      51      3
//        KEJI_TONG_XIN.put("159994", "科技-通信             ");//5GETF                 市值：14.80     累涨：39.16     9.76      16.79     12.61     10日：1.67      0.97      0.97      5         累涨修正：46.65     净值区间：97      80      57      68      52      4
//        KEJI_TONG_XIN.put("159695", "科技-通信             ");//通信ETF               市值：1.04      累涨：34.23     9.43      12.74     12.06     10日：2.89      1.50      1.50      4         累涨修正：46.12     净值区间：97      94      80      90      66      5
//        KEJI_TONG_XIN.put("159811", "科技-通信             ");//5G50ETF               市值：1.05      累涨：35.84     10.95     13.84     11.05     10日：1.70      0.69      0.69      6         累涨修正：41.68     净值区间：79      71      51      67      50      6
//        KEJI_TONG_XIN.put("159507", "科技-通信             ");//电信ETF               市值：0.43      累涨：33.09     8.87      13.08     11.14     10日：1.83      0.97      0.97      7         累涨修正：40.74     净值区间：97      97      80      90      63      7
//        KEJI_TONG_XIN.put("159511", "科技-通信             ");//通信ETF南方           市值：0.81      累涨：28.20     9.22      10.19     8.79      10日：1.58      0.99      0.99      8         累涨修正：35.72     净值区间：91      91      76      83      56      8
//        KEJI_TONG_XIN.put("560300", "科技-通信             ");//电信50ETF             市值：0.72      累涨：25.49     8.84      8.38      8.27      10日：1.65      0.98      0.98      9         累涨修正：33.02     净值区间：100     97      73      84      50      9
//        KEJI_TONG_XIN.put("560690", "科技-通信             ");//电信ETF基金           市值：0.26      累涨：23.65     8.33      7.16      8.16      10日：1.80      0.79      0.79      10        累涨修正：30.19     净值区间：100     61      70      84      51      10
//        KEJI_TONG_XIN.put("563010", "科技-通信             ");//电信ETF               市值：1.48      累涨：25.05     8.58      8.00      8.47      10日：1.44      0.56      0.56      11        累涨修正：29.85     净值区间：89      74      66      81      51      11
    }

    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源

    static {
//        KEJI_NEW_ENERGY.put("560960", "科技-新能源           ");//碳中和60指数ETF       市值：0.12      累涨：26.77     11.19     6.85      8.73      10日：7.73      1.21      1.21      1         累涨修正：41.76     净值区间：100     91      48      44      44      1
//        KEJI_NEW_ENERGY.put("159625", "科技-新能源           ");//绿色电力ETF           市值：3.44      累涨：24.05     5.20      12.14     6.71      10日：3.51      1.05      1.05      8         累涨修正：33.86     净值区间：38      33      60      80      80      2
//        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：1.12      累涨：23.10     5.46      10.85     6.79      10日：3.61      1.05      1.05      7         累涨修正：33.01     净值区间：36      29      59      79      79      3
//        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.69      累涨：32.11     10.13     12.47     9.51      10日：0.39                          2         累涨修正：32.5      净值区间：50      29      17      47      34      4
//        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.29      累涨：31.67     9.49      12.76     9.42      10日：0.33                          3         累涨修正：32        净值区间：44      28      15      46      34      5
        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.27      累涨：25.45     7.42      7.34      10.69     10日：1.36      0.82      0.82      4         累涨修正：31.73     净值区间：23      19      13      36      29      6
//        KEJI_NEW_ENERGY.put("560580", "科技-新能源           ");//电力ETF南方           市值：0.55      累涨：23.24     5.78      11.29     6.17      10日：2.92      0.88      0.88      10        累涨修正：31.44     净值区间：38      31      59      85      85      7
//        KEJI_NEW_ENERGY.put("561170", "科技-新能源           ");//绿色电力ETF           市值：1.16      累涨：23.54     5.88      11.85     5.81      10日：2.99      0.75      0.75      11        累涨修正：31.03     净值区间：52      32      57      76      76      8
//        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.54      累涨：23.59     6.18      11.09     6.32      10日：3.00      0.66      0.66      9         累涨修正：30.55     净值区间：33      21      55      77      77      9
//        KEJI_NEW_ENERGY.put("561700", "科技-新能源           ");//电力ETF基金           市值：1.57      累涨：22.61     5.59      11.33     5.69      10日：2.63      0.78      0.78      20        累涨修正：29.92     净值区间：38      32      60      82      82      10
//        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.58      累涨：25.30     7.47      7.86      9.97      10日：1.10      0.56      0.56      6         累涨修正：29.76     净值区间：40      24      19      36      29      11
//        KEJI_NEW_ENERGY.put("159611", "科技-新能源           ");//电力ETF               市值：35.35     累涨：22.01     5.77      10.78     5.46      10日：2.66      0.82      0.82      28        累涨修正：29.59     净值区间：54      37      62      84      84      12
//        KEJI_NEW_ENERGY.put("562960", "科技-新能源           ");//绿色电力ETF易方达     市值：0.85      累涨：23.23     5.80      11.29     6.14      10日：2.81      0.57      0.57      15        累涨修正：29.46     净值区间：60      31      59      82      82      13
//        KEJI_NEW_ENERGY.put("561560", "科技-新能源           ");//电力ETF               市值：6.37      累涨：21.87     5.49      10.81     5.57      10日：2.73      0.77      0.77      27        累涨修正：29.22     净值区间：47      34      60      83      83      14
//        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.35      累涨：24.97     6.91      10.48     7.58      10日：0.76      0.54      0.54      30        累涨修正：28.97     净值区间：92      74      67      76      65      15
//        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.78      累涨：24.63     7.03      10.35     7.25      10日：0.86      0.43      0.43      29        累涨修正：28.07     净值区间：88      70      66      77      65      16
//        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：7.14      累涨：23.72     7.18      7.12      9.42      10日：0.91      0.55      0.55      21        累涨修正：27.93     净值区间：35      23      15      35      29      17
//        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.55      累涨：23.79     7.40      6.92      9.47      10日：0.79      0.53      0.53      24        累涨修正：27.76     净值区间：42      26      14      35      29      18
//        KEJI_NEW_ENERGY.put("562350", "科技-新能源           ");//电力指数ETF           市值：0.53      累涨：20.95     5.25      10.13     5.57      10日：2.72      0.68      0.68      41        累涨修正：27.75     净值区间：42      33      63      83      83      19
//        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.48      累涨：25.67     8.36      8.79      8.52      10日：0.67      0.23      0.23      13        累涨修正：27.72     净值区间：38      21      14      34      29      20
//        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.64      累涨：22.27     6.50      7.32      8.45      10日：2.95      1.10                5         累涨修正：27.42     净值区间：13      13      46      50      50      21
//        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：3.48      累涨：24.75     8.15      6.24      10.36     10日：1.18      0.24      0.24      18        累涨修正：27.37     净值区间：36      24      15      35      29      22
//        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.35      累涨：23.80     8.29      6.79      8.72      10日：0.69      0.46      0.46      31        累涨修正：27.25     净值区间：40      27      15      35      29      23
//        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.14      累涨：24.16     7.32      8.22      8.62      10日：2.90                          10        累涨修正：27.06     净值区间：10      9       32      62      51      24
//        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：20.22     累涨：24.09     7.95      7.12      9.02      10日：0.72      0.36      0.36      26        累涨修正：26.97     净值区间：44      30      19      37      30      25
//        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.58      累涨：22.14     6.57      9.69      5.88      10日：1.70      0.48      0.48      43        累涨修正：26.72     净值区间：62      43      44      38      38      26
//        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.62      累涨：24.74     7.27      7.37      10.10     10日：0.76      0.19      0.19      22        累涨修正：26.64     净值区间：44      28      14      37      30      27
//        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：89.58     累涨：25.24     8.86      7.25      9.13      10日：0.45      0.15      0.15      25        累涨修正：26.59     净值区间：36      24      15      36      29      28
//        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：1.99      累涨：24.27     7.37      8.26      8.64      10日：1.60                          14        累涨修正：25.87     净值区间：17      13      38      58      44      29
//        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：2.88      累涨：23.59     6.94      8.26      8.39      10日：1.77                          23        累涨修正：25.36     净值区间：22      16      34      57      45      30
//        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：0.90      累涨：23.25     8.16      6.11      8.98      10日：1.85                          16        累涨修正：25.1      净值区间：27      19      39      55      40      31
//        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：19.44     累涨：22.68     6.67      7.55      8.46      10日：2.34                          17        累涨修正：25.02     净值区间：19      15      45      68      52      32
//        KEJI_NEW_ENERGY.put("159368", "科技-新能源           ");//创业板新能源ETF华夏   市值：1.22      累涨：                    12.75     10.73     10日：1.52                          12        累涨修正：25        净值区间：32      22      34      61              33
//        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：8.79      累涨：23.04     7.51      6.58      8.95      10日：1.84                          19        累涨修正：24.88     净值区间：29      23      40      55      41      34
//        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.11      累涨：23.21     7.51      7.14      8.56      10日：1.35                          35        累涨修正：24.56     净值区间：27      18      37      53      39      35
//        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.17      累涨：21.81     6.43      8.18      7.20      10日：2.54                          32        累涨修正：24.35     净值区间：19      18      38      69      57      36
//        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.85      累涨：22.25     6.66      8.82      6.77      10日：2.09                          34        累涨修正：24.34     净值区间：16      15      36      65      56      37
//        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：43.63     累涨：22.73     7.62      6.43      8.68      10日：1.41                          36        累涨修正：24.14     净值区间：23      18      36      54      40      38
//        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：6.45      累涨：22.45     7.59      6.27      8.59      10日：1.68                          37        累涨修正：24.13     净值区间：29      22      39      56      42      39
//        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：11.63     累涨：22.20     6.94      7.44      7.82      10日：1.73                          39        累涨修正：23.93     净值区间：23      18      45      61      47      40
//        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：1.82      累涨：21.63     6.29      8.44      6.90      10日：2.26                          33        累涨修正：23.89     净值区间：16      15      38      66      59      41
//        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：10.50     累涨：21.61     6.47      8.33      6.81      10日：2.10                          38        累涨修正：23.71     净值区间：16      15      37      68      57      42
//        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：6.78      累涨：21.39     6.08      8.64      6.67      10日：2.23                          42        累涨修正：23.62     净值区间：15      15      39      68      57      43
//        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.10      累涨：21.04     7.11      7.14      6.79      10日：2.23                          40        累涨修正：23.27     净值区间：13      12      40      73      63      44
//        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：2.66      累涨：20.83     6.69      7.51      6.63      10日：2.13                          44        累涨修正：22.96     净值区间：21      19      40      70      58      45
//        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.47      累涨：20.98     6.00      7.33      7.65      10日：1.81                          46        累涨修正：22.79     净值区间：24      19      47      70      57      46
//        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.55      累涨：21.24     6.85      6.20      8.19      10日：1.51                          48        累涨修正：22.75     净值区间：17      13      37      56      43      47
//        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：2.52      累涨：22.19     6.93      6.43      8.83      10日：0.48                          47        累涨修正：22.67     净值区间：38      26      16      36      29      48
//        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.43      累涨：20.84     5.78      6.72      8.34      10日：1.73                          50        累涨修正：22.57     净值区间：14      12      44      67      52      49
//        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：6.34      累涨：20.47     6.20      7.87      6.40      10日：1.97                          45        累涨修正：22.44     净值区间：15      14      36      68      57      50
//        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.59      累涨：19.43     5.91      5.29      8.23      10日：2.01                          49        累涨修正：21.44     净值区间：12      9       45      69      50      51
    }

    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车

    static {
        KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：6.13      累涨：54.15     15.43     22.06     16.66     10日：5.01      0.40                1         累涨修正：59.96     净值区间：21      21      48      73      72      1
//        KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：1.71      累涨：53.65     16.08     21.85     15.72     10日：4.58      0.62                2         累涨修正：59.47     净值区间：24      23      49      73      71      2
//        KEJI_NEW_CAR.put("159512", "科技-汽车             ");//汽车ETF               市值：0.67      累涨：34.83     10.73     13.13     10.97     10日：6.65      2.08                3         累涨修正：45.64     净值区间：18      21      40      67      67      3
//        KEJI_NEW_CAR.put("516110", "科技-汽车             ");//汽车ETF               市值：4.07      累涨：33.70     9.77      13.06     10.87     10日：5.68      1.64                6         累涨修正：42.66     净值区间：17      17      41      69      69      4
//        KEJI_NEW_CAR.put("159565", "科技-汽车             ");//汽车零部件ETF         市值：0.87      累涨：37.20     9.34      15.67     12.19     10日：2.44      0.08      0.08      7         累涨修正：40.12     净值区间：59      59      69      86      66      5
//        KEJI_NEW_CAR.put("159306", "科技-汽车             ");//汽车零件ETF           市值：0.23      累涨：35.66     9.13      14.82     11.71     10日：2.41      0.36      0.09      11        累涨修正：39.15     净值区间：66      66      77      91      61      6
//        KEJI_NEW_CAR.put("159755", "科技-汽车             ");//电池ETF               市值：27.20     累涨：33.96     9.99      11.51     12.46     10日：4.64                          4         累涨修正：38.6      净值区间：18      17      40      69      53      7
//        KEJI_NEW_CAR.put("562260", "科技-汽车             ");//汽车配件ETF           市值：0.12      累涨：35.00     8.71      14.75     11.54     10日：2.15      0.18      0.18      17        累涨修正：38.23     净值区间：56      56      71      87      64      8
//        KEJI_NEW_CAR.put("159767", "科技-汽车             ");//电池龙头ETF           市值：1.12      累涨：33.51     9.02      11.55     12.94     10日：4.63                          9         累涨修正：38.14     净值区间：13      11      34      65      52      9
//        KEJI_NEW_CAR.put("562700", "科技-汽车             ");//汽车零部件ETF         市值：0.41      累涨：35.56     9.07      14.83     11.66     10日：2.28                          13        累涨修正：37.84     净值区间：76      76      67      85      69      10
//        KEJI_NEW_CAR.put("159757", "科技-汽车             ");//电池30ETF             市值：3.01      累涨：33.42     9.79      11.80     11.83     10日：4.20                          5         累涨修正：37.62     净值区间：17      16      38      69      54      11
//        KEJI_NEW_CAR.put("159889", "科技-汽车             ");//智能汽车ETF           市值：0.48      累涨：34.64     9.36      14.40     10.88     10日：2.95                          12        累涨修正：37.59     净值区间：84      77      59      67      51      12
//        KEJI_NEW_CAR.put("159795", "科技-汽车             ");//智能汽车ETF基金       市值：0.42      累涨：33.25     9.27      13.18     10.80     10日：2.66      0.23      0.23      16        累涨修正：37.29     净值区间：92      87      74      72      51      13
//        KEJI_NEW_CAR.put("516520", "科技-汽车             ");//智能驾驶ETF           市值：3.40      累涨：34.05     10.14     13.33     10.58     10日：2.55      0.10      0.10      15        累涨修正：37.2      净值区间：88      82      68      72      53      14
//        KEJI_NEW_CAR.put("159775", "科技-汽车             ");//新能源车电池ETF       市值：0.55      累涨：32.83     10.27     10.87     11.69     10日：3.98                          10        累涨修正：36.81     净值区间：15      14      45      70      54      15
//        KEJI_NEW_CAR.put("159840", "科技-汽车             ");//锂电池ETF             市值：8.50      累涨：32.64     9.35      11.60     11.69     10日：4.15                          8         累涨修正：36.79     净值区间：17      16      39      68      53      16
//        KEJI_NEW_CAR.put("515250", "科技-汽车             ");//智能汽车ETF           市值：6.81      累涨：33.91     9.68      13.28     10.95     10日：2.51                          14        累涨修正：36.42     净值区间：87      80      65      68      51      17
//        KEJI_NEW_CAR.put("159888", "科技-汽车             ");//智能车ETF             市值：0.83      累涨：33.05     9.19      13.25     10.61     10日：2.54                          19        累涨修正：35.59     净值区间：86      72      68      70      51      18
//        KEJI_NEW_CAR.put("516660", "科技-汽车             ");//新能源车ETF基金       市值：3.06      累涨：31.18     8.81      11.20     11.17     10日：3.65                          18        累涨修正：34.83     净值区间：19      18      39      67      49      19
//        KEJI_NEW_CAR.put("515030", "科技-汽车             ");//新能源车ETF           市值：41.77     累涨：30.89     8.82      10.76     11.31     10日：3.45                          21        累涨修正：34.34     净值区间：20      19      38      69      49      20
//        KEJI_NEW_CAR.put("561160", "科技-汽车             ");//锂电池ETF             市值：5.86      累涨：31.74     8.65      12.21     10.88     10日：2.51                          26        累涨修正：34.25     净值区间：32      23      41      63      45      21
//        KEJI_NEW_CAR.put("515700", "科技-汽车             ");//新能车ETF             市值：22.26     累涨：30.73     8.82      10.71     11.20     10日：3.45                          20        累涨修正：34.18     净值区间：18      18      41      69      49      22
//        KEJI_NEW_CAR.put("159566", "科技-汽车             ");//储能电池ETF           市值：1.08      累涨：31.99     8.06      13.11     10.82     10日：2.17                          34        累涨修正：34.16     净值区间：34      22      41      63      50      23
//        KEJI_NEW_CAR.put("516390", "科技-汽车             ");//新能源汽车ETF         市值：3.17      累涨：30.69     8.80      10.98     10.91     10日：3.41                          22        累涨修正：34.1      净值区间：21      20      40      66      50      24
//        KEJI_NEW_CAR.put("560000", "科技-汽车             ");//智慧电车ETF           市值：0.11      累涨：30.01     8.87      10.99     10.15     10日：4.02                          25        累涨修正：34.03     净值区间：21      21      22      51      50      25
//        KEJI_NEW_CAR.put("159872", "科技-汽车             ");//智能网联汽车ETF       市值：0.50      累涨：30.82     8.32      10.87     11.63     10日：3.20                          24        累涨修正：34.02     净值区间：81      74      87      92      60      26
//        KEJI_NEW_CAR.put("159824", "科技-汽车             ");//新能车ETF             市值：1.59      累涨：30.46     9.21      10.60     10.65     10日：3.47                          23        累涨修正：33.93     净值区间：25      24      38      70      50      27
//        KEJI_NEW_CAR.put("516590", "科技-汽车             ");//智能汽车ETF易方达     市值：0.90      累涨：30.38     8.41      11.68     10.29     10日：3.40                          32        累涨修正：33.78     净值区间：22      22      39      66      53      28
//        KEJI_NEW_CAR.put("159720", "科技-汽车             ");//智能车ETF泰康         市值：0.53      累涨：30.54     8.90      11.27     10.37     10日：3.23                          29        累涨修正：33.77     净值区间：24      24      40      67      54      29
//        KEJI_NEW_CAR.put("159796", "科技-汽车             ");//电池50ETF             市值：9.47      累涨：31.52     8.79      11.87     10.86     10日：2.12                          33        累涨修正：33.64     净值区间：27      19      35      63      45      30
//        KEJI_NEW_CAR.put("516380", "科技-汽车             ");//智能电动车ETF         市值：0.93      累涨：30.64     8.97      11.81     9.86      10日：2.96                          27        累涨修正：33.6      净值区间：25      25      66      66      55      31
//        KEJI_NEW_CAR.put("159806", "科技-汽车             ");//新能源车ETF           市值：9.75      累涨：29.88     8.32      10.44     11.12     10日：3.69                          28        累涨修正：33.57     净值区间：21      19      38      68      50      32
//        KEJI_NEW_CAR.put("159637", "科技-汽车             ");//新能源车龙头ETF       市值：7.99      累涨：30.08     8.39      10.60     11.09     10日：3.40                          31        累涨修正：33.48     净值区间：23      21      40      68      50      33
//        KEJI_NEW_CAR.put("562880", "科技-汽车             ");//电池ETF基金           市值：3.23      累涨：30.52     7.62      11.88     11.02     10日：2.44                          30        累涨修正：32.96     净值区间：32      23      35      66      48      34
//        KEJI_NEW_CAR.put("561910", "科技-汽车             ");//电池ETF               市值：5.68      累涨：29.36     7.87      10.62     10.87     10日：2.50                          36        累涨修正：31.86     净值区间：30      23      39      63      45      35
//        KEJI_NEW_CAR.put("159305", "科技-汽车             ");//储能电池50ETF         市值：0.41      累涨：29.78     6.73      12.61     10.44     10日：2.00                          35        累涨修正：31.78     净值区间：26      17      37      58      47      36
//        KEJI_NEW_CAR.put("159239", "科技-汽车             ");//恒生汽车ETF           市值：2.11      累涨：                                        10日：                                        累涨修正：          净值区间：                                        37
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_TONG_XIN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_NEW_CAR);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }

    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }

    /**
     * ETF涨幅数据：查询数据,根据名称模糊查询,显示近n个交易日的价格区间
     */
    private static void findByTypeName(String date, List nameLikeList, List nameNoLikeList, String typeEn, String typeCn, Map<String, String> typeMap) {
//        String typeEn = "";
//        String typeCn = "";
        CondEtfAdrCount condition = new CondEtfAdrCount();
        condition.setDate(date);
        condition.setOrderBy(ADR_UP_SUM_1_60_DESC);
        condition.setLikeNameList(nameLikeList);
        condition.setNotLikeNameList(nameNoLikeList);

//
        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
//        EtfControl.saveOrUpdateListNetLastDay(condition, date, true);//保存或更新ETF涨幅次数-批量更新基础信息

        if (etfListLikeName == null) {
            System.out.println("数据为null");
        }
        int num = 0;//序号
        etfListLikeName = etfListLikeName.stream().filter(e -> e != null).sorted(Comparator.comparing(EtfAdrCountVo::getADR_UP_SUM_TOTAL, Comparator.nullsFirst(BigDecimal::compareTo)).reversed()).collect(Collectors.toList());

        System.out.println("    static {");
        for (EtfAdrCountVo vo : etfListLikeName) {
            StringBuffer sb = new StringBuffer();

            sb.append("        ");
            sb.append(typeEn + ".put(\"").append(StockUtil.formatStName(vo.getF12(), SIZE_6)).append("\"");
            sb.append(", \"" + StockUtil.formatStName(typeCn, SIZE_22) + "\");");
//            sb.append(", \"" + StockUtil.formatStName(vo.getF14(), SIZE_22) + "\");");
            sb.append("//");
            sb.append(StockUtil.formatStName(vo.getF14(), SIZE_22));
            sb.append(StockUtil.formatStName("市值：", SIZE_6));
            BigDecimal marketValue = null;
            if (vo.getF20() != null) {
                marketValue = vo.getF20().divide(NUM_YI_1, 2, BigDecimal.ROUND_HALF_UP);
            }
            sb.append(StockUtil.formatDouble(marketValue, SIZE_10));
            sb.append(StockUtil.formatStName("累涨：", SIZE_6));
            if (vo.getADR_UP_SUM_1_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_40_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_40_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_20_40() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_20_40().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_20() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_20().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatStName("10日：", SIZE_6));
            if (vo.getADR_UP_SUM_1_10() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_10().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_5() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_5().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_3() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_3().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_ORDER_STAT(), SIZE_10));
            sb.append(StockUtil.formatStName("累涨修正：", SIZE_10));
//            sb.append(StockUtil.formatDouble(vo.getAdrUpSum_60_and_10c6(), SIZE_10));
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_TOTAL(), SIZE_10));

            sb.append(StockUtil.formatStName("净值区间：", SIZE_10));
            BigDecimal curArea = vo.getNET_AREA_DAY_5();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_10();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_20();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_40();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_60();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }

            sb.append(StockUtil.formatInt(++num, SIZE_6));


            System.out.println(sb);
        }
        System.out.println("    }");


    }

    public static void main(String[] args) throws Exception {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
//        String date = "2025-05-29";

//        System.out.println("    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT, null, "INDEX_CN_NOT", ContEtfTypeName.INDEX_CN_NOT, ContMapEtfTop.INDEX_CN_NOT);
//        System.out.println("    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT_USA, null, "INDEX_CN_NOT_USA", ContEtfTypeName.INDEX_CN_NOT_USA, ContMapEtfTop.INDEX_CN_NOT_USA);
//        System.out.println("    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_1000, ContEtfNameKey.INDEX_CN_1000_NOLIKE, "INDEX_CN_1000", ContEtfTypeName.INDEX_CN_1000, ContMapEtfTop.INDEX_CN_1000);
//        System.out.println("    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板");
//        findByTypeName(date, ContEtfNameKey.INDEX_300, ContEtfNameKey.INDEX_300_NOLIKE, "INDEX_300", ContEtfTypeName.INDEX_300, ContMapEtfTop.INDEX_300);
//        System.out.println("    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板");
//        findByTypeName(date, ContEtfNameKey.INDEX_688, ContEtfNameKey.INDEX_688_NOLIKE, "INDEX_688", ContEtfTypeName.INDEX_688, ContMapEtfTop.INDEX_688);
//        System.out.println("    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股");
//        findByTypeName(date, ContEtfNameKey.INDEX_HK,  ContEtfNameKey.INDEX_HK_NOLIKE, "INDEX_HK", ContEtfTypeName.INDEX_HK, ContMapEtfTop.INDEX_HK);
//        System.out.println("    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_BIG,  ContEtfNameKey.INDEX_CN_BIG_NOLIKE, "INDEX_CN_BIG", ContEtfTypeName.INDEX_CN_BIG, ContMapEtfTop.INDEX_CN_BIG);

//        System.out.println("    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港科技");
//        findByTypeName(date, ContEtfNameKey.KEJI_HK, null, "KEJI_HK", ContEtfTypeName.KEJI_HK, ContMapEtfTop.KEJI_HK);
//        System.out.println("    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();//科技-军工");
//        findByTypeName(date, ContEtfNameKey.KEJI_JUNGONG, null, "KEJI_JUNGONG", ContEtfTypeName.KEJI_JUNGONG, ContMapEtfTop.KEJI_JUNGONG);
//        System.out.println("    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();//科技-通用");
//        findByTypeName(date, ContEtfNameKey.KEJI_GONG_YE, ContEtfNameKey.KEJI_GONG_YE_NOLIKE, "KEJI_GONG_YE", ContEtfTypeName.KEJI_GONG_YE, ContMapEtfTop.KEJI_GONG_YE);
//        System.out.println("    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件");
//        findByTypeName(date, ContEtfNameKey.KEJI_RUAN_JIAN, null, "KEJI_RUAN_JIAN", ContEtfTypeName.KEJI_RUAN_JIAN, ContMapEtfTop.KEJI_RUAN_JIAN);
//        System.out.println("    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片");
//        findByTypeName(date, ContEtfNameKey.KEJI_XIN_PIAN, null, "KEJI_XIN_PIAN", ContEtfTypeName.KEJI_XIN_PIAN, ContMapEtfTop.KEJI_XIN_PIAN);
//        System.out.println("    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();");
//        findByTypeName(date, ContEtfNameKey.KEJI_TONG_XIN, null, "KEJI_TONG_XIN", ContEtfTypeName.KEJI_TONG_XIN, ContMapEtfTop.KEJI_TONG_XIN);
//        System.out.println("    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源");
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_ENERGY, null, "KEJI_NEW_ENERGY", ContEtfTypeName.KEJI_NEW_ENERGY, ContMapEtfTop.KEJI_NEW_ENERGY);
//        System.out.println("    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车");
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_CAR, null, "KEJI_NEW_CAR", ContEtfTypeName.KEJI_NEW_CAR, ContMapEtfTop.KEJI_NEW_CAR);

//        System.out.println("    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();//资源-石油");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_OIL, null, "ZIYUAN_OIL", ContEtfTypeName.ZIYUAN_OIL, ContMapEtfTop.ZIYUAN_OIL);//资源-石油
//        System.out.println("    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_NONGYE, null, "ZIYUAN_NONGYE", ContEtfTypeName.ZIYUAN_NONGYE, ContMapEtfTop.ZIYUAN_NONGYE);
//        System.out.println("    public static Map<String, String> ZIYUAN_XIYOU = new HashMap<>();");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_XIYOU, null, "ZIYUAN_XIYOU", ContEtfTypeName.ZIYUAN_XIYOU, ContMapEtfTop.ZIYUAN_XIYOU);
//        System.out.println("    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_COMMON, ContEtfNameKey.ZIYUAN_COMMON_NOLIKE, "ZIYUAN_COMMON", ContEtfTypeName.ZIYUAN_COMMON, ContMapEtfTop.ZIYUAN_COMMON);
//        findByTypeName(date, ContEtfNameKey.ZIYUAN, ContEtfNameKey.ZIYUAN_NOLIKE, "ZIYUAN", ContEtfTypeName.ZIYUAN_STR, ContMapEtfTop.ZIYUAN);


//        System.out.println("    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_COMMON, ContEtfNameKey.XIAOFEI_COMMON_NOLIKE, "XIAOFEI_COMMON", ContEtfTypeName.XIAOFEI_COMMON, ContMapEtfTop.XIAOFEI_COMMON);
//        System.out.println("    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_MEDIA, null, "XIAOFEI_MEDIA", ContEtfTypeName.XIAOFEI_MEDIA, ContMapEtfTop.XIAOFEI_MEDIA);
//        System.out.println("    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_WINE, null, "XIAOFEI_WINE", ContEtfTypeName.XIAOFEI_WINE, ContMapEtfTop.XIAOFEI_WINE);

//        System.out.println("    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗");
//        findByTypeName(date, ContEtfNameKey.YILIAO_COMMON, null, "YILIAO_COMMON", ContEtfTypeName.YILIAO_COMMON, ContMapEtfTop.YILIAO_COMMON);


//        System.out.println("    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金");
//        findByTypeName(date, ContEtfNameKey.JINRONG_GOLD,  ContEtfNameKey.JINRONG_GOLD_NOLIKE, "JINRONG_GOLD", ContEtfTypeName.JINRONG_GOLD, ContMapEtfTop.JINRONG_GOLD);
//        System.out.println("    public static Map<String, String> JINRONG_BANK = new HashMap<>();");
//        findByTypeName(date, ContEtfNameKey.JINRONG_BANK,  null, "JINRONG_BANK", ContEtfTypeName.JINRONG_BANK, ContMapEtfTop.JINRONG_BANK);
//        System.out.println("    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券");
//        findByTypeName(date, ContEtfNameKey.JINRONG_ZHENGQUAN,  ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE, "JINRONG_ZHENGQUAN", ContEtfTypeName.JINRONG_ZHENGQUAN, ContMapEtfTop.JINRONG_ZHENGQUAN);
//        System.out.println("    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();");
//        findByTypeName(date, ContEtfNameKey.JINRONG_FANGDICHAN,  null, "JINRONG_FANGDICHAN", ContEtfTypeName.JINRONG_FANGDICHAN, ContMapEtfTop.JINRONG_FANGDICHAN);
//        public static String INDEX_CN_CITY = "指数-国内城市";

////        //etf头部数据
//        List<String> zqdmList = new ArrayList<>(ContMapEtfTop.ETF_All.keySet());
//        int count = 0;
//        for (String zqdm : zqdmList) {
//            System.out.println(++count + ":" + zqdm + ":" + ETF_All.get(zqdm));
//        }

    }
}
