package utils;

import ttjj.dto.CondStockAdrCount;
import ttjj.dto.EtfAdrCountVo;
import ttjj.rank.EtfControl;
import ttjj.service.EtfAdrCountService;

import java.math.BigDecimal;
import java.util.Arrays;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import static utils.Content.*;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {
    /**
     * 资源
     */
    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();
    static {
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：5.03      累涨：64.70     21.04     37.51     9.22      5.14      5.14      1
        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.33      累涨：16.29     3.30      8.59      4.40      2.93      1.46      2
        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：0.75      累涨：15.56     5.48      6.16      3.92      2.79      2.37      3
        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.08      累涨：16.11     4.84      7.03      4.24      2.75      1.79      4
        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.28      累涨：15.64     5.90      5.95      4.01      2.56      2.11      5
        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.25      累涨：16.23     6.31      5.82      4.10      2.55      1.88      6
        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：0.64      累涨：13.92     5.63      4.98      3.31      2.54      1.87      7
        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：0.62      累涨：16.37     6.10      6.69      3.58      2.39      1.84      8
        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：0.93      累涨：16.70     5.50      7.01      4.19      2.39      1.59      9
        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：9.85      累涨：50.63     22.16     26.67     3.94      2.20      1.46      10
    }
    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();
    static {
        ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.52      累涨：20.10     4.49      7.82      7.79      6.09      4.04      1
        ZIYUAN_NONGYE.put("159616", "资源-农业             ");//农牧ETF               市值：0.68      累涨：24.58     5.04      10.24     9.30      6.08      3.59      2
        ZIYUAN_NONGYE.put("159825", "资源-农业             ");//农业ETF               市值：18.79     累涨：23.18     5.05      9.11      9.32      5.79      3.02      3
        ZIYUAN_NONGYE.put("159867", "资源-农业             ");//畜牧ETF               市值：6.40      累涨：21.80     4.73      8.73      8.34      5.66      3.16      4
        ZIYUAN_NONGYE.put("516670", "资源-农业             ");//畜牧养殖ETF           市值：6.81      累涨：22.20     5.35      8.28      8.57      5.57      3.58      5
        ZIYUAN_NONGYE.put("516810", "资源-农业             ");//农业50ETF             市值：1.66      累涨：23.61     5.73      9.60      8.43      5.41      2.99      6
        ZIYUAN_NONGYE.put("159865", "资源-农业             ");//养殖ETF               市值：33.11     累涨：21.27     4.82      8.32      8.13      5.40      3.04      7
        ZIYUAN_NONGYE.put("516550", "资源-农业             ");//农业ETF               市值：2.14      累涨：20.02     4.20      7.73      8.09      5.32      3.37      8
        ZIYUAN_NONGYE.put("159827", "资源-农业             ");//农业50ETF             市值：1.12      累涨：23.98     5.30      9.68      9.43      5.28      2.69      9
        ZIYUAN_NONGYE.put("562900", "资源-农业             ");//农业ETF易方达         市值：0.82      累涨：21.51     5.21      8.44      8.57      5.00      2.70      10
        ZIYUAN_NONGYE.put("159587", "资源-农业             ");//粮食50ETF             市值：0.31      累涨：22.89     5.77      9.19      8.11      4.53      2.62      11
        ZIYUAN_NONGYE.put("159698", "资源-农业             ");//粮食ETF               市值：1.99      累涨：24.17     6.33      10.28     7.79      4.09      2.33      12
    }
    public static Map<String, String> ZIYUAN_XIYOU = new HashMap<>();
    static {
        ZIYUAN_XIYOU.put("512400", "资源-稀有             ");//有色金属ETF           市值：61.56     累涨：31.19     9.83      10.25     13.48     8.53      3.20      1
        ZIYUAN_XIYOU.put("159871", "资源-稀有             ");//有色金属ETF           市值：1.12      累涨：29.20     9.02      9.30      12.70     8.48      3.30      2
        ZIYUAN_XIYOU.put("159652", "资源-稀有             ");//有色50ETF             市值：3.19      累涨：29.28     8.83      9.51      12.98     8.31      3.48      3
        ZIYUAN_XIYOU.put("159876", "资源-稀有             ");//有色龙头ETF           市值：0.79      累涨：28.79     9.26      9.23      12.73     8.24      3.04      4
        ZIYUAN_XIYOU.put("516650", "资源-稀有             ");//有色金属ETF基金       市值：1.16      累涨：29.38     9.57      9.55      12.27     8.13      3.18      5
        ZIYUAN_XIYOU.put("159881", "资源-稀有             ");//有色60ETF             市值：0.60      累涨：29.22     9.66      9.12      12.55     8.11      2.89      6
        ZIYUAN_XIYOU.put("159880", "资源-稀有             ");//有色ETF基金           市值：1.13      累涨：28.77     8.80      9.56      12.14     7.95      3.17      7
        ZIYUAN_XIYOU.put("560860", "资源-稀有             ");//工业有色ETF           市值：5.48      累涨：30.47     10.48     9.53      12.90     7.86      1.71      8
        ZIYUAN_XIYOU.put("561800", "资源-稀有             ");//稀有金属ETF基金       市值：0.95      累涨：35.80     11.75     12.27     16.35     7.07      1.57      9
        ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：19.05     累涨：40.41     13.14     18.27     16.39     6.93      2.00      10
        ZIYUAN_XIYOU.put("159671", "资源-稀有             ");//稀有金属ETF基金       市值：5.92      累涨：33.48     11.30     12.50     14.08     6.80      1.74      11
        ZIYUAN_XIYOU.put("159713", "资源-稀有             ");//稀土ETF               市值：3.31      累涨：37.79     13.10     16.02     15.69     6.76      1.94      12
        ZIYUAN_XIYOU.put("516780", "资源-稀有             ");//稀土ETF               市值：8.28      累涨：40.02     13.08     17.72     16.31     6.74      2.07      13
        ZIYUAN_XIYOU.put("159608", "资源-稀有             ");//稀有金属ETF           市值：2.46      累涨：32.84     11.22     11.83     13.71     6.61      1.46      14
        ZIYUAN_XIYOU.put("159715", "资源-稀有             ");//稀土ETF易方达         市值：2.03      累涨：39.12     13.38     17.53     15.33     6.47      1.60      15
        ZIYUAN_XIYOU.put("562800", "资源-稀有             ");//稀有金属ETF           市值：11.58     累涨：34.13     11.35     13.09     13.76     6.43      1.49      16
        ZIYUAN_XIYOU.put("159980", "资源-稀有             ");//有色ETF               市值：12.13     累涨：15.84     3.48      5.78      6.58      4.79      2.96      17
    }
    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();
    static {
        ZIYUAN_COMMON.put("516890", "资源-通用             ");//新材料ETF指数基金     市值：0.25      累涨：                                                            1
        ZIYUAN_COMMON.put("159761", "资源-通用             ");//新材料50ETF           市值：1.48      累涨：                                                            2
        ZIYUAN_COMMON.put("159703", "资源-通用             ");//新材料ETF             市值：0.56      累涨：                                                            3
        ZIYUAN_COMMON.put("562850", "资源-通用             ");//央企能源ETF           市值：1.42      累涨：                                                            4
        ZIYUAN_COMMON.put("588010", "资源-通用             ");//科创新材料ETF         市值：2.60      累涨：                                                            5
        ZIYUAN_COMMON.put("561330", "资源-通用             ");//矿业ETF               市值：0.79      累涨：                                                            6
        ZIYUAN_COMMON.put("561260", "资源-通用             ");//能源ETF               市值：0.85      累涨：                                                            7
        ZIYUAN_COMMON.put("510170", "资源-通用             ");//大宗商品ETF           市值：1.68      累涨：                                                            8
        ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.14      累涨：                                                            9
        ZIYUAN_COMMON.put("561790", "资源-通用             ");//央企现代能源ETF       市值：0.51      累涨：                                                            10
        ZIYUAN_COMMON.put("515220", "资源-通用             ");//煤炭ETF               市值：41.55     累涨：                                                            11
        ZIYUAN_COMMON.put("515210", "资源-通用             ");//钢铁ETF               市值：17.21     累涨：                                                            12
        ZIYUAN_COMMON.put("159981", "资源-通用             ");//能源化工ETF           市值：5.00      累涨：                                                            13
        ZIYUAN_COMMON.put("516220", "资源-通用             ");//化工龙头ETF           市值：1.21      累涨：                                                            14
        ZIYUAN_COMMON.put("562590", "资源-通用             ");//半导体材料ETF         市值：3.47      累涨：                                                            15
        ZIYUAN_COMMON.put("516360", "资源-通用             ");//新材料ETF             市值：0.59      累涨：                                                            16
        ZIYUAN_COMMON.put("159870", "资源-通用             ");//化工ETF               市值：17.44     累涨：                                                            17
        ZIYUAN_COMMON.put("159930", "资源-通用             ");//能源ETF               市值：3.14      累涨：                                                            18
        ZIYUAN_COMMON.put("588160", "资源-通用             ");//科创材料ETF           市值：1.50      累涨：                                                            19
        ZIYUAN_COMMON.put("516020", "资源-通用             ");//化工ETF               市值：4.85      累涨：                                                            20
        ZIYUAN_COMMON.put("159985", "资源-通用             ");//豆粕ETF               市值：28.21     累涨：                                                            21
        ZIYUAN_COMMON.put("516120", "资源-通用             ");//化工50ETF             市值：1.98      累涨：                                                            22
        ZIYUAN_COMMON.put("516710", "资源-通用             ");//新材料50ETF           市值：0.45      累涨：                                                            23
        ZIYUAN_COMMON.put("562010", "资源-通用             ");//绿色能源ETF           市值：0.16      累涨：                                                            24
        ZIYUAN_COMMON.put("159763", "资源-通用             ");//新材料ETF基金         市值：0.58      累涨：                                                            25
        ZIYUAN_COMMON.put("516570", "资源-通用             ");//化工行业ETF           市值：0.60      累涨：                                                            26
        ZIYUAN_COMMON.put("159945", "资源-通用             ");//能源ETF基金           市值：0.35      累涨：                                                            27
        ZIYUAN_COMMON.put("516480", "资源-通用             ");//新材料ETF基金         市值：0.13      累涨：                                                            28
        ZIYUAN_COMMON.put("510410", "资源-通用             ");//资源ETF               市值：4.07      累涨：                                                            29
        ZIYUAN_COMMON.put("159944", "资源-通用             ");//材料ETF               市值：0.23      累涨：                                                            30
    }
    public static Map<String, String> ZIYUAN = new HashMap<>();
    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_NONGYE);
        ZIYUAN.putAll(ZIYUAN_XIYOU);
        ZIYUAN.putAll(ZIYUAN_COMMON);
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用
    static {
        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：5.28      累涨：23.39     2.90      7.01      13.48     7.34      4.87      1
        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.39      累涨：28.08     6.48      7.59      14.24     7.32      4.75      2
        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.87      累涨：23.23     4.00      7.39      11.97     7.28      4.13      3
        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：5.15      累涨：22.09     3.28      7.03      12.08     7.27      4.19      4
        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.53      累涨：22.49     3.62      7.62      11.60     7.03      4.17      5
        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：147.52    累涨：23.38     4.19      7.68      11.77     6.92      4.18      6
        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.91      累涨：23.70     3.88      8.21      11.88     6.78      4.16      7
        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：1.12      累涨：20.99     5.07      5.61      10.53     6.13      4.95      8
        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.30      累涨：35.70     14.86     11.70     11.95     5.86      5.28      9
        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：26.18     累涨：20.52     5.14      5.17      10.56     5.84      4.62      10
        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.86      累涨：19.88     5.00      5.08      9.91      5.60      4.54      11
        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.09      累涨：19.21     4.61      6.21      8.65      5.48      4.44      12
        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.45      累涨：19.46     4.97      6.39      8.78      5.34      4.37      13
        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.09      累涨：30.51     10.19     12.75     9.65      5.13      5.08      14
        XIAOFEI_COMMON.put("159793", "消费-通用             ");//线上消费ETF平安       市值：0.35      累涨：57.52     6.64      35.10     20.93     4.81      4.81      15
        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：18.31     累涨：21.77     4.71      9.20      8.82      4.59      4.21      16
        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.09      累涨：20.26     5.04      8.48      7.76      3.98      2.60      17
        XIAOFEI_COMMON.put("516600", "消费-通用             ");//消费服务ETF           市值：0.94      累涨：23.38     5.10      11.33     9.43      3.63      2.97      18
        XIAOFEI_COMMON.put("159725", "消费-通用             ");//线上消费ETF           市值：0.50      累涨：54.26     11.83     31.63     14.58     3.37      2.25      19
        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.72      累涨：18.38     6.77      6.00      5.61      3.18      1.93      20
        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.91      累涨：43.33     16.23     19.41     10.37     3.04      3.04      21
        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.57      累涨：17.48     6.53      5.80      5.25      2.95      1.76      22
        XIAOFEI_COMMON.put("159728", "消费-通用             ");//在线消费ETF           市值：0.61      累涨：56.35     14.25     31.76     14.32     2.86      2.10      23
        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.14      累涨：23.24     8.67      6.71      8.64      3.78      1.39      1
        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.71      累涨：18.50     6.53      7.61      5.63      2.43      1.27      1
        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.56      累涨：17.85     6.39      7.37      5.19      2.30      1.10      2
    }
    public static Map<String, String> XIAOFEI_HK = new HashMap<>();//消费-香港消费
    static {
        XIAOFEI_HK.put("159793", "消费-香港消费         ");//线上消费ETF平安       市值：0.38      累涨：53.28     2.50      34.36     17.96     9.44                1
        XIAOFEI_HK.put("159725", "消费-香港消费         ");//线上消费ETF           市值：0.50      累涨：53.61     5.93      34.00     17.93     8.53      1.12      2
        XIAOFEI_HK.put("159728", "消费-香港消费         ");//在线消费ETF           市值：0.63      累涨：54.70     8.74      31.56     19.07     8.50      0.76      3
        XIAOFEI_HK.put("159735", "消费-香港消费         ");//港股消费ETF           市值：5.49      累涨：58.19     7.60      28.19     24.79     7.88      0.11      4
        XIAOFEI_HK.put("513230", "消费-香港消费         ");//港股消费ETF           市值：2.79      累涨：55.43     6.11      28.83     22.93     7.20      0.18      5
        XIAOFEI_HK.put("513590", "消费-香港消费         ");//香港消费ETF           市值：5.65      累涨：58.00     5.60      27.11     27.97     7.03      0.10      6
        XIAOFEI_HK.put("513070", "消费-香港消费         ");//港股消费ETF易方达     市值：3.26      累涨：55.80     7.47      27.80     23.21     7.01      0.35      7
        XIAOFEI_HK.put("513970", "消费-香港消费         ");//恒生消费ETF           市值：9.10      累涨：32.70     5.79      14.00     13.50     6.78      2.18      8
        XIAOFEI_HK.put("520520", "消费-香港消费         ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：33.95     6.79      14.21     14.07     6.76      2.05      9
        XIAOFEI_HK.put("517550", "消费-香港消费         ");//消费ETF沪港深         市值：0.42      累涨：39.40     7.69      16.09     16.32     6.20      1.30      10
        XIAOFEI_HK.put("159699", "消费-香港消费         ");//恒生消费ETF           市值：11.70     累涨：33.04     6.63      14.72     12.56     5.36      2.60      11
        XIAOFEI_HK.put("517880", "消费-香港消费         ");//品牌消费ETF           市值：0.39      累涨：26.62     7.28      10.68     9.71      5.32      2.57      12
    }
    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒
    static {
        XIAOFEI_MEDIA.put("159855", "消费-文娱传媒         ");//影视ETF               市值：0.60      累涨：56.53     9.41      33.61     13.51     6.89      0.10      1
        XIAOFEI_MEDIA.put("516620", "消费-文娱传媒         ");//影视ETF               市值：0.57      累涨：56.99     9.84      33.97     13.18     6.76                2
        XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：16.49     累涨：61.86     10.82     38.08     12.96     5.56                3
        XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.36      累涨：62.99     10.82     38.54     13.63     5.44                4
        XIAOFEI_MEDIA.put("159869", "消费-文娱传媒         ");//游戏ETF               市值：51.74     累涨：62.10     10.65     38.14     13.31     5.43                5
        XIAOFEI_MEDIA.put("517770", "消费-文娱传媒         ");//游戏传媒ETF           市值：0.30      累涨：51.15     8.60      26.72     15.83     5.34      1.41      6
        XIAOFEI_MEDIA.put("159805", "消费-文娱传媒         ");//传媒ETF               市值：1.78      累涨：49.33     10.90     25.53     12.90     4.66      0.33      7
        XIAOFEI_MEDIA.put("516190", "消费-文娱传媒         ");//文娱传媒ETF           市值：0.21      累涨：45.70     9.72      24.63     11.35     4.66                8
        XIAOFEI_MEDIA.put("512980", "消费-文娱传媒         ");//传媒ETF               市值：24.76     累涨：48.63     10.40     25.08     13.15     4.64      0.34      9
    }
    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐
    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.03      累涨：24.72     8.20      8.90      8.52      3.61      3.32      1
        XIAOFEI_WINE.put("159766", "消费-吃喝玩乐         ");//旅游ETF               市值：29.74     累涨：25.39     8.73      9.58      8.44      3.35      3.35      2
        XIAOFEI_WINE.put("515170", "消费-吃喝玩乐         ");//食品饮料ETF           市值：34.33     累涨：25.93     4.26      10.20     11.47     1.52      1.52      3
        XIAOFEI_WINE.put("159862", "消费-吃喝玩乐         ");//食品ETF               市值：0.46      累涨：25.84     4.22      10.83     10.79     1.44      1.44      4
        XIAOFEI_WINE.put("159736", "消费-吃喝玩乐         ");//饮食ETF               市值：48.74     累涨：24.60     4.53      9.83      10.24     1.39      1.39      5
        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：122.74    累涨：32.32     7.10      13.17     12.05     1.28      1.28      6
        XIAOFEI_WINE.put("515710", "消费-吃喝玩乐         ");//食品ETF               市值：9.31      累涨：25.59     4.68      9.62      11.29     1.27      1.27      7
        XIAOFEI_WINE.put("516900", "消费-吃喝玩乐         ");//食品饮料ETF基金       市值：1.00      累涨：29.38     4.70      12.03     12.65     1.12      1.12      8
        XIAOFEI_WINE.put("159843", "消费-吃喝玩乐         ");//食品饮料ETF           市值：3.06      累涨：25.84     4.41      10.56     10.87     1.04      1.04      9
        XIAOFEI_WINE.put("159378", "消费-吃喝玩乐         ");//通用航空ETF           市值：5.82      累涨：34.85     7.13      21.17     8.90      0.53                10
    }
    public static Map<String, String> XIAOFEI_HOUSE = new HashMap<>();//消费-家电
    static {
        XIAOFEI_HOUSE.put("159996", "消费-家电             ");//家电ETF               市值：16.64     累涨：34.63     10.38     15.76     10.10     6.03      2.86      1
        XIAOFEI_HOUSE.put("561120", "消费-家电             ");//家电ETF               市值：1.12      累涨：34.03     10.10     15.84     9.57      5.48      2.81      2
        XIAOFEI_HOUSE.put("159328", "消费-家电             ");//家电ETF易方达         市值：1.28      累涨：30.95     9.93      14.13     8.98      4.74      2.60      3
        XIAOFEI_HOUSE.put("560880", "消费-家电             ");//家电ETF龙头           市值：4.52      累涨：32.26     10.43     15.21     9.04      4.68      2.54      4
        XIAOFEI_HOUSE.put("159730", "消费-家电             ");//龙头家电ETF           市值：0.51      累涨：25.56     6.86      13.02     7.77      4.10      1.81      5
    }
    public static Map<String, String> XIAOFEI = new HashMap<>();
    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_MEDIA);
        XIAOFEI.putAll(XIAOFEI_WINE);
        XIAOFEI.putAll(XIAOFEI_HOUSE);
//        XIAOFEI.putAll(XIAOFEI_TRAVEL);
    }


    /**
     * 医疗
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗
    static {
        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：3.64      累涨：63.61     15.79     23.34     25.41     14.21     7.27      1
        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：7.86      累涨：63.14     15.60     23.25     25.79     14.10     6.57      2
        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：94.96     累涨：61.38     15.78     21.94     25.12     13.68     6.20      3
        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：20.23     累涨：64.95     17.06     23.56     25.52     13.56     6.44      4
        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：4.17      累涨：65.31     16.88     24.78     24.52     13.53     6.05      5
        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：1.71      累涨：62.77     14.44     25.35     24.51     13.13     6.12      6
        YILIAO_COMMON.put("159316", "医疗-通用             ");//恒生创新药ETF         市值：1.84      累涨：12.92                         12.92     12.92     5.91      7
        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：15.52     累涨：63.76     16.74     24.38     24.16     12.86     5.61      8
        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：2.30      累涨：59.41     16.26     21.94     22.47     12.03     5.34      9
        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.21      累涨：57.86     15.09     22.63     21.66     11.07     4.88      10
        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：39.52     累涨：58.50     14.61     23.99     21.10     11.03     5.13      11
        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：2.71      累涨：46.35     13.37     16.22     17.12     10.51     5.64      12
        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：1.80      累涨：55.78     15.47     22.85     19.45     10.48     5.06      13
        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.16      累涨：55.15     15.55     21.51     19.75     10.38     5.05      14
        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.19      累涨：55.65     15.33     22.52     19.40     10.30     5.06      15
        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：8.12      累涨：56.32     16.70     23.44     18.29     9.79      4.60      16
        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：30.93     累涨：57.01     16.68     23.52     18.64     9.77      4.53      17
        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：109.01    累涨：54.89     14.50     23.70     18.44     9.70      4.85      18
        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：2.66      累涨：46.05     13.54     16.62     16.29     9.50      4.84      19
        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：1.84      累涨：45.95     14.21     16.06     16.31     9.44      4.61      20
        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药沪深港ETF       市值：2.59      累涨：45.36     13.42     16.50     16.20     9.40      4.24      21
        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药沪港深ETF       市值：3.40      累涨：41.99     12.27     15.88     14.97     9.26      4.26      22
        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：1.04      累涨：57.78     17.90     24.07     18.16     9.26      4.42      23
        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：4.12      累涨：42.81     12.73     20.38     12.66     8.52      4.82      24
        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：37.34     累涨：36.53     10.78     13.44     13.46     8.43      4.53      25
        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：3.32      累涨：40.94     13.27     18.01     12.12     8.38      4.67      26
        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：2.08      累涨：35.41     10.43     13.69     12.76     8.17      3.95      27
        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.16      累涨：35.05     10.52     13.26     12.75     8.09      4.35      28
        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.00      累涨：35.62     10.81     13.15     12.59     7.93      4.36      29
        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.34      累涨：34.49     10.38     12.50     12.68     7.89      4.15      30
        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：106.71    累涨：35.83     10.28     13.87     12.54     7.80      4.19      31
        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：1.08      累涨：36.50     11.94     13.39     12.63     7.77      3.93      32
        YILIAO_COMMON.put("588250", "医疗-通用             ");//科创生物医药ETF       市值：3.17      累涨：7.72                          7.72      7.72      4.01      33
        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.38      累涨：35.37     11.15     12.96     11.80     6.62      3.39      34
        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.35      累涨：29.96     9.19      11.11     10.40     6.50      3.34      35
        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.57      累涨：32.08     11.30     12.55     9.71      6.15      4.21      36
        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：12.23     累涨：37.31     13.43     15.03     10.43     5.87      3.46      37
        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.19      累涨：31.18     11.08     12.45     9.54      5.85      3.69      38
        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：16.31     累涨：33.51     9.96      13.33     11.41     5.83      3.19      39
        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.14      累涨：32.04     10.76     13.48     10.34     5.80      3.31      40
        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.12      累涨：29.03     9.31      10.80     10.72     5.80      3.22      41
        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.83      累涨：29.22     9.38      10.59     10.21     5.78      3.00      42
        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：47.04     累涨：28.46     9.41      11.14     9.40      5.67      3.23      43
        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.31      累涨：35.98     12.51     14.90     10.10     5.67      3.56      44
        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：2.05      累涨：29.85     9.42      11.32     10.42     5.65      3.09      45
        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.73      累涨：37.06     13.32     15.48     10.00     5.63      3.11      46
        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.02      累涨：37.01     12.64     15.63     10.32     5.58      3.37      47
        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.79      累涨：30.37     8.91      13.14     10.61     5.55      3.11      48
        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：214.19    累涨：31.34     9.62      12.57     10.28     5.54      3.31      49
        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.17      累涨：30.39     12.20     10.51     9.35      5.44      3.33      50
        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：21.90     累涨：29.20     9.87      11.65     9.28      5.33      2.97      51
        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.53      累涨：30.01     10.62     11.56     9.38      5.30      3.25      52
        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：32.15     累涨：35.17     11.83     14.63     10.39     5.22      3.58      53
        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：36.49     累涨：35.66     12.94     13.80     10.23     5.21      2.96      54
        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：7.06      累涨：28.39     9.00      10.76     10.04     5.05      2.74      55
        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.42      累涨：33.82     11.00     13.70     10.72     4.99      2.89      56
        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：5.50      累涨：31.89     10.47     13.27     9.64      4.70      3.24      57
        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：8.90      累涨：40.87     14.50     20.94     9.31      4.59      2.82      58
        YILIAO_COMMON.put("159647", "医疗-通用             ");//中药ETF               市值：7.70      累涨：20.08     8.28      5.55      7.19      4.15      3.22      59
        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.62      累涨：31.33     11.79     16.08     7.73      4.15      2.38      60
        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：21.78     累涨：41.09     14.68     21.59     8.97      4.07      2.40      61
        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：15.40     累涨：42.38     14.77     22.20     8.78      4.03      2.50      62
        YILIAO_COMMON.put("560080", "医疗-通用             ");//中药ETF               市值：21.03     累涨：20.22     8.52      5.06      7.52      4.03      3.17      63
        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.71      累涨：31.77     12.36     15.64     7.01      4.03      2.89      64
        YILIAO_COMMON.put("562390", "医疗-通用             ");//中药50ETF             市值：0.64      累涨：20.07     8.58      4.44      7.37      3.99      2.94      65
        YILIAO_COMMON.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.87      累涨：19.31     8.33      4.68      7.00      3.93      3.15      66
        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：16.28     累涨：31.28     12.44     15.39     6.94      3.93      2.70      67
        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：240.96    累涨：40.16     13.66     21.06     8.75      3.85      2.38      68
        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.68      累涨：33.00     12.93     16.64     7.43      3.63      2.43      69
        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.84      累涨：36.45     12.84     20.17     7.60      3.55      2.72      70
        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.77      累涨：33.15     11.07     18.71     7.00      3.30      2.44      71
        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.85      累涨：34.60     12.57     19.17     7.04      3.15      2.28      72
        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.09      累涨：33.75     13.01     18.40     6.88      2.97      2.28      73
        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.11      累涨：32.32     13.06     18.01     6.14      2.78      2.32      74
        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：10.63     累涨：24.23     13.73     5.60      5.22      1.48                75
        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：12.22     累涨：25.16     13.98     6.74      4.61      1.28                76
        YILIAO_COMMON.put("159217", "医疗-通用             ");//港股通创新药ETF工银   市值：13.52     累涨：                                                            77
    }
    public static Map<String, String> YILIAO = new HashMap<>();//医疗
    static {
        YILIAO.putAll(YILIAO_COMMON);
    }

    /**
     * 科技-工业
     */
    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();
    static {
        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：32.52     累涨：40.87     9.22      15.14     16.51     10.53     8.19      1
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：68.16     累涨：38.12     9.60      14.85     13.67     8.71      7.53      2
        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：116.81    累涨：38.59     9.36      15.61     13.62     8.02      6.56      3
        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：8.42      累涨：38.34     9.48      15.59     13.27     7.63      6.51      4
        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.80      累涨：37.57     9.36      15.72     12.49     7.63      6.11      5
        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：36.49     累涨：37.94     9.40      15.51     13.03     7.56      6.32      6
    }
    /**
     * 科技-工业
     */
    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();
    static {
        KEJI_GONG_YE.put("517360", "科技-工业             ");//沪港深科技ETF         市值：0.49      累涨：54.39     9.39      24.04     20.96     9.98      6.17      1
        KEJI_GONG_YE.put("159723", "科技-工业             ");//科技龙头ETF           市值：0.77      累涨：53.03     10.09     24.38     18.56     8.34      4.54      2
        KEJI_GONG_YE.put("159667", "科技-工业             ");//工业母机ETF           市值：5.17      累涨：57.60     18.83     20.55     19.35     7.90      4.11      3
        KEJI_GONG_YE.put("159663", "科技-工业             ");//机床ETF               市值：0.86      累涨：55.74     18.35     20.36     18.53     7.51      3.69      4
        KEJI_GONG_YE.put("515860", "科技-工业             ");//科技ETF基金           市值：1.88      累涨：45.83     15.04     18.63     12.64     7.17      3.16      5
        KEJI_GONG_YE.put("515000", "科技-工业             ");//科技ETF               市值：32.35     累涨：48.50     16.38     19.25     12.87     6.87      3.30      6
        KEJI_GONG_YE.put("516050", "科技-工业             ");//科技龙头ETF           市值：4.36      累涨：48.89     16.32     19.09     13.61     6.81      3.35      8
        KEJI_GONG_YE.put("517660", "科技-工业             ");//物联网沪港深ETF       市值：0.44      累涨：50.10     12.41     21.04     16.65     6.43      3.66      9
        KEJI_GONG_YE.put("512770", "科技-工业             ");//战略新兴ETF           市值：2.17      累涨：37.35     10.39     15.43     11.68     6.31      3.51      10
        KEJI_GONG_YE.put("560990", "科技-工业             ");//中金科技先锋ETF       市值：0.31      累涨：37.98     12.78     14.62     10.80     6.13      2.62      11
        KEJI_GONG_YE.put("159709", "科技-工业             ");//物联网ETF工银         市值：0.81      累涨：50.67     15.75     22.13     13.83     6.10      2.74      12
        KEJI_GONG_YE.put("516800", "科技-工业             ");//智能制造ETF           市值：1.78      累涨：52.68     17.05     21.51     14.53     6.07      2.36      13
        KEJI_GONG_YE.put("561130", "科技-工业             ");//国货ETF               市值：1.74      累涨：25.96     7.40      9.38      9.18      6.06      3.78      14
        KEJI_GONG_YE.put("159638", "科技-工业             ");//高端装备ETF           市值：11.60     累涨：39.62     12.43     15.68     14.42     6.01      0.12      15
        KEJI_GONG_YE.put("510770", "科技-工业             ");//G60创新ETF            市值：0.17      累涨：37.02     10.73     15.47     10.82     5.90      2.35      16
        KEJI_GONG_YE.put("515750", "科技-工业             ");//科技50ETF             市值：6.88      累涨：45.13     13.60     19.48     12.39     5.85      2.69      17
        KEJI_GONG_YE.put("159773", "科技-工业             ");//创业板科技ETF         市值：2.36      累涨：39.46     8.88      19.74     11.23     5.71      2.94      18
        KEJI_GONG_YE.put("159896", "科技-工业             ");//物联网ETF南方         市值：0.53      累涨：49.84     16.86     20.59     12.85     5.71      3.06      19
        KEJI_GONG_YE.put("159895", "科技-工业             ");//物联网ETF易方达       市值：0.72      累涨：48.74     17.31     19.42     12.44     5.55      2.97      20
        KEJI_GONG_YE.put("515200", "科技-工业             ");//创新100ETF            市值：1.76      累涨：37.75     10.21     17.33     10.58     5.47      2.45      21
        KEJI_GONG_YE.put("159786", "科技-工业             ");//VRETF                 市值：1.36      累涨：53.62     18.13     25.55     11.37     5.31      3.25      22
        KEJI_GONG_YE.put("159621", "科技-工业             ");//MSCIESGETF            市值：0.27      累涨：22.11     6.32      7.78      8.01      5.17      3.14      23
        KEJI_GONG_YE.put("159717", "科技-工业             ");//ESGETF                市值：0.57      累涨：21.25     5.26      8.14      7.85      5.11      3.06      24
        KEJI_GONG_YE.put("560170", "科技-工业             ");//央企科技ETF           市值：14.26     累涨：40.63     13.65     14.76     12.68     5.10      1.01      25
        KEJI_GONG_YE.put("560280", "科技-工业             ");//工程机械ETF           市值：2.10      累涨：38.99     9.08      15.67     14.63     5.04      2.47      26
        KEJI_GONG_YE.put("515090", "科技-工业             ");//可持续发展ETF         市值：0.07      累涨：22.86     6.55      8.31      8.00      5.00      3.33      27
        KEJI_GONG_YE.put("159542", "科技-工业             ");//工程机械ETF           市值：0.11      累涨：40.46     9.77      16.13     14.82     5.00      2.36      28
        KEJI_GONG_YE.put("563050", "科技-工业             ");//央企科技50ETF         市值：2.93      累涨：38.86     13.60     14.07     11.63     5.00      0.85      29
        KEJI_GONG_YE.put("516720", "科技-工业             ");//ESGETF                市值：0.25      累涨：23.64     7.24      7.89      8.74      4.99      3.51      30
        KEJI_GONG_YE.put("515580", "科技-工业             ");//科技100ETF            市值：4.42      累涨：39.18     13.03     16.43     10.40     4.94      2.18      32
        KEJI_GONG_YE.put("159701", "科技-工业             ");//物联网ETF招商         市值：0.23      累涨：46.57     15.84     19.41     11.66     4.89      2.94      33
        KEJI_GONG_YE.put("516330", "科技-工业             ");//物联网ETF             市值：0.46      累涨：50.06     17.60     21.27     11.74     4.88      2.56      34
        KEJI_GONG_YE.put("159777", "科技-工业             ");//创科技ETF             市值：1.01      累涨：36.76     8.11      19.01     9.64      4.84      2.22      35
        KEJI_GONG_YE.put("560650", "科技-工业             ");//核心50ETF             市值：0.11      累涨：25.38     7.09      8.06      10.83     4.73      2.36      36
        KEJI_GONG_YE.put("562380", "科技-工业             ");//央企科技引领ETF       市值：2.52      累涨：38.86     12.96     14.69     11.76     4.61      0.98      37
        KEJI_GONG_YE.put("563210", "科技-工业             ");//专精特新ETF           市值：0.35      累涨：31.18               16.85     16.11     4.60      2.02      38
        KEJI_GONG_YE.put("516260", "科技-工业             ");//物联网50ETF           市值：1.07      累涨：47.94     16.89     20.30     11.18     4.59      2.86      39
        KEJI_GONG_YE.put("159653", "科技-工业             ");//ESG300ETF             市值：0.59      累涨：19.73     5.65      7.38      6.70      4.57      2.62      40
        KEJI_GONG_YE.put("159807", "科技-工业             ");//科技ETF               市值：9.65      累涨：37.08     12.54     14.21     10.33     4.54      1.90      41
        KEJI_GONG_YE.put("561500", "科技-工业             ");//漂亮50ETF             市值：0.71      累涨：25.72     7.41      8.79      10.13     4.51      2.10      42
        KEJI_GONG_YE.put("159791", "科技-工业             ");//300ESGETF             市值：0.35      累涨：21.44     6.57      8.31      7.45      4.36      2.76      43
        KEJI_GONG_YE.put("516830", "科技-工业             ");//300ESGETF             市值：1.64      累涨：20.56     5.98      7.27      7.43      4.36      2.71      44
        KEJI_GONG_YE.put("561900", "科技-工业             ");//沪深300ESGETF         市值：0.51      累涨：20.13     5.76      7.45      6.92      4.30      2.98      45
        KEJI_GONG_YE.put("560180", "科技-工业             ");//沪深300ESGETF南方     市值：0.34      累涨：19.64     5.71      7.11      6.82      4.06      2.77      46
        KEJI_GONG_YE.put("510990", "科技-工业             ");//180ESGETF             市值：0.48      累涨：19.26     6.38      6.15      6.73      3.92      2.45      47
        KEJI_GONG_YE.put("516960", "科技-工业             ");//机械ETF               市值：0.20      累涨：25.14     6.73      10.30     8.11      3.79      2.62      48
        KEJI_GONG_YE.put("516320", "科技-工业             ");//高端装备ETF           市值：0.86      累涨：25.53     6.64      10.83     8.06      3.54      1.84      49
        KEJI_GONG_YE.put("562910", "科技-工业             ");//高端制造ETF           市值：1.09      累涨：24.72     6.10      10.82     7.80      3.49      1.67      50
        KEJI_GONG_YE.put("510090", "科技-工业             ");//ESGETF基金            市值：0.80      累涨：19.16     6.05      6.25      6.86      3.46      2.09      51
        KEJI_GONG_YE.put("159886", "科技-工业             ");//机械ETF               市值：0.57      累涨：27.07     6.37      11.95     8.75      3.42      2.29      52
        KEJI_GONG_YE.put("510160", "科技-工业             ");//产业升级ETF           市值：2.42      累涨：18.50     6.86      6.83      4.81      2.76      2.16      53
        KEJI_GONG_YE.put("159206", "科技-工业             ");//卫星ETF               市值：1.47      累涨：1.20                          1.20      1.20      1.20      54
        KEJI_GONG_YE.put("511900", "科技-工业             ");//富国货币ETF           市值：1.59      累涨：0.11      0.03      0.05      0.03      0.02      0.01      55
    }
    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件
    static {
        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：26.83     累涨：70.14     30.51     24.94     14.69     10.08     7.11      1
        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：4.77      累涨：54.28     16.47     23.68     14.13     9.87      7.26      2
        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：7.32      累涨：66.32     28.29     23.72     14.31     9.85      7.34      3
        KEJI_RUAN_JIAN.put("589520", "科技-软件             ");//科创人工智能ETF华宝   市值：2.58      累涨：14.24                         14.24     9.70      7.41      4
        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：13.44     累涨：57.17     17.58     25.44     14.15     9.60      7.34      5
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：14.50     累涨：68.96     31.95     24.08     12.93     8.91      7.88      6
        KEJI_RUAN_JIAN.put("159388", "科技-软件             ");//创业板人工智能ETF国泰 市值：2.53      累涨：8.89                          8.89      8.89      8.89      7
        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.39      累涨：51.13     19.15     20.34     11.64     8.45      7.12      8
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：41.59     累涨：66.54     32.23     20.81     13.50     8.36      6.76      9
        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.63      累涨：65.00     31.73     20.85     12.42     8.11      6.74      10
        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：8.65      累涨：66.29     32.34     21.07     12.88     8.01      6.70      11
        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：2.83      累涨：51.18     19.72     20.14     11.32     7.86      6.24      12
        KEJI_RUAN_JIAN.put("588770", "科技-软件             ");//科创信息技术ETF摩根   市值：3.72      累涨：8.55                          8.55      7.85      6.53      13
        KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：2.24      累涨：7.79                          7.79      7.79      7.14      14
        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：0.71      累涨：55.73     24.48     20.82     10.43     7.52      7.44      15
        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.76      累涨：71.73     35.31     26.01     10.41     7.48      6.17      16
        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：1.70      累涨：57.75     25.94     21.87     9.94      7.37      6.73      17
        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.60      累涨：58.83     28.79     20.81     9.23      7.22      6.69      18
        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：7.12      累涨：59.98     25.11     23.85     11.02     7.01      6.25      19
        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：0.55      累涨：55.96     24.21     22.40     9.35      6.99      5.93      20
        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：15.16     累涨：50.05     23.83     16.04     10.18     6.95      6.34      21
        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.22      累涨：62.65     26.75     24.38     11.52     6.89      5.76      22
        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：5.45      累涨：66.19     29.22     25.57     11.40     6.89      5.90      23
        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.87      累涨：56.58     24.18     22.95     9.45      6.89      5.60      24
        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：118.81    累涨：63.89     27.53     24.54     11.82     6.88      5.76      25
        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：5.39      累涨：53.98     25.21     17.24     11.53     6.87      6.00      26
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：5.83      累涨：72.08     34.39     27.97     9.72      6.83      5.59      27
        KEJI_RUAN_JIAN.put("560630", "科技-软件             ");//机器人产业ETF         市值：5.04      累涨：6.79                          6.79      6.79      5.76      28
        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.70      累涨：59.65     29.06     21.67     8.92      6.78      6.45      29
        KEJI_RUAN_JIAN.put("560800", "科技-软件             ");//数字经济ETF           市值：7.53      累涨：51.20     21.91     19.76     9.53      6.76      6.12      30
        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：46.82     累涨：63.25     27.09     24.63     11.53     6.65      5.68      31
        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：18.64     累涨：56.55     24.60     22.08     9.87      6.63      5.82      32
        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：4.17      累涨：69.64     33.59     27.52     8.53      6.57      5.75      33
        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：31.20     累涨：67.48     33.11     25.47     8.90      6.42      5.40      34
        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.12      累涨：62.97     27.13     24.80     11.04     6.39      5.15      35
        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：6.02      累涨：66.49     32.74     24.87     8.88      6.33      5.45      36
        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：2.66      累涨：68.19     35.00     25.12     8.07      6.33      6.04      37
        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：4.90      累涨：68.36     33.78     25.68     8.90      6.28      5.52      38
        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：48.22     累涨：55.05     24.47     21.16     9.42      6.25      5.68      39
        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//云计算50ETF           市值：1.22      累涨：64.83     31.74     24.49     8.60      6.22      5.55      40
        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.30      累涨：68.05     33.80     25.38     8.87      6.20      5.75      41
        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算沪港深ETF       市值：2.85      累涨：76.59     37.31     29.94     9.34      6.11      5.93      42
        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.33      累涨：46.10     22.44     15.10     8.56      6.11      5.89      43
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人50ETF           市值：4.20      累涨：59.15     24.91     24.35     9.89      6.10      5.43      44
        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：18.08     累涨：68.97     33.18     27.60     8.19      6.09      5.32      45
        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：146.98    累涨：56.47     24.92     22.26     9.29      6.04      5.41      46
        KEJI_RUAN_JIAN.put("589010", "科技-软件             ");//科创人工智能ETF华夏   市值：2.29      累涨：5.98                          5.98      5.98      5.98      47
        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：30.13     累涨：56.42     25.70     21.92     8.80      5.96      5.56      48
        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.15      累涨：67.31     32.58     26.78     7.95      5.95      5.53      49
        KEJI_RUAN_JIAN.put("159658", "科技-软件             ");//数字经济ETF           市值：2.12      累涨：49.62     21.42     19.22     8.98      5.91      5.26      50
        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：0.59      累涨：66.90     34.54     24.90     7.46      5.84      5.54      51
        KEJI_RUAN_JIAN.put("159586", "科技-软件             ");//计算机ETF南方         市值：2.40      累涨：67.42     37.08     22.49     7.85      5.82      5.58      52
        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.62      累涨：64.51     34.89     21.30     8.32      5.76      5.01      53
        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.01      累涨：65.72     35.37     22.30     8.05      5.74      5.18      54
        KEJI_RUAN_JIAN.put("159998", "科技-软件             ");//计算机ETF             市值：27.19     累涨：60.48     30.45     22.01     8.02      5.63      4.97      55
        KEJI_RUAN_JIAN.put("512720", "科技-软件             ");//计算机ETF             市值：10.51     累涨：61.79     31.11     22.49     8.19      5.43      4.88      56
        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.30      累涨：65.17     36.24     21.64     7.29      5.42      5.06      57
        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：0.89      累涨：55.09     25.83     21.43     7.83      5.36      4.37      58
        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：4.40      累涨：69.11     35.77     26.51     6.83      5.32      4.87      59
        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.59      累涨：66.55     37.10     22.36     7.09      5.30      4.67      60
        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：13.01     累涨：64.92     35.02     22.57     7.33      5.14      4.54      61
        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：27.17     累涨：65.54     36.38     21.86     7.30      5.08      4.47      62
        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：2.96      累涨：61.41     34.97     19.07     7.37      5.05      4.44      63
        KEJI_RUAN_JIAN.put("513360", "科技-软件             ");//教育ETF               市值：6.54      累涨：62.84     37.79     16.38     9.52      3.41      1.94      64
    }
    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片
    static {
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：1.98      累涨：60.76     3.40      26.55     31.40     22.03     7.89      1
        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.25      累涨：62.59     16.13     19.31     27.53     18.54     7.05      2
        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：4.99      累涨：63.15     15.73     20.24     27.65     18.44     7.34      3
        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：24.86     累涨：62.47     15.61     19.83     27.50     17.80     6.98      4
        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：225.55    累涨：63.38     15.98     20.20     27.66     17.79     6.94      5
        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：12.78     累涨：49.28     1.67      21.07     26.74     17.52     6.42      6
        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.72      累涨：56.65               14.34     42.78     16.69     6.00      7
        KEJI_XIN_PIAN.put("159511", "科技-芯片             ");//通信ETF南方           市值：0.97      累涨：53.68     12.50     16.86     25.63     14.95     4.86      8
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.56      累涨：70.39     19.54     24.68     26.84     14.88     6.20      9
        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.12      累涨：60.38     15.32     19.67     26.05     14.27     6.47      10
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.72      累涨：68.33     19.17     24.74     25.02     14.26     6.17      11
        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片产业ETF           市值：9.59      累涨：57.35     14.31     19.79     23.58     13.83     5.99      12
        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：256.43    累涨：57.63     14.57     19.80     23.81     13.51     5.60      13
        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.47     累涨：56.19     14.11     18.95     23.77     13.50     5.77      14
        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：12.78     累涨：58.45     14.85     20.39     23.47     13.41     5.64      15
        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：46.34     累涨：57.45     14.56     19.70     23.81     13.39     5.17      16
        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.16      累涨：56.21     14.81     18.72     23.22     13.30     5.54      17
        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：117.03    累涨：57.51     14.35     20.03     23.56     13.23     5.68      18
        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.10     累涨：57.21     15.08     19.68     22.91     13.18     5.41      19
        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：215.10    累涨：58.81     14.78     20.68     23.54     13.05     5.85      20
        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：5.03      累涨：58.55     15.24     20.78     22.93     13.00     5.54      21
        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.78      累涨：55.43     14.29     19.44     22.50     12.43     5.40      22
        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.41      累涨：54.04     13.83     18.93     21.61     12.27     5.26      23
        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.10      累涨：50.57     10.56     18.09     22.07     11.50     5.75      24
        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.58      累涨：47.83     10.08     16.36     21.39     11.14     5.33      25
        KEJI_XIN_PIAN.put("159695", "科技-芯片             ");//通信ETF               市值：1.15      累涨：52.36     12.00     20.83     21.20     10.66     5.11      26
        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：4.30      累涨：54.64     13.34     21.83     20.77     10.25     5.02      27
        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.20      累涨：43.58     8.12      16.09     19.45     10.13     5.53      28
        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.85      累涨：44.68     7.61      18.25     18.82     10.00     5.24      29
        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：15.77     累涨：52.19     13.30     20.39     19.53     9.85      4.60      30
        KEJI_XIN_PIAN.put("159811", "科技-芯片             ");//5G50ETF               市值：1.14      累涨：56.42     14.70     22.28     21.48     9.72      4.12      31
        KEJI_XIN_PIAN.put("159583", "科技-芯片             ");//通信设备ETF           市值：0.77      累涨：57.12     15.00     23.72     20.20     9.58      4.59      32
        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：2.00      累涨：50.12     13.07     19.47     18.39     9.37      4.53      33
        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：5.08      累涨：49.14     13.11     19.18     18.03     9.12      4.41      34
        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.89      累涨：42.52     8.01      16.87     17.82     9.10      5.00      35
        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.33      累涨：41.16     8.45      15.50     17.49     8.95      4.81      36
        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：21.04     累涨：42.68     8.17      16.58     18.12     8.85      4.96      37
        KEJI_XIN_PIAN.put("515880", "科技-芯片             ");//通信ETF               市值：33.58     累涨：60.41     16.05     27.24     19.93     8.82      4.38      38
        KEJI_XIN_PIAN.put("515050", "科技-芯片             ");//5G通信ETF             市值：65.17     累涨：60.51     16.88     26.32     19.36     8.42      4.05      39
        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.77      累涨：52.32     14.64     21.51     17.09     8.31      3.58      40
        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.13      累涨：53.42     14.00     24.03     17.98     8.24      3.69      41
        KEJI_XIN_PIAN.put("159994", "科技-芯片             ");//5GETF                 市值：15.24     累涨：60.01     16.77     26.41     18.59     8.23      3.99      42
        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.90      累涨：52.67     14.77     21.76     16.94     7.78      3.32      43
        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：4.27      累涨：45.83     11.60     18.65     16.72     7.73      4.44      44
        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：5.20      累涨：52.21     14.50     21.35     17.55     7.71      3.35      45
        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：2.07      累涨：44.42     12.23     18.44     14.97     7.33      3.71      46
        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.76      累涨：49.83     14.75     20.27     16.13     6.43      2.42      47
        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：5.94      累涨：41.00     8.95      17.76     14.75     5.90      1.95      48
        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：23.86     累涨：53.79     14.83     24.60     14.93     5.27      3.07      49
        KEJI_XIN_PIAN.put("589100", "科技-芯片           ");//科创芯片ETF国泰       市值：2.54      累涨：                                                            86
    }

    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();
    static {
        KEJI_TONG_XIN.put("159811", "科技-通信             ");//5G50ETF               市值：1.14      累涨：58.19     19.59     23.22     15.67     7.71      4.13      1
        KEJI_TONG_XIN.put("159994", "科技-通信             ");//5GETF                 市值：15.44     累涨：59.58     20.75     25.37     14.25     7.21      4.08      2
        KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：33.92     累涨：59.98     19.15     26.77     14.06     7.18      3.81      3
        KEJI_TONG_XIN.put("159511", "科技-通信             ");//通信ETF南方           市值：0.90      累涨：52.21     13.53     19.65     19.03     7.18      2.81      4
        KEJI_TONG_XIN.put("515050", "科技-通信             ");//5G通信ETF             市值：65.93     累涨：59.49     20.21     25.97     13.96     6.94      3.77      5
        KEJI_TONG_XIN.put("159583", "科技-通信             ");//通信设备ETF           市值：0.88      累涨：56.88     18.23     24.10     15.04     6.94      3.02      6
        KEJI_TONG_XIN.put("159507", "科技-通信             ");//电信ETF               市值：0.46      累涨：53.00     15.32     23.05     14.63     6.60      3.29      7
        KEJI_TONG_XIN.put("159695", "科技-通信             ");//通信ETF               市值：1.17      累涨：52.24     14.94     22.32     14.98     6.52      3.26      8
        KEJI_TONG_XIN.put("563010", "科技-通信             ");//电信ETF               市值：1.91      累涨：47.56     11.60     19.22     16.74     5.99      3.16      9
        KEJI_TONG_XIN.put("560690", "科技-通信             ");//电信ETF基金           市值：0.30      累涨：48.96     12.01     20.71     16.24     5.59      2.84      10
        KEJI_TONG_XIN.put("560300", "科技-通信             ");//电信50ETF             市值：0.90      累涨：48.14     11.04     18.79     18.39     4.38      2.87      11
    }
    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港科技
    static {
        KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：3.99      累涨：78.79     9.36      43.23     28.10     19.33     16.62     1
        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：3.67      累涨：63.99     14.15     35.28     17.07     6.52      2.74      2
        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：5.66      累涨：68.15     14.55     39.48     17.09     6.48      2.60      3
        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.60      累涨：69.39     15.32     39.10     17.47     6.44      2.96      4
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：112.93    累涨：70.25     14.20     40.58     18.02     6.42      3.01      5
        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：4.68      累涨：66.59     13.98     38.89     16.47     6.13      3.03      6
        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：6.78      累涨：68.76     14.77     39.92     16.89     6.04      2.83      7
        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：52.85     累涨：66.56     12.95     36.46     20.66     5.88      1.60      8
        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：14.05     累涨：66.08     13.00     36.29     20.29     5.72      1.34      9
        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：4.82      累涨：81.44     17.08     50.25     16.67     5.62      2.69      10
        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：13.70     累涨：68.35     14.76     39.32     16.99     5.48      2.47      11
        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：172.66    累涨：68.28     14.57     38.99     18.02     5.46      2.48      12
        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：371.94    累涨：66.77     11.62     38.74     19.82     5.45      1.69      13
        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：35.64     累涨：65.78     15.56     36.09     17.60     5.38      2.33      14
        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：26.63     累涨：65.50     15.03     36.24     17.31     5.34      2.23      15
        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：244.72    累涨：66.18     15.35     36.48     17.50     5.16      2.00      16
        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：2.44      累涨：63.10     13.47     36.82     15.37     5.09      2.17      17
        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.77      累涨：62.97     12.92     34.50     18.53     5.05      1.21      18
        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：109.83    累涨：65.21     14.92     36.22     17.24     4.95      2.04      19
        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：236.88    累涨：65.40     14.96     36.78     16.74     4.93      1.96      20
        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：3.78      累涨：64.44     14.68     36.70     16.43     4.89      1.83      21
        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：8.02      累涨：65.26     11.29     35.75     20.85     4.89      1.93      22
        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：17.00     累涨：64.33     14.85     35.93     16.60     4.87      1.94      23
        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：42.82     累涨：65.79     15.31     36.65     17.23     4.85      1.86      24
        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：61.39     累涨：64.53     14.32     36.37     16.82     4.78      2.00      25
        KEJI_HK.put("517360", "科技-香港             ");//沪港深科技ETF         市值：0.41      累涨：52.96     11.72     28.71     14.53     4.65      1.90      26
        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：8.75      累涨：65.76     14.84     36.91     17.16     4.62      1.60      27
        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：228.25    累涨：65.22     11.59     36.43     20.02     4.31      1.18      28
        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：5.86      累涨：70.06     12.87     42.54     18.58     4.22      1.46      29
        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：389.29    累涨：70.55     12.20     43.00     18.86     4.01      1.35      30
        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：41.59     累涨：71.06     12.89     43.16     18.95     3.98      1.29      31
        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.68      累涨：70.95     12.40     42.98     18.97     3.91      0.81      32
        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：11.93     累涨：72.78     17.67     41.35     17.64     3.77      1.54      33
        KEJI_HK.put("517350", "科技-香港             ");//中概科技ETF           市值：0.92      累涨：51.81     13.55     28.68     11.81     3.31      1.38      34
        KEJI_HK.put("159723", "科技-香港             ");//科技龙头ETF           市值：0.73      累涨：50.88     13.96     27.80     11.69     3.28      1.09      35
        KEJI_HK.put("516050", "科技-香港             ");//科技龙头ETF           市值：4.19      累涨：43.90     15.20     20.08     9.93      2.25      1.29      36
        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.27      累涨：62.11     13.18     36.22     17.00     2.25      0.39      37
        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：4.47      累涨：57.72     12.01     34.64     14.78     2.05      0.60      38
        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：2.94      累涨：60.67     13.60     35.71     14.78     1.91      0.53      39
        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.82      累涨：58.84     12.58     34.25     14.69     1.59                40
        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.51      累涨：46.33     16.00     24.44     7.99      0.78      0.12      41
    }
    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源
    static {
        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.58      累涨：28.22     8.21      13.32     8.36      3.64      2.43      1
        KEJI_NEW_ENERGY.put("562960", "科技-新能源           ");//绿色电力ETF易方达     市值：0.83      累涨：14.57     3.61      5.16      5.80      3.61      1.94      2
        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.48      累涨：29.71     8.46      15.46     8.29      3.41      2.22      3
        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：105.91    累涨：32.80     8.95      17.46     8.86      3.34      2.15      4
        KEJI_NEW_ENERGY.put("560580", "科技-新能源           ");//电力ETF南方           市值：0.52      累涨：14.40     3.41      5.31      5.78      3.31      1.90      5
        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.18      累涨：14.70     3.79      4.73      6.18      3.30      1.93      6
        KEJI_NEW_ENERGY.put("561170", "科技-新能源           ");//绿色电力ETF           市值：1.63      累涨：15.19     4.07      5.24      5.88      3.30      1.93      7
        KEJI_NEW_ENERGY.put("159611", "科技-新能源           ");//电力ETF               市值：35.35     累涨：15.62     3.61      6.24      5.77      3.29      1.90      8
        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.64      累涨：30.29     9.12      15.71     7.47      3.24      1.96      9
        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：20.42     累涨：31.03     8.74      16.31     7.95      3.16      2.07      10
        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：0.94      累涨：14.40     3.53      5.41      5.46      3.15      1.57      11
        KEJI_NEW_ENERGY.put("561700", "科技-新能源           ");//电力ETF基金           市值：1.46      累涨：14.60     3.70      5.31      5.59      3.02      1.70      12
        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：2.35      累涨：29.35     8.58      15.64     6.93      3.01      1.73      13
        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：7.53      累涨：29.96     8.81      16.28     7.18      3.01      1.91      14
        KEJI_NEW_ENERGY.put("561560", "科技-新能源           ");//电力ETF               市值：5.59      累涨：14.09     3.25      5.44      5.49      2.99      1.66      15
        KEJI_NEW_ENERGY.put("562350", "科技-新能源           ");//电力指数ETF           市值：0.51      累涨：14.17     3.62      5.30      5.25      2.91      1.70      16
        KEJI_NEW_ENERGY.put("159625", "科技-新能源           ");//绿色电力ETF           市值：3.31      累涨：14.16     3.83      5.13      5.20      2.90      1.35      17
        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：3.74      累涨：31.10     8.30      17.00     8.15      2.90      1.88      18
        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.60      累涨：29.61     8.62      15.30     7.27      2.85      1.69      19
        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.43      累涨：29.21     8.44      15.04     7.40      2.76      1.85      20
        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.36      累涨：30.10     8.15      17.00     7.42      2.73      1.67      21
        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.50      累涨：36.16     8.40      20.30     10.13     2.57      1.48      22
        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.64      累涨：23.45     5.84      13.44     6.85      2.40      1.56      23
        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.69      累涨：20.56     5.14      11.09     6.50      2.34      1.45      24
        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.39      累涨：21.16     5.59      10.72     7.11      2.30      1.03      25
        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.20      累涨：18.82               10.37     9.49      2.30      1.17      26
        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：20.72     累涨：20.76     4.86      11.52     6.67      2.27      1.40      27
        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：2.84      累涨：20.43     5.12      10.78     6.69      2.21      1.11      28
        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：6.75      累涨：19.75     5.34      10.21     6.20      2.17      1.16      29
        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.64      累涨：19.13     5.46      10.28     5.91      2.15      1.62      30
        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：1.94      累涨：20.17     5.69      10.23     6.29      2.07      1.04      31
        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.93      累涨：20.76     5.83      10.78     6.66      2.02      0.89      32
        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.61      累涨：19.14     4.81      10.80     6.00      1.99      1.33      33
        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：0.97      累涨：26.60     7.21      14.51     8.16      1.93      1.30      34
        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.83      累涨：30.01     14.30     10.42     7.03      1.93      0.71      35
        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.35      累涨：30.16     14.69     10.60     6.91      1.93      0.92      36
        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：7.26      累涨：20.02     5.87      10.33     6.08      1.92      1.16      37
        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：11.10     累涨：20.14     5.85      10.35     6.47      1.91      1.03      38
        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：3.19      累涨：24.69     7.43      13.51     6.94      1.89      1.27      39
        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.15      累涨：27.07     7.22      15.15     7.32      1.88      1.22      40
        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：12.33     累涨：21.99     5.06      12.39     6.94      1.86      1.04      41
        KEJI_NEW_ENERGY.put("560960", "科技-新能源           ");//碳中和60指数ETF       市值：0.24      累涨：22.77     5.69      13.02     6.10      1.85      0.87      42
        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：6.89      累涨：27.96     7.76      16.08     7.59      1.83      1.31      43
        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.35      累涨：20.18     5.55      10.77     6.43      1.81      0.91      44
        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：2.16      累涨：24.04     7.19      12.75     7.37      1.73      1.31      45
        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.59      累涨：19.18     5.36      10.43     5.78      1.70      1.02      46
        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.23      累涨：26.53     7.33      15.36     7.51      1.67      1.26      47
        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：47.03     累涨：26.83     7.14      15.79     7.62      1.58      1.23      48
        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：9.38      累涨：26.19     6.80      15.15     7.51      1.51      1.30      49
        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.68      累涨：27.93     11.54     11.77     6.57      1.06      0.53      50
        KEJI_NEW_ENERGY.put("159368", "科技-新能源           ");//创业板新能源ETF华夏   市值：1.64      累涨：0.51                          0.51      0.51      0.51      51
    }
    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车
    static {
        KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：1.84      累涨：55.26     3.46      27.17     24.63     11.27     5.13      1
        KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：8.16      累涨：64.79     5.25      34.60     24.94     9.81      4.28      2
        KEJI_NEW_CAR.put("159512", "科技-汽车             ");//汽车ETF               市值：0.89      累涨：36.65     14.46     13.19     9.07      6.29      4.30      3
        KEJI_NEW_CAR.put("159872", "科技-汽车             ");//智能网联汽车ETF       市值：0.54      累涨：47.06     12.09     24.87     10.30     6.10      2.69      4
        KEJI_NEW_CAR.put("159565", "科技-汽车             ");//汽车零部件ETF         市值：0.99      累涨：47.82     14.85     20.36     13.14     5.71      3.30      5
        KEJI_NEW_CAR.put("159720", "科技-汽车             ");//智能车ETF泰康         市值：0.58      累涨：38.17     8.98      17.77     11.42     5.69      4.10      6
        KEJI_NEW_CAR.put("562700", "科技-汽车             ");//汽车零部件ETF         市值：0.38      累涨：47.45     14.83     20.09     12.78     5.58      3.24      7
        KEJI_NEW_CAR.put("516110", "科技-汽车             ");//汽车ETF               市值：6.65      累涨：35.46     12.62     14.47     8.37      5.58      3.98      8
        KEJI_NEW_CAR.put("516520", "科技-汽车             ");//智能驾驶ETF           市值：4.33      累涨：56.86     15.95     28.75     12.41     5.54      2.93      9
        KEJI_NEW_CAR.put("159566", "科技-汽车             ");//储能电池ETF           市值：1.32      累涨：40.58     13.11     14.42     13.05     5.54      1.84      10
        KEJI_NEW_CAR.put("159755", "科技-汽车             ");//电池ETF               市值：37.69     累涨：43.06     10.37     18.96     13.73     5.53      3.73      11
        KEJI_NEW_CAR.put("159775", "科技-汽车             ");//新能源车电池ETF       市值：0.64      累涨：39.85     10.14     16.30     13.41     5.45      3.47      12
        KEJI_NEW_CAR.put("560000", "科技-汽车             ");//智慧电车ETF           市值：0.11      累涨：42.19     11.61     18.42     12.16     5.34      3.67      13
        KEJI_NEW_CAR.put("562260", "科技-汽车             ");//汽车配件ETF           市值：0.14      累涨：44.55     13.68     19.00     12.04     5.33      2.86      14
        KEJI_NEW_CAR.put("159306", "科技-汽车             ");//汽车零件ETF           市值：0.30      累涨：45.82     14.40     19.43     12.16     5.30      3.14      15
        KEJI_NEW_CAR.put("515030", "科技-汽车             ");//新能源车ETF           市值：49.97     累涨：40.35     10.22     17.31     12.82     5.25      3.31      16
        KEJI_NEW_CAR.put("159305", "科技-汽车             ");//储能电池50ETF         市值：0.48      累涨：37.69     11.46     14.60     11.63     5.22      1.89      17
        KEJI_NEW_CAR.put("159840", "科技-汽车             ");//锂电池ETF             市值：11.09     累涨：40.67     10.04     17.63     13.00     5.19      3.47      18
        KEJI_NEW_CAR.put("516380", "科技-汽车             ");//智能电动车ETF         市值：1.03      累涨：41.69     10.22     21.00     10.47     5.16      3.95      19
        KEJI_NEW_CAR.put("515700", "科技-汽车             ");//新能车ETF             市值：25.44     累涨：40.28     9.81      17.26     13.21     5.09      3.29      20
        KEJI_NEW_CAR.put("515250", "科技-汽车             ");//智能汽车ETF           市值：9.11      累涨：57.98     16.80     29.34     11.84     5.08      2.85      21
        KEJI_NEW_CAR.put("159888", "科技-汽车             ");//智能车ETF             市值：0.93      累涨：55.41     16.54     27.73     11.39     5.08      2.83      22
        KEJI_NEW_CAR.put("516590", "科技-汽车             ");//智能汽车ETF易方达     市值：1.03      累涨：40.06     10.17     19.71     10.18     5.08      3.92      23
        KEJI_NEW_CAR.put("159757", "科技-汽车             ");//电池30ETF             市值：3.41      累涨：40.94     10.30     16.81     13.83     5.04      3.53      24
        KEJI_NEW_CAR.put("516390", "科技-汽车             ");//新能源汽车ETF         市值：3.80      累涨：39.27     9.08      16.91     13.28     5.00      3.07      25
        KEJI_NEW_CAR.put("516660", "科技-汽车             ");//新能源车ETF基金       市值：3.67      累涨：39.96     9.88      17.35     12.73     4.99      3.42      26
        KEJI_NEW_CAR.put("159824", "科技-汽车             ");//新能车ETF             市值：1.82      累涨：40.66     9.98      17.40     13.28     4.97      3.29      27
        KEJI_NEW_CAR.put("159767", "科技-汽车             ");//电池龙头ETF           市值：1.27      累涨：41.00     10.79     17.11     13.10     4.93      3.23      28
        KEJI_NEW_CAR.put("159795", "科技-汽车             ");//智能汽车ETF基金       市值：0.43      累涨：56.03     16.62     27.82     11.59     4.86      2.61      29
        KEJI_NEW_CAR.put("159806", "科技-汽车             ");//新能源车ETF           市值：10.97     累涨：39.25     9.34      17.59     12.32     4.83      2.94      30
        KEJI_NEW_CAR.put("159637", "科技-汽车             ");//新能源车龙头ETF       市值：9.11      累涨：37.99     8.91      16.73     12.35     4.70      3.04      31
        KEJI_NEW_CAR.put("159889", "科技-汽车             ");//智能汽车ETF           市值：0.58      累涨：55.94     16.63     28.64     11.05     4.59      2.37      32
        KEJI_NEW_CAR.put("159796", "科技-汽车             ");//电池50ETF             市值：11.12     累涨：35.69     8.26      15.09     12.34     4.06      2.45      33
        KEJI_NEW_CAR.put("561910", "科技-汽车             ");//电池ETF               市值：6.80      累涨：35.45     9.72      13.44     12.29     4.03      2.51      34
        KEJI_NEW_CAR.put("561160", "科技-汽车             ");//锂电池ETF             市值：6.77      累涨：37.62     10.54     14.22     12.86     3.84      2.32      35
        KEJI_NEW_CAR.put("562880", "科技-汽车             ");//电池ETF基金           市值：3.63      累涨：35.94     9.58      15.03     11.33     3.52      2.23      36
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();
    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_TONG_XIN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_NEW_CAR);
    }

    /**
     * 指数-科创板
     */
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板
    static {
        INDEX_688.put("588860", "指数-科创板           ");//科创医药ETF           市值：4.12      累涨：42.81     12.73     20.38     12.66     8.52      4.82      1
        INDEX_688.put("588700", "指数-科创板           ");//科创医药指数ETF       市值：3.32      累涨：40.94     13.27     18.01     12.12     8.38      4.67      2
        INDEX_688.put("588250", "指数-科创板           ");//科创生物医药ETF       市值：3.17      累涨：7.72                          7.72      7.72      4.01      3
        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：1.85      累涨：50.17     21.20     20.57     9.86      5.90      1.60      4
        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.35      累涨：47.53     19.73     19.27     9.41      5.89      1.71      5
        INDEX_688.put("588780", "指数-科创板           ");//科创芯片设计ETF       市值：1.76      累涨：66.96     28.12     31.68     9.60      5.79      1.30      6
        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：2.80      累涨：48.81     20.50     20.11     9.29      5.33      1.64      7
        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：24.58     累涨：63.03     29.21     30.04     7.58      4.44      1.32      8
        INDEX_688.put("588930", "指数-科创板           ");//科创板人工智能ETF     市值：6.61      累涨：58.98     26.97     28.83     6.97      4.01      1.00      9
        INDEX_688.put("588730", "指数-科创板           ");//科创人工智能ETF       市值：4.48      累涨：47.02     15.49     27.63     6.87      3.95      1.08      10
        INDEX_688.put("588760", "指数-科创板           ");//人工智能ETF科创       市值：12.29     累涨：49.83     16.55     29.97     6.81      3.82      1.04      11
        INDEX_688.put("588290", "指数-科创板           ");//科创芯片ETF基金       市值：21.35     累涨：53.31     21.31     27.27     6.45      3.76      1.00      12
        INDEX_688.put("589520", "指数-科创板           ");//科创人工智能ETF华宝   市值：2.43      累涨：6.83                          6.83      3.70      0.87      13
        INDEX_688.put("588200", "指数-科创板           ");//科创芯片ETF           市值：216.46    累涨：53.58     21.65     27.38     6.18      3.54      0.71      14
        INDEX_688.put("588890", "指数-科创板           ");//科创芯片ETF南方       市值：5.25      累涨：53.01     21.77     27.18     5.59      3.51      0.64      15
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：0.98      累涨：14.76               7.67      7.96      3.26      2.14      16
        INDEX_688.put("588990", "指数-科创板           ");//科创芯片ETF博时       市值：2.26      累涨：51.60     20.82     27.15     5.14      3.20      0.56      17
        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：43.35     累涨：44.65     20.64     19.48     5.57      3.14      1.41      18
        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.27      累涨：49.65     23.56     22.26     6.95      3.12      1.60      19
        INDEX_688.put("588810", "指数-科创板           ");//科创芯片ETF富国       市值：0.89      累涨：62.30     15.65     42.31     5.65      3.11      0.46      20
        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：30.87     累涨：44.72     21.00     19.56     5.20      3.04      1.41      21
        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.17      累涨：44.54     20.74     20.05     5.15      2.93      1.35      22
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.08      累涨：50.19     24.56     21.15     6.57      2.93      1.79      23
        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：57.49     累涨：44.90     20.78     20.20     5.17      2.93      1.41      24
        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：2.70      累涨：44.35     20.19     19.87     5.53      2.92      1.30      25
        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：9.37      累涨：43.83     20.67     19.23     5.07      2.83      1.41      26
        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：30.78     累涨：43.76     20.89     19.41     4.64      2.83      1.25      27
        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.37      累涨：44.36     20.82     19.36     5.62      2.82      1.33      28
        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：2.36      累涨：44.40     20.51     20.27     4.90      2.80      1.34      29
        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：2.62      累涨：48.96     21.55     24.09     5.08      2.64      0.22      30
        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.22      累涨：45.90     22.31     19.50     5.10      2.54      1.09      31
        INDEX_688.put("588750", "指数-科创板           ");//科创芯片50ETF         市值：12.04     累涨：52.48     22.45     26.81     4.87      2.49      0.19      32
        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：13.03     累涨：7.94                2.90      5.63      2.42      1.26      33
        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.29      累涨：36.97     14.86     17.01     7.34      2.29      0.81      34
        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.03      累涨：44.03     18.12     23.28     4.70      2.25      0.59      35
        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：4.09      累涨：9.40                4.56      5.14      2.21      1.16      36
        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：8.36      累涨：8.95                4.63      4.71      2.20      1.26      37
        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：1.77      累涨：33.21     8.31      21.73     4.89      2.17      0.10      38
        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.26      累涨：47.89     21.12     24.10     4.52      2.13      0.22      39
        INDEX_688.put("589630", "指数-科创板           ");//科创综指ETF国泰       市值：12.26     累涨：4.46                          4.46      2.12      1.28      40
        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：5.45      累涨：7.41                2.99      4.71      2.10      1.26      41
        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：4.79      累涨：7.41                3.00      4.51      2.09      1.26      42
        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.23      累涨：19.72               14.89     6.75      2.07      0.90      43
        INDEX_688.put("588770", "指数-科创板           ");//科创信息技术ETF摩根   市值：3.52      累涨：2.02                          2.02      2.02      0.20      44
        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：11.29     累涨：8.98                5.06      4.22      2.00      1.16      45
        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：6.79      累涨：6.62                2.61      4.11      1.99      1.15      46
        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：3.46      累涨：7.49                3.19      4.79      1.99      1.05      47
        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：7.81      累涨：6.59                2.54      4.05      1.91      1.17      48
        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：6.02      累涨：42.53     17.88     21.05     4.63      1.89      0.35      49
        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：9.40      累涨：6.62                2.41      4.31      1.89      0.95      50
        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：7.17      累涨：7.38                3.49      4.58      1.88      1.05      51
        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：3.90      累涨：6.65                2.49      4.26      1.87      1.04      52
        INDEX_688.put("589600", "指数-科创板           ");//科创综指ETF富国       市值：11.94     累涨：4.77                0.60      4.77      1.82      1.07      53
        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.40      累涨：34.70     14.54     15.79     4.53      1.81      1.32      54
        INDEX_688.put("589060", "指数-科创板           ");//科创综指ETF东财       市值：2.39      累涨：1.81                          1.81      1.81      1.11      55
        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.59      累涨：41.02     16.99     21.78     3.79      1.80      0.28      56
        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：1.59      累涨：32.24     7.63      22.00     4.33      1.79      0.19      57
        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：768.25    累涨：41.20     17.04     21.76     4.07      1.76      0.19      58
        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：108.43    累涨：41.73     17.30     22.18     3.97      1.70      0.10      59
        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：52.04     累涨：41.02     16.71     21.70     4.30      1.67      0.15      60
        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：31.17     累涨：39.96     16.98     21.12     3.68      1.65      0.15      61
        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.04      累涨：40.31     16.30     21.83     3.81      1.62      0.14      62
        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.37      累涨：35.10     14.36     16.44     4.30      1.62      1.14      63
        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：532.53    累涨：41.47     16.85     22.46     3.98      1.61      0.29      64
        INDEX_688.put("588840", "指数-科创板           ");//科创板50ETF基金       市值：1.92      累涨：3.60                          3.60      1.48      0.21      65
        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：41.23     累涨：40.65     16.76     22.02     3.67      1.41                66
        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：0.90      累涨：37.76     15.73     19.82     3.42      1.29                67
        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：2.61      累涨：25.41     10.91     12.76     2.67      1.11      0.94      68
        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：16.21     累涨：33.24     14.35     15.51     3.89      0.87      0.18      69
        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：79.79     累涨：33.31     14.65     16.04     3.67      0.72      0.18      70
        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：38.09     累涨：33.58     15.25     15.73     3.47      0.71      0.18      71
        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：13.34     累涨：32.39     14.20     15.94     3.15      0.58      0.12      72
        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：8.66      累涨：30.27     13.27     14.90     2.79      0.54      0.36      73
        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：40.79     累涨：31.26     14.31     14.69     2.95      0.54      0.36      74
        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：21.46     累涨：32.54     14.91     15.26     3.39      0.52                75
        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：20.46     累涨：33.54     14.62     16.54     3.28      0.47      0.24      76
        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：16.15     累涨：31.57     14.03     14.95     3.45      0.36      0.18      77
        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：10.46     累涨：31.43     14.68     14.87     2.74      0.35                78
        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.03      累涨：33.35     15.03     15.92     3.21      0.33                79
        INDEX_688.put("588660", "指数-科创板           ");//科创创业50ETF基金     市值：3.51      累涨：1.12                          1.12      0.32      0.11      80
        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.23      累涨：30.81     13.97     14.68     3.34      0.23      0.23      81
        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.23      累涨：30.51     13.82     14.48     2.69      0.16                82
        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.64      累涨：33.38     15.33     16.01     3.14      0.16                83
        INDEX_688.put("588910", "指数-科创板           ");//科创价值ETF           市值：11.63     累涨：                                                            84
        INDEX_688.put("588170", "指数-科创板           ");//N科创半导体ETF        市值：5.09      累涨：                                                            85

    }
    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股
    static {
        INDEX_HK.put("159688", "指数-港股             ");//恒生互联网ETF         市值：7.71      累涨：65.40     6.04      33.78     29.19     17.46     7.05      1
        INDEX_HK.put("513330", "指数-港股             ");//恒生互联网ETF         市值：247.18    累涨：65.50     5.46      34.52     29.09     17.46     6.95      2
        INDEX_HK.put("159568", "指数-港股             ");//港股互联网ETF         市值：3.97      累涨：72.76     7.49      39.72     29.11     16.63     6.72      3
        INDEX_HK.put("513770", "指数-港股             ");//港股互联网ETF         市值：47.12     累涨：72.23     7.46      40.72     27.96     15.79     6.39      4
        INDEX_HK.put("159792", "指数-港股             ");//港股通互联网ETF       市值：432.05    累涨：71.92     7.86      38.37     29.61     15.68     6.41      5
        INDEX_HK.put("513040", "指数-港股             ");//港股通互联网ETF       市值：6.25      累涨：71.06     7.35      39.31     28.53     15.35     5.96      6
        INDEX_HK.put("513160", "指数-港股             ");//港股科技30ETF         市值：13.31     累涨：75.19     12.13     40.14     29.56     14.90     4.84      7
        INDEX_HK.put("513980", "指数-港股             ");//港股科技50ETF         市值：120.87    累涨：71.32     9.98      39.19     28.28     14.88     7.22      8
        INDEX_HK.put("159741", "指数-港股             ");//恒生科技ETF基金       市值：7.39      累涨：66.83     7.37      36.15     28.52     14.75     5.87      9
        INDEX_HK.put("513130", "指数-港股             ");//恒生科技ETF           市值：260.45    累涨：67.03     7.89      36.46     27.98     14.55     5.89      10
        INDEX_HK.put("513380", "指数-港股             ");//恒生科技ETF龙头       市值：43.38     累涨：66.82     7.98      36.26     27.92     14.50     5.93      11
        INDEX_HK.put("159750", "指数-港股             ");//港股科技50ETF         市值：5.39      累涨：67.81     8.11      35.57     29.06     14.49     6.74      12
        INDEX_HK.put("513010", "指数-港股             ");//恒生科技ETF易方达     市值：110.49    累涨：65.89     8.15      35.37     27.37     14.30     5.90      13
        INDEX_HK.put("513260", "指数-港股             ");//恒生科技ETF基金       市值：33.32     累涨：66.36     8.04      36.04     27.53     14.30     5.99      14
        INDEX_HK.put("513860", "指数-港股             ");//港股通科技ETF         市值：15.18     累涨：69.28     9.88      38.01     26.54     14.26     6.28      15
        INDEX_HK.put("159636", "指数-港股             ");//港股通科技30ETF       市值：174.08    累涨：69.53     10.50     36.32     28.47     14.25     6.90      16
        INDEX_HK.put("513150", "指数-港股             ");//港股通科技ETF华泰柏瑞 市值：1.77      累涨：70.17     10.60     38.71     27.02     14.19     6.69      17
        INDEX_HK.put("159735", "指数-港股             ");//港股消费ETF           市值：6.24      累涨：62.66     7.71      32.22     26.60     14.16     7.50      18
        INDEX_HK.put("513580", "指数-港股             ");//恒生科技ETF指数基金   市值：25.77     累涨：66.22     8.23      35.92     27.82     14.02     5.92      19
        INDEX_HK.put("513180", "指数-港股             ");//恒生科技指数ETF       市值：264.70    累涨：66.39     8.02      36.06     27.39     13.99     5.77      20
        INDEX_HK.put("513070", "指数-港股             ");//港股消费ETF易方达     市值：3.90      累涨：59.55     6.82      30.77     25.62     13.95     7.31      21
        INDEX_HK.put("513890", "指数-港股             ");//恒生科技HKETF         市值：3.80      累涨：65.35     7.74      35.79     26.55     13.90     5.95      22
        INDEX_HK.put("159740", "指数-港股             ");//恒生科技ETF           市值：64.62     累涨：65.21     7.71      35.03     27.53     13.88     5.51      23
        INDEX_HK.put("159742", "指数-港股             ");//恒生科技指数ETF       市值：16.28     累涨：65.14     7.96      35.37     27.17     13.87     5.83      24
        INDEX_HK.put("513020", "指数-港股             ");//港股科技ETF           市值：6.63      累涨：69.02     9.02      39.88     26.06     13.81     6.46      25
        INDEX_HK.put("513230", "指数-港股             ");//港股消费ETF           市值：2.96      累涨：59.73     6.37      31.45     25.53     13.73     7.09      26
        INDEX_HK.put("159751", "指数-港股             ");//港股科技ETF           市值：4.69      累涨：66.57     8.97      37.47     25.14     13.44     6.49      27
        INDEX_HK.put("513320", "指数-港股             ");//恒生新经济ETF         市值：2.71      累涨：64.45     9.03      35.74     24.99     13.20     6.77      28
        INDEX_HK.put("517550", "指数-港股             ");//消费ETF沪港深         市值：0.68      累涨：42.00     6.32      17.68     21.02     13.19     6.99      29
        INDEX_HK.put("159323", "指数-港股             ");//港股通汽车ETF         市值：1.82      累涨：55.26     3.46      30.63     26.80     13.03     5.92      30
        INDEX_HK.put("159506", "指数-港股             ");//恒生医疗ETF           市值：13.96     累涨：51.51     6.39      25.71     24.90     12.88     9.26      31
        INDEX_HK.put("513750", "指数-港股             ");//港股非银ETF           市值：14.46     累涨：44.86     5.86      19.33     23.10     12.62     7.21      32
        INDEX_HK.put("517360", "指数-港股             ");//沪港深科技ETF         市值：0.50      累涨：54.39     9.39      28.58     21.65     12.53     6.36      33
        INDEX_HK.put("520600", "指数-港股             ");//港股汽车ETF           市值：8.05      累涨：64.79     5.25      38.81     27.19     12.16     5.18      34
        INDEX_HK.put("517390", "指数-港股             ");//云计算沪港深ETF       市值：3.67      累涨：77.53     13.06     44.60     26.34     12.12     3.62      35
        INDEX_HK.put("513780", "指数-港股             ");//港股创新药50ETF       市值：1.76      累涨：50.33     7.50      23.70     24.61     11.83     8.47      36
        INDEX_HK.put("159788", "指数-港股             ");//港股通100ETF          市值：1.14      累涨：48.56     5.72      23.35     22.03     11.79     6.02      37
        INDEX_HK.put("159615", "指数-港股             ");//恒生生物科技ETF       市值：3.59      累涨：47.40     6.10      23.26     23.11     11.71     8.14      38
        INDEX_HK.put("159567", "指数-港股             ");//港股创新药ETF         市值：5.55      累涨：48.91     5.73      22.30     25.43     11.65     8.12      39
        INDEX_HK.put("159954", "指数-港股             ");//H股ETF                市值：4.53      累涨：48.17     6.48      24.87     20.11     11.64     5.90      40
        INDEX_HK.put("510900", "指数-港股             ");//H股ETF                市值：106.24    累涨：47.10     6.58      23.29     19.95     11.52     6.05      41
        INDEX_HK.put("520700", "指数-港股             ");//港股创新药ETF基金     市值：1.06      累涨：49.75     5.48      24.65     24.90     11.46     8.35      42
        INDEX_HK.put("159850", "指数-港股             ");//恒生国企ETF           市值：10.28     累涨：47.83     7.01      23.45     20.33     11.41     5.93      43
        INDEX_HK.put("513280", "指数-港股             ");//恒生生物科技ETF       市值：2.35      累涨：48.42     6.53      23.70     22.92     11.20     7.94      44
        INDEX_HK.put("159718", "指数-港股             ");//港股医药ETF           市值：2.25      累涨：46.58     6.62      24.00     21.57     11.12     7.85      45
        INDEX_HK.put("159570", "指数-港股             ");//港股通创新药ETF       市值：16.66     累涨：51.43     6.81      24.52     25.73     11.12     8.25      46
        INDEX_HK.put("159303", "指数-港股             ");//恒生医疗ETF基金       市值：1.14      累涨：49.32     6.33      25.90     21.74     11.09     7.38      47
        INDEX_HK.put("159557", "指数-港股             ");//恒生医疗指数ETF       市值：2.53      累涨：46.57     7.23      23.34     20.42     10.87     7.28      48
        INDEX_HK.put("520500", "指数-港股             ");//恒生创新药ETF         市值：1.90      累涨：49.95     4.98      24.43     25.28     10.83     8.19      49
        INDEX_HK.put("513200", "指数-港股             ");//港股通医药ETF         市值：36.08     累涨：48.95     6.26      25.14     22.58     10.82     7.54      50
        INDEX_HK.put("159892", "指数-港股             ");//恒生医药ETF           市值：47.31     累涨：47.84     6.63      22.05     23.86     10.77     7.75      51
        INDEX_HK.put("513900", "指数-港股             ");//港股通100ETF          市值：1.54      累涨：47.41     4.94      23.59     21.55     10.76     5.08      52
        INDEX_HK.put("513210", "指数-港股             ");//恒生ETF易方达         市值：0.59      累涨：43.28     4.80      21.78     19.32     10.58     5.45      53
        INDEX_HK.put("513120", "指数-港股             ");//港股创新药ETF         市值：117.80    累涨：48.44     6.96      23.55     23.08     10.54     8.64      54
        INDEX_HK.put("159711", "指数-港股             ");//港股通ETF             市值：0.59      累涨：43.71     4.54      21.87     18.54     10.45     5.13      55
        INDEX_HK.put("159776", "指数-港股             ");//港股通医药ETF         市值：1.40      累涨：46.43     6.36      23.59     21.54     10.41     7.63      56
        INDEX_HK.put("513060", "指数-港股             ");//恒生医疗ETF           市值：151.15    累涨：46.34     6.64      23.08     21.45     10.41     6.85      57
        INDEX_HK.put("513550", "指数-港股             ");//港股通50ETF           市值：29.78     累涨：45.64     5.68      21.95     19.83     10.39     5.33      58
        INDEX_HK.put("159920", "指数-港股             ");//恒生ETF               市值：180.51    累涨：42.81     5.04      21.19     19.17     10.38     5.32      59
        INDEX_HK.put("159699", "指数-港股             ");//恒生消费ETF           市值：16.04     累涨：34.67     4.13      14.78     18.38     10.35     5.92      60
        INDEX_HK.put("159960", "指数-港股             ");//恒生中国企业ETF       市值：6.20      累涨：43.09     5.94      21.67     19.06     10.21     5.21      61
        INDEX_HK.put("513970", "指数-港股             ");//恒生消费ETF           市值：12.67     累涨：35.13     4.14      13.97     19.30     10.20     5.91      62
        INDEX_HK.put("513600", "指数-港股             ");//恒生指数ETF           市值：15.06     累涨：43.61     4.72      22.40     18.98     10.18     4.93      63
        INDEX_HK.put("159312", "指数-港股             ");//恒生ETF港股通         市值：0.50      累涨：42.70     5.34      20.71     19.30     10.10     5.26      64
        INDEX_HK.put("520520", "指数-港股             ");//恒生消费ETF华泰柏瑞   市值：1.07      累涨：35.80     4.12      13.67     20.04     10.10     5.97      65
        INDEX_HK.put("513660", "指数-港股             ");//恒生ETF               市值：41.12     累涨：43.15     5.36      21.39     19.18     10.09     4.93      66
        INDEX_HK.put("513990", "指数-港股             ");//港股通ETF             市值：0.97      累涨：45.33     5.54      23.27     19.46     10.08     5.23      67
        INDEX_HK.put("159712", "指数-港股             ");//港股通50ETF           市值：0.59      累涨：47.12     4.98      26.37     17.82     9.61      5.12      68
        INDEX_HK.put("159318", "指数-港股             ");//恒生港股通ETF         市值：0.54      累涨：43.30     5.35      21.89     18.75     9.59      4.72      69
        INDEX_HK.put("513190", "指数-港股             ");//港股通金融ETF         市值：5.46      累涨：36.13     8.43      15.52     13.94     8.60      5.37      70
        INDEX_HK.put("159726", "指数-港股             ");//恒生红利ETF           市值：5.95      累涨：28.42     5.51      11.29     13.57     7.90      4.47      71
        INDEX_HK.put("517660", "指数-港股             ");//物联网沪港深ETF       市值：0.45      累涨：50.10     12.41     24.77     19.01     7.88      3.76      72
        INDEX_HK.put("513140", "指数-港股             ");//港股金融ETF           市值：0.82      累涨：32.96     5.53      14.81     14.50     7.36      4.38      73
        INDEX_HK.put("513920", "指数-港股             ");//港股通央企红利ETF     市值：36.96     累涨：31.00     8.62      11.83     12.24     7.30      5.33      74
        INDEX_HK.put("159622", "指数-港股             ");//创新药ETF沪港深       市值：2.11      累涨：38.81     7.88      18.61     16.61     7.27      5.96      75
        INDEX_HK.put("159519", "指数-港股             ");//港股国企ETF           市值：1.96      累涨：31.05     9.84      11.67     11.40     6.99      4.21      76
        INDEX_HK.put("159569", "指数-港股             ");//港股红利低波ETF       市值：1.52      累涨：26.77     11.49     6.61      9.49      6.88      3.16      77
        INDEX_HK.put("517000", "指数-港股             ");//沪港深500ETF          市值：3.86      累涨：28.37     5.34      13.76     12.10     6.88      3.41      78
        INDEX_HK.put("517080", "指数-港股             ");//沪港深500ETF基金      市值：4.22      累涨：28.35     5.32      13.93     11.92     6.79      3.43      79
        INDEX_HK.put("517170", "指数-港股             ");//沪港深ETF             市值：0.42      累涨：28.93     5.63      14.42     11.81     6.66      3.37      80
        INDEX_HK.put("517380", "指数-港股             ");//创新药沪港深ETF       市值：2.43      累涨：33.93     5.40      16.55     15.62     6.62      5.01      81
        INDEX_HK.put("517990", "指数-港股             ");//医药ETF沪港深         市值：0.40      累涨：29.56     4.28      14.60     13.84     6.61      4.92      82
        INDEX_HK.put("159545", "指数-港股             ");//恒生红利低波ETF       市值：11.66     累涨：25.36     6.95      9.83      10.49     6.54      2.59      83
        INDEX_HK.put("513170", "指数-港股             ");//恒生央企ETF           市值：4.90      累涨：30.85     7.17      13.04     13.24     6.47      4.01      84
        INDEX_HK.put("517010", "指数-港股             ");//沪港深500ETF易方达    市值：0.73      累涨：28.90     5.77      14.20     11.48     6.41      3.44      85
        INDEX_HK.put("513810", "指数-港股             ");//港股国企ETF           市值：0.50      累涨：29.36     8.42      11.80     10.69     6.20      3.63      86
        INDEX_HK.put("513910", "指数-港股             ");//港股央企红利ETF       市值：26.96     累涨：29.45     11.28     9.58      10.16     6.12      3.88      87
        INDEX_HK.put("513630", "指数-港股             ");//港股红利指数ETF       市值：95.65     累涨：24.61     6.95      9.39      9.32      6.02      2.97      88
        INDEX_HK.put("517300", "指数-港股             ");//沪港深300ETF          市值：27.38     累涨：25.87     5.76      12.45     10.77     5.99      3.48      89
        INDEX_HK.put("513690", "指数-港股             ");//港股红利ETF博时       市值：39.27     累涨：26.02     6.61      9.75      11.16     5.98      3.16      90
        INDEX_HK.put("517030", "指数-港股             ");//沪港深300ETF易方达    市值：0.66      累涨：23.13     4.55      11.30     9.43      5.89      3.19      91
        INDEX_HK.put("513950", "指数-港股             ");//恒生红利ETF           市值：11.41     累涨：25.77     7.59      9.69      10.32     5.75      2.55      92
        INDEX_HK.put("159333", "指数-港股             ");//港股央企红利ETF       市值：5.04      累涨：39.14     22.05     9.39      8.84      5.68      3.84      93
        INDEX_HK.put("520890", "指数-港股             ");//港股通红利低波ETF     市值：0.74      累涨：37.53     19.82     9.86      10.22     5.65      2.47      94
        INDEX_HK.put("159691", "指数-港股             ");//港股红利ETF           市值：60.74     累涨：20.19     6.32      7.27      7.45      5.51      2.86      95
        INDEX_HK.put("520550", "指数-港股             ");//港股红利低波ETF       市值：2.01      累涨：16.28               6.40      10.08     5.40      3.19      96
        INDEX_HK.put("513820", "指数-港股             ");//港股红利ETF基金       市值：20.86     累涨：22.24     9.06      7.51      6.62      4.79      2.78      97
        INDEX_HK.put("520900", "指数-港股             ");//红利ETF港股           市值：30.89     累涨：24.53     9.75      9.49      7.17      4.66      2.68      98
        INDEX_HK.put("520990", "指数-港股             ");//港股央企红利50ETF     市值：49.47     累涨：25.52     11.14     9.19      6.73      4.55      2.58      99
        INDEX_HK.put("159331", "指数-港股             ");//红利港股ETF           市值：0.92      累涨：31.71     19.00     7.00      6.74      4.49      2.63      100
        INDEX_HK.put("513530", "指数-港股             ");//港股通红利ETF         市值：15.01     累涨：23.71     9.58      7.75      7.38      4.47      2.69      101
        INDEX_HK.put("520660", "指数-港股             ");//港股通央企红利ETF南方 市值：11.32     累涨：22.79     10.18     8.28      5.77      4.46      2.59      102
        INDEX_HK.put("159302", "指数-港股             ");//港股高股息ETF         市值：1.17      累涨：22.52     8.65      7.93      6.97      4.26      2.55      103
        INDEX_HK.put("513830", "指数-港股             ");//港股红利ETF           市值：6.38      累涨：2.98                          2.98      2.98      2.08      104
    }

    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘
    static {
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.70     累涨：65.60     16.87     32.99     18.76     12.06     7.29      1
        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：10.89     累涨：85.72     28.00     45.74     11.98     8.26      4.23      2
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：7.09      累涨：62.59     29.71     29.80     7.68      5.97      2.97      3
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：9.18      累涨：47.50     9.24      28.89     9.91      5.62      2.54      4
        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：8.51      累涨：23.36     5.97      10.58     7.48      4.47      3.12      5
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：12.19     累涨：27.73     7.06      15.15     5.52      3.45      1.80      6
        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：7.34      累涨：67.46     23.23     41.31     8.32      3.13      2.75      7
        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：20.14     累涨：19.86     4.38      8.41      7.07      2.96      0.88      8
        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：6.60      累涨：51.78     20.92     31.28     3.90      2.87      1.68      9
        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：14.08     累涨：20.52     7.85      7.75      5.07      2.86      1.94      10
        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.58      累涨：33.49     7.82      21.32     4.73      2.70      1.68      11
        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：11.82     累涨：26.59     9.99      12.43     4.17      2.48      1.42      12
        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：5.37      累涨：3.79                          3.79      1.41      1.09      13
    }
    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股
    static {
        INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：6.24      累涨：110.29    52.73     36.23     21.33     18.98     9.58      1
        INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：6.09      累涨：41.25     10.33     11.72     19.20     17.14     15.52     2
        INDEX_CN_NOT_USA.put("513350", "指数-外盘-美股        ");//标普油气ETF           市值：6.59      累涨：65.18     31.12     27.72     9.24      6.70      6.16      3
        INDEX_CN_NOT_USA.put("159518", "指数-外盘-美股        ");//标普油气ETF           市值：11.24     累涨：52.27     34.70     17.27     4.97      4.23      4.12      4
        INDEX_CN_NOT_USA.put("562060", "指数-外盘-美股        ");//标普红利ETF           市值：15.55     累涨：17.08     5.38      5.69      6.48      3.73      2.13      5
        INDEX_CN_NOT_USA.put("513290", "指数-外盘-美股        ");//纳指生物科技ETF       市值：14.25     累涨：28.60     10.63     12.03     6.44      3.49      2.14      6
        INDEX_CN_NOT_USA.put("159502", "指数-外盘-美股        ");//标普生物科技ETF       市值：11.11     累涨：28.17     11.99     10.46     6.22      2.98      1.81      7
        INDEX_CN_NOT_USA.put("513100", "指数-外盘-美股        ");//纳指ETF               市值：140.30    累涨：24.33     10.77     7.17      6.39      2.51      2.16      8
        INDEX_CN_NOT_USA.put("159941", "指数-外盘-美股        ");//纳指ETF               市值：236.79    累涨：25.14     11.82     7.14      6.18      2.50      1.85      9
        INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：90.57     累涨：28.96     13.90     8.47      6.59      2.45      2.01      10
        INDEX_CN_NOT_USA.put("159513", "指数-外盘-美股        ");//纳斯达克100指数ETF    市值：57.66     累涨：26.09     11.23     9.61      5.25      2.26      2.01      11
        INDEX_CN_NOT_USA.put("513390", "指数-外盘-美股        ");//纳指100ETF            市值：16.68     累涨：27.00     14.87     8.12      4.01      2.24      1.88      12
        INDEX_CN_NOT_USA.put("159632", "指数-外盘-美股        ");//纳斯达克ETF           市值：92.44     累涨：27.24     14.75     7.07      5.42      2.09      2.03      13
        INDEX_CN_NOT_USA.put("513300", "指数-外盘-美股        ");//纳斯达克ETF           市值：62.11     累涨：25.75     13.63     6.62      5.50      2.06      2.06      14
        INDEX_CN_NOT_USA.put("513650", "指数-外盘-美股        ");//标普500ETF南方        市值：38.87     累涨：16.41     7.42      5.39      3.73      1.97      1.64      15
        INDEX_CN_NOT_USA.put("513110", "指数-外盘-美股        ");//纳斯达克100ETF        市值：34.48     累涨：26.96     14.71     7.89      4.36      1.83      1.77      16
        INDEX_CN_NOT_USA.put("159696", "指数-外盘-美股        ");//纳指ETF易方达         市值：23.49     累涨：25.39     13.89     7.45      4.05      1.83      1.68      17
        INDEX_CN_NOT_USA.put("159655", "指数-外盘-美股        ");//标普ETF               市值：19.30     累涨：27.18     12.62     10.75     3.81      1.82      1.63      18
        INDEX_CN_NOT_USA.put("159659", "指数-外盘-美股        ");//纳斯达克100ETF        市值：46.25     累涨：27.21     15.16     8.12      3.93      1.77      1.77      19
        INDEX_CN_NOT_USA.put("513400", "指数-外盘-美股        ");//道琼斯ETF             市值：22.45     累涨：20.33     10.39     6.31      4.15      1.76      1.58      20
        INDEX_CN_NOT_USA.put("159660", "指数-外盘-美股        ");//纳指100ETF            市值：25.50     累涨：27.93     16.73     7.13      4.07      1.69      1.69      21
        INDEX_CN_NOT_USA.put("159501", "指数-外盘-美股        ");//纳斯达克指数ETF       市值：68.62     累涨：24.09     12.69     7.48      3.92      1.58      1.58      22
        INDEX_CN_NOT_USA.put("513870", "指数-外盘-美股        ");//纳指ETF富国           市值：15.32     累涨：26.16     13.89     8.26      4.01      1.56      1.56      23
        INDEX_CN_NOT_USA.put("513850", "指数-外盘-美股        ");//美国50ETF             市值：19.94     累涨：24.26     13.67     6.74      3.85      1.49      1.49      24
        INDEX_CN_NOT_USA.put("159577", "指数-外盘-美股        ");//美国50ETF             市值：11.30     累涨：24.59     14.22     6.43      3.94      1.48      1.48      25
        INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：165.54    累涨：14.13     6.91      4.32      2.90      1.03      0.98      26
    }
    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘
    static {
        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.59      累涨：43.88     8.24      17.57     18.66     9.32      5.19      1
        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.14      累涨：44.70     7.38      20.87     17.85     8.72      3.72      2
        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.21      累涨：38.87     8.03      15.99     15.04     8.46      3.08      3
        INDEX_CN_1000.put("159521", "指数-中小盘           ");//2000指数ETF           市值：0.23      累涨：39.20     8.82      16.30     15.28     8.25      2.97      4
        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.15      累涨：37.33     7.15      15.86     15.05     8.24      3.76      5
        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.51      累涨：44.97     10.14     18.87     17.33     8.20      3.44      6
        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.15      累涨：44.50     10.56     18.40     17.12     8.01      2.88      7
        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.11      累涨：42.56     11.54     17.24     15.44     7.89      4.42      8
        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：7.25      累涨：41.13     7.35      19.24     15.48     7.83      3.14      9
        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.51      累涨：47.71     11.88     20.78     16.42     7.80      4.21      10
        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：5.74      累涨：46.12     10.34     20.87     16.96     7.69      3.26      11
        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：1.54      累涨：41.98     9.07      18.89     15.78     7.69      3.54      12
        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.16      累涨：34.79     5.71      15.98     13.37     7.63      3.25      13
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.17      累涨：44.66     11.18     19.27     15.67     7.59      3.04      14
        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.40      累涨：37.80     7.18      16.71     14.09     7.58      2.49      15
        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.12      累涨：38.90     6.42      17.77     15.75     7.58      3.10      16
        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：1.37      累涨：37.19     5.88      18.14     13.66     7.55      2.17      17
        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.79      累涨：45.61     10.35     20.30     16.61     7.52      3.29      18
        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.23      累涨：43.89     9.84      19.99     15.77     7.47      3.00      19
        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：30.25     累涨：44.99     9.61      20.47     17.04     7.42      3.00      20
        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF指数       市值：0.20      累涨：41.05     8.93      18.43     15.04     7.27      3.38      21
        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.59      累涨：42.90     10.01     18.97     15.77     7.16      2.87      22
        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.37      累涨：36.08     7.88      15.60     12.89     7.13      2.59      23
        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.75      累涨：42.02     8.40      20.55     14.77     7.05      2.59      24
        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：102.55    累涨：36.72     6.48      17.06     13.81     7.00      2.81      25
        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.56      累涨：43.03     9.86      17.87     16.64     6.99      2.01      26
        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.85      累涨：28.34     4.57      13.17     10.60     6.95      3.93      27
        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.47      累涨：36.45     5.74      17.68     13.47     6.94      2.95      28
        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：307.15    累涨：37.31     6.43      17.49     13.86     6.82      2.57      29
        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：560.49    累涨：37.85     6.82      17.73     13.74     6.80      2.62      30
        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：25.04     累涨：37.07     6.22      17.76     13.68     6.74      2.69      31
        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：254.84    累涨：37.07     6.62      17.34     13.54     6.68      2.58      32
        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：1.42      累涨：35.82     6.02      17.38     13.09     6.54      2.58      33
        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：3.52      累涨：38.06     6.69      19.31     12.82     6.39      2.91      34
        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.45      累涨：27.00     5.81      10.93     10.26     6.25      3.19      35
        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.58      累涨：27.67     4.84      11.80     11.37     6.25      3.17      36
        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.80      累涨：28.57     5.86      13.87     9.30      6.16      2.60      37
        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：4.21      累涨：28.57     4.20      13.46     11.97     6.13      2.42      38
        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.47      累涨：31.27     5.25      15.24     10.97     6.07      2.45      39
        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：7.31      累涨：30.77     5.85      14.25     10.67     6.04      2.99      40
        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.35      累涨：38.84     8.75      16.74     14.38     6.01      1.35      41
        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.86      累涨：28.60     4.21      13.41     11.80     5.99      2.29      42
        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：3.15      累涨：29.20     3.95      13.98     12.09     5.95      2.74      43
        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.23      累涨：33.69     4.76      19.00     10.57     5.92      2.59      44
        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.33      累涨：28.53     5.66      13.11     9.83      5.86      2.61      45
        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.95      累涨：29.94     6.49      13.47     10.64     5.80      3.09      46
        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.53      累涨：24.74     5.71      10.53     8.50      5.74      2.84      47
        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.66      累涨：29.34     6.46      12.95     10.51     5.68      2.69      48
        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.82      累涨：28.46     5.05      13.29     10.12     5.67      2.58      49
        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.18      累涨：26.20     6.80      10.22     9.18      5.66      2.51      50
        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.24      累涨：28.59     5.88      12.95     9.76      5.63      2.91      51
        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.62      累涨：25.64     6.09      10.88     8.67      5.55      2.75      52
        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.62      累涨：28.86     4.71      13.92     10.23     5.51      2.58      53
        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：7.27      累涨：28.85     5.11      13.48     10.27     5.51      2.51      54
        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.76      累涨：28.36     4.92      13.41     10.03     5.49      2.44      55
        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：116.48    累涨：29.70     5.19      14.13     10.38     5.47      2.34      56
        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：20.94     累涨：29.30     5.31      13.96     10.03     5.44      2.46      57
        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：22.87     累涨：28.62     4.86      13.77     9.99      5.34      2.20      58
        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1010.22   累涨：29.51     5.32      14.14     10.05     5.29      2.39      59
        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：7.18      累涨：27.81     4.97      12.88     9.96      5.27      1.88      60
        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.61      累涨：23.72     4.61      9.50      9.61      5.24      2.94      61
        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：11.40     累涨：27.92     4.50      13.65     9.77      5.23      2.42      62
        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.72      累涨：28.93     4.86      13.68     11.23     5.21      2.04      63
        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：12.97     累涨：28.21     4.93      13.25     10.03     5.20      2.28      64
        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：1.25      累涨：28.71     5.22      13.80     9.69      5.16      2.14      65
        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：139.19    累涨：29.09     5.29      14.17     9.63      5.16      2.29      66
        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：3.17      累涨：27.75     4.83      13.46     9.46      5.07      2.16      67
        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：32.78     累涨：28.52     4.99      13.94     9.59      5.05      2.32      68
        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.89      累涨：26.17     5.09      11.63     9.45      4.96      2.51      69
        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.81      累涨：29.52     6.96      13.67     9.26      4.94      3.00      70
        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.34      累涨：30.40     7.27      12.47     10.66     4.90      1.86      71
        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：4.30      累涨：31.06     7.30      15.11     8.65      4.85      2.47      72
        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.51      累涨：23.80     4.01      11.86     8.53      4.84      2.24      73
        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.64      累涨：23.89     5.13      10.17     8.59      4.80      2.38      74
        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.18      累涨：18.82     3.87      7.79      7.16      4.69      2.53      75
        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：245.07    累涨：23.15     4.20      10.65     8.40      4.67      2.70      76
        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：201.09    累涨：22.44     4.33      10.16     8.05      4.62      2.51      77
        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.97      累涨：24.23     5.03      10.40     8.80      4.61      1.60      78
        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.85      累涨：31.68     7.53      15.43     8.86      4.43      2.62      79
        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：82.81     累涨：22.32     4.26      10.42     7.84      4.43      2.41      80
        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：192.10    累涨：21.70     4.03      10.27     7.50      4.41      2.30      81
        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：51.49     累涨：21.82     3.73      10.65     7.44      4.40      2.34      82
        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：147.53    累涨：22.64     4.43      10.78     7.73      4.38      2.54      83
        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：118.74    累涨：22.26     4.42      10.46     7.48      4.37      2.39      84
        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500指数ETF           市值：144.58    累涨：22.22     4.51      10.42     7.49      4.36      2.33      85
        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：212.65    累涨：22.07     3.90      10.66     7.80      4.36      2.37      86
        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：86.74     累涨：21.19     4.26      9.74      7.29      4.32      2.36      87
        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.83      累涨：23.10     4.67      10.45     7.98      4.30      2.37      88
        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：4.87      累涨：17.68               10.45     7.61      4.30      2.38      89
        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：166.64    累涨：22.15     4.23      10.37     7.65      4.29      2.34      90
        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.54      累涨：26.62     4.94      12.59     9.09      4.29      1.64      91
        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：203.56    累涨：22.31     4.10      10.48     7.83      4.29      2.29      92
        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：12.36     累涨：9.51                1.99      7.52      4.27      2.38      93
        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：19.32     3.43      8.97      7.10      4.24      2.21      94
        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：28.95     累涨：21.99     4.24      10.53     7.32      4.20      2.24      95
        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：4.46      累涨：18.28     0.20      10.48     7.60      4.19      2.28      96
        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：34.44     累涨：21.26     3.91      10.10     7.25      4.18      2.28      97
        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：2.45      累涨：11.04               3.71      7.52      4.16      2.32      98
        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：51.90     累涨：21.46     4.09      10.35     7.22      4.16      2.17      99
        INDEX_CN_1000.put("560530", "指数-中小盘           ");//中证A500ETF摩根       市值：105.24    累涨：21.92     3.88      10.77     7.57      4.15      2.22      100
        INDEX_CN_1000.put("563360", "指数-中小盘           ");//中证A500ETF基金       市值：162.26    累涨：22.03     4.37      10.39     7.37      4.14      2.26      101
        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：42.60     累涨：21.57     3.98      10.41     7.28      4.14      2.26      102
        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：18.01     累涨：21.83     4.14      10.55     7.33      4.11      2.24      103
        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：60.84     累涨：21.19     4.22      9.90      7.27      4.09      2.29      104
        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：75.49     累涨：20.69     3.57      10.26     7.07      4.06      2.29      105
        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：15.20     累涨：13.39               6.15      7.34      4.06      2.22      106
        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：1.67      累涨：8.78                1.91      6.87      3.99      2.19      107
        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：5.44      累涨：15.16               6.64      8.52      3.98      2.13      108
        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：41.20     累涨：21.82     4.16      10.58     7.28      3.94      2.16      109
        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.42      累涨：19.09     4.39      8.30      6.40      3.77      2.26      110
        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：39.47     累涨：21.57     4.20      10.36     7.31      3.76      1.97      111
        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.36      累涨：18.31     5.32      8.00      4.99      3.70      2.40      112
        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：1.22      累涨：15.80     5.24      6.65      4.01      2.50      1.50      113
    }
    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板
    static {
        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.40      累涨：52.86     8.38      25.97     18.61     9.57      3.45      1
        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.43      累涨：55.28     8.75      26.90     19.63     9.34      3.29      2
        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.61      累涨：54.22     8.85      27.01     18.55     9.33      3.23      3
        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.12      累涨：53.43     10.56     24.81     18.54     9.21      3.30      4
        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.70      累涨：42.40     7.87      18.72     15.81     8.85      3.70      5
        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.36      累涨：51.00     8.78      25.79     17.68     7.90      2.41      6
        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.49      累涨：38.65     5.43      20.05     13.43     6.27      2.64      7
        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.63      累涨：40.92     5.97      21.83     13.41     5.98      2.61      8
        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：6.67      累涨：34.00     2.88      18.51     12.61     5.53      3.14      9
        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.95      累涨：39.32     5.16      21.50     12.66     5.52      2.98      10
        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.23      累涨：16.75               3.57      13.18     5.51      3.52      11
        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：267.50    累涨：36.22     3.31      20.52     12.39     5.43      3.36      12
        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：2.40      累涨：38.54     4.37      21.59     12.58     5.32      2.28      13
        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：42.47     累涨：42.34     6.63      23.48     12.23     5.32      3.12      14
        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：17.45     累涨：35.64     3.73      20.58     11.56     5.22      3.32      15
        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：15.71     累涨：35.88     6.64      16.11     13.13     5.21      1.91      16
        INDEX_300.put("159836", "指数-创业板           ");//创300ETF              市值：1.76      累涨：37.47     3.76      21.03     12.68     5.12      2.45      17
        INDEX_300.put("159957", "指数-创业板           ");//创业板100ETF华夏      市值：19.19     累涨：33.84     2.95      19.21     11.76     5.11      3.07      18
        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.43      累涨：34.22     4.82      17.44     12.08     5.07      3.03      19
        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：50.74     累涨：35.75     3.43      20.62     11.82     5.07      3.25      20
        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.62      累涨：13.00               1.60      11.40     5.06      3.15      21
        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：24.99     累涨：35.95     6.76      16.50     12.69     5.03      2.03      22
        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.93      累涨：35.32     3.35      19.30     12.67     4.94      2.77      23
        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：1.08      累涨：15.14               3.53      11.61     4.93      3.07      24
        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：26.78     累涨：33.48     2.79      19.33     11.51     4.93      2.81      25
        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.30      累涨：34.87     3.27      18.22     13.38     4.93      2.85      26
        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：0.47      累涨：30.80     0.31      19.27     11.53     4.92      3.04      27
        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：95.44     累涨：33.37     2.88      18.89     11.70     4.91      2.82      28
        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：120.05    累涨：35.17     3.38      20.03     12.10     4.91      2.93      29
        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：0.53      累涨：25.52               12.92     12.60     4.91      3.19      30
        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.28      累涨：34.67     7.37      15.13     12.17     4.91      1.73      31
        INDEX_300.put("159721", "指数-创业板           ");//深创龙头ETF           市值：0.90      累涨：36.41     7.18      18.53     10.70     4.89      2.64      32
        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：21.13     累涨：33.63     3.22      19.09     11.59     4.89      2.86      33
        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.10      累涨：34.44     3.11      19.60     12.00     4.89      2.82      34
        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.64      累涨：34.83     4.20      18.58     12.05     4.88      2.56      35
        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：48.31     累涨：34.35     3.62      19.14     11.78     4.88      2.96      36
        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：5.43      累涨：33.92     3.21      19.15     11.64     4.87      2.81      37
        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.36      累涨：34.08     3.74      18.51     12.00     4.85      2.94      38
        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：872.45    累涨：34.79     3.34      19.82     11.84     4.82      2.87      39
        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.23      累涨：33.35     3.14      19.30     10.99     4.62      2.65      40
        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：1.07      累涨：35.56     6.94      18.67     9.95      4.59      2.42      41
        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.88      累涨：33.40     6.02      15.10     12.28     4.45      1.56      42
        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：5.27      累涨：31.60     3.36      19.08     9.38      4.03      1.83      43
        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.43      累涨：13.29               2.27      11.02     3.88      2.29      44
        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.48      累涨：34.47     3.66      19.72     11.09     3.79      1.69      45
    }
    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘
    static {
        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：5.03      累涨：29.68     8.27      8.62      12.79     10.52     10.31     1
        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：50.52     累涨：23.24     6.67      6.32      10.25     8.54      8.38      2
        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：4.53      累涨：19.93     6.30      3.18      10.80     8.45      7.97      3
        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：18.33     累涨：24.96     8.09      7.18      9.69      7.86      7.23      4
        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：2.53      累涨：37.67     15.31     13.89     8.47      7.51      7.05      5
        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：73.67     累涨：23.26     9.81      3.84      9.61      7.31      5.71      6
        INDEX_CN_BIG.put("159966", "指数-大盘             ");//创业板价值ETF         市值：4.79      累涨：36.12     16.66     9.97      9.49      7.25      6.83      7
        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：13.63     累涨：39.25     16.17     14.90     8.18      7.05      6.69      8
        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：3.04      累涨：22.41     7.33      5.21      9.87      7.03      6.83      9
        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.65      累涨：25.75     8.41      6.14      11.20     6.95      6.05      10
        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：1.02      累涨：20.30     6.43      3.93      9.94      6.86      6.39      11
        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.55      累涨：13.85               4.13      10.02     6.85      6.45      12
        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.42      累涨：22.91     7.51      6.17      9.23      6.77      6.38      13
        INDEX_CN_BIG.put("563860", "指数-大盘             ");//A500ETF海富通         市值：10.82     累涨：17.09     1.10      6.23      9.76      6.69      6.49      14
        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：2.31      累涨：37.87     16.19     13.93     7.75      6.66      6.09      15
        INDEX_CN_BIG.put("159351", "指数-大盘             ");//A500指数ETF           市值：149.75    累涨：25.12     9.52      6.07      9.53      6.59      6.18      16
        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：28.37     累涨：21.17     7.27      5.65      8.25      6.58      6.37      17
        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：0.73      累涨：21.24     4.25      6.82      10.17     6.55      5.97      18
        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：6.79      累涨：20.18     7.07      4.40      9.52      6.53      5.36      19
        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.63      累涨：20.14     6.89      4.35      9.57      6.45      5.23      20
        INDEX_CN_BIG.put("563650", "指数-大盘             ");//中证A500龙头ETF       市值：3.07      累涨：6.37                          6.37      6.37      6.37      21
        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：55.93     累涨：20.85     6.61      6.03      8.21      6.33      5.87      22
        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.49      累涨：17.84     5.85      2.76      9.90      6.31      5.36      23
        INDEX_CN_BIG.put("512360", "指数-大盘             ");//MSCI中国A股ETF基金    市值：0.61      累涨：22.73     7.28      6.98      9.21      6.27      5.80      24
        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.33      累涨：23.06     6.92      5.96      10.37     6.24      5.41      25
        INDEX_CN_BIG.put("159352", "指数-大盘             ");//中证A500ETF南方       市值：193.65    累涨：25.25     9.68      6.32      9.25      6.20      5.90      26
        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：6.44      累涨：21.29     6.64      5.18      9.47      6.19      5.89      27
        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：6.88      累涨：18.94     6.21      3.78      8.95      6.16      5.37      28
        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.66      累涨：22.48     8.54      4.69      9.25      6.15      4.94      29
        INDEX_CN_BIG.put("563360", "指数-大盘             ");//中证A500ETF基金       市值：127.93    累涨：24.48     9.60      5.90      8.98      6.14      5.74      30
        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.78      累涨：22.72     8.42      5.34      8.96      6.04      4.93      31
        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：31.68     累涨：24.16     7.57      6.68      10.22     5.97      5.43      32
        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：1.32      累涨：16.75     5.10      2.86      9.27      5.96      4.63      33
        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.52      累涨：23.03     7.86      7.41      7.76      5.94      5.43      34
        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF基金       市值：18.37     累涨：22.50     7.63      7.28      7.59      5.89      5.47      35
        INDEX_CN_BIG.put("159617", "指数-大盘             ");//500价值ETF            市值：0.35      累涨：21.70     7.69      5.71      8.39      5.89      4.85      36
        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：2.81      累涨：19.53     6.25      5.41      9.13      5.87      4.64      37
        INDEX_CN_BIG.put("512240", "指数-大盘             ");//A50ETF龙头            市值：2.11      累涨：5.86                          5.86      5.86      5.86      38
        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：2.92      累涨：29.50     12.60     7.11      9.79      5.78      5.27      39
        INDEX_CN_BIG.put("159358", "指数-大盘             ");//中证A500ETF基金       市值：23.86     累涨：24.41     9.75      6.05      8.61      5.78      5.49      40
        INDEX_CN_BIG.put("512050", "指数-大盘             ");//A500ETF基金           市值：169.62    累涨：24.34     9.22      6.59      8.53      5.71      5.29      41
        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.04      累涨：18.93     7.16      3.54      8.61      5.68      4.93      42
        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.65      累涨：21.47     6.88      5.88      8.71      5.68      4.97      43
        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.52      累涨：23.35     9.38      5.72      8.25      5.63      4.52      44
        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：67.05     累涨：18.27     7.03      3.30      8.36      5.61      4.72      45
        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.48      累涨：26.36     11.22     7.25      7.89      5.60      4.97      46
        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.29      累涨：19.94     6.27      4.85      10.07     5.59      5.43      47
        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：6.52      累涨：22.56     8.11      6.12      8.33      5.59      5.19      48
        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：1.95      累涨：29.14     12.41     7.04      9.69      5.55      5.21      49
        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.32      累涨：31.50     16.86     13.03     10.34     5.54      3.78      50
        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.63      累涨：24.57     8.41      6.68      9.48      5.53      5.05      51
        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.27      累涨：22.28     7.93      5.75      8.60      5.53      4.93      52
        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.14      累涨：35.83     17.18     9.27      9.38      5.52      5.30      53
        INDEX_CN_BIG.put("159357", "指数-大盘             ");//中证A500指数ETF       市值：41.66     累涨：23.67     9.26      5.94      8.47      5.51      5.11      54
        INDEX_CN_BIG.put("563880", "指数-大盘             ");//中证A500指数ETF       市值：63.80     累涨：24.33     9.51      6.34      8.48      5.48      5.08      55
        INDEX_CN_BIG.put("159386", "指数-大盘             ");//A500ETF永赢           市值：2.01      累涨：14.91     1.01      5.58      8.32      5.44      5.14      56
        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：1.24      累涨：20.91     6.41      6.16      8.44      5.43      5.03      57
        INDEX_CN_BIG.put("159362", "指数-大盘             ");//A500ETF工银           市值：26.64     累涨：23.37     9.20      5.97      8.20      5.43      5.03      58
        INDEX_CN_BIG.put("159339", "指数-大盘             ");//A500ETF               市值：68.29     累涨：23.05     9.13      5.75      8.17      5.40      5.09      59
        INDEX_CN_BIG.put("530080", "指数-大盘             ");//180指数ETF            市值：0.47      累涨：18.03     4.07      5.77      8.19      5.37      4.98      60
        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：33.46     累涨：21.89     7.87      6.98      7.04      5.34      5.13      61
        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：9.91      累涨：19.08     6.78      4.84      7.75      5.34      4.85      62
        INDEX_CN_BIG.put("159215", "指数-大盘             ");//中证A500ETF指数基金   市值：18.03     累涨：5.33                          5.33      5.33      5.33      63
        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.63      累涨：26.27     11.01     7.51      7.75      5.31      4.08      64
        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：2.57      累涨：16.86     5.30      3.92      7.84      5.30      4.43      65
        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.47      累涨：21.79     8.21      5.42      8.16      5.29      4.66      66
        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.76      累涨：18.37     6.17      4.04      8.16      5.25      4.35      67
        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：1.06      累涨：26.93     10.88     7.92      8.13      5.24      4.76      68
        INDEX_CN_BIG.put("563800", "指数-大盘             ");//中证A500ETF龙头       市值：194.43    累涨：24.06     9.54      6.48      8.04      5.23      4.92      69
        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2512.36   累涨：23.09     8.22      6.12      8.75      5.23      4.87      70
        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.15      累涨：23.55     8.43      6.27      8.85      5.23      4.95      71
        INDEX_CN_BIG.put("560610", "指数-大盘             ");//A500指数ETF           市值：113.26    累涨：23.58     9.53      6.02      8.03      5.22      4.80      72
        INDEX_CN_BIG.put("560500", "指数-大盘             ");//500质量成长ETF        市值：5.08      累涨：26.74     10.35     7.14      9.25      5.19      4.26      73
        INDEX_CN_BIG.put("560350", "指数-大盘             ");//中证A50ETF指数基金    市值：31.97     累涨：24.12     8.36      5.76      10.09     5.18      4.65      74
        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.48      累涨：23.69     7.37      7.38      9.33      5.18      4.68      75
        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：1.29      累涨：7.45                0.10      7.45      5.16      4.26      76
        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：1.54      累涨：20.02     7.28      4.25      8.58      5.15      4.88      77
        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：22.64     累涨：23.81     7.95      5.91      9.95      5.14      4.43      78
        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：202.70    累涨：21.14     7.14      5.87      8.13      5.08      4.52      79
        INDEX_CN_BIG.put("159359", "指数-大盘             ");//中证A500ETF华安       市值：29.54     累涨：23.21     9.27      6.13      7.81      5.06      4.66      80
        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1776.64   累涨：22.85     8.18      6.19      8.48      5.06      4.74      81
        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：0.96      累涨：22.71     9.62      4.58      8.51      5.04      4.58      82
        INDEX_CN_BIG.put("563220", "指数-大盘             ");//中证A500ETF富国       市值：179.51    累涨：23.59     9.37      6.10      8.12      5.03      4.83      83
        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF指数         市值：0.97      累涨：22.87     7.40      6.48      8.99      5.03      4.49      84
        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：38.08     累涨：24.68     8.39      5.87      10.42     5.03      4.42      85
        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利100ETF            市值：0.73      累涨：18.79     6.87      4.48      8.03      5.02      3.95      86
        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：94.57     累涨：18.83     7.27      4.49      7.82      4.99      3.66      87
        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.21      累涨：18.93     6.93      4.64      7.36      4.99      4.27      88
        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.63      累涨：24.56     9.30      6.22      9.04      4.98      4.08      89
        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.74      累涨：28.28     12.53     7.11      8.64      4.98      4.38      90
        INDEX_CN_BIG.put("560530", "指数-大盘             ");//中证A500ETF摩根       市值：87.54     累涨：23.60     9.67      6.26      7.67      4.95      4.65      91
        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：1.98      累涨：22.08     6.75      6.57      8.86      4.93      4.44      92
        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：23.83     累涨：23.71     8.17      5.78      9.76      4.92      4.48      93
        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.89      累涨：20.52     8.29      5.20      7.39      4.92      4.85      94
        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：1.04      累涨：18.46     7.03      4.07      7.73      4.91      4.46      95
        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.26      累涨：26.96     12.28     6.10      8.58      4.91      4.49      96
        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：10.12     累涨：17.12     5.80      3.88      7.85      4.90      4.42      97
        INDEX_CN_BIG.put("159356", "指数-大盘             ");//A500ETF基金           市值：51.35     累涨：22.54     9.00      5.88      7.66      4.88      4.48      98
        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.26      累涨：24.90     9.15      7.04      8.71      4.88      4.33      99
        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：2.30      累涨：22.97     8.87      5.91      8.19      4.87      4.63      100
        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：81.40     累涨：19.39     7.37      5.04      8.06      4.86      3.74      101
        INDEX_CN_BIG.put("159360", "指数-大盘             ");//中证A500ETF天弘       市值：35.17     累涨：23.08     9.59      6.01      7.48      4.84      4.74      102
        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：11.66     累涨：21.31     7.75      5.54      8.02      4.84      4.43      103
        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.46      累涨：16.61     3.38      5.47      7.76      4.83      4.34      104
        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：47.22     累涨：22.56     7.78      5.83      9.07      4.82      4.21      105
        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.33      累涨：23.52     8.55      6.32      8.65      4.81      4.30      106
        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.53      累涨：17.57     6.71      3.73      8.37      4.80      4.05      107
        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.74      累涨：16.54     6.86      2.93      7.69      4.80      4.06      108
        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：40.47     累涨：22.67     8.23      6.38      8.06      4.79      4.41      109
        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：225.22    累涨：18.58     7.36      4.00      8.25      4.79      3.53      110
        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：83.61     累涨：21.87     8.43      5.49      7.95      4.79      4.45      111
        INDEX_CN_BIG.put("159376", "指数-大盘             ");//A500ETF指数基金       市值：4.51      累涨：23.21     9.31      5.99      7.91      4.78      4.49      112
        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.31      累涨：20.91     8.10      5.57      7.47      4.76      4.30      113
        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：5.31      累涨：29.73     13.58     8.64      7.51      4.72      4.40      114
        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.47      累涨：23.57     8.42      7.02      8.13      4.69      4.27      115
        INDEX_CN_BIG.put("562330", "指数-大盘             ");//中证500价值ETF        市值：0.15      累涨：20.72     7.69      6.05      7.38      4.67      3.45      116
        INDEX_CN_BIG.put("562890", "指数-大盘             ");//中证A50指数ETF        市值：4.90      累涨：24.08     8.55      6.08      9.54      4.66      4.05      117
        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.22      累涨：23.42     9.02      6.19      8.31      4.66      4.05      118
        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波动ETF         市值：36.69     累涨：16.81     6.70      2.98      7.40      4.65      3.76      119
        INDEX_CN_BIG.put("159338", "指数-大盘             ");//中证A500ETF           市值：227.46    累涨：24.53     9.61      6.95      7.97      4.65      4.33      120
        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.57      累涨：26.92     9.94      8.15      8.83      4.64      4.15      121
        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.74      累涨：19.58     8.76      4.00      7.61      4.63      3.50      122
        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：59.67     累涨：24.19     8.58      6.22      9.57      4.63      3.94      123
        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波50ETF         市值：1.14      累涨：19.06     7.87      3.51      8.31      4.60      3.29      124
        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.33      累涨：21.83     8.78      5.45      7.60      4.58      4.21      125
        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：8.73      累涨：17.39     7.01      3.08      7.40      4.57      3.41      126
        INDEX_CN_BIG.put("563500", "指数-大盘             ");//中证A500ETF华宝       市值：14.84     累涨：23.13     9.57      6.07      7.49      4.57      4.18      127
        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：25.20     累涨：17.95     7.19      4.03      7.23      4.57      3.29      128
        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1533.68   累涨：22.04     6.96      6.69      8.54      4.55      4.04      129
        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：20.97     累涨：19.44     7.21      5.41      7.24      4.55      3.72      130
        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.13      累涨：28.87     13.73     6.69      8.45      4.52      4.12      131
        INDEX_CN_BIG.put("159836", "指数-大盘             ");//创300ETF              市值：1.77      累涨：38.95     18.93     12.59     7.43      4.52      4.28      132
        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：6.14      累涨：22.11     8.55      5.68      7.88      4.47      4.29      133
        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：24.89     累涨：27.55     10.42     9.20      8.44      4.46      3.70      134
        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：6.14      累涨：21.36     7.32      6.65      7.58      4.43      4.00      135
        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.32      累涨：19.01     7.66      3.88      7.73      4.42      4.00      136
        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：36.11     累涨：21.41     8.07      5.87      7.47      4.40      4.13      137
        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：34.47     累涨：22.03     7.74      5.92      8.37      4.39      3.79      138
        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.80      累涨：15.49     6.21      2.36      7.01      4.38      3.64      139
        INDEX_CN_BIG.put("159379", "指数-大盘             ");//A500ETF融通           市值：4.64      累涨：20.10     5.77      7.26      7.07      4.37      3.79      140
        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.63      累涨：25.50     9.94      7.60      8.07      4.37      3.85      141
        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：19.70     累涨：22.54     6.89      7.05      8.68      4.36      3.70      142
        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：2.81      累涨：22.06     9.02      5.39      7.65      4.35      3.93      143
        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.48      累涨：21.94     8.04      5.74      8.16      4.34      3.98      144
        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：11.67     累涨：23.98     8.88      5.87      9.23      4.30      3.76      145
        INDEX_CN_BIG.put("515330", "指数-大盘             ");//300ETF天弘            市值：102.03    累涨：21.77     8.28      5.83      7.66      4.29      3.93      146
        INDEX_CN_BIG.put("560510", "指数-大盘             ");//中证A500ETF           市值：68.38     累涨：22.03     9.32      5.72      6.99      4.29      3.98      147
        INDEX_CN_BIG.put("512020", "指数-大盘             ");//A500ETF指数           市值：39.28     累涨：22.05     9.52      5.91      6.62      4.27      3.97      148
        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：6.01      累涨：18.43     7.16      4.91      6.96      4.26      3.92      149
        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：24.91     累涨：22.87     8.67      6.40      7.80      4.26      3.95      150
        INDEX_CN_BIG.put("562530", "指数-大盘             ");//中证1000价值ETF       市值：0.54      累涨：24.65     9.41      8.50      6.74      4.26      3.04      151
        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：52.84     累涨：20.51     8.53      5.17      6.81      4.25      3.28      152
        INDEX_CN_BIG.put("159380", "指数-大盘             ");//A500ETF东财           市值：3.99      累涨：22.80     9.72      6.37      6.71      4.24      3.95      153
        INDEX_CN_BIG.put("510800", "指数-大盘             ");//50ETF基金             市值：5.30      累涨：20.85     6.91      6.05      7.89      4.24      3.83      154
        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.17      累涨：26.55     12.12     6.80      7.63      4.24      4.07      155
        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：61.79     累涨：27.65     12.44     7.25      7.96      4.23      3.73      156
        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.12      累涨：25.80     10.52     6.95      8.79      4.22      3.85      157
        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：3.86      累涨：21.57     8.48      5.72      7.37      4.20      3.75      158
        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：1.85      累涨：22.63     8.43      6.42      7.78      4.20      4.00      159
        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.22      累涨：23.82     9.03      6.69      8.10      4.19      3.40      160
        INDEX_CN_BIG.put("159353", "指数-大盘             ");//中证A500ETF景顺       市值：133.30    累涨：23.01     9.77      6.31      6.93      4.19      3.78      161
        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：74.65     累涨：17.61     6.49      3.92      7.56      4.18      2.92      162
        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：22.95     累涨：21.05     7.91      6.45      6.69      4.17      3.52      163
        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：153.25    累涨：18.75     8.09      3.97      7.42      4.16      3.08      164
        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：2.18      累涨：28.87     13.20     8.74      6.93      4.15      3.52      165
        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：1.57      累涨：21.56     7.87      6.38      7.31      4.13      3.66      166
        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：1.99      累涨：22.25     7.50      6.74      8.04      4.12      3.70      167
        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.43      累涨：16.93     6.17      4.20      6.64      4.09      3.97      168
        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：79.97     累涨：23.45     8.66      5.43      9.36      4.07      3.55      169
        INDEX_CN_BIG.put("159209", "指数-大盘             ");//中证红利质量ETF       市值：2.44      累涨：4.02                          4.02      4.02      3.12      170
        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.39      累涨：25.78     10.76     6.58      8.44      4.02      3.56      171
        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：40.39     累涨：22.50     8.25      6.04      8.33      3.99      3.51      172
        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：1.88      累涨：20.07     6.03      6.37      7.78      3.97      3.44      173
        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：4.77      累涨：21.45     9.05      6.12      6.28      3.96      3.65      174
        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3640.88   累涨：21.64     8.31      6.03      7.30      3.94      3.59      175
        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：11.04     累涨：22.56     8.04      6.40      8.24      3.94      3.32      176
        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.72      累涨：20.40     7.89      5.72      6.79      3.94      3.44      177
        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：1.00      累涨：22.83     9.12      6.34      7.47      3.94      3.06      178
        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.18      累涨：22.56     8.66      6.30      7.60      3.93      3.57      179
        INDEX_CN_BIG.put("560750", "指数-大盘             ");//A500ETF申万菱信       市值：1.51      累涨：15.77     2.74      5.98      7.05      3.87      3.68      180
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.46      累涨：24.73     9.67      6.98      8.08      3.86      3.35      181
        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：1.47      累涨：19.47     7.70      4.56      7.54      3.85      3.11      182
        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.44      累涨：19.97     7.16      5.62      7.19      3.85      3.41      183
        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：1.32      累涨：17.99     7.80      3.50      8.44      3.84      2.64      184
        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.97      累涨：20.43     7.67      5.78      6.98      3.84      3.49      185
        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：0.98      累涨：19.13     8.35      3.70      7.44      3.83      3.25      186
        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：2.94      累涨：22.71     8.53      6.30      7.88      3.83      3.54      187
        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.29      累涨：19.56     7.52      4.44      7.69      3.82      3.64      188
        INDEX_CN_BIG.put("563660", "指数-大盘             ");//A500ETF银河           市值：4.87      累涨：3.81                          3.81      3.81      3.81      189
        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：36.08     累涨：21.20     8.37      5.71      7.12      3.78      3.59      190
        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.31      累涨：21.70     8.28      6.19      7.23      3.73      3.20      191
        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：24.66     累涨：21.25     8.44      5.91      6.90      3.72      3.57      192
        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：3.43      累涨：6.72                0.10      6.62      3.64      3.44      193
        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：12.24     累涨：23.17     8.56      6.08      8.53      3.63      3.28      194
        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：2.32      累涨：15.44     6.35      3.31      5.98      3.59      3.19      195
        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：47.37     累涨：20.68     6.82      6.60      7.41      3.56      3.04      196
        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：9.69      累涨：20.16     7.75      5.70      6.71      3.56      3.39      197
        INDEX_CN_BIG.put("512080", "指数-大盘             ");//A500ETF中金           市值：16.56     累涨：17.52     5.27      6.09      6.16      3.56      3.27      198
        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：5.60      累涨：21.00     8.42      5.73      6.85      3.54      3.23      199
        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：41.74     累涨：20.13     8.16      5.56      6.41      3.52      3.22      200
        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：7.79      累涨：17.99     8.20      3.87      6.84      3.49      2.50      201
        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1591.52   累涨：21.69     8.59      6.14      6.96      3.48      3.21      202
        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.78      累涨：18.76     7.96      4.09      7.01      3.46      2.95      203
        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.11      累涨：19.54     7.89      6.03      6.09      3.44      2.74      204
        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：14.38     累涨：17.47     7.79      3.56      6.74      3.42      2.48      205
        INDEX_CN_BIG.put("562060", "指数-大盘             ");//标普红利ETF           市值：14.67     累涨：18.57     7.76      5.10      6.46      3.42      2.13      206
        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.21      累涨：27.20     12.51     7.91      6.78      3.39      3.11      207
        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.37      累涨：19.97     7.38      5.39      7.70      3.34      2.73      208
        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.14      累涨：20.46     7.56      6.10      6.80      3.33      2.94      209
        INDEX_CN_BIG.put("515300", "指数-大盘             ");//红利低波ETF基金       市值：52.66     累涨：15.83     7.06      3.38      5.69      3.29      2.56      210
        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：10.12     累涨：22.30     8.44      5.66      8.29      3.29      2.86      211
        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：1.94      累涨：20.98     8.60      5.95      6.43      3.24      2.92      212
        INDEX_CN_BIG.put("159361", "指数-大盘             ");//A500ETF易方达         市值：143.32    累涨：21.95     9.45      6.23      6.27      3.22      3.12      213
        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：0.94      累涨：17.45     6.90      5.12      5.90      3.21      2.74      214
        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.60      累涨：22.76     8.20      7.34      7.32      3.20      2.82      215
        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：2.78      累涨：19.75     9.42      4.78      5.74      3.19      2.96      216
        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：38.83     累涨：21.01     8.21      6.05      6.75      3.18      2.82      217
        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：1.78      累涨：18.87     6.86      6.20      5.81      3.17      2.77      218
        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：16.79     累涨：16.15     6.78      3.42      7.44      3.11      2.28      219
        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：4.46      累涨：17.70     4.46      5.81      7.43      3.09      2.80      220
        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：8.50      累涨：21.04     8.42      5.95      6.67      3.08      2.73      221
        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.51      累涨：27.68     13.16     6.90      7.62      3.08      2.51      222
        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：20.85     累涨：19.84     7.92      5.71      6.21      2.95      2.59      223
        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.44      累涨：21.04     8.30      6.58      6.63      2.89      2.42      224
        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：15.82     累涨：20.76     8.41      6.75      5.60      2.84      2.57      225
        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：1.24      累涨：20.01     6.91      6.17      6.93      2.82      2.28      226
        INDEX_CN_BIG.put("159212", "指数-大盘             ");//深100ETF南方          市值：4.08      累涨：2.75                          2.75      2.75      2.75      227
        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.46      累涨：16.77     6.74      4.87      5.45      2.74      2.25      228
        INDEX_CN_BIG.put("159661", "指数-大盘             ");//中证A100指数ETF       市值：0.32      累涨：21.04     8.24      6.21      6.59      2.67      2.15      229
        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：3.15      累涨：17.39     8.57      3.56      6.04      2.63      1.76      230
        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：4.15      累涨：17.75     8.02      4.76      4.97      2.51      2.24      231
        INDEX_CN_BIG.put("512550", "指数-大盘             ");//A50ETF基金            市值：4.02      累涨：20.19     7.46      6.27      7.06      2.32      1.80      232
        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.56      累涨：19.68     7.19      6.72      5.92      2.20      1.73      233
        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.51      累涨：24.53     12.27     6.38      5.88      2.09      1.74      234
        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.23      累涨：15.76     7.27      4.20      4.92      1.68      0.92      235
        INDEX_CN_BIG.put("159390", "指数-大盘             ");//A50指数ETF            市值：8.71      累涨：1.59                          1.59      1.59      1.59      236
        INDEX_CN_BIG.put("159207", "指数-大盘             ");//高股息ETF             市值：4.17      累涨：1.13                          1.13      1.13      1.13      237
        INDEX_CN_BIG.put("515780", "指数-大盘             ");//浦银MSCI中国ETF       市值：0.08      累涨：10.97     8.38      2.59                                    238
        INDEX_CN_BIG.put("159216", "指数-大盘             ");//深证100ETF大成        市值：4.44      累涨：                                                            239
    }
    public static Map<String, String> INDEX_CN_CITY = new HashMap<>();//指数-国内城市
    static {
        INDEX_CN_CITY.put("159976", "指数-国内城市         ");//湾创ETF               市值：1.19      累涨：33.24     7.08      16.06     13.43     8.12      4.73      1
        INDEX_CN_CITY.put("512970", "指数-国内城市         ");//大湾区ETF             市值：0.75      累涨：29.62     9.03      14.23     9.72      6.35      4.34      2
        INDEX_CN_CITY.put("159623", "指数-国内城市         ");//成渝经济圈ETF         市值：32.83     累涨：29.66     7.39      17.26     8.94      5.74      3.04      3
        INDEX_CN_CITY.put("159743", "指数-国内城市         ");//湖北ETF               市值：1.57      累涨：40.34     12.22     20.84     14.69     5.67      2.86      4
        INDEX_CN_CITY.put("517160", "指数-国内城市         ");//长江保护主题ETF       市值：13.73     累涨：22.55     4.70      11.26     9.63      5.63      4.10      5
        INDEX_CN_CITY.put("512870", "指数-国内城市         ");//杭州湾区ETF           市值：0.41      累涨：33.69     11.23     17.08     12.09     5.51      3.32      6
        INDEX_CN_CITY.put("517330", "指数-国内城市         ");//长江保护ETF           市值：13.72     累涨：22.51     4.98      11.97     8.90      5.47      3.81      7
        INDEX_CN_CITY.put("515760", "指数-国内城市         ");//浙江国资ETF           市值：1.78      累涨：22.05     6.08      11.51     7.53      5.15      2.60      8
        INDEX_CN_CITY.put("517850", "指数-国内城市         ");//张江ETF               市值：0.63      累涨：47.34     14.21     25.01     15.55     5.06      2.61      9
        INDEX_CN_CITY.put("512650", "指数-国内城市         ");//长三角ETF             市值：3.94      累涨：25.38     7.56      13.08     9.40      5.01      3.10      10
        INDEX_CN_CITY.put("159831", "指数-国内城市         ");//上海金ETF基金         市值：2.27      累涨：22.55     5.29      11.40     6.48      4.44      3.36      11
        INDEX_CN_CITY.put("518600", "指数-国内城市         ");//上海金ETF             市值：8.75      累涨：22.68     5.05      11.80     6.50      4.43      3.38      12
        INDEX_CN_CITY.put("159830", "指数-国内城市         ");//上海金ETF             市值：5.91      累涨：22.15     5.18      11.31     6.38      4.41      3.36      13
        INDEX_CN_CITY.put("518890", "指数-国内城市         ");//中银上海金ETF         市值：9.21      累涨：22.57     5.20      11.83     6.25      4.29      3.17      14
        INDEX_CN_CITY.put("512190", "指数-国内城市         ");//浙商之江凤凰ETF       市值：0.61      累涨：19.24     6.80      9.42      7.09      3.58      2.79      15
        INDEX_CN_CITY.put("510810", "指数-国内城市         ");//上海国企ETF           市值：76.95     累涨：20.42     7.35      10.53     5.90      3.39      2.18      16
    }
    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_NOT_USA);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_HK);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
        INDEX.putAll(INDEX_CN_CITY);
    }

    /**
     * 金融-证券
     */
    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券
    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：75.43     累涨：45.63     10.02     23.88     19.52     6.45      0.24      1
        JINRONG_ZHENGQUAN.put("513190", "金融-证券             ");//港股通金融ETF         市值：5.97      累涨：36.13     10.70     15.98     13.12     6.28      0.91      2
        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：76.19     累涨：30.07     8.75      13.28     10.63     5.44      0.39      3
        JINRONG_ZHENGQUAN.put("513140", "金融-证券             ");//港股金融ETF           市值：0.79      累涨：33.30     7.69      16.16     12.93     5.33      0.95      4
        JINRONG_ZHENGQUAN.put("159933", "金融-证券             ");//国投金融地产ETF       市值：1.50      累涨：21.91     7.63      7.35      8.10      4.82      1.43      5
        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.37      累涨：26.50     7.43      12.26     9.73      4.78                6
        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.87      累涨：29.86     8.90      13.56     10.10     4.69                7
        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.64      累涨：31.47     10.77     13.28     10.13     4.55      0.36      8
        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.21      累涨：30.07     10.07     12.78     9.57      4.51                9
        JINRONG_ZHENGQUAN.put("510230", "金融-证券             ");//金融ETF               市值：46.48     累涨：21.76     7.71      7.15      8.07      4.35      1.36      10
        JINRONG_ZHENGQUAN.put("510650", "金融-证券             ");//金融地产ETF           市值：0.42      累涨：22.53     7.87      7.22      8.61      4.31      1.64      11
        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：69.93     累涨：30.78     10.01     13.40     9.99      4.18                12
        JINRONG_ZHENGQUAN.put("159931", "金融-证券             ");//金融ETF               市值：0.68      累涨：22.85     7.34      8.90      8.70      4.16      1.04      13
        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：65.82     累涨：31.85     10.53     14.29     10.09     4.15                14
        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：255.88    累涨：31.28     10.18     14.06     9.94      4.13                15
        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：310.87    累涨：32.37     10.77     14.41     10.41     4.13                16
        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：3.86      累涨：30.51     9.89      13.77     9.98      4.12                17
        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：10.67     累涨：31.06     10.04     13.70     10.23     4.08      0.15      18
        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.61      累涨：26.88     8.54      12.04     9.07      4.03                19
        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：4.05      累涨：30.79     10.17     13.40     9.94      4.03                20
        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：19.26     累涨：31.44     10.32     14.09     10.12     4.01                21
        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.97      累涨：29.19     8.88      13.00     9.91      4.00      0.10      22
        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：19.57     累涨：30.36     9.98      13.34     9.88      3.99                23
        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：8.38      累涨：31.15     10.39     13.82     9.81      3.96      0.09      24
        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.37      累涨：30.38     9.86      13.63     9.54      3.83                25
        JINRONG_ZHENGQUAN.put("159940", "金融-证券             ");//金融地产ETF           市值：10.30     累涨：21.99     7.95      7.87      7.85      3.82      1.03      26
        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：16.77     累涨：30.06     10.34     12.85     9.32      3.81      0.08      27
        JINRONG_ZHENGQUAN.put("512640", "金融-证券             ");//金融地产ETF基金       市值：0.72      累涨：21.48     7.00      7.63      8.24      3.70      1.00      28
        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.87      累涨：27.57     9.17      12.19     7.03      2.52      0.41      29
    }
    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金
    static {
        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：0.52      累涨：40.00     8.07      14.11     18.04     14.10     9.73      1
        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：28.67     累涨：40.22     8.97      13.88     18.15     13.70     9.29      2
        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金产业ETF           市值：0.19      累涨：39.60     9.52      12.61     17.57     13.63     9.29      3
        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：3.32      累涨：37.70     8.03      13.20     17.33     13.42     8.74      4
        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.40      累涨：38.15     9.01      12.48     16.87     13.25     8.91      5
        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：2.24      累涨：38.05     7.54      13.45     17.49     13.22     8.54      6
        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：16.69     累涨：23.27     5.59      11.74     6.72      4.59      3.44      7
        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：4.45      累涨：22.63     5.25      11.56     6.49      4.48      3.43      8
        JINRONG_GOLD.put("159831", "金融-黄金             ");//上海金ETF基金         市值：2.27      累涨：22.55     5.29      11.40     6.48      4.44      3.36      9
        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：105.41    累涨：22.67     5.43      11.55     6.38      4.43      3.32      10
        JINRONG_GOLD.put("518600", "金融-黄金             ");//上海金ETF             市值：8.75      累涨：22.68     5.05      11.80     6.50      4.43      3.38      11
        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：9.98      累涨：23.30     5.38      12.14     6.45      4.43      3.40      12
        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：186.23    累涨：22.85     5.34      11.65     6.49      4.42      3.40      13
        JINRONG_GOLD.put("159830", "金融-黄金             ");//上海金ETF             市值：5.91      累涨：22.15     5.18      11.31     6.38      4.41      3.36      14
        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：367.67    累涨：23.15     5.46      11.91     6.44      4.39      3.37      15
        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：162.14    累涨：22.85     5.42      11.70     6.42      4.37      3.36      16
        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：22.41     累涨：22.88     5.39      11.66     6.48      4.34      3.36      17
        JINRONG_GOLD.put("159834", "金融-黄金             ");//金ETF                 市值：5.10      累涨：22.00     5.04      11.36     6.32      4.32      3.28      18
        JINRONG_GOLD.put("518680", "金融-黄金             ");//金ETF                 市值：10.83     累涨：22.82     5.31      11.84     6.34      4.29      3.38      19
        JINRONG_GOLD.put("518890", "金融-黄金             ");//中银上海金ETF         市值：9.21      累涨：22.57     5.20      11.83     6.25      4.29      3.17      20
    }
    public static Map<String, String> JINRONG_BANK = new HashMap<>();
    static {
        JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：1.18      累涨：37.72     17.46     12.76     7.50      3.90      2.30      1
        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF华夏           市值：3.66      累涨：25.97     10.68     9.31      6.17      2.92      1.26      2
        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：23.34     累涨：26.18     11.21     9.60      5.75      2.62      1.08      3
        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：12.46     累涨：26.72     11.40     9.84      5.74      2.60      1.13      4
        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：39.04     累涨：25.96     10.82     9.64      5.72      2.56      1.13      5
        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.19      累涨：24.95     11.57     8.07      5.62      2.53      1.02      6
        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：81.03     累涨：26.36     11.14     9.77      5.92      2.49      0.87      7
        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：12.15     累涨：24.82     10.30     9.10      5.58      2.46      1.07      8
        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：4.98      累涨：25.04     10.96     8.97      5.44      2.39      0.90      9
        JINRONG_BANK.put("512730", "金融-银行             ");//中证银行ETF           市值：0.85      累涨：25.23     10.88     9.57      5.24      2.37      0.92      10
    }
    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();
    static {
        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.67      累涨：23.90     5.84      9.34      8.72      4.86      1.86      1
        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：5.88      累涨：25.44     6.41      10.13     8.90      4.48      1.19      2
        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.55      累涨：22.72     6.16      9.08      7.48      4.09      1.71      3
        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.84      累涨：31.36     5.93      15.13     10.63     3.93                4
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：7.16      累涨：31.56     5.97      15.82     9.77      3.10                5
        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：5.10      累涨：30.93     5.58      16.51     8.84      2.98                6
        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：1.16      累涨：20.31     3.84      8.54      8.33      2.93      0.48      7
        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：61.47     累涨：30.35     5.85      15.82     8.82      2.86                8
        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF基金       市值：0.76      累涨：19.59     5.91      8.35      5.55      2.62      0.49      9
        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.55      累涨：19.86     6.74      8.93      4.66      2.41      0.66      10
        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.36      累涨：20.92     3.86      9.15      8.33      2.28      0.31      12
        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.59     累涨：20.31     6.19      9.39      4.73      2.27      0.61      13
        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.41      累涨：20.62     7.50      8.60      5.04      2.20      0.52      15
        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：6.36      累涨：20.87     3.87      9.71      7.67      1.99                20
        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：27.19     累涨：20.34     4.04      9.02      7.37      1.87      0.94      22
        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.68      累涨：15.05     5.01      6.99      3.46      1.53      0.51      24
        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.90      累涨：9.90      0.73      5.45      3.72      1.51      1.08      25
        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.63      累涨：14.95     6.58      4.88      3.49      1.36      1.02      26
        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.72      累涨：13.41     4.91      6.10      2.94      1.20      0.22      27
        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.71      累涨：14.06     4.28      7.03      3.17      1.16      0.53      28
        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：0.67      累涨：14.21     6.55      4.46      3.31      1.15      0.92      29
    }
    public static Map<String, String> JINRONG_CASH = new HashMap<>();
    static {
        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：15.73     累涨：3.41                          3.41      3.31      2.10      1
        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：23.23     累涨：3.69                          3.69      2.89      1.19      2
        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：31.68     累涨：0.59      0.02      0.35      0.23      0.14      0.13      3
        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：0.36      0.10      0.12      0.14      0.10      0.07      4
        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：611.01    累涨：0.42      0.14      0.17      0.11      0.06      0.02      5
        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：12.90     累涨：0.19      0.05      0.09      0.05      0.04      0.01      6
        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.54      累涨：0.15      0.03      0.07      0.05      0.03      0.02      7
        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：683.98    累涨：0.19      0.03      0.11      0.05      0.02      0.01      8
        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.14      累涨：16.28     0.26      15.95     0.07      0.02      0.01      9
        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.44      累涨：16.24     0.06      16.18     0.04      0.02      0.01      10
        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.59      累涨：0.11      0.03      0.05      0.03      0.02      0.01      11
        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：5.97      累涨：0.16      0.06      0.07      0.03      0.02      0.01      12
        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.54      累涨：10.52     0.04      9.90      0.58      0.01                13
        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.16      累涨：7.74      0.25      7.45      0.04      0.01                14
        JINRONG_CASH.put("511670", "金融-现金             ");//华泰天天金ETF         市值：0.17      累涨：18.67     0.02      18.58     0.07      0.01                15
        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.28      累涨：3.49      0.06      3.39      0.04      0.01                16
        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.30      累涨：10.32     0.14      10.15     0.03      0.01                17
        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：7.58      累涨：0.20      0.07      0.10      0.03      0.01                18
        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.23      累涨：9.32      0.04      9.25      0.03      0.01                19
        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：109.28    累涨：0.14      0.05      0.06      0.03      0.01                20
        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.21      累涨：13.09     0.08      12.96     0.05      0.01                21
        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：1.68      累涨：0.23      0.05      0.15      0.04      0.01                22
        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.37      累涨：0.10      0.04      0.05      0.01      0.01                23
        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.43      累涨：0.10      0.05      0.04      0.01      0.01                24
        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.35      累涨：17.18     0.06      17.10     0.02                          25
        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.60      累涨：                                                            26
        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.82      累涨：                                                            27
        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：9.90      累涨：                                                            28
        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.26      累涨：25.15     0.07      25.07     0.01                          29
        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.94      累涨：0.09      0.03      0.06                                    30
    }
    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();
    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }
    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     * 
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }

    /**
     * ETF涨幅数据：查询数据根据名称列表模糊查询
     */
    private static void findByTypeName(String date) {
        String typeEn = "";
        String typeCn = "";
        CondStockAdrCount condition = new CondStockAdrCount();
        condition.setDate(date);
        condition.setOrderBy(ORDER_FIELD_ADR_UP_SUM_1_10 + DB_DESC);

        // 科技
        {
            //        condition.setLikeNameList(ContEtfNameKey.ETF_NAME_NAME_LIST_LIKE_CN_HK);//港股指数
//        condition.setLikeNameList(ContEtfNameKey.ETF_NAME_NAME_LIST_LIKE_KEJI_XIN_PIAN);//科技-芯片
//        condition.setLikeNameList(ContEtfNameKey.ETF_NAME_NAME_LIST_LIKE_XIAO_FEI_HK);//
//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT_NSDK);
//        condition.setLikeNameList(ContEtfNameKey.KEJI_ELECTRICITY);

        condition.setLikeNameList(ContEtfNameKey.KEJI_RUAN_JIAN);//科技-软件
        typeEn = "KEJI_RUAN_JIAN";
        typeCn = ContEtfTypeName.KEJI_RUAN_JIAN;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_GONG_YE);
//        condition.setNotLikeNameList(ContEtfNameKey.KEJI_GONG_YE_NOLIKE);
//        typeEn = "KEJI_GONG_YE";
//        typeCn = ContEtfTypeName.KEJI_GONG_YE;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_TONG_XIN);
//        condition.setNotLikeNameList(ContEtfNameKey.KEJI_GONG_YE_NOLIKE);
//        typeEn = "KEJI_TONG_XIN";
//        typeCn = ContEtfTypeName.KEJI_TONG_XIN;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_NEW_CAR);
//        typeEn = "KEJI_NEW_CAR";
//        typeCn = ContEtfTypeName.KEJI_NEW_CAR;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_NEW_ENERGY);
//        typeEn = "KEJI_NEW_ENERGY";
//        typeCn = ContEtfTypeName.KEJI_NEW_ENERGY;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_HK);
//        typeEn = "KEJI_HK";
//        typeCn = ContEtfTypeName.KEJI_HK;
        }



        // 消费
        {
            //        condition.setLikeNameList(XIAOFEI_HK);

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_WINE);
//        typeEn = "XIAOFEI_WINE";
//        typeCn = ContEtfTypeName.XIAOFEI_WINE;

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_COMMON);
//        condition.setNotLikeNameList(ContEtfNameKey.XIAOFEI_COMMON_NOLIKE);
//        typeEn = "XIAOFEI_COMMON";
//        typeCn = ContEtfTypeName.XIAOFEI_COMMON;

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_MEDIA);
//        typeEn = "XIAOFEI_MEDIA";
//        typeCn = ContEtfTypeName.XIAOFEI_MEDIA;
        }


        // 金融
        {
            //        condition.setNotLikeNameList(JINRONG);
//        condition.setLikeNameList(JINRONG_BANK);
//        condition.setLikeNameList(JINRONG_FANGDICHAN);
//        condition.setLikeNameList(ContEtfNameKey.JINRONG_ZHENGQUAN);
//        condition.setNotLikeNameList(ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE);
//        typeEn = "JINRONG_ZHENGQUAN";
//        typeCn = ContEtfTypeName.JINRONG_ZHENGQUAN;

//        condition.setLikeNameList(ContEtfNameKey.JINRONG_CASH);
//        typeEn = "JINRONG_CASH";
//        typeCn = ContEtfTypeName.JINRONG_CASH;

//        condition.setLikeNameList(JINRONG_COMMON);
//        condition.setLikeNameList(ContEtfNameKey.JINRONG_GOLD);
//        condition.setNotLikeNameList(ContEtfNameKey.JINRONG_GOLD_NOLIKE);

//        typeEn = "JINRONG_GOLD";
//        typeCn = ContEtfTypeName.JINRONG_GOLD;
//        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
        }


        // 医疗
//        condition.setLikeNameList(ContEtfNameKey.YILIAO_COMMON);
//        typeEn = "YILIAO_COMMON";
//        typeCn = ContEtfTypeName.YILIAO_COMMON;

        //指数
        {
            //        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT_USA);
//        typeEn = "INDEX_CN_NOT_USA";
//        typeCn = ContEtfTypeName.INDEX_CN_NOT_USA;

//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT);
//        typeEn = "INDEX_CN_NOT";
//        typeCn = ContEtfTypeName.INDEX_CN_NOT;

//            condition.setLikeNameList(ContEtfNameKey.INDEX_CN_BIG);
//            condition.setNotLikeNameList(ContEtfNameKey.INDEX_CN_BIG_NOLIKE);
//            typeEn = "INDEX_CN_BIG";
//            typeCn = ContEtfTypeName.INDEX_CN_BIG;

//        condition.setLikeNameList(ContEtfNameKey.INDEX_HK);
//        typeEn = "INDEX_HK";
//        typeCn = ContEtfTypeName.INDEX_HK;

//        condition.setLikeNameList(INDEX_300);
//        condition.setNotLikeNameList(INDEX_300_NOLIKE);

//        condition.setLikeNameList(ContEtfNameKey.INDEX_688);
//        typeEn = "INDEX_688";
//        typeCn = ContEtfTypeName.INDEX_688;

//        condition.setLikeNameList(INDEX_CN_1000);
//        condition.setNotLikeNameList(INDEX_CN_NOT);

//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_CITY);
//        typeEn = "INDEX_CN_CITY";
//        typeCn = ContEtfTypeName.INDEX_CN_CITY;

//        condition.setLikeNameList(ZIYUAN_OIL);
//        condition.setLikeNameList(ZIYUAN_NONGYE);
//        condition.setLikeNameList(ZIYUAN_CAILIAO);
//        condition.setLikeNameList(ContEtfNameKey.ZIYUAN_XIYOU);
//        typeEn = "ZIYUAN_XIYOU";
//        typeCn = ContEtfTypeName.ZIYUAN_XIYOU;

//        condition.setLikeNameList(ContEtfNameKey.ZIYUAN_COMMON);
//        condition.setNotLikeNameList(ContEtfNameKey.ZIYUAN_COMMON_NOLIKE);
//        typeEn = "ZIYUAN_COMMON";
//        typeCn = ContEtfTypeName.ZIYUAN_COMMON;
        }

//
        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
        EtfControl.saveOrUpdateListNetLastDay(condition, date);//保存或更新ETF涨幅次数-批量更新基础信息

        if (etfListLikeName == null) {
            System.out.println("数据为null");
        }
        int size6 = 6;
        int SIZE_10 = 10;
        int SIZE_22 = 22;
        int num = 0;//序号
        for (EtfAdrCountVo vo : etfListLikeName) {
            StringBuffer sb = new StringBuffer();

            sb.append(typeEn + ".put(\"").append(StockUtil.formatStName(vo.getF12(), size6)).append("\"");
            sb.append(", \"" + StockUtil.formatStName(typeCn, SIZE_22) + "\");");
//            sb.append(", \"" + StockUtil.formatStName(vo.getF14(), SIZE_22) + "\");");
            sb.append("//");
            sb.append(StockUtil.formatStName(vo.getF14(), SIZE_22));
            sb.append(StockUtil.formatStName("市值：", size6));
            BigDecimal marketValue = null;
            if (vo.getF20() != null) {
                marketValue = vo.getF20().divide(NUM_YI_1, 2, BigDecimal.ROUND_HALF_UP);
            }
            sb.append(StockUtil.formatDouble(marketValue, SIZE_10));
            sb.append(StockUtil.formatStName("累涨：", size6));
            if (vo.getADR_UP_SUM_1_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_40_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_40_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_20_40() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_20_40().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_20() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_20().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_10() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_10().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_5() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_5().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }

            sb.append(StockUtil.formatInt(++num, size6));
            System.out.println(sb);
        }


    }

    public static void main(String[] args) {
//                String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
        String date = "2025-04-11";
        findByTypeName(date);//查询数据根据类型名称模糊查询
    }
}
