package utils;

import ttjj.dto.CondEtfAdrCount;
import ttjj.dto.CondStockAdrCount;
import ttjj.dto.EtfAdrCountVo;
import ttjj.dto.Kline;
import ttjj.rank.EtfControl;
import ttjj.service.EtfAdrCountService;

import java.math.BigDecimal;
import java.util.*;
import java.util.stream.Collectors;

import static utils.Content.*;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {
    /**
     * 资源
     */
    public static Map<String, String> TOP_ZIYUAN_OIL = new HashMap<>();//资源-石油

    static {
        TOP_ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：8.02      累涨：59.76     26.60     14.85     18.31     10日：4.58      2.57      1.45      -0.44     1         累涨修正：69.81     净值区间：38      55      17      39      66      1
    }

    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();//资源-石油

    static {
        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：8.02      累涨：59.76     26.60     14.85     18.31     10日：4.58      2.57      1.45      -0.44     1         累涨修正：69.81     净值区间：38      55      17      39      66      1
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：6.63      累涨：59.44     26.29     15.01     18.14     10日：4.27      2.35      1.49      -0.32     2         累涨修正：69.04     净值区间：48      62      19      39      66      2
        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：1.13      累涨：27.47     7.05      8.68      11.74     10日：2.17      1.03                0.41      3         累涨修正：30.67     净值区间：48      52      18      43      72      3
        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.26      累涨：27.22     9.02      7.43      10.77     10日：1.82      0.75                0.65      4         累涨修正：29.79     净值区间：42      54      20      32      48      4
        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.38      累涨：23.80     7.25      7.08      9.47      10日：1.49      0.53                0.21      6         累涨修正：25.82     净值区间：47      55      29      29      40      5
        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.23      累涨：21.89     7.39      7.24      7.26      10日：1.88      1.04                0.52      5         累涨修正：24.81     净值区间：43      59      24      26      42      6
        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：1.40      累涨：21.21     5.80      7.04      8.37      10日：1.71      0.96                0.21      8         累涨修正：23.88     净值区间：69      69      17      31      60      7
        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：1.83      累涨：20.63     6.95      6.30      7.38      10日：1.85      0.88                0.49      7         累涨修正：23.36     净值区间：73      80      20      27      46      8
        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：1.63      累涨：21.22     6.63      6.95      7.64      10日：1.30      0.70                0.30      10        累涨修正：23.22     净值区间：44      47      21      46      61      9
        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.35      累涨：15.61     5.94      6.07      3.60      10日：1.80      0.90      0.15      0.89      9         累涨修正：18.61     净值区间：73      82      74      80      87      10
    }

    public static Map<String, String> TOP_ZIYUAN_COMMON = new HashMap<>();//资源-通用

    static {
        TOP_ZIYUAN_COMMON.put("516780", "资源-通用             ");//稀土ETF               市值：10.75     累涨：39.19     13.77     11.58     13.84     10日：6.51      2.48      2.04      -1.31     2         累涨修正：52.26     净值区间：44      56      75      83      87      1
    }

    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();//资源-通用

    static {
        ZIYUAN_COMMON.put("516780", "资源-通用             ");//稀土ETF               市值：10.75     累涨：39.19     13.77     11.58     13.84     10日：6.51      2.48      2.04      -1.31     2         累涨修正：52.26     净值区间：44      56      75      83      87      1
        ZIYUAN_COMMON.put("159715", "资源-通用             ");//稀土ETF易方达         市值：2.05      累涨：38.20     14.53     10.23     13.44     10日：6.19      2.22      1.96      -1.29     5         累涨修正：50.53     净值区间：43      57      75      84      89      2
        ZIYUAN_COMMON.put("516150", "资源-通用             ");//稀土ETF嘉实           市值：24.18     累涨：38.14     14.33     10.52     13.29     10日：5.94      2.05      1.80      -1.26     11        累涨修正：49.73     净值区间：44      55      73      82      87      3
        ZIYUAN_COMMON.put("159713", "资源-通用             ");//稀土ETF               市值：3.82      累涨：37.20     13.51     10.23     13.46     10日：6.37      2.28      1.92      -1.29     4         累涨修正：49.69     净值区间：36      49      69      81      86      4
        ZIYUAN_COMMON.put("159608", "资源-通用             ");//稀有金属ETF           市值：2.03      累涨：33.90     10.93     8.89      14.08     10日：7.14      3.70      2.42      -1.58     1         累涨修正：49.58     净值区间：37      59      76      84      87      5
        ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.12      累涨：37.28     16.66     8.94      11.68     10日：6.61      2.11      1.15      -1.93     2         累涨修正：48.3      净值区间：5       29      52      70      72      6
        ZIYUAN_COMMON.put("159671", "资源-通用             ");//稀有金属ETF基金       市值：4.80      累涨：33.29     11.56     8.06      13.67     10日：6.55      3.45      2.13      -1.43     8         累涨修正：47.55     净值区间：38      56      77      83      87      7
        ZIYUAN_COMMON.put("562800", "资源-通用             ");//稀有金属ETF           市值：8.45      累涨：32.98     10.89     8.41      13.68     10日：6.70      3.32      2.22      -1.45     3         累涨修正：47.44     净值区间：44      63      80      86      89      8
        ZIYUAN_COMMON.put("561800", "资源-通用             ");//稀有金属ETF基金       市值：0.86      累涨：33.00     11.97     7.67      13.36     10日：6.82      3.29      2.08      -1.02     7         累涨修正：47.27     净值区间：42      62      78      84      87      9
        ZIYUAN_COMMON.put("515210", "资源-通用             ");//钢铁ETF               市值：11.65     累涨：27.00     10.95     4.05      12.00     10日：9.15      6.06      2.37      -0.47     3         累涨修正：46.95     净值区间：65      81      83      83      85      10
        ZIYUAN_COMMON.put("562010", "资源-通用             ");//绿色能源ETF           市值：0.14      累涨：29.92     12.18     4.89      12.85     10日：7.10      4.43      2.35      -0.14     1         累涨修正：46.15     净值区间：75      82      89      89      92      11
        ZIYUAN_COMMON.put("516650", "资源-通用             ");//有色金属ETF基金       市值：1.26      累涨：34.37     14.48     8.31      11.58     10日：7.17      2.14      0.99      -2.13     6         累涨修正：45.66     净值区间：4       31      57      63      71      12
        ZIYUAN_COMMON.put("159881", "资源-通用             ");//有色60ETF             市值：0.52      累涨：34.59     14.58     8.59      11.42     10日：6.64      1.97      0.99      -1.78     10        累涨修正：45.18     净值区间：3       31      53      67      74      13
        ZIYUAN_COMMON.put("512400", "资源-通用             ");//有色金属ETF           市值：50.34     累涨：34.16     14.60     8.33      11.23     10日：6.64      2.00      1.05      -1.91     13        累涨修正：44.9      净值区间：9       36      51      68      73      14
        ZIYUAN_COMMON.put("159652", "资源-通用             ");//有色50ETF             市值：2.68      累涨：34.87     15.23     8.41      11.23     10日：6.68      1.91      0.71      -1.41     9         累涨修正：44.88     净值区间：16      40      55      68      73      15
        ZIYUAN_COMMON.put("159876", "资源-通用             ");//有色龙头ETF           市值：0.60      累涨：33.87     14.60     8.18      11.09     10日：6.45      2.17      1.01      -1.66     15        累涨修正：44.51     净值区间：9       43      54      67      73      16
        ZIYUAN_COMMON.put("588010", "资源-通用             ");//科创新材料ETF         市值：2.44      累涨：33.47     15.22     5.96      12.29     10日：5.59      2.23      1.60      -0.94     4         累涨修正：44.49     净值区间：47      41      80      84      88      17
        ZIYUAN_COMMON.put("561330", "资源-通用             ");//矿业ETF               市值：0.85      累涨：36.04     15.25     9.39      11.40     10日：5.97      1.71      0.36      -1.54     5         累涨修正：44.44     净值区间：20      41      58      72      77      18
        ZIYUAN_COMMON.put("159880", "资源-通用             ");//有色ETF基金           市值：0.93      累涨：32.78     13.13     8.26      11.39     10日：7.02      2.06      0.95      -1.46     12        累涨修正：43.76     净值区间：18      45      58      72      77      19
        ZIYUAN_COMMON.put("159871", "资源-通用             ");//有色金属ETF           市值：0.75      累涨：32.34     13.44     7.46      11.44     10日：6.67      2.21      1.20      -1.87     14        累涨修正：43.62     净值区间：8       33      52      66      73      20
        ZIYUAN_COMMON.put("516890", "资源-通用             ");//新材料ETF指数基金     市值：0.25      累涨：25.39     10.32     3.44      11.63     10日：7.51      4.11      2.74      -0.76     8         累涨修正：42.49     净值区间：61      74      85      85      87      21
        ZIYUAN_COMMON.put("159761", "资源-通用             ");//新材料50ETF           市值：1.54      累涨：25.83     9.90      3.85      12.08     10日：7.33      3.72      2.74      -0.76     6         累涨修正：42.36     净值区间：67      77      87      87      89      22
        ZIYUAN_COMMON.put("516710", "资源-通用             ");//新材料50ETF           市值：0.37      累涨：26.05     10.39     4.05      11.61     10日：7.27      3.69      2.66      -0.20     7         累涨修正：42.33     净值区间：69      80      88      88      90      23
        ZIYUAN_COMMON.put("588160", "资源-通用             ");//科创材料ETF           市值：2.29      累涨：33.42     15.77     6.19      11.46     10日：5.19      1.72      0.94      -0.47     10        累涨修正：42.21     净值区间：38      31      81      82      88      24
        ZIYUAN_COMMON.put("159763", "资源-通用             ");//新材料ETF基金         市值：0.54      累涨：26.21     11.08     3.71      11.42     10日：7.23      3.57      2.31      -0.21     9         累涨修正：41.63     净值区间：69      80      88      88      90      25
        ZIYUAN_COMMON.put("560860", "资源-通用             ");//工业有色ETF           市值：4.44      累涨：32.24     12.56     8.74      10.94     10日：6.49      1.11      0.67      -1.33     16        累涨修正：41.18     净值区间：14      52      80      80      81      26
        ZIYUAN_COMMON.put("516360", "资源-通用             ");//新材料ETF             市值：0.55      累涨：24.19     9.60      3.67      10.92     10日：6.71      3.39      2.36      -0.43     13        累涨修正：39.01     净值区间：72      80      88      88      90      27
        ZIYUAN_COMMON.put("159703", "资源-通用             ");//新材料ETF             市值：0.57      累涨：24.48     9.20      4.36      10.92     10日：6.83      3.20      2.19      -0.33     12        累涨修正：38.89     净值区间：68      80      88      88      90      28
        ZIYUAN_COMMON.put("159944", "资源-通用             ");//材料ETF               市值：0.23      累涨：25.25     10.60     5.37      9.28      10日：5.89      2.55      1.33      -1.51     11        累涨修正：36.35     净值区间：9       57      69      75      79      29
        ZIYUAN_COMMON.put("516480", "资源-通用             ");//新材料ETF基金         市值：0.12      累涨：23.37     9.14      3.74      10.49     10日：6.00      2.96      1.64      0.00      15        累涨修正：35.61     净值区间：77      84      90      91      92      30
        ZIYUAN_COMMON.put("159981", "资源-通用             ");//能源化工ETF           市值：4.91      累涨：31.61     12.43     8.50      10.68     10日：1.72      1.12                0.15      23        累涨修正：34.45     净值区间：29      28      34      41      51      31
        ZIYUAN_COMMON.put("510410", "资源-通用             ");//资源ETF               市值：4.74      累涨：25.23     9.97      6.48      8.78      10日：4.90      1.80      1.18      -1.33     14        累涨修正：34.29     净值区间：13      39      53      72      78      32
        ZIYUAN_COMMON.put("510170", "资源-通用             ");//大宗商品ETF           市值：1.55      累涨：22.66     9.03      6.19      7.44      10日：4.75      2.08      0.98      -1.08     17        累涨修正：31.45     净值区间：24      61      71      79      83      33
        ZIYUAN_COMMON.put("516020", "资源-通用             ");//化工ETF               市值：4.41      累涨：21.07     9.66      4.91      6.50      10日：3.97      2.30      1.48      -0.81     16        累涨修正：30.3      净值区间：38      58      74      77      85      34
        ZIYUAN_COMMON.put("159870", "资源-通用             ");//化工ETF               市值：14.32     累涨：20.82     9.46      5.01      6.35      10日：4.20      2.27      1.40      -1.03     18        累涨修正：30.09     净值区间：36      59      76      78      85      35
        ZIYUAN_COMMON.put("516120", "资源-通用             ");//化工50ETF             市值：1.78      累涨：20.59     9.68      4.83      6.08      10日：3.91      2.11      1.30      -0.96     20        累涨修正：29.21     净值区间：27      56      73      76      84      36
        ZIYUAN_COMMON.put("516220", "资源-通用             ");//化工龙头ETF           市值：1.16      累涨：20.07     9.61      4.69      5.77      10日：3.98      2.22      1.27      -0.94     21        累涨修正：28.81     净值区间：30      61      77      79      86      37
        ZIYUAN_COMMON.put("516810", "资源-通用             ");//农业50ETF             市值：1.79      累涨：20.07     4.71      9.47      5.89      10日：3.42      2.04      0.68      0.27      22        累涨修正：26.89     净值区间：69      91      91      93      93      38
        ZIYUAN_COMMON.put("159867", "资源-通用             ");//畜牧ETF               市值：5.46      累涨：19.68     4.32      9.30      6.06      10日：3.28      1.96      0.81      0.00      25        累涨修正：26.54     净值区间：75      87      90      83      85      39
        ZIYUAN_COMMON.put("159825", "资源-通用             ");//农业ETF               市值：19.24     累涨：20.57     4.92      9.94      5.71      10日：3.47      1.79      0.27      0.27      24        累涨修正：26.37     净值区间：64      81      86      91      92      40
        ZIYUAN_COMMON.put("515220", "资源-通用             ");//煤炭ETF               市值：45.67     累涨：19.91     5.37      7.53      7.01      10日：3.34      2.22      0.40      0.79      19        累涨修正：26.27     净值区间：86      92      94      94      95      41
        ZIYUAN_COMMON.put("159865", "资源-通用             ");//养殖ETF               市值：36.02     累涨：20.00     4.72      9.28      6.00      10日：3.00      1.65      0.49      0.49      28        累涨修正：25.63     净值区间：75      87      87      81      82      42
        ZIYUAN_COMMON.put("159616", "资源-通用             ");//农牧ETF               市值：0.55      累涨：19.58     5.90      7.33      6.35      10日：3.23      1.60      0.53      -0.27     26        累涨修正：25.47     净值区间：58      77      83      88      91      43
        ZIYUAN_COMMON.put("159827", "资源-通用             ");//农业50ETF             市值：0.94      累涨：19.80     4.46      9.77      5.57      10日：3.36      1.54      0.38      0.38      29        累涨修正：25.46     净值区间：75      86      90      93      94      44
        ZIYUAN_COMMON.put("516670", "资源-通用             ");//畜牧养殖ETF           市值：6.24      累涨：19.72     4.17      9.81      5.74      10日：2.72      1.81      0.30      0.30      27        累涨修正：24.85     净值区间：69      84      88      83      84      45
        ZIYUAN_COMMON.put("516760", "资源-通用             ");//养殖ETF               市值：1.34      累涨：19.62     5.40      9.19      5.03      10日：2.68      1.57      0.47      0.15      33        累涨修正：24.81     净值区间：60      75      79      76      79      46
        ZIYUAN_COMMON.put("159587", "资源-通用             ");//粮食ETF广发           市值：0.42      累涨：18.46     6.35      6.53      5.58      10日：3.05      1.48      0.61      -0.09     30        累涨修正：24.21     净值区间：65      80      87      80      55      47
        ZIYUAN_COMMON.put("516570", "资源-通用             ");//化工行业ETF           市值：0.62      累涨：16.76     7.16      4.35      5.25      10日：3.03      1.78      1.10      -0.82     34        累涨修正：23.77     净值区间：27      50      72      72      85      48
        ZIYUAN_COMMON.put("159980", "资源-通用             ");//有色ETF               市值：10.37     累涨：18.88     9.63      4.33      4.92      10日：3.01      0.64      0.35      -0.94     17        累涨修正：23.23     净值区间：7       7       33      46      67      49
        ZIYUAN_COMMON.put("562900", "资源-通用             ");//农业ETF易方达         市值：0.71      累涨：18.42     3.25      9.47      5.70      10日：2.65      1.45      0.26      0.53      35        累涨修正：23.04     净值区间：64      81      81      80      81      50
        ZIYUAN_COMMON.put("159930", "资源-通用             ");//能源ETF               市值：2.60      累涨：17.54     5.32      6.11      6.11      10日：2.27      1.87      0.62      0.47      31        累涨修正：22.92     净值区间：54      57      64      73      84      51
        ZIYUAN_COMMON.put("159698", "资源-通用             ");//粮食ETF               市值：2.79      累涨：17.42     6.24      6.58      4.60      10日：2.35      1.45      0.78      -0.44     36        累涨修正：22.78     净值区间：54      73      84      79      47      52
        ZIYUAN_COMMON.put("159945", "资源-通用             ");//能源ETF广发           市值：0.30      累涨：18.06     5.80      6.15      6.11      10日：2.19      1.71      0.38      0.48      32        累涨修正：22.72     净值区间：46      48      55      69      81      53
        ZIYUAN_COMMON.put("561790", "资源-通用             ");//央企现代能源ETF       市值：0.46      累涨：14.56     5.49      4.24      4.83      10日：2.96      1.10      0.55      -0.27     39        累涨修正：19.72     净值区间：54      81      83      86      91      54
        ZIYUAN_COMMON.put("561260", "资源-通用             ");//能源ETF               市值：0.38      累涨：14.00     4.82      4.25      4.93      10日：2.88      1.29      0.64      -0.09     40        累涨修正：19.45     净值区间：64      84      71      71      79      55
        ZIYUAN_COMMON.put("562850", "资源-通用             ");//央企能源ETF           市值：0.96      累涨：14.24     4.51      4.62      5.11      10日：2.97      1.10      0.55      -0.18     38        累涨修正：19.41     净值区间：57      75      83      86      91      56
        ZIYUAN_COMMON.put("516550", "资源-通用             ");//农业ETF               市值：1.95      累涨：15.23     4.03      7.00      4.20      10日：2.25      0.75      0.30      0.30      41        累涨修正：18.83     净值区间：67      75      56      69      70      57
        ZIYUAN_COMMON.put("159985", "资源-通用             ");//豆粕ETF               市值：27.44     累涨：12.82     3.14      6.11      3.57      10日：1.25      0.57      0.10      0.26      42        累涨修正：14.84     净值区间：69      85      23      34      31      58
        ZIYUAN_COMMON.put("589180", "资源-通用             ");//科创新材料ETF汇添富   市值：0.31      累涨：                                        10日：5.10      1.92      1.54      -0.95     37        累涨修正：10.1      净值区间：48      46                              59
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();

    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_COMMON);
//        ZIYUAN.putAll(ZIYUAN_XIYOU);
//        ZIYUAN.putAll(ZIYUAN_NONGYE);
    }

    public static Map<String, String> TOP_ZIYUAN = new HashMap<>();

    static {
        TOP_ZIYUAN.putAll(TOP_ZIYUAN_OIL);
        TOP_ZIYUAN.putAll(TOP_ZIYUAN_COMMON);
//        TOP_ZIYUAN.putAll(TOP_ZIYUAN_XIYOU);
//        TOP_ZIYUAN.putAll(TOP_ZIYUAN_NONGYE);
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用
    public static Map<String, String> TOP_XIAOFEI_COMMON = new HashMap<>();//消费-通用

    static {

    }

    static {
        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.06      累涨：25.62     7.73      9.69      8.20      10日：4.29      4.05      2.84      -1.04     3         累涨修正：39.64     净值区间：69      76      84      92      93      1
        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.35      累涨：28.58     11.04     11.84     5.70      10日：2.70      2.48      0.91      -0.11     1         累涨修正：35.58     净值区间：33      33      20      63      43      2
        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.81      累涨：25.66     6.32      13.28     6.06      10日：2.53      2.53      0.96      1.67      42        累涨修正：32.64     净值区间：92      79      47      63      52      3
        XIAOFEI_COMMON.put("159996", "消费-通用             ");//家电ETF               市值：13.57     累涨：26.84     8.44      11.32     7.08      10日：1.51      1.51      0.99      0.15      1         累涨修正：31.84     净值区间：40      26      24      75      55      4
        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.54      累涨：25.35     4.34      11.23     9.78      10日：2.87      1.82      0.19      -0.48     2         累涨修正：30.42     净值区间：14      42      54      80      80      5
        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.71      累涨：24.00     4.32      10.15     9.53      10日：3.44      2.22      0.22      -0.44     4         累涨修正：30.1      净值区间：18      46      68      86      86      6
        XIAOFEI_COMMON.put("561120", "消费-通用             ");//家电ETF               市值：1.01      累涨：25.55     8.14      10.82     6.59      10日：1.26      1.26      0.76      0.17      8         累涨修正：29.59     净值区间：38      24      21      73      58      7
        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：4.37      累涨：25.55     10.95     10.36     4.24      10日：1.56      1.35      0.42      -0.41     5         累涨修正：29.3      净值区间：45      37      28      68      52      8
        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.33      累涨：27.62     8.51      12.78     6.33      10日：1.08      0.59                0.00      9         累涨修正：29.29     净值区间：14      6       6       70      61      9
        XIAOFEI_COMMON.put("560880", "消费-通用             ");//家电ETF龙头           市值：4.12      累涨：25.34     7.99      10.70     6.65      10日：1.30      1.30      0.66      0.65      6         累涨修正：29.26     净值区间：50      32      29      75      60      10
        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.14      累涨：24.98     8.03      10.53     6.42      10日：1.81      1.09      0.50      0.15      7         累涨修正：28.88     净值区间：26      12      12      66      61      11
        XIAOFEI_COMMON.put("516600", "消费-通用             ");//消费服务ETF           市值：0.82      累涨：20.58     7.95      6.83      5.80      10日：2.14      1.98      0.82      0.00      10        累涨修正：26.34     净值区间：91      77      75      94      74      12
        XIAOFEI_COMMON.put("159730", "消费-通用             ");//龙头家电ETF           市值：0.38      累涨：23.76     8.85      8.00      6.91      10日：0.81      0.81      0.41      0.10      18        累涨修正：26.2      净值区间：24      13      13      67      52      13
        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：4.90      累涨：22.00     10.63     7.35      4.02      10日：1.59      1.01      0.72      -0.57     11        累涨修正：26.04     净值区间：55      54      32      65      54      14
        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：134.70    累涨：22.53     10.52     8.36      3.65      10日：1.22      0.98      0.49      -0.49     14        累涨修正：25.71     净值区间：46      47      31      65      55      15
        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.76      累涨：22.36     10.45     8.17      3.74      10日：1.04      1.04      0.52      -0.51     15        累涨修正：25.48     净值区间：45      43      25      63      50      16
        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.76      累涨：22.15     10.68     7.60      3.87      10日：1.17      1.04      0.52      -0.64     13        累涨修正：25.4      净值区间：40      43      26      63      54      17
        XIAOFEI_COMMON.put("159328", "消费-通用             ");//家电ETF易方达         市值：1.17      累涨：22.80     8.19      8.49      6.12      10日：0.93      0.73      0.42      0.41      20        累涨修正：25.3      净值区间：9       9       9       55      52      18
        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.24      累涨：21.90     10.21     8.11      3.58      10日：1.01      1.01      0.67      -0.78     19        累涨修正：25.26     净值区间：47      39      26      58      52      19
        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：22.63     累涨：22.72     8.69      8.92      5.11      10日：1.02      0.94      0.26      -0.34     12        累涨修正：25.2      净值区间：7       5       12      72      68      20
        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：0.77      累涨：21.60     9.02      7.75      4.83      10日：1.05      0.84      0.21      -0.42     17        累涨修正：23.91     净值区间：0       0       3       69      60      21
        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：16.34     累涨：20.52     8.58      7.43      4.51      10日：1.87      0.94      0.19      -0.37     16        累涨修正：23.71     净值区间：44      25      45      81      71      22
        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.32      累涨：20.81     7.94      8.16      4.71      10日：0.86      0.77                -0.19     22        累涨修正：22.44     净值区间：9       6       6       71      60      23
        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.59      累涨：20.36     8.22      7.38      4.76      10日：0.83      0.83      0.21      -0.31     21        累涨修正：22.44     净值区间：5       3       9       71      64      24
        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.00      累涨：19.13     8.47      6.66      4.00      10日：0.65      0.65      0.13      -0.39     23        累涨修正：20.69     净值区间：13      8       8       72      51      25
    }

    public static Map<String, String> TOP_XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒

    static {
        TOP_XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：20.34     累涨：58.06     20.14     16.31     21.61     10日：11.92     2.55      2.47      2.76      1         累涨修正：77.47     净值区间：84      90      92      95      96      1
    }

    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒

    static {
        XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：20.34     累涨：58.06     20.14     16.31     21.61     10日：11.92     2.55      2.47      2.76      1         累涨修正：77.47     净值区间：84      90      92      95      96      1
        XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.55      累涨：57.58     19.28     16.96     21.34     10日：11.78     2.22      2.22      2.65      2         累涨修正：76.02     净值区间：87      91      94      96      97      2
        XIAOFEI_MEDIA.put("159869", "消费-文娱传媒         ");//游戏ETF               市值：69.99     累涨：56.56     19.09     16.75     20.72     10日：11.60     2.21      2.21      2.73      3         累涨修正：74.79     净值区间：87      91      93      96      96      3
        XIAOFEI_MEDIA.put("159805", "消费-文娱传媒         ");//传媒ETF               市值：1.94      累涨：40.17     15.95     10.67     13.55     10日：7.48      1.35      1.35      1.58      4         累涨修正：51.7      净值区间：91      94      96      97      97      4
        XIAOFEI_MEDIA.put("516190", "消费-文娱传媒         ");//文娱传媒ETF           市值：0.17      累涨：40.70     16.97     11.61     12.12     10日：6.48      1.34      1.34      1.44      7         累涨修正：51.2      净值区间：93      95      96      97      98      5
        XIAOFEI_MEDIA.put("517770", "消费-文娱传媒         ");//游戏传媒ETF           市值：0.35      累涨：39.23     15.69     11.03     12.51     10日：7.28      1.53      1.53      2.26      5         累涨修正：51.1      净值区间：96      97      98      99      99      6
        XIAOFEI_MEDIA.put("512980", "消费-文娱传媒         ");//传媒ETF               市值：25.78     累涨：40.31     16.49     11.24     12.58     10日：7.12      1.19      1.19      1.64      6         累涨修正：51        净值区间：94      96      97      98      98      7
        XIAOFEI_MEDIA.put("516620", "消费-文娱传媒         ");//影视ETF               市值：0.50      累涨：39.58     15.31     11.85     12.42     10日：4.71      0.30      0.30      1.22      8         累涨修正：45.19     净值区间：83      71      53      66      66      8
        XIAOFEI_MEDIA.put("159855", "消费-文娱传媒         ");//影视ETF               市值：0.58      累涨：37.21     15.08     11.83     10.30     10日：4.45      0.57      0.57      1.48      9         累涨修正：43.37     净值区间：95      66      56      65      67      9
    }

    public static Map<String, String> TOP_XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐

    static {
//        TOP_XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.02      累涨：24.21     12.52     7.22      4.47      10日：3.59      0.30      0.30      0.44      2         累涨修正：28.7      净值区间：88      56      63      63      32      1
        TOP_XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：127.65    累涨：13.41     4.61      3.52      5.28      10日：1.99      0.54      0.18      0.90      3         累涨修正：16.3      净值区间：100     100     61      27      25      3
    }

    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐

    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.02      累涨：24.21     12.52     7.22      4.47      10日：3.59      0.30      0.30      0.44      2         累涨修正：28.7      净值区间：88      56      63      63      32      1
        XIAOFEI_WINE.put("159766", "消费-吃喝玩乐         ");//旅游ETF               市值：30.66     累涨：23.85     12.94     6.57      4.34      10日：3.61      0.30      0.30      0.45      1         累涨修正：28.36     净值区间：75      53      62      62      31      2
        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：127.65    累涨：13.41     4.61      3.52      5.28      10日：1.99      0.54      0.18      0.90      3         累涨修正：16.3      净值区间：100     100     61      27      25      3
        XIAOFEI_WINE.put("159736", "消费-吃喝玩乐         ");//食品饮料ETF天弘       市值：47.25     累涨：13.58     5.94      4.44      3.20      10日：1.89                          0.58      6         累涨修正：15.47     净值区间：71      78      34      23      20      4
        XIAOFEI_WINE.put("515710", "消费-吃喝玩乐         ");//食品ETF               市值：9.09      累涨：12.30     5.24      3.35      3.71      10日：2.02      0.34      0.17      0.34      4         累涨修正：15        净值区间：57      56      29      16      16      5
        XIAOFEI_WINE.put("159843", "消费-吃喝玩乐         ");//食品饮料ETF           市值：2.96      累涨：12.10     4.74      3.58      3.78      10日：1.89      0.16      0.16      0.63      5         累涨修正：14.47     净值区间：83      78      34      19      19      6
        XIAOFEI_WINE.put("515170", "消费-吃喝玩乐         ");//食品饮料ETF           市值：31.99     累涨：11.85     5.07      3.55      3.23      10日：1.62      0.18      0.18      0.54      7         累涨修正：14.01     净值区间：71      63      32      18      18      7
        XIAOFEI_WINE.put("516900", "消费-吃喝玩乐         ");//食品饮料ETF基金       市值：0.81      累涨：12.02     5.42      3.37      3.23      10日：1.19                          0.68      9         累涨修正：13.21     净值区间：100     67      33      17      16      8
        XIAOFEI_WINE.put("159862", "消费-吃喝玩乐         ");//食品ETF               市值：0.42      累涨：11.10     3.86      3.75      3.49      10日：1.67      0.15                0.61      8         累涨修正：12.92     净值区间：57      45      32      17      17      9
    }

    public static Map<String, String> XIAOFEI = new HashMap<>();

    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
        XIAOFEI.putAll(XIAOFEI_MEDIA);
        XIAOFEI.putAll(XIAOFEI_WINE);
//        XIAOFEI.putAll(XIAOFEI_HK);
//        XIAOFEI.putAll(XIAOFEI_HOUSE);
//        XIAOFEI.putAll(XIAOFEI_TRAVEL);
    }

    public static Map<String, String> TOP_XIAOFEI = new HashMap<>();

    static {
        TOP_XIAOFEI.putAll(TOP_XIAOFEI_COMMON);
        TOP_XIAOFEI.putAll(TOP_XIAOFEI_MEDIA);
        TOP_XIAOFEI.putAll(TOP_XIAOFEI_WINE);
    }


    /**
     * 医疗
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗
    public static Map<String, String> TOP_YILIAO_COMMON = new HashMap<>();

    static {
        TOP_YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：39.80     累涨：81.25     27.04     25.89     28.32     10日：17.05     10.37     5.85      -1.66     1         累涨修正：120.37    净值区间：71      76      84      90      90      1
    }

    static {
        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：39.80     累涨：81.25     27.04     25.89     28.32     10日：17.05     10.37     5.85      -1.66     1         累涨修正：120.37    净值区间：71      76      84      90      90      1
        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：16.69     累涨：79.26     27.32     25.63     26.31     10日：15.18     9.81      5.18      -1.40     2         累涨修正：114.61    净值区间：70      76      84      90      90      2
        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：5.34      累涨：78.25     25.96     26.59     25.70     10日：14.26     9.89      5.50      -1.28     4         累涨修正：113.4     净值区间：71      75      83      90      90      3
        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：5.67      累涨：79.10     26.61     25.10     27.39     10日：15.32     9.59      4.39      -1.24     3         累涨修正：112.79    净值区间：71      76      85      90      90      4
        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：2.82      累涨：77.77     25.77     25.39     26.61     10日：15.22     9.78      4.96      -1.29     5         累涨修正：112.69    净值区间：69      74      83      90      90      5
        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：97.77     累涨：77.03     25.71     24.46     26.86     10日：15.14     9.28      4.77      -1.12     6         累涨修正：110.99    净值区间：68      74      83      90      90      6
        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：19.71     累涨：75.54     25.91     24.32     25.31     10日：14.64     9.85      5.15      -1.01     7         累涨修正：110.33    净值区间：73      77      84      91      91      7
        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：42.68     累涨：69.22     22.51     24.37     22.34     10日：12.87     8.41      4.80      -0.72     8         累涨修正：100.1     净值区间：77      81      87      93      93      8
        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：3.03      累涨：69.62     23.46     24.41     21.75     10日：12.24     8.32      4.44      -1.73     10        累涨修正：99.06     净值区间：62      69      79      88      88      9
        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.06      累涨：69.62     23.12     24.66     21.84     10日：12.19     8.13      4.45      -1.50     9         累涨修正：98.84     净值区间：65      71      81      89      89      10
        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：2.45      累涨：63.42     20.92     21.45     21.05     10日：12.76     8.49      4.28      -1.38     11        累涨修正：93.23     净值区间：66      73      81      90      90      11
        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：27.09     累涨：63.63     20.02     22.56     21.05     10日：12.28     7.97      4.06      -1.28     12        累涨修正：92        净值区间：67      73      82      90      90      12
        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.19      累涨：63.44     20.95     22.08     20.41     10日：11.83     8.03      3.67      -1.22     13        累涨修正：90.64     净值区间：66      73      82      90      90      13
        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：9.98      累涨：62.59     20.17     22.66     19.76     10日：11.51     7.84      4.02      -1.42     14        累涨修正：89.98     净值区间：68      74      82      90      90      14
        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：83.49     累涨：64.11     20.21     23.98     19.92     10日：10.66     7.43      3.84      -1.48     16        累涨修正：89.88     净值区间：63      69      79      89      89      15
        YILIAO_COMMON.put("159217", "医疗-通用             ");//港股通创新药ETF工银   市值：42.18     累涨：                    25.73     28.12     10日：15.84     9.42      4.90      -1.37     17        累涨修正：88.91     净值区间：70      74      84      90              16
        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.64      累涨：63.85     20.96     24.50     18.39     10日：10.00     7.19      3.87      -1.33     15        累涨修正：88.78     净值区间：66      71      80      89      89      17
        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：0.57      累涨：60.94     19.59     22.57     18.78     10日：10.99     7.56      4.10      -1.67     18        累涨修正：87.69     净值区间：64      70      79      89      89      18
        YILIAO_COMMON.put("159316", "医疗-通用             ");//恒生创新药ETF         市值：2.11      累涨：                    24.47     25.16     10日：14.79     9.33      5.27      -1.35     21        累涨修正：84.29     净值区间：70      75      83      90              19
        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药ETF天弘         市值：4.24      累涨：48.48     16.22     14.63     17.63     10日：12.74     8.38      5.39      -1.68     19        累涨修正：80.38     净值区间：73      77      84      91      91      20
        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：2.81      累涨：52.06     18.00     16.29     17.77     10日：11.51     7.24      3.89      -1.31     20        累涨修正：78.59     净值区间：73      77      85      91      91      21
        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：1.96      累涨：51.24     17.50     16.14     17.60     10日：11.47     7.67      4.02      -1.64     22        累涨修正：78.42     净值区间：68      73      83      89      89      22
        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：3.88      累涨：52.08     18.49     16.49     17.10     10日：10.79     7.11      3.79      -1.18     23        累涨修正：77.56     净值区间：75      78      85      91      91      23
        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药ETF国泰         市值：2.72      累涨：50.97     17.64     15.25     18.08     10日：10.38     6.85      3.02      -1.24     24        累涨修正：74.24     净值区间：71      77      85      91      91      24
        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：99.00     累涨：40.89     14.08     12.14     14.67     10日：9.48      6.57      3.15      -1.36     25        累涨修正：63.24     净值区间：75      78      86      91      91      25
        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：2.66      累涨：43.55     13.83     16.97     12.75     10日：8.30      6.53      2.18      -0.58     29        累涨修正：62.74     净值区间：81      84      87      93      93      26
        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：2.90      累涨：43.03     14.68     15.77     12.58     10日：8.51      6.39      2.24      -0.51     30        累涨修正：62.41     净值区间：83      85      88      94      94      27
        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：1.94      累涨：39.50     14.54     10.19     14.77     10日：9.57      6.53      3.36      -1.25     27        累涨修正：62.32     净值区间：77      80      87      92      92      28
        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.39      累涨：39.52     13.85     10.70     14.97     10日：9.70      6.46      3.25      -1.11     26        累涨修正：62.18     净值区间：77      80      87      92      92      29
        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：35.23     累涨：39.84     15.15     10.56     14.13     10日：9.21      6.37      3.03      -1.16     28        累涨修正：61.48     净值区间：77      79      87      92      92      30
        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.32      累涨：39.21     13.98     11.51     13.72     10日：9.05      6.35      3.17      -1.15     31        累涨修正：60.95     净值区间：75      79      88      92      92      31
        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：13.29     累涨：43.55     5.96      24.41     13.18     10日：6.55      4.09      2.79      -0.34     39        累涨修正：59.77     净值区间：90      91      95      91      61      32
        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.15      累涨：37.69     14.19     9.74      13.76     10日：9.03      6.48      3.09      -1.27     32        累涨修正：59.38     净值区间：71      74      83      89      89      33
        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：0.95      累涨：37.71     14.26     9.63      13.82     10日：8.86      6.36      3.11      -1.26     33        累涨修正：59.15     净值区间：74      77      86      91      91      34
        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.35      累涨：37.70     13.23     12.33     12.14     10日：6.89      5.14      2.78      -0.95     34        累涨修正：55.29     净值区间：64      73      82      90      90      35
        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.69      累涨：33.96     11.17     9.04      13.75     10日：8.46      6.19      2.79      0.46      36        累涨修正：54.19     净值区间：88      89      92      94      94      36
        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.20      累涨：33.83     11.39     10.25     12.19     10日：7.93      6.22      2.82      0.44      35        累涨修正：53.62     净值区间：80      84      88      91      91      37
        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.42      累涨：31.55     12.71     7.44      11.40     10日：7.93      5.74      2.62      -0.77     38        累涨修正：50.46     净值区间：83      85      89      91      74      38
        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：12.49     累涨：39.96     5.71      22.33     11.92     10日：4.13      2.48      1.56      -0.72     57        累涨修正：49.69     净值区间：50      66      83      85      56      39
        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：33.59     累涨：30.72     12.33     7.07      11.32     10日：7.56      5.57      2.74      -0.54     43        累涨修正：49.33     净值区间：80      81      86      90      76      40
        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：12.85     累涨：32.40     12.40     9.24      10.76     10日：6.95      4.75      2.34      -0.42     41        累涨修正：48.78     净值区间：81      83      89      93      93      41
        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.74      累涨：32.55     11.89     9.28      11.38     10日：7.09      4.78      2.04      -0.20     40        累涨修正：48.5      净值区间：85      86      91      94      93      42
        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.18      累涨：31.51     12.07     8.41      11.03     10日：6.58      4.96      2.68      0.15      46        累涨修正：48.41     净值区间：85      85      89      91      78      43
        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.10      累涨：32.31     12.54     8.79      10.98     10日：6.61      4.90      2.16      -0.16     42        累涨修正：48.14     净值区间：88      89      93      95      92      44
        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.31      累涨：30.78     12.11     8.01      10.66     10日：6.98      4.58      2.72      -1.14     47        累涨修正：47.78     净值区间：72      77      85      92      92      45
        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.58      累涨：30.38     11.26     7.45      11.67     10日：6.65      5.24      2.75      0.00      48        累涨修正：47.77     净值区间：82      82      86      89      75      46
        YILIAO_COMMON.put("588250", "医疗-通用             ");//科创生物医药ETF       市值：1.29      累涨：                    16.26     12.58     10日：7.87      6.30      2.17      -0.46     37        累涨修正：47.35     净值区间：82      84      88      94              47
        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.35      累涨：31.77     11.79     9.12      10.86     10日：6.95      4.82      1.85      -0.40     44        累涨修正：47.24     净值区间：87      90      94      95      90      48
        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.19      累涨：29.95     9.95      8.90      11.10     10日：6.50      5.09      2.74      0.00      50        累涨修正：47.02     净值区间：76      78      83      88      77      49
        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：5.86      累涨：28.93     11.42     6.60      10.91     10日：6.89      5.37      2.34      -0.57     51        累涨修正：45.87     净值区间：77      80      85      89      74      50
        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.53      累涨：30.14     12.13     7.41      10.60     10日：6.52      4.41      2.06      -1.13     53        累涨修正：45.19     净值区间：70      74      83      90      90      51
        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：36.96     累涨：30.59     12.28     7.89      10.42     10日：6.40      4.06      1.95      -0.40     52        累涨修正：44.95     净值区间：82      85      91      95      95      52
        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：9.82      累涨：28.85     11.55     8.00      9.30      10日：5.55      4.22      2.09      -0.77     54        累涨修正：42.8      净值区间：79      80      84      94      58      53
        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：16.34     累涨：29.24     11.22     9.12      8.90      10日：5.29      4.05      1.94      -0.72     56        累涨修正：42.46     净值区间：78      79      83      93      57      54
        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：51.47     累涨：28.37     11.04     7.56      9.77      10日：5.70      3.94      2.02      -0.77     59        累涨修正：42.05     净值区间：75      78      86      92      92      55
        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：15.05     累涨：30.01     13.19     8.15      8.67      10日：5.44      3.42      1.41      -1.11     55        累涨修正：41.69     净值区间：64      69      82      89      89      56
        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：261.31    累涨：28.71     11.07     8.67      8.97      10日：5.23      3.99      1.82      -0.30     58        累涨修正：41.57     净值区间：85      85      88      95      57      57
        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：22.64     累涨：27.87     11.08     7.52      9.27      10日：5.48      3.98      1.72      -0.48     60        累涨修正：40.77     净值区间：81      81      85      94      57      58
        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.79      累涨：27.48     12.19     6.51      8.78      10日：5.44      3.73      1.84      -0.83     61        累涨修正：40.33     净值区间：86      86      86      92      92      59
        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：6.50      累涨：26.86     11.22     7.38      8.26      10日：5.39      3.80      2.10      -1.09     66        累涨修正：40.25     净值区间：69      73      83      91      91      60
        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：16.88     累涨：27.37     8.56      10.60     8.21      10日：4.82      3.55      2.07      -0.41     63        累涨修正：39.88     净值区间：83      85      88      95      71      61
        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.83      累涨：28.00     8.74      11.01     8.25      10日：4.65      3.39      1.77      -0.52     62        累涨修正：39.58     净值区间：83      86      86      91      57      62
        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：20.87     累涨：26.32     10.63     6.76      8.93      10日：5.46      3.68      1.97      -0.82     67        累涨修正：39.4      净值区间：75      78      86      92      92      63
        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.87      累涨：27.53     11.71     7.21      8.61      10日：4.97      3.58      1.53      -0.73     65        累涨修正：39.14     净值区间：73      79      87      93      93      64
        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：210.21    累涨：27.09     11.97     6.91      8.21      10日：4.88      3.24      1.88      -0.79     68        累涨修正：38.97     净值区间：73      75      85      91      91      65
        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.77      累涨：27.65     8.70      10.39     8.56      10日：4.84      3.09      1.53      0.00      64        累涨修正：38.64     净值区间：94      95      96      99      75      66
        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：1.99      累涨：25.68     11.91     6.22      7.55      10日：4.82      3.74      1.94      -1.04     70        累涨修正：38.12     净值区间：64      69      80      89      89      67
        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.71      累涨：26.45     9.67      8.41      8.37      10日：4.63      3.12      1.89      -0.13     72        累涨修正：37.98     净值区间：89      90      92      97      58      68
        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.15      累涨：26.55     8.76      10.27     7.52      10日：4.11      3.39      1.95      -0.35     69        累涨修正：37.95     净值区间：86      86      88      95      64      69
        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.83      累涨：26.53     9.03      9.83      7.67      10日：4.09      3.37      1.76      -0.35     71        累涨修正：37.51     净值区间：84      86      88      95      61      70
        YILIAO_COMMON.put("159377", "医疗-通用             ");//创业板医药ETF国泰     市值：0.24      累涨：                              13.64     10日：9.21      6.58      3.66      -0.91     45        累涨修正：36.75     净值区间：86      87      89                      71
        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.84      累涨：25.27     9.42      8.16      7.69      10日：4.25      3.40      1.90      -0.21     73        累涨修正：36.72     净值区间：93      94      95      94      60      72
        YILIAO_COMMON.put("560080", "医疗-通用             ");//中药ETF               市值：18.52     累涨：24.27     7.16      9.40      7.71      10日：4.34      3.01      2.06      -0.93     74        累涨修正：35.74     净值区间：63      67      75      87      87      73
        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.18      累涨：24.67     7.72      9.32      7.63      10日：3.57      3.33      1.89      -0.46     76        累涨修正：35.35     净值区间：85      88      89      93      53      74
        YILIAO_COMMON.put("159647", "医疗-通用             ");//中药ETF               市值：7.09      累涨：23.81     6.69      9.20      7.92      10日：4.49      2.94      2.02      -0.90     75        累涨修正：35.28     净值区间：67      71      77      88      88      75
        YILIAO_COMMON.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.86      累涨：23.80     6.62      9.07      8.11      10日：4.16      2.80      1.92      -1.14     77        累涨修正：34.6      净值区间：61      65      73      87      87      76
        YILIAO_COMMON.put("562390", "医疗-通用             ");//中药50ETF             市值：0.60      累涨：23.48     6.96      8.81      7.71      10日：4.23      2.77      1.84      -0.91     78        累涨修正：34.16     净值区间：61      67      74      87      87      77
        YILIAO_COMMON.put("159366", "医疗-通用             ");//港股医疗ETF           市值：0.35      累涨：                              13.80     10日：8.76      5.91      2.39      -1.00     49        累涨修正：33.25     净值区间：60      69      75                      78
        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.54      累涨：22.40     9.36      5.65      7.39      10日：3.84      3.12      1.91      -0.23     79        累涨修正：33.18     净值区间：92      94      95      98      71      79
        YILIAO_COMMON.put("588130", "医疗-通用             ");//科创医药ETF基金       市值：0.47      累涨：                                        10日：                    2.20      -0.09               累涨修正：          净值区间：85                                      80
    }

    public static Map<String, String> YILIAO = new HashMap<>();//医疗

    static {
        YILIAO.putAll(YILIAO_COMMON);
    }

    public static Map<String, String> TOP_YILIAO = new HashMap<>();//医疗

    static {
        TOP_YILIAO.putAll(TOP_YILIAO_COMMON);
    }

    /**
     * 科技
     */
    public static Map<String, String> TOP_KEJI_HK = new HashMap<>();//科技-香港
    static {
        TOP_KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：518.60    累涨：42.99     16.55     12.74     13.70     10日：7.74      5.28      3.89      0.11      1         累涨修正：63.79     净值区间：75      81      83      85      90      2
    }
    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港
    static {
        KEJI_HK.put("159202", "科技-香港             ");//恒生互联网科技ETF     市值：3.85      累涨：41.82     14.58     14.24     13.00     10日：8.19      5.77      4.91      -0.64     6         累涨修正：65.6      净值区间：59      66      78      78      78      1
        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：518.60    累涨：42.99     16.55     12.74     13.70     10日：7.74      5.28      3.89      0.11      1         累涨修正：63.79     净值区间：75      81      83      85      90      2
        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：14.57     累涨：43.25     15.49     12.84     14.92     10日：7.59      5.04      3.87      0.26      4         累涨修正：63.62     净值区间：77      84      87      89      91      3
        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：69.29     累涨：42.53     16.00     12.81     13.72     10日：7.82      5.42      3.72      0.09      2         累涨修正：63.21     净值区间：73      80      82      83      89      4
        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.38      累涨：42.07     16.04     12.45     13.58     10日：7.50      5.22      3.74      0.00      3         累涨修正：62.27     净值区间：72      79      80      82      89      5
        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：7.86      累涨：41.92     15.95     12.89     13.08     10日：7.41      5.10      3.75      0.14      5         累涨修正：61.93     净值区间：72      80      82      84      90      6
        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：8.32      累涨：41.00     15.11     13.81     12.08     10日：7.26      5.10      4.28      -0.19     11        累涨修正：61.92     净值区间：71      75      78      80      84      7
        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：243.64    累涨：40.53     14.43     14.02     12.08     10日：7.51      5.01      4.39      -0.20     15        累涨修正：61.83     净值区间：72      77      80      82      86      8
        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：1.67      累涨：39.43     16.28     10.52     12.63     10日：6.89      5.47      4.06      0.89      9         累涨修正：59.91     净值区间：93      94      95      95      97      9
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：167.01    累涨：41.39     16.83     11.42     13.14     10日：6.57      4.87      3.46      1.35      7         累涨修正：59.75     净值区间：94      95      96      96      97      10
        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：23.43     累涨：41.28     16.40     12.13     12.75     10日：6.29      4.87      3.60      1.08      12        累涨修正：59.64     净值区间：92      93      95      95      96      11
        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：21.45     累涨：39.98     16.07     11.19     12.72     10日：6.65      5.00      3.82      1.12      10        累涨修正：59.27     净值区间：97      98      98      98      99      12
        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：257.22    累涨：40.41     15.86     11.17     13.38     10日：6.78      5.12      3.47      1.20      8         累涨修正：59.25     净值区间：94      95      96      96      97      13
        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.24      累涨：39.73     16.65     10.64     12.44     10日：6.30      4.86      3.60      1.28      14        累涨修正：58.09     净值区间：72      75      80      80      86      14
        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：5.80      累涨：39.49     16.19     10.83     12.47     10日：6.36      4.90      3.67      1.24      13        累涨修正：58.09     净值区间：98      98      98      99      99      15
        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：349.56    累涨：37.66     16.65     10.01     11.00     10日：6.54      4.91      3.95      -0.57     17        累涨修正：57.01     净值区间：63      68      68      68      70      16
        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：4.56      累涨：39.00     16.21     10.69     12.10     10日：6.27      4.57      3.25      0.49      16        累涨修正：56.34     净值区间：84      85      88      88      93      17
        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：11.06     累涨：37.98     16.49     10.62     10.87     10日：6.35      4.12      3.35      -0.47     20        累涨修正：55.15     净值区间：59      65      67      67      78      18
        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：6.81      累涨：38.23     15.55     10.64     12.04     10日：5.92      4.44      3.26      1.22      18        累涨修正：55.11     净值区间：97      97      98      98      99      19
        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：6.15      累涨：37.80     15.46     10.36     11.98     10日：6.04      4.54      3.34      0.48      21        累涨修正：55.06     净值区间：85      87      90      90      94      20
        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF嘉实       市值：8.38      累涨：36.89     14.86     10.34     11.69     10日：6.45      4.57      3.42      0.42      22        累涨修正：54.75     净值区间：80      85      87      87      90      21
        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：45.63     累涨：37.48     16.57     10.19     10.72     10日：6.13      4.20      3.33      -0.56     23        累涨修正：54.47     净值区间：60      65      67      67      78      22
        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.84      累涨：37.40     16.49     9.65      11.26     10日：6.24      4.17      3.18      -0.40     24        累涨修正：54.17     净值区间：61      68      71      71      76      23
        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：277.03    累涨：37.19     14.96     10.60     11.63     10日：5.99      4.26      3.25      0.28      26        累涨修正：53.94     净值区间：79      82      85      85      88      24
        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：122.34    累涨：37.05     14.90     10.80     11.35     10日：6.06      4.25      3.28      0.40      25        累涨修正：53.92     净值区间：79      83      86      86      89      25
        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：22.51     累涨：36.40     14.46     10.31     11.63     10日：6.27      4.44      3.18      0.27      28        累涨修正：53.47     净值区间：77      81      84      84      87      26
        KEJI_HK.put("159793", "科技-香港             ");//线上消费ETF基金       市值：0.32      累涨：34.67     11.56     11.07     12.04     10日：6.73      4.64      3.66      0.31      19        累涨修正：53.36     净值区间：90      92      94      95      96      27
        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：55.30     累涨：36.69     14.82     10.14     11.73     10日：5.91      4.18      3.24      0.15      31        累涨修正：53.26     净值区间：76      81      84      84      88      28
        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：24.15     累涨：37.37     15.39     10.84     11.14     10日：5.81      3.95      2.95      0.27      30        累涨修正：53.03     净值区间：76      81      84      84      87      29
        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：2.98      累涨：37.55     14.45     11.02     12.08     10日：5.70      4.01      2.62      0.81      29        累涨修正：52.5      净值区间：81      85      90      90      93      30
        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：47.33     累涨：36.51     15.12     10.14     11.25     10日：5.73      4.02      3.06      0.29      35        累涨修正：52.38     净值区间：77      82      85      85      88      31
        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：5.03      累涨：36.33     14.89     10.18     11.26     10日：5.77      3.98      3.14      0.27      36        累涨修正：52.36     净值区间：76      81      84      84      88      32
        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：4.14      累涨：36.62     13.05     10.56     13.01     10日：6.20      4.07      2.71      0.60      27        累涨修正：52.31     净值区间：76      82      87      87      90      33
        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：88.75     累涨：35.50     14.58     9.44      11.48     10日：5.99      4.26      3.25      0.14      32        累涨修正：52.25     净值区间：78      82      85      85      89      34
        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：304.11    累涨：36.59     14.86     10.57     11.16     10日：5.61      3.91      3.06      0.41      37        累涨修正：52.23     净值区间：79      83      85      85      89      35
        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.16      累涨：35.57     13.61     9.46      12.50     10日：5.77      4.10      2.86      0.66      33        累涨修正：51.16     净值区间：83      86      90      90      92      36
        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.81      累涨：34.30     13.36     9.01      11.93     10日：5.86      3.96      2.91      0.11      38        累涨修正：49.94     净值区间：70      78      83      84      88      37
        KEJI_HK.put("513230", "科技-香港             ");//港股消费ETF           市值：3.63      累涨：34.36     14.50     9.56      10.30     10日：5.23      3.86      3.08      -0.28     43        累涨修正：49.61     净值区间：67      73      77      67      77      38
        KEJI_HK.put("513070", "科技-香港             ");//港股消费ETF易方达     市值：6.50      累涨：33.89     14.57     8.85      10.47     10日：5.46      3.75      2.82      0.00      45        累涨修正：48.74     净值区间：74      78      80      65      76      39
        KEJI_HK.put("513590", "科技-香港             ");//香港消费ETF           市值：3.68      累涨：34.60     15.82     8.28      10.50     10日：5.02      3.26      2.60      0.00      41        累涨修正：48.08     净值区间：68      75      78      70      81      40
        KEJI_HK.put("517360", "科技-香港             ");//沪港深科技ETF         市值：0.34      累涨：33.59     15.00     9.20      9.39      10日：4.89      3.63      2.67      1.03      44        累涨修正：47.45     净值区间：96      97      97      97      92      41
        KEJI_HK.put("159735", "科技-香港             ");//港股消费ETF           市值：6.34      累涨：34.56     15.44     9.35      9.77      10日：4.87      3.24      2.36      0.24      42        累涨修正：47.39     净值区间：71      77      80      70      77      42
        KEJI_HK.put("517350", "科技-香港             ");//科技ETF沪港深         市值：0.88      累涨：31.72     13.57     8.37      9.78      10日：5.50      3.64      2.72      1.15      46        累涨修正：46.3      净值区间：95      96      97      97      98      43
        KEJI_HK.put("159728", "科技-香港             ");//在线消费ETF           市值：0.61      累涨：38.21     13.60     14.20     10.41     10日：4.60      1.29      0.94      0.93      39        累涨修正：45.98     净值区间：86      89      96      96      97      44
        KEJI_HK.put("159725", "科技-香港             ");//线上消费ETF           市值：0.47      累涨：36.38     12.67     13.21     10.50     10日：4.03      0.70      0.47      0.82      40        累涨修正：42.05     净值区间：83      86      93      94      95      45
        KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：7.69      累涨：25.66     13.98     3.07      8.61      10日：4.21      3.30      1.94      0.15      50        累涨修正：37.05     净值区间：70      74      80      50      35      46
        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.54      累涨：27.68     11.03     6.29      10.36     10日：4.47      1.56      0.96      1.43      23        累涨修正：35.63     净值区间：100     100     100     100     97      47
        KEJI_HK.put("517550", "科技-香港             ");//消费ETF沪港深         市值：0.49      累涨：23.09     11.32     4.73      7.04      10日：3.24      2.07      1.16      -0.25     52        累涨修正：30.72     净值区间：61      65      75      60      46      48
        KEJI_HK.put("513970", "科技-香港             ");//恒生消费ETF           市值：15.77     累涨：25.67     9.65      8.11      7.91      10日：2.30      1.04      0.52      0.21      53        累涨修正：30.05     净值区间：52      68      84      84      89      49
        KEJI_HK.put("520520", "科技-香港             ");//恒生消费ETF华泰柏瑞   市值：0.90      累涨：25.63     9.72      8.87      7.04      10日：2.16      0.99      0.54      0.18      51        累涨修正：29.86     净值区间：52      67      85      85      89      50
        KEJI_HK.put("159699", "科技-香港             ");//恒生消费ETF           市值：10.47     累涨：26.02     9.81      8.33      7.88      10日：2.13      0.87      0.29      0.19      54        累涨修正：29.6      净值区间：50      64      83      83      88      51
        KEJI_HK.put("520980", "科技-香港             ");//港股通科技30ETF       市值：16.25     累涨：                                        10日：7.48      5.47      3.98      0.47      34        累涨修正：20.91     净值区间：84      89                              52
        KEJI_HK.put("159550", "科技-香港             ");//互联网ETF沪港深       市值：1.78      累涨：                                        10日：5.87      3.92      2.40      0.49      49        累涨修正：14.59     净值区间：84      87                              53
        KEJI_HK.put("159269", "科技-香港             ");//港股通科技ETF南方     市值：4.35      累涨：                                        10日：          4.88      3.57      1.25      48        累涨修正：12.02     净值区间：97                                      54
        KEJI_HK.put("159262", "科技-香港             ");//港股通科技ETF         市值：16.98     累涨：                                        10日：          4.93      3.53      0.48      47        累涨修正：11.99     净值区间：81                                      55
        KEJI_HK.put("159265", "科技-香港             ");//港股消费50ETF         市值：2.01      累涨：                                        10日：1.98      0.50      0.30      0.59      55        累涨修正：3.08      净值区间：60      72                              56
    }

    public static Map<String, String> TOP_KEJI_JUNGONG = new HashMap<>();//科技-军工
    static {
        TOP_KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：140.40    累涨：34.68     14.40     9.48      10.80     10日：1.65      0.75                3.30      8         累涨修正：37.08     净值区间：93      93      90      91      94      4
    }
    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();//科技-军工
    static {
        KEJI_JUNGONG.put("159206", "科技-军工             ");//卫星ETF               市值：1.12      累涨：37.21     15.11     10.23     11.87     10日：3.19      0.40      0.20      1.71      1         累涨修正：41.2      净值区间：100     82      74      81      86      1
        KEJI_JUNGONG.put("159378", "科技-军工             ");//通用航空ETF           市值：9.23      累涨：36.95     17.62     9.20      10.13     10日：1.66      0.44      0.09      2.53      15        累涨修正：39.23     净值区间：98      98      95      96      97      2
        KEJI_JUNGONG.put("159638", "科技-军工             ");//高端装备ETF           市值：12.65     累涨：34.50     14.59     8.60      11.31     10日：2.28      0.84                3.37      5         累涨修正：37.62     净值区间：100     100     100     100     100     3
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：140.40    累涨：34.68     14.40     9.48      10.80     10日：1.65      0.75                3.30      8         累涨修正：37.08     净值区间：93      93      90      91      94      4
        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：68.51     累涨：34.05     14.08     9.26      10.71     10日：1.95      1.04                3.39      6         累涨修正：37.04     净值区间：97      97      98      98      98      5
        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：58.91     累涨：32.49     13.19     7.71      11.59     10日：2.53      1.49                2.62      2         累涨修正：36.51     净值区间：97      98      96      96      97      6
        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：171.87    累涨：32.36     13.29     7.61      11.46     10日：2.52      1.35                2.42      3         累涨修正：36.23     净值区间：97      98      97      97      98      7
        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：6.60      累涨：31.86     12.93     7.41      11.52     10日：2.64      1.17                2.34      4         累涨修正：35.67     净值区间：96      96      91      91      94      8
        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：8.47      累涨：30.29     13.32     7.06      9.91      10日：2.47      1.24                2.32      11        累涨修正：34        净值区间：100     100     10      10      9       9
        KEJI_JUNGONG.put("562910", "科技-军工             ");//高端制造ETF           市值：0.93      累涨：24.24     9.70      4.42      10.12     10日：3.92      1.08      0.15      1.23      10        累涨修正：29.54     净值区间：93      96      98      98      99      10
        KEJI_JUNGONG.put("516320", "科技-军工             ");//高端装备ETF           市值：0.70      累涨：24.46     9.37      5.09      10.00     10日：3.52      0.93      0.13      1.20      12        累涨修正：29.17     净值区间：100     100     100     100     100     11
        KEJI_JUNGONG.put("159208", "科技-军工             ");//航天航空ETF           市值：0.66      累涨：                    9.65      10.82     10日：1.89      0.81      0.09      3.43      9         累涨修正：23.35     净值区间：100     100     89      90              12
        KEJI_JUNGONG.put("159231", "科技-军工             ");//通用航空ETF华宝       市值：0.28      累涨：                    8.97      10.75     10日：2.33      0.54      0.09      2.60      14        累涨修正：22.77     净值区间：100     100     89      90              13
        KEJI_JUNGONG.put("159227", "科技-军工             ");//航空航天ETF           市值：6.24      累涨：                    9.38      11.02     10日：1.55      0.64                3.40      13        累涨修正：22.59     净值区间：98      98      90      91              14
        KEJI_JUNGONG.put("159392", "科技-军工             ");//航空ETF               市值：0.60      累涨：                    8.31      10.29     10日：2.11      0.58                2.69      17        累涨修正：21.29     净值区间：95      95      85      87              15
        KEJI_JUNGONG.put("159218", "科技-军工             ");//卫星产业ETF           市值：0.32      累涨：                              12.87     10日：3.10      0.66                1.61      7         累涨修正：16.63     净值区间：100     79      64      67              16
        KEJI_JUNGONG.put("159241", "科技-军工             ");//航空航天ETF天弘       市值：4.08      累涨：                              10.77     10日：1.90      0.91                3.37      16        累涨修正：13.58     净值区间：98      98      90                      17
        KEJI_JUNGONG.put("159230", "科技-军工             ");//通用航空ETF基金       市值：0.19      累涨：                              10.27     10日：1.88      0.47                2.44      18        累涨修正：12.62     净值区间：95      95      91                      18
    }

    public static Map<String, String> TOP_KEJI_GONG_YE = new HashMap<>();//科技-通用
    static {
//        TOP_KEJI_GONG_YE.put("159777", "科技-通用             ");//创科技ETF             市值：0.87      累涨：33.62     12.94     7.75      12.93     10日：7.68      3.33      3.33      0.99      1         累涨修正：51.29     净值区间：84      84      91      92      94      1
    }
    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();//科技-通用
    static {
        KEJI_GONG_YE.put("159777", "科技-通用             ");//创科技ETF             市值：0.87      累涨：33.62     12.94     7.75      12.93     10日：7.68      3.33      3.33      0.99      1         累涨修正：51.29     净值区间：84      84      91      92      94      1
        KEJI_GONG_YE.put("515860", "科技-通用             ");//科技ETF嘉实           市值：1.87      累涨：33.52     10.91     8.79      13.82     10日：8.87      3.00      2.92      -0.16     3         累涨修正：51.23     净值区间：68      78      89      93      94      2
        KEJI_GONG_YE.put("159773", "科技-通用             ");//创业板科技ETF         市值：1.97      累涨：33.36     11.54     7.75      14.07     10日：7.44      3.41      3.41      1.08      2         累涨修正：51.03     净值区间：84      84      91      93      95      3
        KEJI_GONG_YE.put("159542", "科技-通用             ");//工程机械ETF           市值：0.08      累涨：27.72     10.36     7.34      10.02     10日：6.19      3.56      3.39      -0.09     5         累涨修正：44.25     净值区间：95      95      98      98      39      4
        KEJI_GONG_YE.put("159667", "科技-通用             ");//工业母机ETF           市值：3.96      累涨：34.43     17.50     7.48      9.45      10日：3.84      1.98      1.98      1.16      15        累涨修正：44.21     净值区间：85      81      86      73      82      5
        KEJI_GONG_YE.put("516330", "科技-通用             ");//物联网ETF             市值：0.13      累涨：30.79     12.41     7.05      11.33     10日：6.11      2.15      2.15      0.61      7         累涨修正：43.35     净值区间：81      66      80      83      87      6
        KEJI_GONG_YE.put("515580", "科技-通用             ");//科技100ETF            市值：4.20      累涨：27.72     9.30      6.76      11.66     10日：6.92      2.80      2.80      0.68      10        累涨修正：43.04     净值区间：84      86      93      94      96      7
        KEJI_GONG_YE.put("515750", "科技-通用             ");//科技50ETF             市值：6.53      累涨：30.60     10.96     7.12      12.52     10日：5.38      2.25      2.25      1.00      9         累涨修正：42.73     净值区间：88      90      95      96      97      8
        KEJI_GONG_YE.put("512770", "科技-通用             ");//战略新兴ETF           市值：2.15      累涨：29.40     10.54     6.80      12.06     10日：6.02      2.53      2.39      1.20      11        累涨修正：42.73     净值区间：77      80      91      93      94      9
        KEJI_GONG_YE.put("159663", "科技-通用             ");//机床ETF               市值：0.88      累涨：33.60     17.61     6.81      9.18      10日：3.62      1.82      1.82      1.35      26        累涨修正：42.68     净值区间：85      84      85      68      77      10
        KEJI_GONG_YE.put("159896", "科技-通用             ");//物联网ETF南方         市值：1.06      累涨：30.81     12.39     7.56      10.86     10日：5.68      2.03      2.03      0.63      8         累涨修正：42.58     净值区间：83      69      80      83      87      11
        KEJI_GONG_YE.put("516050", "科技-通用             ");//科技龙头ETF           市值：4.26      累涨：29.22     9.24      8.29      11.69     10日：6.11      2.41      2.41      1.11      4         累涨修正：42.56     净值区间：86      87      93      95      96      12
        KEJI_GONG_YE.put("515000", "科技-通用             ");//科技ETF               市值：31.24     累涨：28.06     9.49      7.05      11.52     10日：6.12      2.90      2.60      1.09      6         累涨修正：42.28     净值区间：85      86      93      95      96      13
        KEJI_GONG_YE.put("562380", "科技-通用             ");//央企科技引领ETF       市值：1.87      累涨：30.58     11.86     7.16      11.56     10日：5.45      1.55      1.55      0.77      13        累涨修正：40.68     净值区间：71      64      87      90      91      14
        KEJI_GONG_YE.put("563050", "科技-通用             ");//央企科技50ETF         市值：2.31      累涨：29.66     11.58     6.63      11.45     10日：5.74      1.43      1.43      0.98      21        累涨修正：39.69     净值区间：71      86      86      89      91      15
        KEJI_GONG_YE.put("560170", "科技-通用             ");//央企科技ETF           市值：14.15     累涨：29.94     11.82     6.71      11.41     10日：5.54      1.38      1.38      0.80      22        累涨修正：39.62     净值区间：74      64      87      89      91      16
        KEJI_GONG_YE.put("159709", "科技-通用             ");//物联网ETF工银         市值：0.76      累涨：29.67     11.79     7.47      10.41     10日：4.90      1.64      1.64      0.86      16        累涨修正：39.49     净值区间：87      87      95      96      97      17
        KEJI_GONG_YE.put("516260", "科技-通用             ");//物联网50ETF           市值：0.99      累涨：28.82     11.59     7.08      10.15     10日：5.31      1.78      1.78      0.59      17        累涨修正：39.47     净值区间：81      68      84      86      89      18
        KEJI_GONG_YE.put("159723", "科技-通用             ");//科技龙头ETF           市值：0.70      累涨：28.60     12.39     8.04      8.17      10日：3.90      2.31      2.31      1.25      14        累涨修正：39.43     净值区间：87      87      91      92      92      19
        KEJI_GONG_YE.put("159886", "科技-通用             ");//机械ETF               市值：0.53      累涨：24.05     8.64      5.04      10.37     10日：6.25      3.03      3.03      0.52      12        累涨修正：39.39     净值区间：84      89      93      93      94      20
        KEJI_GONG_YE.put("159701", "科技-通用             ");//物联网ETF招商         市值：0.18      累涨：29.33     12.51     6.76      10.06     10日：5.04      1.64      1.64      0.50      20        累涨修正：39.29     净值区间：81      59      80      83      83      21
        KEJI_GONG_YE.put("159895", "科技-通用             ");//物联网ETF易方达       市值：0.67      累涨：29.19     12.26     7.42      9.51      10日：4.47      1.65      1.65      0.93      19        累涨修正：38.61     净值区间：80      70      87      87      89      22
        KEJI_GONG_YE.put("560280", "科技-通用             ");//工程机械ETF           市值：1.45      累涨：23.73     9.56      5.13      9.04      10日：4.82      2.94      2.78      0.23      24        累涨修正：37.05     净值区间：77      80      89      89      67      23
        KEJI_GONG_YE.put("563210", "科技-通用             ");//专精特新ETF           市值：0.34      累涨：25.28     6.95      6.77      11.56     10日：5.23      2.14      2.14      0.86      18        累涨修正：36.93     净值区间：69      69      87      88      88      24
        KEJI_GONG_YE.put("516960", "科技-通用             ");//机械ETF               市值：0.14      累涨：23.57     8.92      4.64      10.01     10日：5.47      2.57      2.57      0.40      23        累涨修正：36.75     净值区间：83      89      92      92      94      25
        KEJI_GONG_YE.put("517660", "科技-通用             ");//物联网ETF沪港深       市值：0.47      累涨：27.89     12.61     6.98      8.30      10日：3.33      1.57      1.57      0.93      29        累涨修正：35.93     净值区间：81      64      68      52      74      26
        KEJI_GONG_YE.put("515200", "科技-通用             ");//创新100ETF            市值：1.60      累涨：25.14     10.60     5.89      8.65      10日：4.60      2.83      1.64      0.81      25        累涨修正：35.85     净值区间：85      85      83      69      72      27
        KEJI_GONG_YE.put("159778", "科技-通用             ");//工业互联ETF           市值：0.54      累涨：26.49     10.56     5.89      10.04     10日：3.99      1.70      1.70      0.96      28        累涨修正：35.58     净值区间：73      85      88      88      76      28
        KEJI_GONG_YE.put("560990", "科技-通用             ");//中金科技先锋ETF       市值：0.29      累涨：22.13     7.31      5.92      8.90      10日：5.06      2.64      2.40      1.18      27        累涨修正：34.63     净值区间：88      90      94      62      65      29
        KEJI_GONG_YE.put("516800", "科技-通用             ");//智能制造ETF           市值：1.65      累涨：24.75     9.30      5.81      9.64      10日：4.31      1.80      1.80      1.16      30        累涨修正：34.46     净值区间：80      84      92      92      58      30
        KEJI_GONG_YE.put("510770", "科技-通用             ");//G60创新ETF            市值：0.17      累涨：26.82     8.71      9.52      8.59      10日：2.74      1.54      1.54      1.19      38        累涨修正：34.18     净值区间：86      88      95      96      97      31
        KEJI_GONG_YE.put("159807", "科技-通用             ");//科技ETF               市值：9.33      累涨：21.23     7.60      4.92      8.71      10日：4.62      2.01      2.01      0.59      31        累涨修正：31.88     净值区间：88      88      93      94      95      32
        KEJI_GONG_YE.put("516720", "科技-通用             ");//ESGETF                市值：0.24      累涨：22.93     8.59      7.01      7.33      10日：3.63      1.97      1.42      0.43      32        累涨修正：31.37     净值区间：60      71      87      88      92      33
        KEJI_GONG_YE.put("560650", "科技-通用             ");//核心50ETF             市值：0.11      累涨：18.61     6.34      3.37      8.90      10日：4.40      2.61      2.61      0.93      35        累涨修正：30.84     净值区间：67      67      84      84      84      34
        KEJI_GONG_YE.put("159791", "科技-通用             ");//300ESGETF             市值：0.32      累涨：17.35     6.46      3.02      7.87      10日：4.53      3.15      2.73      0.31      34        累涨修正：30.49     净值区间：74      83      90      90      91      35
        KEJI_GONG_YE.put("159621", "科技-通用             ");//MSCIESGETF            市值：0.30      累涨：21.31     7.81      6.05      7.45      10日：3.47      2.17      1.77      0.39      37        累涨修正：30.49     净值区间：61      73      83      84      89      36
        KEJI_GONG_YE.put("561500", "科技-通用             ");//漂亮50ETF             市值：0.57      累涨：18.46     5.74      3.67      9.05      10日：4.40      2.42      2.42      0.59      36        累涨修正：30.12     净值区间：79      79      88      88      88      37
        KEJI_GONG_YE.put("159653", "科技-通用             ");//ESG300ETF             市值：0.57      累涨：20.08     8.31      4.85      6.92      10日：3.31      2.31      1.81      0.69      39        累涨修正：29.32     净值区间：66      77      85      85      76      38
        KEJI_GONG_YE.put("588850", "科技-通用             ");//科创机械ETF           市值：0.11      累涨：                    5.82      11.28     10日：5.16      1.62      1.62      0.76      33        累涨修正：27.12     净值区间：61      61      77      77              39
        KEJI_GONG_YE.put("561130", "科技-通用             ");//国货ETF               市值：1.63      累涨：16.28     6.35      3.09      6.84      10日：3.71      1.91      1.91      1.13      42        累涨修正：25.72     净值区间：82      82      89      89      90      40
        KEJI_GONG_YE.put("515090", "科技-通用             ");//可持续发展ETF         市值：0.07      累涨：16.09     6.98      3.19      5.92      10日：3.22      2.22      1.81      0.08      41        累涨修正：25.15     净值区间：70      54      68      49      64      41
        KEJI_GONG_YE.put("510160", "科技-通用             ");//产业升级ETF           市值：2.34      累涨：17.14     6.95      3.60      6.59      10日：3.72      1.95      0.91      0.34      40        累涨修正：24.63     净值区间：50      71      79      80      85      42
        KEJI_GONG_YE.put("159717", "科技-通用             ");//ESGETF                市值：0.46      累涨：16.79     6.81      3.13      6.85      10日：3.15      1.79      1.34      0.67      44        累涨修正：24.41     净值区间：86      90      93      93      67      43
        KEJI_GONG_YE.put("516830", "科技-通用             ");//300ESGETF             市值：2.17      累涨：15.55     5.63      3.34      6.58      10日：3.25      2.08      1.50      0.34      43        累涨修正：23.88     净值区间：61      69      82      82      86      44
        KEJI_GONG_YE.put("560180", "科技-通用             ");//沪深300ESGETF南方     市值：0.24      累涨：14.93     5.68      2.91      6.34      10日：3.44      1.95      1.56      0.39      45        累涨修正：23.44     净值区间：59      71      90      90      90      45
        KEJI_GONG_YE.put("510990", "科技-通用             ");//180ESGETF             市值：0.49      累涨：15.67     6.52      2.75      6.40      10日：3.00      1.60      1.17      0.53      47        累涨修正：22.61     净值区间：54      73      83      85      88      46
        KEJI_GONG_YE.put("561900", "科技-通用             ");//沪深300ESGETF         市值：0.41      累涨：14.35     5.86      2.77      5.72      10日：2.83      1.52      1.40      0.35      49        累涨修正：21.5      净值区间：78      85      88      88      91      47
        KEJI_GONG_YE.put("560810", "科技-通用             ");//央企ESGETF            市值：4.99      累涨：14.13     4.69      3.90      5.54      10日：3.43      1.64      1.12      0.00      46        累涨修正：21.44     净值区间：80      87      93      93      94      48
        KEJI_GONG_YE.put("510090", "科技-通用             ");//ESGETF基金            市值：0.82      累涨：15.91     6.48      3.55      5.88      10日：2.48      1.51      0.66      0.57      48        累涨修正：21.22     净值区间：40      73      33      38      49      49
    }

    public static Map<String, String> TOP_KEJI_RUAN_JIAN = new HashMap<>();//科技-软件
    static {
        TOP_KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：69.17     累涨：52.13     17.14     12.44     22.55     10日：9.79      6.52      3.00      -2.64     1         累涨修正：74.44     净值区间：1       1       1       1       1       1
        TOP_KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：1.56      累涨：52.73     19.52     14.74     18.47     10日：7.56      4.00      1.00      0.30      4         累涨修正：66.29     净值区间：88      89      95      96      97      4
    }
    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件
    static {
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：69.17     累涨：52.13     17.14     12.44     22.55     10日：9.79      6.52      3.00      -2.64     1         累涨修正：74.44     净值区间：1       1       1       1       1       1
        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：10.86     累涨：51.26     16.49     12.27     22.50     10日：9.81      6.34      3.00      -2.57     3         累涨修正：73.41     净值区间：42      59      79      83      85      2
        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：6.50      累涨：51.39     17.37     11.81     22.21     10日：9.42      6.49      3.00      -2.67     2         累涨修正：73.3      净值区间：44      62      80      85      86      3
        KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：1.56      累涨：52.73     19.52     14.74     18.47     10日：7.56      4.00      1.00      0.30      4         累涨修正：66.29     净值区间：88      89      95      96      97      4
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：15.65     累涨：53.22     19.89     15.14     18.19     10日：6.81      3.84      0.84      0.28      6         累涨修正：65.55     净值区间：83      85      91      94      96      5
        KEJI_RUAN_JIAN.put("159388", "科技-软件             ");//创业板人工智能ETF国泰 市值：0.50      累涨：53.00     19.96     14.51     18.53     10日：7.07      3.81      0.81      0.00      5         累涨修正：65.5      净值区间：95      95      91      94      95      6
        KEJI_RUAN_JIAN.put("159586", "科技-软件             ");//计算机ETF南方         市值：4.08      累涨：42.66     15.34     10.01     17.31     10日：6.27      4.34      2.31      -1.25     8         累涨修正：57.89     净值区间：63      69      86      86      83      7
        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：2.96      累涨：40.73     14.39     9.10      17.24     10日：6.65      4.59      2.88      -1.87     9         累涨修正：57.73     净值区间：56      60      80      80      81      8
        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.70      累涨：44.62     17.09     9.90      17.63     10日：6.61      4.16      1.16      0.00      7         累涨修正：57.71     净值区间：88      89      95      96      97      9
        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.12      累涨：41.44     14.20     10.09     17.15     10日：6.23      3.99      2.21      -1.35     10        累涨修正：56.08     净值区间：55      64      82      83      85      10
        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：1.80      累涨：39.63     13.68     9.23      16.72     10日：6.59      4.42      2.62      -1.82     12        累涨修正：55.88     净值区间：52      59      80      80      80      11
        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：15.87     累涨：39.65     14.14     9.20      16.31     10日：6.01      4.09      2.51      -1.75     18        累涨修正：54.77     净值区间：50      57      78      78      78      12
        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：31.72     累涨：41.88     16.13     10.23     15.52     10日：6.09      3.78      1.10      0.08      11        累涨修正：53.95     净值区间：89      89      96      96      96      13
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：5.42      累涨：42.75     17.68     10.27     14.80     10日：5.19      3.64      0.98      0.08      17        累涨修正：53.54     净值区间：82      84      89      91      94      14
        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：4.87      累涨：40.03     14.62     9.85      15.56     10日：6.27      3.77      1.33      -0.17     14        累涨修正：52.73     净值区间：82      83      93      93      94      15
        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：5.74      累涨：40.38     14.78     10.41     15.19     10日：6.11      3.73      1.23      0.09      13        累涨修正：52.68     净值区间：89      89      96      96      96      16
        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：4.81      累涨：40.10     15.33     9.67      15.10     10日：6.17      3.81      1.25      -0.08     16        累涨修正：52.58     净值区间：87      87      95      95      96      17
        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//云计算50ETF           市值：1.37      累涨：40.79     15.87     9.79      15.13     10日：5.80      3.45      1.14      0.20      20        累涨修正：52.32     净值区间：91      93      97      97      60      18
        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：32.17     累涨：37.88     14.67     9.20      14.01     10日：5.30      4.05      2.27      -1.35     21        累涨修正：51.77     净值区间：50      51      78      78      59      19
        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算ETF沪港深       市值：2.92      累涨：40.52     16.35     10.07     14.10     10日：4.95      3.40      1.12      0.09      23        累涨修正：51.11     净值区间：88      72      85      88      91      20
        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.41      累涨：36.62     14.05     8.85      13.72     10日：5.46      4.23      2.32      -1.34     22        累涨修正：50.95     净值区间：49      59      76      76      59      21
        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：34.17     累涨：38.02     14.63     9.12      14.27     10日：6.67      3.74      1.07      0.10      19        累涨修正：50.57     净值区间：88      83      91      93      95      22
        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.63      累涨：36.25     13.59     9.08      13.58     10日：4.97      3.74      2.11      -0.97     28        累涨修正：49.18     净值区间：55      56      80      80      62      23
        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：45.34     累涨：34.17     12.24     8.40      13.53     10日：6.02      4.10      1.96      0.52      24        累涨修正：48.21     净值区间：89      62      68      63      38      24
        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.16      累涨：36.36     13.61     9.76      12.99     10日：5.15      3.25      1.45      -0.11     27        累涨修正：47.66     净值区间：86      87      91      91      65      25
        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：1.40      累涨：36.69     13.91     9.80      12.98     10日：4.48      3.13      1.66      -0.82     44        累涨修正：47.62     净值区间：61      64      76      76      59      26
        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：17.78     累涨：34.50     17.11     5.73      11.66     10日：5.36      3.63      2.01      2.60      32        累涨修正：47.51     净值区间：96      96      97      89      63      27
        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：10.58     累涨：33.20     12.13     7.75      13.32     10日：6.39      4.08      1.81      0.62      25        累涨修正：47.29     净值区间：94      63      68      61      31      28
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人50ETF           市值：5.68      累涨：34.89     17.59     6.02      11.28     10日：5.34      3.41      1.79      2.98      31        累涨修正：47.22     净值区间：95      96      97      91      64      29
        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：7.63      累涨：35.92     13.03     9.24      13.65     10日：4.64      3.29      1.67      -1.02     40        累涨修正：47.19     净值区间：58      63      77      64      55      30
        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：22.06     累涨：35.95     13.43     9.55      12.97     10日：5.07      3.19      1.41      -0.12     38        累涨修正：47.03     净值区间：86      87      89      86      59      31
        KEJI_RUAN_JIAN.put("513360", "科技-软件             ");//教育ETF               市值：5.11      累涨：37.38     14.81     10.72     11.85     10日：3.65      2.89      1.53      -0.94     48        累涨修正：46.98     净值区间：55      61      81      81      86      32
        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.73      累涨：36.49     12.37     9.82      14.30     10日：5.22      2.84      1.13      -0.11     39        累涨修正：46.81     净值区间：74      80      91      92      92      33
        KEJI_RUAN_JIAN.put("159998", "科技-软件             ");//计算机ETF             市值：32.33     累涨：34.51     12.36     8.99      13.16     10日：5.31      3.40      1.58      -0.55     34        累涨修正：46.38     净值区间：69      69      86      86      73      34
        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：15.11     累涨：31.95     11.50     7.60      12.85     10日：6.40      4.17      1.89      0.74      26        累涨修正：46.3      净值区间：94      65      72      63      39      35
        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：3.23      累涨：35.50     13.19     9.20      13.11     10日：4.54      3.14      1.56      -0.85     46        累涨修正：46.3      净值区间：59      62      77      77      58      36
        KEJI_RUAN_JIAN.put("159786", "科技-软件             ");//VRETF                 市值：1.23      累涨：36.29     13.75     9.17      13.37     10日：6.58      2.49      0.44      -0.11     29        累涨修正：46.24     净值区间：76      81      92      94      95      37
        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：8.00      累涨：32.43     11.99     7.68      12.76     10日：6.10      4.00      1.85      0.57      30        累涨修正：46.23     净值区间：94      60      69      64      38      38
        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.60      累涨：35.65     11.60     10.15     13.90     10日：5.24      2.99      1.17      -0.21     35        累涨修正：46.22     净值区间：72      79      91      92      93      39
        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：4.02      累涨：34.97     13.21     8.86      12.90     10日：5.13      3.28      1.41      -0.11     45        累涨修正：46.2      净值区间：83      84      90      90      53      40
        KEJI_RUAN_JIAN.put("159382", "科技-软件             ");//创业板人工智能ETF南方 市值：0.39      累涨：                    15.31     18.38     10日：7.10      3.79      0.79      0.26      15        累涨修正：46.16     净值区间：95      96      83      89              41
        KEJI_RUAN_JIAN.put("512720", "科技-软件             ");//计算机ETF             市值：13.04     累涨：34.46     12.87     8.63      12.96     10日：5.11      3.42      1.51      -0.47     42        累涨修正：46.01     净值区间：66      69      85      85      69      42
        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：166.02    累涨：35.03     13.54     8.59      12.90     10日：5.83      3.19      0.84      0.21      33        累涨修正：45.73     净值区间：83      81      86      87      91      43
        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：5.70      累涨：36.00     11.99     9.39      14.62     10日：5.40      2.89      0.67      -0.10     37        累涨修正：45.63     净值区间：59      66      87      90      90      44
        KEJI_RUAN_JIAN.put("589010", "科技-软件             ");//科创人工智能ETF华夏   市值：0.85      累涨：31.93     11.30     7.68      12.95     10日：5.84      3.85      1.82      0.60      36        累涨修正：45.26     净值区间：94      67      72      65      40      45
        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：55.65     累涨：33.20     12.90     7.82      12.48     10日：5.82      3.34      1.16      0.08      43        累涨修正：44.68     净值区间：87      82      88      89      92      46
        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：19.33     累涨：33.67     13.05     8.06      12.56     10日：5.79      3.28      0.88      0.07      41        累涨修正：44.5      净值区间：83      73      85      87      90      47
        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：150.47    累涨：32.90     16.68     5.25      10.97     10日：5.06      3.15      1.57      1.54      50        累涨修正：44.25     净值区间：97      97      98      78      57      48
        KEJI_RUAN_JIAN.put("589520", "科技-软件             ");//科创人工智能ETF华宝   市值：2.84      累涨：31.52     11.80     6.99      12.73     10日：5.65      3.68      1.66      0.70      47        累涨修正：44.17     净值区间：96      67      69      57      38      49
        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：59.78     累涨：33.29     17.06     5.41      10.82     10日：4.89      2.93      1.40      1.72      52        累涨修正：43.91     净值区间：95      95      97      79      58      50
        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人ETF嘉实         市值：5.75      累涨：32.28     17.05     5.30      9.93      10日：4.36      2.73      1.32      1.79      58        累涨修正：42.01     净值区间：98      98      99      79      56      51
        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.36      累涨：31.86     16.70     4.82      10.34     10日：4.43      2.78      1.44      1.86      57        累涨修正：41.95     净值区间：93      93      96      78      56      52
        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.63      累涨：31.67     16.56     4.72      10.39     10日：4.66      2.72      1.31      1.93      56        累涨修正：41.67     净值区间：98      98      99      77      57      53
        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.37      累涨：30.50     10.56     6.96      12.98     10日：5.73      3.01      1.05      -0.15     51        累涨修正：41.34     净值区间：78      86      93      82      76      54
        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：16.08     累涨：30.29     9.60      7.77      12.92     10日：5.96      2.97      0.93      -0.15     49        累涨修正：41.08     净值区间：72      78      90      91      91      55
        KEJI_RUAN_JIAN.put("560800", "科技-软件             ");//数字经济ETF           市值：7.59      累涨：27.31     8.38      7.02      11.91     10日：5.14      3.17      1.71      -0.52     53        累涨修正：39.04     净值区间：65      67      82      82      59      56
        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创ETF广发           市值：1.30      累涨：28.31     8.77      8.00      11.54     10日：4.64      3.08      1.40      -0.43     55        累涨修正：38.83     净值区间：50      54      74      49      45      57
        KEJI_RUAN_JIAN.put("560630", "科技-软件             ");//机器人产业ETF         市值：4.82      累涨：29.51     15.63     5.04      8.84      10日：3.96      2.54      1.32      1.96      65        累涨修正：38.65     净值区间：98      98      99      79      58      58
        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：2.65      累涨：27.65     8.80      7.75      11.10     10日：4.60      3.02      1.34      -0.50     59        累涨修正：37.95     净值区间：62      58      77      63      63      59
        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：2.99      累涨：26.51     7.56      7.98      10.97     10日：4.42      3.13      1.47      -0.51     61        累涨修正：37        净值区间：59      56      73      49      46      60
        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.91      累涨：27.95     11.55     7.84      8.56      10日：3.80      2.87      1.09      0.13      67        累涨修正：36.8      净值区间：100     56      64      66      62      61
        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：1.91      累涨：26.65     8.82      6.70      11.13     10日：4.29      3.10      1.37      -0.59     63        累涨修正：36.78     净值区间：58      53      75      58      41      62
        KEJI_RUAN_JIAN.put("159658", "科技-软件             ");//数字经济ETF           市值：1.99      累涨：25.60     8.18      5.77      11.65     10日：4.72      3.13      1.60      -0.41     60        累涨修正：36.65     净值区间：58      58      76      76      54      63
        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：2.45      累涨：24.00     6.76      6.35      10.89     10日：5.29      3.16      1.54      -0.15     54        累涨修正：35.53     净值区间：72      45      65      65      39      64
        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.24      累涨：23.21     6.86      5.86      10.49     10日：5.01      3.02      1.55      -0.30     62        累涨修正：34.34     净值区间：13      13      21      27      27      65
        KEJI_RUAN_JIAN.put("588770", "科技-软件             ");//科创信息技术ETF摩根   市值：3.07      累涨：22.49     6.41      5.81      10.27     10日：4.89      2.99      1.60      -0.11     66        累涨修正：33.57     净值区间：70      52      63      63      38      66
        KEJI_RUAN_JIAN.put("159213", "科技-软件             ");//机器人ETF基金         市值：0.74      累涨：                    4.91      10.01     10日：4.49      2.81      1.80      1.47      69        累涨修正：25.82     净值区间：95      95      97      78              67
        KEJI_RUAN_JIAN.put("159389", "科技-软件             ");//数字经济ETF嘉实       市值：2.92      累涨：                              10.38     10日：4.78      2.74      1.17      -0.58     68        累涨修正：20.24     净值区间：50      62      81                      68
        KEJI_RUAN_JIAN.put("561220", "科技-软件             ");//数字经济ETF工银       市值：3.66      累涨：                              9.69      10日：4.59      2.44      0.87      -0.39     70        累涨修正：18.46     净值区间：57      64      85                      69
        KEJI_RUAN_JIAN.put("159385", "科技-软件             ");//数字经济ETF富国       市值：2.62      累涨：                              9.68      10日：4.38      2.24      0.97      -0.38     71        累涨修正：18.24     净值区间：52      60      76                      70
        KEJI_RUAN_JIAN.put("589380", "科技-软件             ");//AIETF富国             市值：0.70      累涨：                                        10日：          4.06      2.03      0.60      64        累涨修正：8.12      净值区间：97      65                              71
        KEJI_RUAN_JIAN.put("159246", "科技-软件             ");//人工智能ETF富国       市值：2.23      累涨：                                        10日：                              0.30      72        累涨修正：0         净值区间：                                        72
    }

    public static Map<String, String> TOP_KEJI_XIN_PIAN = new HashMap<>();//科技-芯片
    static {
        TOP_KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：5.54      累涨：35.77     10.76     12.54     12.47     10日：5.18      2.82      1.71      -0.18     11        累涨修正：47.19     净值区间：68      44      70      81      85      1
        TOP_KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：2.44      累涨：30.16     9.52      8.09      12.55     10日：5.31      3.40      1.75      -0.57     6         累涨修正：42.37     净值区间：72      38      58      58      32      9
    }
    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片
    static {
        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：5.54      累涨：35.77     10.76     12.54     12.47     10日：5.18      2.82      1.71      -0.18     11        累涨修正：47.19     净值区间：68      44      70      81      85      1
        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：4.42      累涨：35.87     11.97     9.14      14.76     10日：6.91      3.07      0.43      0.00      1         累涨修正：46.71     净值区间：86      90      95      97      97      2
        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：20.94     累涨：36.99     13.45     9.20      14.34     10日：6.30      2.47      0.24      0.36      7         累涨修正：46.24     净值区间：78      82      92      94      95      3
        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：4.73      累涨：33.66     11.23     8.17      14.26     10日：7.34      3.37      0.80      0.11      2         累涨修正：45.97     净值区间：86      88      94      95      93      4
        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：4.09      累涨：34.86     11.83     8.29      14.74     10日：6.59      3.12      0.45      0.11      3         累涨修正：45.47     净值区间：84      86      93      95      96      5
        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：2.24      累涨：32.53     11.06     7.97      13.50     10日：6.60      3.23      0.86      0.12      5         累涨修正：44.08     净值区间：92      94      97      97      93      6
        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：3.17      累涨：33.05     11.31     8.59      13.15     10日：6.50      3.06      0.48      0.36      4         累涨修正：43.57     净值区间：92      94      97      97      91      7
        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.65      累涨：32.33     11.21     7.82      13.30     10日：6.43      2.69      0.63      0.50      9         累涨修正：42.71     净值区间：88      93      96      97      95      8
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：2.44      累涨：30.16     9.52      8.09      12.55     10日：5.31      3.40      1.75      -0.57     6         累涨修正：42.37     净值区间：72      38      58      58      32      9
        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.11      累涨：32.11     11.21     8.18      12.72     10日：5.81      2.77      0.65      0.26      10        累涨修正：41.99     净值区间：92      93      96      97      88      10
        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：1.48      累涨：28.59     8.98      6.71      12.90     10日：6.72      3.28      0.72      0.24      8         累涨修正：40.03     净值区间：82      92      95      96      96      11
        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：294.79    累涨：25.61     7.11      6.94      11.56     10日：5.64      3.47      2.07      -0.59     13        累涨修正：38.86     净值区间：66      45      66      66      40      12
        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：15.94     累涨：25.84     7.25      7.07      11.52     10日：5.37      3.30      2.00      -0.59     15        累涨修正：38.51     净值区间：69      43      65      65      40      13
        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：12.58     累涨：29.74     8.82      8.26      12.66     10日：5.55      2.50      0.35      0.26      14        累涨修正：38.49     净值区间：86      90      95      96      96      14
        KEJI_XIN_PIAN.put("588170", "科技-芯片             ");//科创半导体ETF         市值：2.30      累涨：29.35     7.50      8.97      12.88     10日：5.31      1.96      0.88      -0.58     16        累涨修正：38.38     净值区间：42      55      78      78      78      15
        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：4.56      累涨：28.49     9.04      7.40      12.05     10日：5.88      2.81      0.44      0.33      12        累涨修正：38.06     净值区间：82      89      94      96      96      16
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.68      累涨：26.59     8.15      7.13      11.31     10日：4.57      2.90      1.58      -0.31     17        累涨修正：37.22     净值区间：72      36      55      55      35      17
        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：25.14     累涨：24.27     6.61      6.71      10.95     10日：5.29      3.13      1.84      -0.47     19        累涨修正：36.37     净值区间：66      46      66      66      40      18
        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：5.40      累涨：24.60     6.46      7.13      11.01     10日：5.10      3.04      1.79      -0.47     22        累涨修正：36.32     净值区间：69      43      66      66      39      19
        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：1.77      累涨：26.32     9.08      6.21      11.03     10日：5.32      2.89      0.80      0.57      18        累涨修正：36.13     净值区间：86      88      95      95      73      20
        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.28      累涨：24.50     6.41      6.77      11.32     10日：5.26      2.93      1.66      -0.38     21        累涨修正：36.01     净值区间：70      44      66      66      41      21
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.29      累涨：26.20     7.82      7.23      11.15     10日：4.17      2.65      1.48      -0.15     26        累涨修正：35.98     净值区间：73      36      59      59      37      22
        KEJI_XIN_PIAN.put("589100", "科技-芯片             ");//科创芯片ETF国泰       市值：1.08      累涨：23.50     6.31      6.38      10.81     10日：5.15      3.11      1.97      -0.51     29        累涨修正：35.7      净值区间：70      46      67      67      43      23
        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.32      累涨：25.11     6.68      7.00      11.43     10日：5.21      2.41      1.40      -0.84     27        累涨修正：35.53     净值区间：45      49      73      74      53      24
        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：243.98    累涨：25.38     7.34      7.17      10.87     10日：4.31      2.66      1.48      -0.39     30        累涨修正：35.31     净值区间：63      35      59      59      36      25
        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.96      累涨：24.29     6.25      7.01      11.03     10日：4.81      2.94      1.61      -0.84     24        累涨修正：35.26     净值区间：40      40      64      90      75      26
        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：26.50     累涨：26.48     7.34      7.62      11.52     10日：5.18      2.00      0.76      -1.04     20        累涨修正：35.18     净值区间：20      39      72      74      68      27
        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.64      累涨：24.64     7.57      6.85      10.22     10日：4.30      2.59      1.34      -0.47     35        累涨修正：34.21     净值区间：60      47      65      65      35      28
        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：253.99    累涨：23.82     7.00      6.66      10.16     10日：4.50      2.85      1.51      -0.41     33        累涨修正：34.19     净值区间：68      48      66      66      37      29
        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.94      累涨：26.21     7.13      7.67      11.41     10日：4.89      1.82      0.61      -0.69     25        累涨修正：34.14     净值区间：19      38      72      73      71      30
        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：53.81     累涨：23.67     7.28      6.04      10.35     10日：4.42      2.88      1.57      -0.39     34        累涨修正：34.11     净值区间：67      48      66      66      36      31
        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：12.52     累涨：23.79     7.44      5.89      10.46     10日：4.44      2.84      1.35      -0.40     32        累涨修正：33.77     净值区间：71      43      65      65      37      32
        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.74      累涨：24.65     6.17      6.85      11.63     10日：5.38      2.00      0.82      -1.08     28        累涨修正：33.67     净值区间：21      38      72      73      70      33
        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：114.54    累涨：23.53     6.90      6.29      10.34     10日：4.51      2.75      1.42      -0.61     36        累涨修正：33.63     净值区间：64      37      63      63      37      34
        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：4.78      累涨：23.28     7.36      5.74      10.18     10日：4.42      2.78      1.53      -0.55     37        累涨修正：33.54     净值区间：42      39      63      63      35      35
        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.29      累涨：23.50     6.43      6.64      10.43     10日：4.30      2.68      1.47      -0.43     39        累涨修正：33.42     净值区间：71      40      52      52      38      36
        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.67      累涨：25.29     7.35      6.70      11.24     10日：4.77      2.02      0.65      -0.80     31        累涨修正：33.38     净值区间：22      39      72      73      72      37
        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.05     累涨：23.23     6.90      6.36      9.97      10日：4.33      2.78      1.45      -0.48     38        累涨修正：33.24     净值区间：67      39      63      63      38      38
        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.77      累涨：23.19     6.05      6.18      10.96     10日：4.87      1.97      1.20      -0.77     41        累涨修正：32.43     净值区间：52      49      75      76      53      39
        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片ETF天弘           市值：10.31     累涨：22.73     7.14      5.90      9.69      10日：4.18      2.52      1.26      -0.41     42        累涨修正：31.95     净值区间：67      42      64      64      36      40
        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.73      累涨：22.02     6.60      5.87      9.55      10日：4.21      2.69      1.47      -0.32     43        累涨修正：31.86     净值区间：68      44      66      66      38      41
        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.69      累涨：23.72     5.95      6.37      11.40     10日：5.01      1.72      0.66      -0.90     40        累涨修正：31.77     净值区间：24      41      73      73      70      42
        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.96      累涨：21.89     6.08      6.06      9.75      10日：4.24      2.52      1.33      -0.41     44        累涨修正：31.31     净值区间：63      35      61      61      35      43
        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.34     累涨：21.53     6.63      5.43      9.47      10日：4.02      2.52      1.34      -0.33     45        累涨修正：30.75     净值区间：64      48      66      66      36      44
        KEJI_XIN_PIAN.put("588710", "科技-芯片             ");//科创半导体设备ETF     市值：0.55      累涨：                              13.93     10日：6.50      2.67      1.62      -0.94     23        累涨修正：26.34     净值区间：48      60      81                      45
    }

    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();
    public static Map<String, String> TOP_KEJI_TONG_XIN = new HashMap<>();

    static {
        TOP_KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：27.23     累涨：44.92     8.29      21.45     15.18     10日：6.91      6.08      2.11      3.18      1         累涨修正：62.13     净值区间：95      96      96      99      79      1
    }

    static {
        KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：27.23     累涨：44.92     8.29      21.45     15.18     10日：6.91      6.08      2.11      3.18      1         累涨修正：62.13     净值区间：95      96      96      99      79      1
        KEJI_TONG_XIN.put("515050", "科技-通信             ");//5G通信ETF             市值：64.83     累涨：41.88     7.74      20.53     13.61     10日：6.44      5.85      2.26      3.08      3         累涨修正：58.69     净值区间：96      96      85      94      62      2
        KEJI_TONG_XIN.put("159994", "科技-通信             ");//5GETF                 市值：15.29     累涨：42.21     8.19      21.15     12.87     10日：6.03      5.55      2.16      3.40      2         累涨修正：58.11     净值区间：98      98      86      95      62      3
        KEJI_TONG_XIN.put("159583", "科技-通信             ");//通信设备ETF           市值：0.65      累涨：39.69     8.09      17.66     13.94     10日：5.94      5.19      2.30      2.34      4         累涨修正：55.42     净值区间：100     100     80      92      73      4
        KEJI_TONG_XIN.put("159811", "科技-通信             ");//5G50ETF               市值：1.09      累涨：38.09     9.44      17.82     10.83     10日：5.01      4.58      1.98      3.13      5         累涨修正：51.64     净值区间：97      97      85      94      62      5
        KEJI_TONG_XIN.put("159695", "科技-通信             ");//通信ETF               市值：1.04      累涨：34.63     7.64      15.37     11.62     10日：4.81      3.93      1.56      2.05      6         累涨修正：46.49     净值区间：94      96      96      99      77      6
        KEJI_TONG_XIN.put("159507", "科技-通信             ");//电信ETF               市值：0.45      累涨：34.45     8.02      15.25     11.18     10日：4.60      3.73      1.71      2.15      7         累涨修正：46.2      净值区间：96      97      97      99      75      7
        KEJI_TONG_XIN.put("159511", "科技-通信             ");//通信ETF南方           市值：0.83      累涨：29.27     8.70      12.77     7.80      10日：3.82      2.93      1.36      1.72      8         累涨修正：38.74     净值区间：96      96      96      99      69      8
        KEJI_TONG_XIN.put("560300", "科技-通信             ");//电信50ETF             市值：0.73      累涨：23.94     5.34      10.41     8.19      10日：3.74      2.76      0.89      1.84      9         累涨修正：32.22     净值区间：98      98      98      99      62      9
        KEJI_TONG_XIN.put("560690", "科技-通信             ");//电信ETF基金           市值：0.26      累涨：24.10     6.74      9.42      7.94      10日：3.52      2.73      0.93      1.61      10        累涨修正：32.21     净值区间：96      97      97      99      63      10
        KEJI_TONG_XIN.put("563010", "科技-通信             ");//电信ETF               市值：1.48      累涨：24.63     7.02      10.01     7.60      10日：2.57      2.01      0.64      1.74      11        累涨修正：30.49     净值区间：96      96      94      98      63      11
    }

    public static Map<String, String> TOP_KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源
    static {
        TOP_KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.65      累涨：33.61     11.88     5.99      15.74     10日：11.78     5.20      5.20      -0.50     1         累涨修正：60.99     净值区间：83      88      91      91      91      1
    }
    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源
    static {
        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.65      累涨：33.61     11.88     5.99      15.74     10日：11.78     5.20      5.20      -0.50     1         累涨修正：60.99     净值区间：83      88      91      91      91      1
        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.56      累涨：32.12     11.55     5.21      15.36     10日：11.23     5.22      5.22      -0.24     3         累涨修正：59.01     净值区间：85      87      91      91      91      2
        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：123.65    累涨：31.91     10.87     5.57      15.47     10日：11.28     4.96      4.96      0.00      2         累涨修正：58.07     净值区间：77      83      88      88      88      3
        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.60      累涨：32.24     11.88     5.07      15.29     10日：10.80     4.93      4.93      -0.17     8         累涨修正：57.83     净值区间：84      88      92      92      92      4
        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：23.22     累涨：32.01     10.88     5.86      15.27     10日：10.86     4.98      4.98      -0.16     4         累涨修正：57.81     净值区间：78      83      88      88      88      5
        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.40      累涨：30.97     10.84     4.68      15.45     10日：11.47     5.11      5.11      -0.41     9         累涨修正：57.77     净值区间：82      86      90      90      90      6
        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.71      累涨：31.82     11.10     5.62      15.10     10日：11.08     4.93      4.93      -0.24     5         累涨修正：57.69     净值区间：82      87      90      90      90      7
        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：10.10     累涨：32.09     11.27     5.33      15.49     10日：11.08     4.82      4.82      -0.49     6         累涨修正：57.63     净值区间：80      85      89      89      89      8
        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：3.84      累涨：31.46     10.87     5.51      15.08     10日：11.23     4.94      4.94      -0.42     7         累涨修正：57.51     净值区间：81      86      90      90      90      9
        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：3.34      累涨：30.10     10.61     4.74      14.75     10日：11.00     4.57      4.57      -0.22     15        累涨修正：54.81     净值区间：81      86      90      90      90      10
        KEJI_NEW_ENERGY.put("159368", "科技-新能源           ");//创业板新能源ETF华夏   市值：0.98      累涨：35.60     14.03     6.59      14.98     10日：7.43      3.60      3.60      0.93      10        累涨修正：53.83     净值区间：88      88      94      94      96      11
        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.62      累涨：30.11     10.83     5.50      13.78     10日：8.96      4.49      4.49      0.21      13        累涨修正：52.54     净值区间：82      85      90      91      91      12
        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.79      累涨：35.17     12.90     7.22      15.05     10日：7.26      3.09      3.09      -0.26     11        累涨修正：51.7      净值区间：59      68      84      86      87      13
        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.78      累涨：34.22     12.99     7.20      14.03     10日：7.44      3.00      3.00      -0.29     12        累涨修正：50.66     净值区间：57      68      76      78      79      14
        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：6.52      累涨：29.44     10.17     5.72      13.55     10日：8.16      4.05      4.05      0.26      14        累涨修正：49.75     净值区间：83      88      93      93      95      15
        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：43.83     累涨：29.55     10.44     5.60      13.51     10日：7.91      3.82      3.82      -0.05     17        累涨修正：48.92     净值区间：81      86      92      92      94      16
        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.16      累涨：29.61     10.69     5.51      13.41     10日：7.63      3.84      3.84      -0.14     19        累涨修正：48.76     净值区间：81      86      92      93      94      17
        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：8.94      累涨：29.19     10.03     6.34      12.82     10日：7.68      3.86      3.86      0.00      16        累涨修正：48.45     净值区间：82      86      92      92      94      18
        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：0.91      累涨：29.55     10.06     6.60      12.89     10日：7.25      3.87      3.87      -0.21     18        累涨修正：48.41     净值区间：86      89      94      94      95      19
        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：2.04      累涨：27.25     11.66     4.18      11.41     10日：6.30      3.58      3.58      -0.22     22        累涨修正：44.29     净值区间：78      83      91      91      93      20
        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.59      累涨：25.51     8.78      4.21      12.52     10日：7.27      3.66      3.66      0.00      24        累涨修正：43.76     净值区间：74      81      89      89      91      21
        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.58      累涨：31.46     12.10     7.35      12.01     10日：6.12      2.34      1.65      0.19      20        累涨修正：43.22     净值区间：63      67      86      90      93      22
        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.64      累涨：24.75     8.04      5.23      11.48     10日：7.12      3.62      3.62      -0.18     23        累涨修正：42.73     净值区间：91      94      96      96      97      23
        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.14      累涨：27.43     9.99      5.77      11.67     10日：5.95      2.89      2.89      0.67      16        累涨修正：42.05     净值区间：89      92      95      95      96      24
        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.23      累涨：31.42     12.53     7.25      11.64     10日：5.64      1.95      1.46      0.48      21        累涨修正：41.93     净值区间：60      69      85      89      92      25
        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：2.91      累涨：26.53     10.88     4.52      11.13     10日：6.13      3.04      3.04      0.00      25        累涨修正：41.78     净值区间：80      83      90      90      94      26
        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：11.98     累涨：24.36     8.80      4.70      10.86     10日：5.92      3.14      3.14      0.20      26        累涨修正：39.7      净值区间：80      86      91      91      93      27
        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：20.59     累涨：23.05     8.61      3.82      10.62     10日：6.39      3.34      3.34      0.34      27        累涨修正：39.46     净值区间：83      88      93      93      94      28
        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.53      累涨：22.43     8.82      3.34      10.27     10日：6.17      3.22      3.05      0.00      30        累涨修正：37.92     净值区间：83      88      92      92      94      29
        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.59      累涨：23.03     8.24      4.15      10.64     10日：6.25      2.87      2.87      0.22      29        累涨修正：37.89     净值区间：79      85      90      90      93      30
        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.59      累涨：22.18     8.35      3.71      10.12     10日：5.80      3.06      3.06      0.18      32        累涨修正：37.16     净值区间：83      87      92      92      94      31
        KEJI_NEW_ENERGY.put("159387", "科技-新能源           ");//创业板新能源ETF国泰   市值：0.31      累涨：                              14.32     10日：7.26      3.74      3.74      0.92      28        累涨修正：32.8      净值区间：86      86      93                      32
        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：10.49     累涨：20.47     7.74      4.66      8.07      10日：4.57      1.95      1.95      0.52      33        累涨修正：30.89     净值区间：65      79      88      88      91      33
        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.55      累涨：21.86     7.57      6.00      8.29      10日：4.46      2.21      0.82      0.28      31        累涨修正：30.17     净值区间：37      60      78      78      81      34
        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.15      累涨：20.01     7.47      4.87      7.67      10日：4.52      1.72      1.72      0.39      34        累涨修正：29.69     净值区间：63      78      88      88      91      35
        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：6.90      累涨：19.94     7.48      4.79      7.67      10日：4.31      1.69      1.69      0.39      35        累涨修正：29.32     净值区间：56      76      86      86      90      36
        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：1.80      累涨：19.90     7.56      4.71      7.63      10日：4.23      1.58      1.58      0.39      38        累涨修正：28.87     净值区间：56      76      87      87      90      37
        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.83      累涨：19.61     7.97      4.51      7.13      10日：3.92      1.56      1.56      0.51      44        累涨修正：28.21     净值区间：63      79      88      88      91      38
        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：2.71      累涨：19.27     7.25      4.94      7.08      10日：4.00      1.36      1.36      0.62      45        累涨修正：27.35     净值区间：59      78      87      87      90      39
        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：6.29      累涨：19.24     7.04      4.65      7.55      10日：4.05      1.30      1.30      0.64      46        累涨修正：27.19     净值区间：59      77      86      86      90      40
        KEJI_NEW_ENERGY.put("560580", "科技-新能源           ");//电力ETF南方           市值：0.58      累涨：18.95     7.75      3.61      7.59      10日：4.35      2.69      0.19      0.00      37        累涨修正：26.37     净值区间：70      87      89      89      91      41
        KEJI_NEW_ENERGY.put("561170", "科技-新能源           ");//绿色电力ETF           市值：1.39      累涨：18.83     7.61      3.65      7.57      10日：4.66      2.77                -0.18     36        累涨修正：26.26     净值区间：43      76      80      80      84      42
        KEJI_NEW_ENERGY.put("562960", "科技-新能源           ");//绿色电力ETF易方达     市值：0.83      累涨：19.14     8.24      3.75      7.15      10日：4.30      2.60                0.09      39        累涨修正：26.04     净值区间：45      77      81      81      85      43
        KEJI_NEW_ENERGY.put("159625", "科技-新能源           ");//绿色电力ETF           市值：3.03      累涨：18.99     7.79      4.30      6.90      10日：4.09      2.51      0.17      0.09      41        累涨修正：25.93     净值区间：54      77      82      82      85      44
        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.10      累涨：19.09     7.17      4.78      7.14      10日：3.66      1.04      1.04      0.26      50        累涨修正：25.87     净值区间：61      76      86      86      90      45
        KEJI_NEW_ENERGY.put("561700", "科技-新能源           ");//电力ETF基金           市值：1.45      累涨：18.10     7.46      3.42      7.22      10日：4.47      2.70                0.29      40        累涨修正：25.27     净值区间：19      51      55      55      60      46
        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.34      累涨：18.16     7.27      3.56      7.33      10日：4.30      2.60                0.27      42        累涨修正：25.06     净值区间：55      81      83      83      86      47
        KEJI_NEW_ENERGY.put("561560", "科技-新能源           ");//电力ETF               市值：5.51      累涨：17.96     7.27      3.76      6.93      10日：4.29      2.76                0.17      43        累涨修正：25.01     净值区间：61      83      86      86      89      48
        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：0.89      累涨：18.15     7.48      4.00      6.67      10日：3.98      2.45                0.19      47        累涨修正：24.58     净值区间：84      93      94      44      48      49
        KEJI_NEW_ENERGY.put("159611", "科技-新能源           ");//电力ETF               市值：33.77     累涨：17.65     7.10      3.39      7.16      10日：4.17      2.73                0.30      48        累涨修正：24.55     净值区间：58      82      85      85      88      50
        KEJI_NEW_ENERGY.put("562350", "科技-新能源           ");//电力指数ETF           市值：0.42      累涨：17.24     7.34      3.31      6.59      10日：4.25      2.78                0.00      49        累涨修正：24.27     净值区间：42      76      80      80      84      51
        KEJI_NEW_ENERGY.put("159261", "科技-新能源           ");//创业板新能源ETF鹏华   市值：2.91      累涨：                                        10日：                    3.52      0.59      51        累涨修正：7.04      净值区间：87                                      52
    }

    public static Map<String, String> TOP_KEJI_NEW_CAR = new HashMap<>();//科技-汽车
    static {
        TOP_KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：7.41      累涨：40.33     19.12     9.78      11.43     10日：5.69      4.14      3.28      2.39      1         累涨修正：56.72     净值区间：97      98      98      75      81      1
    }
    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车
    static {
        KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：7.41      累涨：40.33     19.12     9.78      11.43     10日：5.69      4.14      3.28      2.39      1         累涨修正：56.72     净值区间：97      98      98      75      81      1
        KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：2.32      累涨：39.62     18.31     10.10     11.21     10日：5.32      3.91      2.92      3.27      2         累涨修正：54.69     净值区间：100     100     100     78      83      2
        KEJI_NEW_CAR.put("159565", "科技-汽车             ");//汽车零部件ETF         市值：0.94      累涨：36.54     18.49     6.03      12.02     10日：5.96      3.95      3.12      1.12      5         累涨修正：52.69     净值区间：99      99      99      96      90      3
        KEJI_NEW_CAR.put("562700", "科技-汽车             ");//汽车零部件ETF         市值：0.62      累涨：35.79     18.41     5.90      11.48     10日：5.71      4.18      3.37      1.21      7         累涨修正：52.42     净值区间：86      87      90      90      84      4
        KEJI_NEW_CAR.put("159306", "科技-汽车             ");//汽车零件ETF           市值：0.24      累涨：34.26     18.04     6.26      9.96      10日：4.43      3.43      2.70      1.23      12        累涨修正：47.52     净值区间：100     100     100     87      91      5
        KEJI_NEW_CAR.put("159305", "科技-汽车             ");//储能电池ETF广发       市值：0.40      累涨：36.84     14.83     7.39      14.62     10日：5.98      1.82      0.74      0.33      3         累涨修正：46.12     净值区间：66      85      92      92      95      6
        KEJI_NEW_CAR.put("159566", "科技-汽车             ");//储能电池ETF           市值：1.25      累涨：37.42     15.05     7.61      14.76     10日：5.87      1.25      0.44      0.36      4         累涨修正：45.42     净值区间：62      86      93      93      95      7
        KEJI_NEW_CAR.put("561160", "科技-汽车             ");//锂电池ETF             市值：6.02      累涨：35.74     14.02     8.32      13.40     10日：5.84      1.79      0.60      1.19      6         累涨修正：44.57     净值区间：100     100     100     100     100     8
        KEJI_NEW_CAR.put("515250", "科技-汽车             ");//智能汽车ETF           市值：7.51      累涨：34.14     15.87     7.46      10.81     10日：4.02      1.90      1.37      1.14      8         累涨修正：42.8      净值区间：100     100     100     97      77      9
        KEJI_NEW_CAR.put("159796", "科技-汽车             ");//电池50ETF             市值：10.36     累涨：33.92     13.28     7.59      13.05     10日：5.66      1.36      0.51      0.84      10        累涨修正：41.96     净值区间：88      93      97      97      98      10
        KEJI_NEW_CAR.put("159889", "科技-汽车             ");//智能汽车ETF           市值：0.48      累涨：34.57     16.70     7.44      10.43     10日：3.53      1.65      1.10      1.30      14        累涨修正：41.95     净值区间：97      97      98      92      73      11
        KEJI_NEW_CAR.put("561910", "科技-汽车             ");//电池ETF               市值：7.15      累涨：34.06     12.93     8.09      13.04     10日：5.67      1.40      0.40      1.39      9         累涨修正：41.93     净值区间：93      96      98      98      99      12
        KEJI_NEW_CAR.put("159888", "科技-汽车             ");//智能车ETF             市值：0.84      累涨：33.51     15.63     7.39      10.49     10日：3.70      1.70      1.32      1.31      15        累涨修正：41.55     净值区间：97      98      99      94      78      13
        KEJI_NEW_CAR.put("562880", "科技-汽车             ");//电池ETF嘉实           市值：3.03      累涨：34.84     14.15     7.69      13.00     10日：5.34      0.97      0.19      1.16      11        累涨修正：41.53     净值区间：100     100     100     100     100     14
        KEJI_NEW_CAR.put("516520", "科技-汽车             ");//智能驾驶ETF           市值：3.70      累涨：33.22     15.63     7.05      10.54     10日：3.73      1.62      1.33      1.13      21        累涨修正：41.23     净值区间：97      97      99      97      79      15
        KEJI_NEW_CAR.put("560000", "科技-汽车             ");//智慧电车ETF           市值：0.10      累涨：30.02     13.78     5.01      11.23     10日：5.64      2.42      1.51      0.30      20        累涨修正：41.1      净值区间：72      76      88      59      39      16
        KEJI_NEW_CAR.put("159795", "科技-汽车             ");//智能汽车ETF基金       市值：0.42      累涨：32.72     15.65     7.50      9.57      10日：3.46      1.67      1.22      1.43      19        累涨修正：40.29     净值区间：100     100     100     97      80      17
        KEJI_NEW_CAR.put("159767", "科技-汽车             ");//电池龙头ETF           市值：1.16      累涨：35.37     16.39     7.10      11.88     10日：3.87      0.70                1.39      17        累涨修正：39.94     净值区间：93      94      90      87      91      18
        KEJI_NEW_CAR.put("159755", "科技-汽车             ");//电池ETF               市值：37.51     累涨：34.75     15.46     7.87      11.42     10日：3.87      0.42      0.14      1.70      16        累涨修正：39.32     净值区间：95      96      98      98      99      19
        KEJI_NEW_CAR.put("516660", "科技-汽车             ");//新能源车ETF基金       市值：3.10      累涨：31.66     14.51     6.54      10.61     10日：4.04      1.17      0.65      1.68      22        累涨修正：38.17     净值区间：100     100     100     97      95      20
        KEJI_NEW_CAR.put("515700", "科技-汽车             ");//新能车ETF             市值：22.70     累涨：31.58     14.15     6.70      10.73     10日：4.35      0.96      0.48      1.67      23        累涨修正：37.85     净值区间：100     100     100     100     98      21
        KEJI_NEW_CAR.put("159757", "科技-汽车             ");//电池30ETF             市值：2.98      累涨：33.50     15.04     7.37      11.09     10日：3.82      0.52                1.55      25        累涨修正：37.84     净值区间：94      95      98      98      99      22
        KEJI_NEW_CAR.put("516390", "科技-汽车             ");//新能源汽车ETF         市值：3.17      累涨：31.85     14.09     6.99      10.77     10日：4.00      0.88      0.44      1.32      26        累涨修正：37.61     净值区间：94      95      98      98      95      23
        KEJI_NEW_CAR.put("515030", "科技-汽车             ");//新能源车ETF           市值：43.14     累涨：31.41     14.39     6.75      10.27     10日：4.01      0.96      0.56      1.67      27        累涨修正：37.5      净值区间：100     100     100     100     96      24
        KEJI_NEW_CAR.put("159775", "科技-汽车             ");//新能源车电池ETF       市值：0.55      累涨：32.50     13.95     7.25      11.30     10日：4.10      0.68                1.53      24        累涨修正：37.28     净值区间：100     100     98      98      99      25
        KEJI_NEW_CAR.put("159806", "科技-汽车             ");//新能源车ETF           市值：9.73      累涨：31.07     14.41     6.42      10.24     10日：3.85      1.09      0.54      1.65      28        累涨修正：37.09     净值区间：100     100     98      98      95      26
        KEJI_NEW_CAR.put("159637", "科技-汽车             ");//新能源车龙头ETF       市值：8.08      累涨：31.18     14.02     6.49      10.67     10日：3.71      0.96      0.48      1.77      31        累涨修正：36.81     净值区间：100     100     100     100     96      27
        KEJI_NEW_CAR.put("159872", "科技-汽车             ");//智能网联汽车ETF       市值：0.46      累涨：31.07     15.60     6.62      8.85      10日：3.02      1.10      0.77      0.88      32        累涨修正：36.73     净值区间：100     100     100     88      90      28
        KEJI_NEW_CAR.put("159824", "科技-汽车             ");//新能车ETF             市值：1.62      累涨：30.49     13.74     6.38      10.37     10日：4.20      0.96      0.48      1.66      33        累涨修正：36.61     净值区间：100     100     100     98      96      29
        KEJI_NEW_CAR.put("562260", "科技-汽车             ");//汽车配件ETF           市值：0.11      累涨：32.00     7.97      18.04     5.99      10日：2.39      0.74      0.74      0.00      37        累涨修正：36.61     净值区间：9       4       3       35      56      30
        KEJI_NEW_CAR.put("159840", "科技-汽车             ");//锂电池ETF             市值：9.15      累涨：32.43     14.61     7.23      10.59     10日：3.57      0.35                1.59      29        累涨修正：36.35     净值区间：100     100     100     100     100     31
        KEJI_NEW_CAR.put("159720", "科技-汽车             ");//智能车ETF泰康         市值：0.54      累涨：29.37     13.61     6.50      9.26      10日：3.94      1.09      0.62      1.25      35        累涨修正：35.64     净值区间：94      95      98      66      70      32
        KEJI_NEW_CAR.put("516380", "科技-汽车             ");//智能电动车ETF         市值：0.90      累涨：29.50     13.79     6.38      9.33      10日：3.70      1.05      0.66      1.17      36        累涨修正：35.57     净值区间：90      92      96      67      79      33
        KEJI_NEW_CAR.put("516110", "科技-汽车             ");//汽车ETF               市值：3.90      累涨：27.54     13.03     7.76      6.75      10日：2.96      1.33      1.33      0.77      34        累涨修正：34.49     净值区间：97      97      98      44      52      34
        KEJI_NEW_CAR.put("516590", "科技-汽车             ");//智能汽车ETF易方达     市值：0.90      累涨：29.41     14.22     6.03      9.16      10日：3.37      0.63      0.42      1.46      39        累涨修正：34.25     净值区间：87      88      95      71      74      35
        KEJI_NEW_CAR.put("159512", "科技-汽车             ");//汽车ETF               市值：0.56      累涨：26.33     10.60     8.48      7.25      10日：3.46      1.30      1.30      1.71      30        累涨修正：33.69     净值区间：98      98      99      53      55      36
        KEJI_NEW_CAR.put("159210", "科技-汽车             ");//港股汽车ETF           市值：1.29      累涨：                              11.58     10日：5.52      3.76      2.83      2.68      18        累涨修正：26.52     净值区间：98      99      99                      37
        KEJI_NEW_CAR.put("159239", "科技-汽车             ");//港股通汽车ETF富国     市值：1.16      累涨：                              12.09     10日：5.80      3.53      2.31      3.06      13        累涨修正：26.04     净值区间：97      98      98                      38
        KEJI_NEW_CAR.put("159237", "科技-汽车             ");//港股汽车ETF基金       市值：1.24      累涨：                                        10日：          4.14      3.34      2.79      38        累涨修正：10.82     净值区间：100                                     39
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_TONG_XIN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_NEW_CAR);
    }

    public static Map<String, String> TOP_KEJI = new HashMap<>();

    static {
        TOP_KEJI.putAll(TOP_KEJI_HK);
        TOP_KEJI.putAll(TOP_KEJI_XIN_PIAN);
        TOP_KEJI.putAll(TOP_KEJI_TONG_XIN);
        TOP_KEJI.putAll(TOP_KEJI_RUAN_JIAN);
        TOP_KEJI.putAll(TOP_KEJI_GONG_YE);
        TOP_KEJI.putAll(TOP_KEJI_JUNGONG);
        TOP_KEJI.putAll(TOP_KEJI_NEW_ENERGY);
        TOP_KEJI.putAll(TOP_KEJI_NEW_CAR);
    }

    /**
     * 指数
     */
    public static Map<String, String> TOP_INDEX_CN_NOT = new HashMap<>();//指数-外盘
    static {
        TOP_INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：15.27     累涨：30.94     12.99     6.39      11.56     10日：5.40      3.27      2.10      -1.44     1         累涨修正：43.81     净值区间：2       8       62      62      80      1
    }
    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘
    static {
        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：15.27     累涨：30.94     12.99     6.39      11.56     10日：5.40      3.27      2.10      -1.44     1         累涨修正：43.81     净值区间：2       8       62      62      80      1
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：14.04     累涨：32.02     14.76     7.20      10.06     10日：4.93      2.64      1.95      -1.21     2         累涨修正：43.49     净值区间：3       5       55      55      78      2
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：8.53      累涨：24.05     8.65      5.03      10.37     10日：6.14      2.77      2.54      -1.66     3         累涨修正：38.04     净值区间：0       9       58      58      75      3
        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：15.66     累涨：29.92     16.35     4.36      9.21      10日：4.03      1.42      0.42      -0.42     4         累涨修正：36.21     净值区间：24      35      74      58      67      4
        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：5.20      累涨：25.75     11.45     5.35      8.95      10日：1.14      0.79      0.72      -0.65     5         累涨修正：29.12     净值区间：33      10      32      34      62      5
        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：13.49     累涨：23.96     9.49      5.05      9.42      10日：0.91      0.13      0.13      -0.47     6         累涨修正：25.26     净值区间：5       2       39      44      65      6
        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：14.80     累涨：24.06     9.18      5.81      9.07      10日：1.19                          -0.50     7         累涨修正：25.25     净值区间：14      6       36      42      65      7
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：11.78     累涨：23.25     8.78      5.31      9.16      10日：0.85      0.07      0.07      -0.54     8         累涨修正：24.31     净值区间：4       2       32      38      63      8
        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.57      累涨：21.97     8.14      4.58      9.25      10日：0.69                          -0.45     9         累涨修正：22.66     净值区间：11      5       38      42      63      9
        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：7.26      累涨：19.90     8.17      5.11      6.62      10日：0.40                          -0.20     11        累涨修正：20.3      净值区间：29      11      38      38      66      10
        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：4.71      累涨：18.91     10.99     3.46      4.46      10日：0.70      0.10      0.10      -0.50     10        累涨修正：19.91     净值区间：0       0       61      45      46      11
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：13.24     累涨：15.90     8.91      3.95      3.04      10日：0.50                          -0.20     13        累涨修正：16.4      净值区间：0       0       32      14      8       12
        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：10.21     累涨：13.31     7.18      2.23      3.90      10日：1.36      0.63                -0.42     12        累涨修正：15.3      净值区间：9       29      58      26      14      13
    }

    public static Map<String, String> TOP_INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股
    static {
        TOP_INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：109.95    累涨：41.15     16.92     9.84      14.39     10日：6.54      3.93      2.85      -0.70     1         累涨修正：57.32     净值区间：75      83      94      95      97      2
        TOP_INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：205.98    累涨：25.68     12.47     6.31      6.90      10日：3.04      1.66      1.28      -0.70     18        累涨修正：32.94     净值区间：46      44      88      91      96      19
    }
    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股
    static {
        INDEX_CN_NOT_USA.put("159502", "指数-外盘-美股        ");//标普生物科技ETF       市值：12.28     累涨：39.85     14.43     13.63     11.79     10日：9.41      6.48      2.81      -2.34     25        累涨修正：61.36     净值区间：17      53      64      74      80      1
        INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：109.95    累涨：41.15     16.92     9.84      14.39     10日：6.54      3.93      2.85      -0.70     1         累涨修正：57.32     净值区间：75      83      94      95      97      2
        INDEX_CN_NOT_USA.put("513290", "指数-外盘-美股        ");//纳指生物科技ETF       市值：12.21     累涨：33.36     12.32     10.71     10.33     10日：8.61      5.37      2.44      -1.97     37        累涨修正：52.22     净值区间：10      49      66      71      80      3
        INDEX_CN_NOT_USA.put("159941", "指数-外盘-美股        ");//纳指ETF               市值：267.76    累涨：31.23     15.43     7.96      7.84      10日：3.03      2.13      1.56      -0.56     3         累涨修正：39.51     净值区间：67      67      91      92      97      4
        INDEX_CN_NOT_USA.put("513390", "指数-外盘-美股        ");//纳指100ETF            市值：32.29     累涨：31.06     14.88     8.17      8.01      10日：3.30      2.03      1.37      0.00      2         累涨修正：39.13     净值区间：90      92      98      98      99      5
        INDEX_CN_NOT_USA.put("159501", "指数-外盘-美股        ");//纳指ETF嘉实           市值：69.13     累涨：30.86     14.78     8.46      7.62      10日：2.89      2.03      1.44      -0.52     4         累涨修正：38.66     净值区间：65      69      92      94      97      6
        INDEX_CN_NOT_USA.put("159632", "指数-外盘-美股        ");//纳斯达克ETF           市值：92.23     累涨：30.83     15.15     7.99      7.69      10日：2.98      1.95      1.41      -0.48     7         累涨修正：38.58     净值区间：62      65      91      92      97      7
        INDEX_CN_NOT_USA.put("159696", "指数-外盘-美股        ");//纳指ETF易方达         市值：28.02     累涨：30.78     14.72     8.48      7.58      10日：2.86      1.86      1.53      -0.46     10        累涨修正：38.56     净值区间：62      63      90      92      97      8
        INDEX_CN_NOT_USA.put("513100", "指数-外盘-美股        ");//纳指ETF               市值：155.26    累涨：30.03     14.68     7.72      7.63      10日：3.01      2.09      1.54      -0.49     6         累涨修正：38.21     净值区间：67      67      91      92      97      9
        INDEX_CN_NOT_USA.put("513870", "指数-外盘-美股        ");//纳指ETF富国           市值：14.82     累涨：30.24     14.64     8.07      7.53      10日：2.99      1.95      1.43      -0.51     9         累涨修正：38.04     净值区间：64      65      91      93      97      10
        INDEX_CN_NOT_USA.put("513300", "指数-外盘-美股        ");//纳斯达克ETF           市值：94.75     累涨：29.87     13.74     8.15      7.98      10日：3.01      2.07      1.53      -0.63     5         累涨修正：38.01     净值区间：61      63      90      92      97      11
        INDEX_CN_NOT_USA.put("159513", "指数-外盘-美股        ");//纳斯达克100指数ETF    市值：59.29     累涨：30.07     14.41     7.96      7.70      10日：3.01      1.98      1.47      -0.65     8         累涨修正：38        净值区间：65      67      91      93      97      12
        INDEX_CN_NOT_USA.put("513110", "指数-外盘-美股        ");//纳斯达克100ETF        市值：34.35     累涨：30.35     14.54     8.40      7.41      10日：2.78      1.87      1.44      -0.58     14        累涨修正：37.88     净值区间：61      63      90      92      97      13
        INDEX_CN_NOT_USA.put("159659", "指数-外盘-美股        ");//纳斯达克100ETF        市值：50.31     累涨：30.26     14.20     8.35      7.71      10日：2.80      1.83      1.32      -0.45     12        累涨修正：37.53     净值区间：65      68      92      94      98      14
        INDEX_CN_NOT_USA.put("159660", "指数-外盘-美股        ");//纳指100ETF            市值：27.34     累涨：29.14     13.28     8.15      7.71      10日：2.94      1.92      1.47      -0.50     11        累涨修正：36.94     净值区间：68      70      92      94      97      15
        INDEX_CN_NOT_USA.put("159577", "指数-外盘-美股        ");//美国50ETF             市值：7.72      累涨：29.04     13.32     8.25      7.47      10日：2.86      1.93      1.39      -0.53     13        累涨修正：36.61     净值区间：56      64      90      93      97      16
        INDEX_CN_NOT_USA.put("513850", "指数-外盘-美股        ");//美国50ETF             市值：16.09     累涨：28.50     13.12     7.86      7.52      10日：2.86      1.88      1.25      -0.34     17        累涨修正：35.74     净值区间：65      73      92      94      97      17
        INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：8.45      累涨：27.77     13.25     4.50      10.02     10日：2.16      1.90      1.90      -1.03     16        累涨修正：35.63     净值区间：29      29      39      39      53      18
        INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：205.98    累涨：25.68     12.47     6.31      6.90      10日：3.04      1.66      1.28      -0.70     18        累涨修正：32.94     净值区间：46      44      88      91      96      19
        INDEX_CN_NOT_USA.put("159655", "指数-外盘-美股        ");//标普ETF               市值：31.16     累涨：25.51     12.18     6.86      6.47      10日：2.66      1.61      1.36      -0.86     21        累涨修正：32.5      净值区间：35      35      85      89      95      20
        INDEX_CN_NOT_USA.put("513650", "指数-外盘-美股        ");//标普500ETF南方        市值：34.79     累涨：25.37     12.23     6.60      6.54      10日：2.62      1.49      1.18      -0.80     22        累涨修正：31.84     净值区间：40      40      86      89      95      21
        INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：7.28      累涨：28.90     10.68     11.19     7.03      10日：1.35      0.11      0.11      -0.87     19        累涨修正：30.58     净值区间：7       5       19      43      57      22
        INDEX_CN_NOT_USA.put("513400", "指数-外盘-美股        ");//道琼斯ETF             市值：14.75     累涨：22.51     9.76      4.74      8.01      10日：3.59      1.57      1.31      -1.13     15        累涨修正：30.29     净值区间：13      10      75      76      88      23
        INDEX_CN_NOT_USA.put("562060", "指数-外盘-美股        ");//标普红利ETF           市值：16.10     累涨：18.63     5.38      7.13      6.12      10日：3.06      1.35      0.34      -0.43     20        累涨修正：23.72     净值区间：7       37      61      73      81      24
    }

    public static Map<String, String> TOP_INDEX_CN_1000 = new HashMap<>();

    static {
        TOP_INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：1.38      累涨：55.44     24.20     17.55     13.69     10日：9.92      3.15      2.14      2.12      1         累涨修正：72.79     净值区间：98      99      99      100     100     1
    }

    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘

    static {
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：1.38      累涨：55.44     24.20     17.55     13.69     10日：9.92      3.15      2.14      2.12      1         累涨修正：72.79     净值区间：98      99      99      100     100     1
        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.14      累涨：44.59     19.96     12.45     12.18     10日：7.83      2.39      2.05      1.56      2         累涨修正：58.91     净值区间：66      77      85      89      94      2
        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：2.10      累涨：44.75     21.03     12.41     11.31     10日：7.19      1.71      1.50      1.93      4         累涨修正：56.65     净值区间：100     100     100     100     100     3
        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.58      累涨：40.96     17.35     12.47     11.14     10日：7.51      2.32      1.76      1.51      3         累涨修正：54.31     净值区间：97      98      99      99      100     4
        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.46      累涨：44.04     22.04     10.20     11.80     10日：6.67      1.21      1.12      1.67      9         累涨修正：54.16     净值区间：100     100     100     100     100     5
        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：5.40      累涨：43.62     21.06     12.36     10.20     10日：6.69      1.29      1.03      1.46      7         累涨修正：53.66     净值区间：97      98      99      99      100     6
        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.47      累涨：43.41     21.75     11.27     10.39     10日：7.14      1.12      0.97      1.42      10        累涨修正：53.61     净值区间：93      95      98      98      99      7
        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.19      累涨：43.92     22.31     11.55     10.06     10日：6.70      1.23      0.74      1.39      8         累涨修正：53.33     净值区间：64      77      88      88      94      8
        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：19.32     累涨：42.35     20.34     11.61     10.40     10日：6.57      1.48      1.13      1.65      6         累涨修正：52.66     净值区间：100     100     100     100     100     9
        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.20      累涨：44.69     22.19     11.89     10.61     10日：6.23      0.55      0.55      1.03      24        累涨修正：52.57     净值区间：100     100     100     100     100     10
        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.56      累涨：40.51     17.93     11.44     11.14     10日：7.53      1.43      1.35      1.73      5         累涨修正：52.17     净值区间：97      98      99      99      100     11
        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.10      累涨：42.32     22.00     9.65      10.67     10日：7.32      0.86      0.34      0.95      14        累涨修正：51.18     净值区间：59      75      85      87      93      12
        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.53      累涨：39.33     19.99     10.32     9.02      10日：5.96      1.25      1.08      1.33      15        累涨修正：48.7      净值区间：100     100     100     70      82      13
        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF嘉实       市值：0.17      累涨：39.13     20.07     10.23     8.83      10日：5.60      1.08      0.83      1.49      17        累涨修正：47.47     净值区间：97      98      99      99      100     14
        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.14      累涨：37.15     17.35     10.77     9.03      10日：5.80      1.45      1.14      1.66      16        累涨修正：46.68     净值区间：95      98      98      99      99      15
        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：4.55      累涨：36.81     18.30     8.63      9.88      10日：6.75      1.10      0.94      1.33      13        累涨修正：46.54     净值区间：92      96      98      98      99      16
        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.42      累涨：35.75     16.68     8.50      10.57     10日：7.26      1.15      0.74      1.39      11        累涨修正：45.64     净值区间：94      97      98      99      99      17
        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.86      累涨：36.30     17.39     9.77      9.14      10日：6.42      0.83      0.83      1.65      20        累涨修正：45.21     净值区间：20      31      48      51      62      18
        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.12      累涨：35.55     17.43     8.64      9.48      10日：6.25      1.38      0.95      1.21      12        累涨修正：45.08     净值区间：97      98      99      99      99      19
        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：8.06      累涨：35.11     16.50     9.71      8.90      10日：6.41      0.91      0.82      1.54      19        累涨修正：44.07     净值区间：100     100     100     100     100     20
        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.33      累涨：33.11     16.20     7.80      9.11      10日：6.09      0.99      0.81      1.36      21        累涨修正：41.81     净值区间：96      98      99      99      99      21
        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.08      累涨：33.54     16.16     8.01      9.37      10日：6.03      0.76      0.59      1.68      30        累涨修正：41.51     净值区间：100     100     100     100     100     22
        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.44      累涨：31.92     16.38     8.09      7.45      10日：6.38      1.13      0.94      1.50      22        累涨修正：41.31     净值区间：96      97      98      99      99      23
        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.83      累涨：28.40     12.36     6.96      9.08      10日：6.89      2.00      2.00      1.55      18        累涨修正：41.29     净值区间：81      89      92      46      62      24
        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.29      累涨：33.78     19.16     6.95      7.67      10日：5.23      0.77      0.48      1.84      35        累涨修正：40.74     净值区间：96      97      99      99      99      25
        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.17      累涨：32.28     15.34     7.81      9.13      10日：5.91      0.99      0.63      1.08      23        累涨修正：40.44     净值区间：96      98      99      99      99      26
        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：117.02    累涨：31.55     14.84     8.63      8.08      10日：5.98      0.86      0.74      1.35      27        累涨修正：39.87     净值区间：98      99      99      99      100     27
        INDEX_CN_1000.put("159521", "指数-中小盘           ");//国证2000ETF指数基金   市值：0.16      累涨：32.72     16.46     8.36      7.90      10日：5.10      0.77      0.58      0.96      37        累涨修正：39.75     净值区间：93      97      99      99      99      28
        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：307.26    累涨：31.70     14.60     8.77      8.33      10日：5.95      0.85      0.58      1.39      26        累涨修正：39.66     净值区间：96      98      99      99      99      29
        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：648.60    累涨：31.52     14.53     8.70      8.29      10日：5.84      0.82      0.55      1.41      29        累涨修正：39.28     净值区间：98      99      99      99      100     30
        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.23      累涨：31.88     14.47     9.22      8.19      10日：5.40      0.54      0.33      1.40      40        累涨修正：38.48     净值区间：96      97      98      99      99      31
        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：17.38     累涨：31.00     14.58     8.54      7.88      10日：5.52      0.69      0.50      1.30      38        累涨修正：38.21     净值区间：94      97      98      98      99      32
        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：0.94      累涨：30.28     14.54     7.90      7.84      10日：5.36      0.77      0.67      1.34      36        累涨修正：37.75     净值区间：95      97      98      99      99      33
        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.09      累涨：31.59     14.62     9.81      7.16      10日：4.57      0.35      0.35      1.38      54        累涨修正：37.21     净值区间：92      95      98      98      99      34
        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：0.77      累涨：29.86     13.30     8.57      7.99      10日：5.54      0.70      0.43      1.46      34        累涨修正：36.96     净值区间：98      99      99      99      100     35
        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.37      累涨：29.93     16.29     7.27      6.37      10日：4.57      1.01      0.64      1.10      45        累涨修正：36.79     净值区间：94      96      97      97      98      36
        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：3.99      累涨：26.79     11.25     6.74      8.80      10日：5.49      1.89      1.31      1.40      25        累涨修正：36.79     净值区间：86      92      95      95      97      37
        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.41      累涨：28.50     14.14     6.58      7.78      10日：4.95      0.88      0.70      1.05      44        累涨修正：35.73     净值区间：100     100     100     100     100     38
        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.52      累涨：26.03     11.49     6.67      7.87      10日：5.68      1.46      0.73      1.28      28        累涨修正：34.63     净值区间：100     100     100     100     100     39
        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.33      累涨：27.63     11.47     6.48      9.68      10日：5.04      1.03      0.41      0.93      32        累涨修正：34.52     净值区间：71      88      81      61      71      40
        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.68      累涨：24.83     10.99     6.81      7.03      10日：5.37      1.38      1.30      0.61      33        累涨修正：34.18     净值区间：96      98      99      99      99      41
        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.25      累涨：24.54     10.71     6.00      7.83      10日：6.17      1.82      0.79      1.47      31        累涨修正：34.11     净值区间：96      98      98      99      99      42
        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.59      累涨：26.37     11.54     7.31      7.52      10日：5.12      0.86      0.54      1.30      39        累涨修正：33.43     净值区间：91      97      97      98      98      43
        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.81      累涨：24.69     10.25     6.74      7.70      10日：5.27      1.07      0.86      1.20      41        累涨修正：32.75     净值区间：89      95      97      61      69      44
        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.22      累涨：25.61     12.35     6.75      6.51      10日：4.72      1.30      0.43      0.75      42        累涨修正：32.49     净值区间：88      90      93      76      78      45
        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.20      累涨：24.84     11.38     7.15      6.31      10日：4.75      1.22      0.71      1.22      46        累涨修正：32.23     净值区间：100     100     100     100     100     46
        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：28.35     累涨：24.51     10.93     6.31      7.27      10日：5.57      0.91      0.54      1.37      43        累涨修正：32.07     净值区间：93      97      98      98      99      47
        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.09      累涨：24.14     10.97     6.58      6.59      10日：5.17      1.27      0.74      1.17      48        累涨修正：32.06     净值区间：83      91      94      96      97      48
        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：20.78     累涨：24.60     11.29     6.08      7.23      10日：5.35      0.80      0.60      1.31      50        累涨修正：31.95     净值区间：94      97      98      99      99      49
        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：7.20      累涨：24.81     10.23     6.77      7.81      10日：5.35      0.82      0.41      1.54      49        累涨修正：31.8      净值区间：89      95      97      98      98      50
        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.27      累涨：24.98     11.67     6.58      6.73      10日：4.72      0.87      0.60      1.28      52        累涨修正：31.77     净值区间：88      96      97      88      92      51
        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：3.30      累涨：21.32     8.09      5.84      7.39      10日：5.42      1.81      1.52      -0.09     47        累涨修正：31.59     净值区间：89      94      96      96      98      52
        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：104.73    累涨：24.74     10.53     6.87      7.34      10日：5.29      0.67      0.42      1.35      59        累涨修正：31.54     净值区间：94      97      98      98      99      53
        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：0.95      累涨：24.13     10.64     6.37      7.12      10日：5.24      0.85      0.64      1.39      53        累涨修正：31.5      净值区间：95      97      98      98      99      54
        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.75      累涨：25.79     11.86     6.75      7.18      10日：3.98      1.11      0.30      0.30      51        累涨修正：31.48     净值区间：64      68      88      88      93      55
        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：9.83      累涨：24.72     11.02     6.66      7.04      10日：5.14      0.77      0.36      1.36      55        累涨修正：31.35     净值区间：94      97      98      98      99      56
        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1139.10   累涨：24.23     10.71     6.27      7.25      10日：5.48      0.72      0.40      1.34      56        累涨修正：31.23     净值区间：93      97      98      98      99      57
        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：5.56      累涨：24.08     11.19     5.99      6.90      10日：5.11      0.68      0.65      1.76      64        累涨修正：31.17     净值区间：96      98      99      99      99      58
        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：18.91     累涨：24.07     10.76     6.09      7.22      10日：5.33      0.76      0.38      1.50      58        累涨修正：30.92     净值区间：94      97      98      98      99      59
        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.88      累涨：25.38     12.13     7.53      5.72      10日：4.44      0.33      0.33      1.40      25        累涨修正：30.81     净值区间：100     100     100     100     100     60
        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：15.08     累涨：23.92     10.83     5.97      7.12      10日：5.22      0.69      0.46      1.29      63        累涨修正：30.75     净值区间：96      98      99      99      99      61
        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：139.63    累涨：24.00     10.64     6.19      7.17      10日：5.46      0.62      0.31      1.44      61        累涨修正：30.7      净值区间：95      98      99      99      99      62
        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.12      累涨：22.56     10.86     6.07      5.63      10日：4.28      1.79      0.94      1.13      62        累涨修正：30.51     净值区间：89      95      96      89      93      63
        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：6.72      累涨：23.80     10.71     6.04      7.05      10日：5.17      0.63      0.32      1.36      65        累涨修正：30.24     净值区间：92      96      97      97      98      64
        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：2.87      累涨：22.93     9.62      6.23      7.08      10日：5.17      0.86      0.53      1.25      57        累涨修正：30.02     净值区间：93      97      98      98      99      65
        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.83      累涨：24.09     10.97     6.11      7.01      10日：4.78      0.54      0.27      1.26      67        累涨修正：29.95     净值区间：89      98      98      98      99      66
        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.81      累涨：23.40     10.62     5.96      6.82      10日：4.97      0.69      0.41      1.23      70        累涨修正：29.88     净值区间：90      96      97      97      98      67
        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.50      累涨：22.13     9.07      6.30      6.76      10日：4.90      0.59      0.48      1.43      72        累涨修正：28.58     净值区间：95      98      98      99      99      68
        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：2.95      累涨：24.15     10.87     7.15      6.13      10日：3.16      0.44      0.22      0.67      81        累涨修正：28.19     净值区间：91      93      98      98      99      69
        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.52      累涨：20.00     7.91      6.16      5.93      10日：4.63      2.03      0.76      0.25      60        累涨修正：28.18     净值区间：86      94      96      96      97      70
        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.46      累涨：19.44     7.33      3.94      8.17      10日：6.41      0.77      0.68      0.59      68        累涨修正：27.98     净值区间：84      67      78      84      88      71
        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.51      累涨：22.22     11.17     4.84      6.21      10日：4.75      0.40      0.27      1.42      84        累涨修正：27.91     净值区间：100     89      91      58      72      72
        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.31      累涨：18.83     6.73      4.71      7.39      10日：4.55      2.18      1.04      0.24      66        累涨修正：27.64     净值区间：89      95      95      75      80      73
        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.77      累涨：21.13     9.47      5.63      6.03      10日：4.90      0.80      0.40      1.20      69        累涨修正：27.63     净值区间：90      96      97      97      98      74
        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.60      累涨：23.73     10.98     7.27      5.48      10日：3.07      0.45                0.79      88        累涨修正：27.25     净值区间：94      94      97      98      99      75
        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500ETF嘉实           市值：147.26    累涨：19.87     7.99      5.49      6.39      10日：4.62      0.81      0.81      0.91      71        累涨修正：26.92     净值区间：71      82      88      89      93      76
        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.14      累涨：18.88     7.53      5.57      5.78      10日：4.15      2.21      0.80      0.79      75        累涨修正：26.84     净值区间：100     67      70      70      77      77
        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：24.35     累涨：19.18     7.86      5.09      6.23      10日：4.53      0.97      0.87      1.26      73        累涨修正：26.42     净值区间：90      94      96      96      98      78
        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：152.34    累涨：19.03     7.67      5.12      6.24      10日：4.63      0.93      0.83      1.03      74        累涨修正：26.25     净值区间：85      90      94      94      96      79
        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：173.71    累涨：18.64     7.74      4.89      6.01      10日：4.72      1.03      0.93      1.14      76        累涨修正：26.25     净值区间：84      90      94      94      97      80
        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：3.28      累涨：18.71     7.89      4.65      6.17      10日：4.51      0.95      0.95      0.85      79        累涨修正：26.07     净值区间：81      92      93      93      96      81
        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：2.73      累涨：19.28     8.02      4.85      6.41      10日：4.29      0.89      0.79      0.88      77        累涨修正：26.04     净值区间：80      94      94      94      96      82
        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：49.70     累涨：18.98     7.57      5.19      6.22      10日：4.32      0.97      0.87      0.96      78        累涨修正：26.01     净值区间：90      95      96      97      98      83
        INDEX_CN_1000.put("563360", "指数-中小盘           ");//A500ETF华泰柏瑞       市值：199.07    累涨：19.12     7.95      5.22      5.95      10日：4.45      0.78      0.78      1.17      82        累涨修正：25.91     净值区间：85      90      94      94      97      84
        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：52.02     累涨：18.95     7.71      5.14      6.10      10日：4.46      0.80      0.80      1.10      85        累涨修正：25.81     净值区间：85      90      94      94      97      85
        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：3.84      累涨：22.66     11.20     6.07      5.39      10日：2.98      0.11                0.80      101       累涨修正：25.75     净值区间：82      77      91      93      97      86
        INDEX_CN_1000.put("159215", "指数-中小盘           ");//中证A500ETF指数基金   市值：18.63     累涨：18.54     7.84      4.63      6.07      10日：4.47      0.98      0.88      0.98      80        累涨修正：25.75     净值区间：84      91      94      94      97      87
        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.63      累涨：18.72     7.52      5.29      5.91      10日：4.36      0.90      0.75      0.82      83        累涨修正：25.48     净值区间：78      79      86      87      92      88
        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：83.52     累涨：18.97     7.75      5.21      6.01      10日：4.19      0.82      0.72      1.03      86        累涨修正：25.42     净值区间：80      87      92      92      95      89
        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：164.46    累涨：18.59     7.87      5.04      5.68      10日：4.38      0.78      0.78      0.88      90        累涨修正：25.31     净值区间：80      88      92      93      95      90
        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：13.24     累涨：18.54     8.12      4.63      5.79      10日：4.30      0.87      0.77      1.05      87        累涨修正：25.25     净值区间：85      94      83      77      81      91
        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：0.99      累涨：19.14     8.20      4.90      6.04      10日：4.07      0.67      0.67      0.86      99        累涨修正：25.22     净值区间：83      91      93      93      96      92
        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：9.26      累涨：18.99     7.97      5.05      5.97      10日：4.12      0.66      0.66      1.13      100       累涨修正：25.09     净值区间：87      92      93      93      95      93
        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：140.10    累涨：18.73     7.83      4.89      6.01      10日：4.22      0.71      0.71      1.11      95        累涨修正：25.08     净值区间：85      91      94      94      97      94
        INDEX_CN_1000.put("563650", "指数-中小盘           ");//中证A500龙头ETF       市值：2.06      累涨：18.74     8.19      4.65      5.90      10日：3.98      0.78      0.78      0.88      94        累涨修正：25.06     净值区间：75      85      90      90      94      95
        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：130.28    累涨：18.53     7.66      5.20      5.67      10日：4.34      0.70      0.70      1.09      102       累涨修正：24.97     净值区间：85      91      94      94      97      96
        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：28.57     累涨：18.44     7.79      5.11      5.54      10日：4.34      0.78      0.68      0.97      92        累涨修正：24.92     净值区间：84      91      94      94      97      97
        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：2.03      累涨：16.43     6.11      4.59      5.73      10日：3.61      2.37      1.22      0.00      91        累涨修正：24.85     净值区间：95      97      97      98      99      98
        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：34.66     累涨：18.35     7.33      5.12      5.90      10日：4.39      0.69      0.69      0.98      105       累涨修正：24.81     净值区间：79      88      92      92      96      99
        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：23.01     累涨：18.40     7.96      4.94      5.50      10日：3.99      0.79      0.79      0.98      103       累涨修正：24.76     净值区间：80      88      92      92      96      100
        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：43.26     累涨：18.81     8.15      5.30      5.36      10日：3.83      0.70      0.70      0.99      107       累涨修正：24.74     净值区间：84      89      93      93      96      101
        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：112.99    累涨：18.47     7.79      5.19      5.49      10日：4.14      0.71      0.71      1.02      106       累涨修正：24.74     净值区间：75      84      90      90      94      102
        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：34.52     累涨：18.32     7.73      4.82      5.77      10日：4.07      0.78      0.78      0.97      108       累涨修正：24.73     净值区间：80      88      93      93      96      103
        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：22.00     累涨：18.31     7.82      4.97      5.52      10日：4.00      0.79      0.79      0.88      104       累涨修正：24.68     净值区间：80      87      92      93      96      104
        INDEX_CN_1000.put("560530", "指数-中小盘           ");//XD中证A500ETF摩根     市值：71.96     累涨：17.89     7.42      4.95      5.52      10日：4.18      0.90      0.80      0.91      93        累涨修正：24.57     净值区间：45      64      77      77      86      105
        INDEX_CN_1000.put("563660", "指数-中小盘           ");//A500ETF银河           市值：2.55      累涨：18.67     7.72      4.99      5.96      10日：3.92      0.79      0.59      1.09      97        累涨修正：24.56     净值区间：89      94      96      96      98      106
        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：57.61     累涨：18.55     7.78      5.04      5.73      10日：4.05      0.71      0.61      1.02      109       累涨修正：24.53     净值区间：84      90      94      94      96      107
        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：12.96     累涨：18.46     7.80      4.80      5.86      10日：4.16      0.78      0.49      0.97      98        累涨修正：24.38     净值区间：80      89      93      93      96      108
        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：61.81     累涨：17.91     7.42      4.99      5.50      10日：4.00      0.73      0.73      0.93      112       累涨修正：24.1      净值区间：79      87      92      92      95      109
        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：8.95      累涨：17.80     7.25      4.74      5.81      10日：4.19      0.69      0.69      1.08      113       累涨修正：24.06     净值区间：89      94      96      96      98      110
        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：181.02    累涨：18.03     7.04      5.32      5.67      10日：4.08      0.62      0.62      1.13      111       累涨修正：23.97     净值区间：85      91      94      94      96      111
        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.59      累涨：18.04     7.39      5.17      5.48      10日：3.57      0.71      0.52      0.83      114       累涨修正：23.36     净值区间：96      99      99      99      99      112
        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.36      累涨：16.55     6.19      5.46      4.90      10日：3.59      1.56      0.69      0.69      89        累涨修正：23.08     净值区间：92      95      98      82      82      113
        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：16.24     6.47      4.96      4.81      10日：3.61      0.73      0.55      0.73      115       累涨修正：21.68     净值区间：28      41      56      56      69      114
        INDEX_CN_1000.put("159226", "指数-中小盘           ");//中证A500增强ETF       市值：0.99      累涨：                              5.98      10日：4.28      0.89      0.79      0.98      96        累涨修正：12.73     净值区间：83      89      93                      115
        INDEX_CN_1000.put("563550", "指数-中小盘           ");//A500增强ETF摩根       市值：2.45      累涨：                              4.81      10日：3.71      1.09      0.69      0.49      110       累涨修正：10.99     净值区间：84      91      94                      116
        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：383.61    累涨：                                        10日：                              1.39      116       累涨修正：0         净值区间：98      99      99      99      100     117
        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.27      累涨：                                        10日：                              1.30      117       累涨修正：0         净值区间：100     100     100     100     100     118
        INDEX_CN_1000.put("159249", "指数-中小盘           ");//A500增强ETF工银       市值：1.22      累涨：                                        10日：                    0.70      0.70                累涨修正：          净值区间：71                                      119
        INDEX_CN_1000.put("563680", "指数-中小盘           ");//800自由现金流ETF      市值：0.28      累涨：                                        10日：                              0.29                累涨修正：          净值区间：                                        120
        INDEX_CN_1000.put("563630", "指数-中小盘           ");//A500增强ETF           市值：1.05      累涨：                                        10日：          0.60      0.60      0.90                累涨修正：          净值区间：75                                      121
        INDEX_CN_1000.put("159240", "指数-中小盘           ");//中证A500增强ETF天弘   市值：0.31      累涨：                                        10日：3.76      0.98      0.98      1.08                累涨修正：          净值区间：88      93                              122
        INDEX_CN_1000.put("563990", "指数-中小盘           ");//800现金流ETF          市值：0.60      累涨：                                        10日：                              0.57                累涨修正：          净值区间：                                        123
        INDEX_CN_1000.put("516460", "指数-中小盘           ");//现金流ETF800          市值：0.14      累涨：                                        10日：                              0.19                累涨修正：          净值区间：                                        124
        INDEX_CN_1000.put("561090", "指数-中小盘           ");//中证A500增强ETF       市值：1.31      累涨：                                        10日：                    0.50      0.70                累涨修正：          净值区间：87                                      125
    }

    public static Map<String, String> TOP_INDEX_300 = new HashMap<>();//指数-创业板
    static {
        TOP_INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.92      累涨：42.63     15.68     11.41     15.54     10日：7.89      3.37      2.74      2.43      1         累涨修正：59.37     净值区间：95      96      98      98      99      1
    }
    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板
    static {
        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.92      累涨：42.63     15.68     11.41     15.54     10日：7.89      3.37      2.74      2.43      1         累涨修正：59.37     净值区间：95      96      98      98      99      1
        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.52      累涨：41.11     16.32     9.33      15.46     10日：8.12      3.37      2.31      2.08      2         累涨修正：57.22     净值区间：98      99      99      99      100     2
        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：251.14    累涨：40.87     15.31     9.71      15.85     10日：8.17      3.14      2.12      1.79      3         累涨修正：56.42     净值区间：96      97      99      99      99      3
        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.26      累涨：40.32     17.69     7.26      15.37     10日：8.41      3.20      2.23      1.62      12        累涨修正：56.39     净值区间：98      40      58      58      64      4
        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：5.84      累涨：40.04     14.76     10.50     14.78     10日：7.56      3.48      2.32      1.81      9         累涨修正：55.72     净值区间：91      94      97      97      98      5
        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：0.89      累涨：40.32     14.52     9.67      16.13     10日：8.11      3.23      1.94      1.72      6         累涨修正：55.54     净值区间：96      97      99      99      99      6
        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.98      累涨：39.79     15.16     8.75      15.88     10日：8.24      3.15      2.16      1.83      5         累涨修正：55.5      净值区间：98      99      99      99      100     7
        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：2.21      累涨：39.28     14.86     8.67      15.75     10日：8.33      3.31      2.20      1.71      4         累涨修正：55.32     净值区间：96      98      99      99      99      8
        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.25      累涨：39.62     14.27     9.68      15.67     10日：7.68      3.47      2.24      2.00      7         累涨修正：55.25     净值区间：96      98      99      99      99      9
        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：44.19     累涨：40.11     15.31     9.30      15.50     10日：7.78      3.03      2.09      1.74      11        累涨修正：55.1      净值区间：93      96      98      98      98      10
        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：3.27      累涨：40.08     15.26     9.14      15.68     10日：7.68      3.24      1.71      1.87      8         累涨修正：54.42     净值区间：96      97      99      99      99      11
        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：14.21     累涨：39.50     15.25     8.73      15.52     10日：7.98      3.19      1.85      1.93      10        累涨修正：54.37     净值区间：95      97      99      99      99      12
        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：104.22    累涨：35.93     13.13     7.95      14.85     10日：7.52      3.02      1.96      1.63      14        累涨修正：50.39     净值区间：93      95      98      98      98      13
        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：1.96      累涨：35.75     11.81     8.91      15.03     10日：7.36      3.11      2.02      1.06      2         累涨修正：50.26     净值区间：93      96      98      98      98      14
        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：41.87     累涨：39.37     15.52     9.57      14.28     10日：6.22      2.63      0.87      1.73      13        累涨修正：49.96     净值区间：94      96      98      98      99      15
        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：863.48    累涨：36.17     13.32     8.25      14.60     10日：6.90      2.63      1.61      1.68      15        累涨修正：48.92     净值区间：94      96      98      98      99      16
        INDEX_300.put("159957", "指数-创业板           ");//创业板ETF华夏         市值：17.56     累涨：35.38     12.86     8.12      14.40     10日：6.81      2.65      1.60      1.58      16        累涨修正：48.04     净值区间：95      97      98      98      99      17
        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：87.35     累涨：35.35     12.85     8.22      14.28     10日：6.84      2.59      1.58      1.73      20        累涨修正：47.94     净值区间：96      97      99      99      99      18
        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.19      累涨：35.63     13.11     8.39      14.13     10日：6.61      2.67      1.51      1.42      19        累涨修正：47.93     净值区间：98      99      99      99      100     19
        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：24.79     累涨：35.24     12.80     8.07      14.37     10日：6.76      2.63      1.64      1.55      21        累涨修正：47.91     净值区间：98      99      99      100     100     20
        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.26      累涨：35.43     13.26     7.97      14.20     10日：6.60      2.79      1.54      1.01      22        累涨修正：47.9      净值区间：100     100     100     100     100     21
        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.03      累涨：35.57     13.47     7.79      14.31     10日：6.69      2.63      1.43      1.53      23        累涨修正：47.75     净值区间：100     100     100     100     100     22
        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：4.93      累涨：35.07     13.10     7.71      14.26     10日：6.85      2.52      1.61      1.52      26        累涨修正：47.66     净值区间：96      98      99      99      99      23
        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.23      累涨：34.14     11.65     7.81      14.68     10日：7.16      3.04      1.57      1.31      17        累涨修正：47.48     净值区间：98      98      99      99      99      24
        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：46.57     累涨：35.11     12.95     8.05      14.11     10日：6.61      2.44      1.61      1.63      31        累涨修正：47.38     净值区间：96      97      99      99      99      25
        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.53      累涨：35.42     13.50     8.05      13.87     10日：6.46      2.41      1.43      1.56      28        累涨修正：47.15     净值区间：98      99      99      99      100     26
        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：15.57     累涨：34.22     12.72     7.87      13.63     10日：6.33      2.75      1.71      1.64      35        累涨修正：46.72     净值区间：98      98      99      99      99      27
        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.81      累涨：34.65     13.00     8.09      13.56     10日：6.45      2.26      1.58      1.56      33        累涨修正：46.52     净值区间：100     100     100     100     100     28
        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.16      累涨：38.74     15.03     11.65     12.06     10日：4.03      1.84      0.24      1.19      24        累涨修正：45.09     净值区间：100     100     100     100     100     29
        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.07      累涨：38.57     15.37     11.30     11.90     10日：3.87      1.76      0.24      1.10      25        累涨修正：44.68     净值区间：97      98      99      99      100     30
        INDEX_300.put("159368", "指数-创业板           ");//创业板新能源ETF华夏   市值：0.94      累涨：35.85     13.89     7.38      14.58     10日：6.45      1.87                0.62      3         累涨修正：44.17     净值区间：55      80      90      91      93      31
        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.54      累涨：38.12     14.59     11.64     11.89     10日：4.06      1.66      0.16      1.09      30        累涨修正：44.16     净值区间：94      96      98      99      80      32
        INDEX_300.put("159377", "指数-创业板           ");//创业板医药ETF国泰     市值：0.23      累涨：32.56     8.16      12.83     11.57     10日：5.38      3.85      1.07      1.32      44        累涨修正：43.93     净值区间：98      98      99      99      99      33
        INDEX_300.put("159836", "指数-创业板           ");//创业板300ETF天弘      市值：1.71      累涨：34.44     12.86     8.37      13.21     10日：5.39      1.96      1.03      1.59      36        累涨修正：43.85     净值区间：94      97      98      98      99      34
        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：15.15     累涨：28.87     9.40      6.81      12.66     10日：6.71      3.43      2.28      1.56      29        累涨修正：43.57     净值区间：100     100     100     100     100     35
        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.39      累涨：33.43     12.15     7.47      13.81     10日：6.02      1.86      1.09      1.63      40        累涨修正：43.49     净值区间：100     100     100     100     100     36
        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.26      累涨：36.36     16.18     10.06     10.12     10日：3.55      2.22      0.65      0.82      27        累涨修正：43.43     净值区间：97      98      99      99      99      37
        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.20      累涨：28.72     9.48      6.61      12.63     10日：6.62      3.27      2.28      1.49      32        累涨修正：43.17     净值区间：100     100     100     100     100     38
        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.13      累涨：34.29     14.00     8.25      12.04     10日：4.66      1.76      1.00      0.99      37        累涨修正：42.71     净值区间：97      98      99      99      99      39
        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.09      累涨：37.33     14.72     11.25     11.36     10日：3.72      1.53                1.44      34        累涨修正：42.58     净值区间：63      74      89      89      91      40
        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：23.60     累涨：28.22     9.82      6.47      11.93     10日：5.98      2.78      2.08      1.86      41        累涨修正：41.14     净值区间：96      98      98      99      99      41
        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.14      累涨：27.25     9.06      6.40      11.79     10日：6.26      3.18      2.11      1.73      39        累涨修正：40.91     净值区间：96      98      98      98      99      42
        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.42      累涨：34.09     13.82     8.44      11.83     10日：4.46      1.37      0.36      1.21      38        累涨修正：40.64     净值区间：100     100     100     100     100     43
        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.70      累涨：31.52     13.74     8.05      9.73      10日：3.13      1.29      0.46      0.82      43        累涨修正：36.86     净值区间：79      82      93      93      94      44
        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：0.93      累涨：27.38     11.11     5.47      10.80     10日：4.96      1.84      0.98      0.85      44        累涨修正：36.14     净值区间：88      94      97      97      98      45
        INDEX_300.put("159372", "指数-创业板           ");//创业板50ETF万家       市值：0.28      累涨：                              15.51     10日：8.14      2.99      1.90      1.51      18        累涨修正：30.44     净值区间：98      99      99                      46
        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：4.85      累涨：25.18     9.65      6.19      9.34      10日：4.06      1.05                0.21      45        累涨修正：30.29     净值区间：55      71      86      86      89      47
        INDEX_300.put("159205", "指数-创业板           ");//创业板ETF东财         市值：2.78      累涨：                              13.80     10日：6.61      2.35      1.50      1.57      42        累涨修正：25.76     净值区间：98      99      99                      48
        INDEX_300.put("159387", "指数-创业板           ");//创业板新能源ETF国泰   市值：0.27      累涨：                              13.66     10日：6.19      1.48      0.09      0.37      25        累涨修正：21.51     净值区间：61      84      92                      49
        INDEX_300.put("159261", "指数-创业板           ");//创业板新能源ETF鹏华   市值：2.50      累涨：                                        10日：          1.38      0.10      0.79      51        累涨修正：1.58      净值区间：92                                      50
    }

    public static Map<String, String> TOP_INDEX_688 = new HashMap<>();//指数-科创板
    static {
        TOP_INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.21      累涨：35.89     11.21     9.74      14.94     10日：5.92      3.43      1.70      2.00      1         累涨修正：48.64     净值区间：100     100     100     100     100     1
    }
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板
    static {
        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.21      累涨：35.89     11.21     9.74      14.94     10日：5.92      3.43      1.70      2.00      1         累涨修正：48.64     净值区间：100     100     100     100     100     1
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.45      累涨：36.92     12.73     10.48     13.71     10日：4.65      2.96      1.38      2.56      3         累涨修正：47.29     净值区间：97      98      99      99      99      2
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：1.30      累涨：36.61     11.97     10.84     13.80     10日：4.73      2.82      1.11      2.58      2         累涨修正：46.38     净值区间：100     100     100     100     100     3
        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：2.08      累涨：30.01     8.44      9.86      11.71     10日：6.05      3.94      2.24      1.96      10        累涨修正：44.48     净值区间：100     100     100     100     100     4
        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：22.79     累涨：29.12     9.09      6.83      13.20     10日：6.98      3.32      2.51      1.45      6         累涨修正：44.44     净值区间：98      98      45      47      50      5
        INDEX_688.put("588660", "指数-科创板           ");//科创创业50ETF基金     市值：2.97      累涨：29.68     9.70      7.16      12.82     10日：7.01      3.19      2.15      1.51      4         累涨修正：44.18     净值区间：98      99      99      99      99      6
        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.31      累涨：30.08     8.58      9.82      11.68     10日：6.22      3.92      1.89      2.04      9         累涨修正：44        净值区间：98      99      99      99      99      7
        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：3.31      累涨：29.82     8.84      9.46      11.52     10日：5.58      3.76      2.27      1.84      13        累涨修正：43.7      净值区间：99      99      99      99      99      8
        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：85.63     累涨：29.52     9.71      6.82      12.99     10日：6.68      3.21      2.13      2.09      5         累涨修正：43.67     净值区间：100     100     100     100     100     9
        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：15.15     累涨：28.87     9.40      6.81      12.66     10日：6.71      3.43      2.28      1.56      29        累涨修正：43.57     净值区间：100     100     100     100     100     10
        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：11.16     累涨：28.86     9.49      6.30      13.07     10日：6.90      3.14      2.26      1.70      8         累涨修正：43.42     净值区间：97      98      98      99      99      11
        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：41.90     累涨：29.30     9.44      7.15      12.71     10日：6.81      3.00      2.11      1.90      7         累涨修正：43.33     净值区间：100     100     100     100     100     12
        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.20      累涨：28.72     9.48      6.61      12.63     10日：6.62      3.27      2.28      1.70      32        累涨修正：43.17     净值区间：100     100     100     100     100     13
        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.51      累涨：29.17     8.56      7.84      12.77     10日：6.63      2.94      2.12      1.92      12        累涨修正：42.98     净值区间：100     100     100     100     100     14
        INDEX_688.put("588400", "指数-科创板           ");//科创创业ETF嘉实       市值：18.02     累涨：28.13     8.81      6.72      12.60     10日：6.75      3.15      2.27      1.71      16        累涨修正：42.57     净值区间：97      98      98      99      99      15
        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.59      累涨：28.97     8.86      7.60      12.51     10日：6.59      3.09      1.94      1.75      11        累涨修正：42.53     净值区间：97      98      99      99      99      16
        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：45.19     累涨：28.09     9.05      6.37      12.67     10日：6.80      3.18      2.11      1.72      14        累涨修正：42.29     净值区间：93      95      97      97      97      17
        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：17.31     累涨：27.94     9.18      6.22      12.54     10日：6.62      3.26      2.23      1.85      15        累涨修正：42.28     净值区间：100     100     100     100     100     18
        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.66      累涨：27.28     8.73      6.68      11.87     10日：6.50      3.04      2.23      1.41      25        累涨修正：41.28     净值区间：97      98      98      99      99      19
        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：23.64     累涨：28.22     9.82      6.47      11.93     10日：5.98      2.78      2.08      2.03      41        累涨修正：41.14     净值区间：100     100     100     100     100     20
        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.29      累涨：32.22     9.37      10.29     12.56     10日：4.24      2.25      1.19      2.01      19        累涨修正：41.09     净值区间：99      99      99      99      99      21
        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.14      累涨：27.25     9.06      6.40      11.79     10日：6.26      3.18      2.11      1.73      39        累涨修正：40.91     净值区间：96      98      98      99      99      22
        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：65.87     累涨：31.00     8.86      9.90      12.24     10日：4.76      2.37      1.28      1.84      17        累涨修正：40.69     净值区间：100     100     100     100     100     23
        INDEX_688.put("589300", "指数-科创板           ");//科创综指ETF嘉实       市值：1.11      累涨：26.18     7.14      7.42      11.62     10日：5.87      4.25      2.16      0.46      23        累涨修正：40.62     净值区间：100     100     100     100     100     24
        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：3.79      累涨：31.09     8.92      9.57      12.60     10日：4.74      2.16      1.27      2.03      20        累涨修正：40.53     净值区间：100     100     100     100     100     25
        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：3.81      累涨：30.93     9.37      9.37      12.19     10日：4.55      2.21      1.20      1.88      24        累涨修正：40.09     净值区间：98      98      99      99      99      26
        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：32.21     累涨：30.42     9.09      9.02      12.31     10日：4.68      2.38      1.18      1.75      18        累涨修正：39.84     净值区间：98      98      99      99      99      27
        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：10.00     累涨：30.23     8.73      9.18      12.32     10日：4.85      2.36      1.17      1.84      22        累涨修正：39.78     净值区间：100     100     100     100     100     28
        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：54.80     累涨：30.70     9.27      9.39      12.04     10日：4.56      2.27      1.08      1.84      21        累涨修正：39.69     净值区间：98      98      99      99      99      29
        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.11      累涨：30.55     9.03      9.51      12.01     10日：4.49      2.13      1.11      1.80      26        累涨修正：39.39     净值区间：98      98      99      99      99      30
        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：29.85     累涨：29.93     9.01      8.93      11.99     10日：4.48      2.23      1.10      1.90      27        累涨修正：38.84     净值区间：98      98      99      99      99      31
        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.59      累涨：29.80     9.43      9.81      10.56     10日：4.10      2.27      1.33      1.84      28        累涨修正：38.83     净值区间：100     100     100     100     100     32
        INDEX_688.put("589630", "指数-科创板           ");//科创综指ETF国泰       市值：10.74     累涨：25.37     7.22      7.32      10.83     10日：4.92      3.05      1.92      1.70      29        累涨修正：37.18     净值区间：100     100     100     100     100     33
        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：22.40     累涨：25.95     7.12      7.77      11.06     10日：4.36      2.37      1.23      1.42      31        累涨修正：35.14     净值区间：98      98      99      99      99      34
        INDEX_688.put("588910", "指数-科创板           ");//科创价值ETF           市值：4.92      累涨：27.64     8.81      7.11      11.72     10日：4.22      1.50      0.70      1.69      38        累涨修正：34.76     净值区间：93      95      98      98      98      35
        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：4.82      累涨：25.08     7.10      6.67      11.31     10日：4.44      2.36      1.22      1.52      35        累涨修正：34.32     净值区间：93      94      96      97      97      36
        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：10.94     累涨：24.43     6.89      6.34      11.20     10日：4.33      2.46      1.32      1.41      36        累涨修正：33.86     净值区间：98      98      99      99      99      37
        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：6.44      累涨：25.39     7.59      6.85      10.95     10日：4.21      2.14      1.01      1.61      37        累涨修正：33.76     净值区间：98      98      99      99      99      38
        INDEX_688.put("589600", "指数-科创板           ");//科创综指ETF富国       市值：13.71     累涨：25.09     7.44      6.46      11.19     10日：4.30      2.08      1.13      1.54      39        累涨修正：33.73     净值区间：98      98      99      99      99      39
        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：4.40      累涨：25.87     8.34      7.56      9.97      10日：3.57      2.13      1.00      1.50      42        累涨修正：33.57     净值区间：98      98      99      99      99      40
        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：17.50     累涨：25.36     7.90      6.77      10.69     10日：4.13      2.05      0.91      1.72      41        累涨修正：33.36     净值区间：100     100     100     100     100     41
        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：20.11     累涨：25.34     7.31      7.54      10.49     10日：4.04      2.06      0.92      1.62      43        累涨修正：33.28     净值区间：100     100     100     100     100     42
        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：7.50      累涨：25.00     7.06      7.26      10.68     10日：4.07      2.08      0.93      1.53      44        累涨修正：33.01     净值区间：97      98      99      99      99      43
        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：10.52     累涨：24.75     7.58      6.64      10.53     10日：3.90      2.04      1.01      1.51      52        累涨修正：32.71     净值区间：95      95      98      98      98      44
        INDEX_688.put("588170", "指数-科创板           ");//科创半导体ETF         市值：2.51      累涨：28.95     8.34      9.52      11.09     10日：2.85      0.88                0.20      19        累涨修正：32.68     净值区间：45      44      63      71      71      45
        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.49      累涨：27.89     9.17      7.81      10.91     10日：3.03      0.80      0.48      1.27      22        累涨修正：32.68     净值区间：93      94      98      98      98      46
        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：7.56      累涨：24.77     7.96      6.20      10.61     10日：3.93      2.06      0.92      1.42      51        累涨修正：32.6      净值区间：95      96      98      98      98      47
        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：5.97      累涨：24.39     7.18      6.66      10.55     10日：4.01      2.15      0.91      1.51      49        累涨修正：32.37     净值区间：98      98      99      99      99      48
        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：7.11      累涨：24.91     7.39      7.29      10.23     10日：3.69      2.03      0.80      1.61      50        累涨修正：32.23     净值区间：95      96      98      98      98      49
        INDEX_688.put("589060", "指数-科创板           ");//科创综指ETF东财       市值：1.44      累涨：24.33     6.89      7.51      9.93      10日：3.96      2.17      0.88      1.55      45        累涨修正：32.22     净值区间：100     100     100     100     100     50
        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：2.37      累涨：26.84     8.86      7.35      10.63     10日：2.66      0.94      0.63      1.72      26        累涨修正：31.7      净值区间：94      94      98      98      98      51
        INDEX_688.put("588850", "指数-科创板           ");//科创机械ETF           市值：0.12      累涨：                    6.72      12.26     10日：5.99      2.36      2.17      1.21      18        累涨修正：31.67     净值区间：80      86      90      90              52
        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：0.99      累涨：21.76     6.10      5.93      9.73      10日：4.27      2.51      1.15      0.86      47        累涨修正：30.84     净值区间：95      96      97      98      71      53
        INDEX_688.put("589980", "指数-科创板           ");//科创100ETF汇添富      市值：2.93      累涨：                    9.27      11.84     10日：4.63      2.50      1.24      1.70      30        累涨修正：30.72     净值区间：97      97      98      98              54
        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：2.43      累涨：23.11     5.86      6.84      10.41     10日：4.01      2.08      0.54      0.83      66        累涨修正：30.28     净值区间：81      81      85      85      52      55
        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：6.56      累涨：22.05     5.73      7.33      8.99      10日：3.83      2.43      0.77      0.86      46        累涨修正：29.85     净值区间：86      87      91      93      73      56
        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：1.09      累涨：21.08     4.71      5.73      10.64     10日：4.62      2.38      0.71      1.02      48        累涨修正：29.5      净值区间：85      87      93      93      70      57
        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.29      累涨：22.23     5.80      6.35      10.08     10日：3.87      2.09      0.54      0.69      68        累涨修正：29.27     净值区间：18      18      26      26      32      58
        INDEX_688.put("588770", "指数-科创板           ");//科创信息技术ETF摩根   市值：3.07      累涨：21.88     5.59      6.46      9.83      10日：3.63      2.13      0.53      0.74      69        累涨修正：28.7      净值区间：75      76      81      81      49      59
        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：1.83      累涨：19.56     5.39      4.85      9.32      10日：3.45      2.26      0.78      0.68      53        累涨修正：26.83     净值区间：16      16      22      22      22      60
        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：60.60     累涨：19.60     5.15      5.13      9.32      10日：3.36      1.92      0.48      0.78      57        累涨修正：25.84     净值区间：94      95      97      97      60      61
        INDEX_688.put("589700", "指数-科创板           ");//科创成长ETF南方       市值：0.32      累涨：                              11.42     10日：5.90      4.02      2.23      1.81      33        累涨修正：25.8      净值区间：98      98      99                      62
        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：32.08     累涨：19.44     5.06      5.21      9.17      10日：3.62      1.89      0.32      0.93      56        累涨修正：25.59     净值区间：89      90      94      94      58      63
        INDEX_688.put("588720", "指数-科创板           ");//科创50ETF中银         市值：3.51      累涨：19.27     4.92      5.35      9.00      10日：3.52      1.91      0.40      0.59      58        累涨修正：25.5      净值区间：86      90      95      86      49      64
        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：118.63    累涨：19.47     5.02      5.49      8.96      10日：3.27      1.78      0.49      0.68      60        累涨修正：25.5      净值区间：90      91      95      95      57      65
        INDEX_688.put("588840", "指数-科创板           ");//科创板50ETF基金       市值：1.84      累涨：19.55     5.31      4.90      9.34      10日：3.54      1.88      0.22      0.76      55        累涨修正：25.41     净值区间：92      93      92      92      56      66
        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：641.72    累涨：19.28     5.34      5.17      8.77      10日：3.17      1.78      0.49      0.68      62        累涨修正：25.21     净值区间：90      91      95      95      59      67
        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：47.06     累涨：19.08     5.00      5.24      8.84      10日：3.46      1.87      0.39      0.78      61        累涨修正：25.19     净值区间：90      91      95      95      57      68
        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：888.30    累涨：19.70     5.58      5.34      8.78      10日：3.21      1.65      0.29      0.76      59        累涨修正：25.14     净值区间：90      91      95      95      58      69
        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：2.84      累涨：18.81     5.14      5.00      8.67      10日：3.37      1.68      0.39      0.68      64        累涨修正：24.64     净值区间：89      91      95      95      46      70
        INDEX_688.put("588270", "指数-科创板           ");//科创200ETF易方达      市值：0.38      累涨：                              14.14     10日：4.94      2.74      1.31      2.50      32        累涨修正：24.44     净值区间：94      96      98                      71
        INDEX_688.put("588040", "指数-科创板           ");//科创50ETF指数         市值：0.31      累涨：17.23     5.07      4.62      7.54      10日：3.51      1.94      0.87      0.48      63        累涨修正：24.42     净值区间：93      94      96      96      20      72
        INDEX_688.put("589580", "指数-科创板           ");//科创综指ETF兴银       市值：0.23      累涨：                              12.24     10日：5.49      3.12      1.64      0.67      34        累涨修正：24.13     净值区间：100     100     100                     73
        INDEX_688.put("588670", "指数-科创板           ");//科创综指增强ETF       市值：1.05      累涨：                              10.33     10日：5.09      3.59      2.51      1.61      40        累涨修正：24.03     净值区间：98      99      99                      74
        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.33      累涨：18.25     5.23      4.95      8.07      10日：2.96      1.55      0.42      0.69      66        累涨修正：23.6      净值区间：90      91      95      95      57      75
        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.76      累涨：18.20     5.09      4.79      8.32      10日：2.90      1.59      0.43      0.57      68        累涨修正：23.55     净值区间：85      86      93      93      55      76
        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：3.07      累涨：17.14     7.40      4.33      5.41      10日：0.99      0.41      0.08      1.00      65        累涨修正：18.7      净值区间：100     66      83      84      88      77
        INDEX_688.put("588710", "指数-科创板           ");//科创半导体设备ETF     市值：0.61      累涨：                              11.89     10日：3.83      1.62                0.10      30        累涨修正：17.34     净值区间：34      42      62                      78
        INDEX_688.put("589180", "指数-科创板           ");//科创新材料ETF汇添富   市值：0.25      累涨：                              10.47     10日：2.78      0.86      0.57      1.53      52        累涨修正：15.25     净值区间：100     100     99                      79
        INDEX_688.put("588940", "指数-科创板           ");//科创50ETF富国         市值：2.17      累涨：                              8.92      10日：3.69      2.19      0.20      0.79      54        累涨修正：15.2      净值区间：90      90      94                      80
        INDEX_688.put("588520", "指数-科创板           ");//科创增强ETF           市值：1.04      累涨：                                        10日：          2.08      1.28      1.37      67        累涨修正：4.64      净值区间：100                                     81
    }

    public static Map<String, String> TOP_INDEX_CN_BIG = new HashMap<>();

    static {
        TOP_INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.66      累涨：20.72     8.58      6.26      5.88      10日：4.44      1.16      1.16      1.03      40        累涨修正：28.64     净值区间：61      76      83      83      90      37
    }

    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘

    static {
        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.14      累涨：37.15     17.35     10.77     9.03      10日：5.80      1.45      1.14      1.66      16        累涨修正：46.68     净值区间：95      98      98      99      99      1
        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：14.23     累涨：35.17     15.30     9.47      10.40     10日：7.39      0.46      0.46      1.38      18        累涨修正：43.94     净值区间：88      82      87      89      91      2
        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：2.34      累涨：35.27     15.40     9.51      10.36     10日：7.27      0.44      0.44      1.43      17        累涨修正：43.86     净值区间：94      88      88      90      92      3
        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：1.89      累涨：35.90     15.60     9.83      10.47     10日：6.76      0.33      0.33      1.55      20        累涨修正：43.65     净值区间：100     86      88      91      92      4
        INDEX_CN_BIG.put("159721", "指数-大盘             ");//深证100ETF永赢        市值：0.84      累涨：26.56     11.46     7.78      7.32      10日：5.34      1.67      1.67      1.28      3         累涨修正：36.91     净值区间：76      83      89      89      96      5
        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.76      累涨：23.68     8.08      5.80      9.80      10日：5.86      2.77      1.56      0.00      1         累涨修正：35.43     净值区间：76      84      90      92      95      6
        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.53      累涨：23.40     8.72      6.93      7.75      10日：5.83      2.02      2.02      0.14      2         累涨修正：35.29     净值区间：84      89      93      70      79      7
        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.11      累涨：23.96     9.93      6.60      7.43      10日：5.37      1.60      1.60      1.29      5         累涨修正：34.13     净值区间：25      34      46      46      65      8
        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：2.67      累涨：23.22     9.59      6.25      7.38      10日：5.88      1.65      1.65      1.29      8         累涨修正：34.05     净值区间：75      83      88      88      93      9
        INDEX_CN_BIG.put("159212", "指数-大盘             ");//深100ETF南方          市值：5.61      累涨：23.07     9.34      6.32      7.41      10日：5.68      1.68      1.68      1.21      7         累涨修正：33.79     净值区间：76      86      89      89      93      10
        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：64.96     累涨：23.09     9.00      6.75      7.34      10日：5.72      1.65      1.65      1.39      4         累涨修正：33.76     净值区间：82      87      91      91      95      11
        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.74      累涨：23.24     9.53      6.55      7.16      10日：5.46      1.74      1.65      1.30      6         累涨修正：33.74     净值区间：80      87      91      91      95      12
        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：2.02      累涨：24.58     10.10     6.79      7.69      10日：5.68      1.15      1.06      1.50      15        累涨修正：33.53     净值区间：88      93      96      96      97      13
        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：1.89      累涨：22.88     9.08      6.26      7.54      10日：5.61      1.62      1.62      1.28      9         累涨修正：33.35     净值区间：74      83      88      88      93      14
        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.41      累涨：22.97     9.41      6.32      7.24      10日：5.41      1.60      1.60      1.28      10        累涨修正：33.18     净值区间：77      88      89      89      94      15
        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：0.91      累涨：22.76     9.47      4.87      8.42      10日：6.41      1.31      1.31      0.65      21        累涨修正：33.1      净值区间：50      54      55      29      44      16
        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波ETF基金       市值：2.97      累涨：23.36     10.09     6.33      6.94      10日：4.13      2.67      1.45      -0.16     11        累涨修正：33.06     净值区间：84      90      93      96      97      17
        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：4.66      累涨：24.64     10.42     7.00      7.22      10日：5.41      1.03      0.95      1.27      18        累涨修正：32.98     净值区间：93      96      98      98      99      18
        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.50      累涨：22.37     8.85      6.14      7.38      10日：5.39      1.60      1.60      1.06      12        累涨修正：32.56     净值区间：75      83      88      88      92      19
        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.38      累涨：23.62     9.49      6.70      7.43      10日：5.47      1.13      1.06      1.34      17        累涨修正：32.34     净值区间：72      74      82      82      88      20
        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.65      累涨：24.94     13.23     5.46      6.25      10日：4.03      1.62      0.83      0.41      30        累涨修正：32.25     净值区间：100     100     100     57      78      21
        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：0.97      累涨：20.85     7.83      5.07      7.95      10日：5.02      3.03      1.67      -0.13     13        累涨修正：32.24     净值区间：90      93      95      96      98      22
        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.16      累涨：22.47     9.00      6.43      7.04      10日：5.18      1.47      1.47      1.29      14        累涨修正：32.06     净值区间：92      96      98      54      60      23
        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：8.46      累涨：20.51     7.39      6.01      7.11      10日：4.20      2.77      1.50      -0.16     16        累涨修正：30.48     净值区间：72      81      86      91      94      24
        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.72      累涨：21.02     7.38      5.94      7.70      10日：3.86      2.57      1.44      -0.24     23        累涨修正：30.33     净值区间：78      88      93      94      96      25
        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：198.11    累涨：20.60     7.49      6.29      6.82      10日：4.01      2.67      1.49      -0.25     19        累涨修正：30.26     净值区间：77      85      89      93      96      26
        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.38      累涨：22.21     9.98      6.46      5.77      10日：3.42      2.32      1.15      0.12      39        累涨修正：30.25     净值区间：77      83      89      29      49      27
        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：0.57      累涨：20.53     7.08      5.10      8.35      10日：4.71      2.38      1.14      0.16      20        累涨修正：29.9      净值区间：81      88      93      94      97      28
        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.33      累涨：21.75     7.95      7.09      6.71      10日：4.96      1.30      0.90      0.89      39        累涨修正：29.81     净值区间：96      98      98      98      99      29
        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：3.08      累涨：20.58     8.31      5.77      6.50      10日：3.85      2.50      1.42      -0.09     27        累涨修正：29.77     净值区间：79      88      91      94      96      30
        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：21.80     累涨：20.06     7.73      5.82      6.51      10日：3.95      2.66      1.53      -0.24     24        累涨修正：29.73     净值区间：78      86      90      93      96      31
        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.01      累涨：20.56     7.82      5.48      7.26      10日：3.78      2.75      1.27      0.19      25        累涨修正：29.63     净值区间：91      93      95      96      98      32
        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.53      累涨：21.00     8.77      6.18      6.05      10日：4.73      1.29      1.17      1.05      29        累涨修正：29.36     净值区间：72      84      89      89      94      33
        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：1.49      累涨：19.75     7.42      4.58      7.75      10日：4.73      2.39      1.23      0.23      26        累涨修正：29.33     净值区间：87      91      95      96      98      34
        INDEX_CN_BIG.put("512360", "指数-大盘             ");//MSCI中国A股ETF基金    市值：0.65      累涨：22.13     10.57     6.39      5.17      10日：3.74      1.18      1.05      0.33      72        累涨修正：29.15     净值区间：85      94      95      91      95      35
        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.15      累涨：18.31     6.09      5.16      7.06      10日：5.33      1.97      1.61      0.27      34        累涨修正：28.83     净值区间：40      40      46      46      63      36
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.66      累涨：20.72     8.58      6.26      5.88      10日：4.44      1.16      1.16      1.03      40        累涨修正：28.64     净值区间：61      76      83      83      90      37
        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：5.13      累涨：18.00     6.21      4.94      6.85      10日：4.59      3.10      1.45      0.40      33        累涨修正：28.59     净值区间：97      98      98      99      99      38
        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：10.15     累涨：19.70     8.89      4.80      6.01      10日：4.40      1.57      1.45      0.60      42        累涨修正：28.57     净值区间：77      81      88      88      94      39
        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：0.62      累涨：22.42     10.00     6.04      6.38      10日：4.27      0.70      0.55      0.98      41        累涨修正：28.49     净值区间：94      96      98      98      99      40
        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.09      累涨：20.41     8.40      5.97      6.04      10日：3.73      1.53      1.35      0.63      43        累涨修正：28.37     净值区间：79      90      90      90      96      41
        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.45      累涨：19.18     6.86      5.24      7.08      10日：4.40      1.96      1.26      0.38      31        累涨修正：28.06     净值区间：98      96      96      97      98      42
        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.25      累涨：19.62     6.98      6.27      6.37      10日：5.73      1.38      0.64      0.53      22        累涨修正：28.01     净值区间：69      88      93      93      96      43
        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：44.30     累涨：18.67     8.12      4.85      5.70      10日：4.35      1.56      1.56      0.83      55        累涨修正：27.7      净值区间：77      81      88      88      94      44
        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：39.40     累涨：18.74     7.80      5.17      5.77      10日：4.31      1.54      1.54      0.59      45        累涨修正：27.67     净值区间：77      81      88      88      94      45
        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.31      累涨：18.83     6.73      4.71      7.39      10日：4.55      2.18      1.04      0.24      66        累涨修正：27.64     净值区间：89      95      95      75      80      46
        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.04      累涨：19.93     8.15      7.16      4.62      10日：3.23      2.40      1.01      0.27      63        累涨修正：27.58     净值区间：80      85      86      75      45      47
        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.56      累涨：20.39     9.08      5.38      5.93      10日：3.76      1.40      1.00      1.01      41        累涨修正：27.55     净值区间：86      92      94      94      75      48
        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.33      累涨：19.29     7.24      6.16      5.89      10日：4.42      1.60      1.01      0.75      35        累涨修正：27.33     净值区间：80      93      50      50      67      49
        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.68      累涨：21.38     9.74      5.74      5.90      10日：4.34      0.71      0.41      1.02      60        累涨修正：27.25     净值区间：88      90      96      70      71      50
        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：33.01     累涨：19.64     7.23      6.04      6.37      10日：4.22      1.40      0.93      0.57      32        累涨修正：27.12     净值区间：94      96      98      98      99      51
        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.92      累涨：19.48     8.81      4.96      5.71      10日：4.05      1.40      1.05      0.49      61        累涨修正：27.03     净值区间：100     100     100     89      94      52
        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.22      累涨：19.81     7.35      6.13      6.33      10日：4.07      1.01      1.01      1.61      50        累涨修正：26.91     净值区间：100     100     100     100     100     53
        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.56      累涨：19.74     8.27      5.27      6.20      10日：3.96      1.05      0.95      0.57      64        累涨修正：26.65     净值区间：71      82      88      89      95      54
        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：0.78      累涨：15.95     4.94      4.35      6.66      10日：4.32      2.99      1.66      0.43      80        累涨修正：26.58     净值区间：97      98      98      99      99      55
        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：6.85      累涨：19.03     7.11      5.54      6.38      10日：4.08      1.35      1.01      0.67      38        累涨修正：26.48     净值区间：75      81      89      90      94      56
        INDEX_CN_BIG.put("159209", "指数-大盘             ");//中证红利质量ETF       市值：2.21      累涨：18.33     7.32      5.42      5.59      10日：4.31      1.99      0.89      0.39      44        累涨修正：26.41     净值区间：61      80      85      85      92      57
        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：19.77     累涨：19.61     7.69      5.52      6.40      10日：4.00      1.17      0.72      0.71      47        累涨修正：26.22     净值区间：100     100     100     100     100     58
        INDEX_CN_BIG.put("512550", "指数-大盘             ");//富时A50ETF嘉实        市值：3.24      累涨：17.87     6.73      4.41      6.73      10日：4.18      1.60      1.28      0.51      66        累涨修正：26.21     净值区间：77      82      88      89      94      59
        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：1.33      累涨：17.94     6.50      4.87      6.57      10日：4.71      1.34      1.10      0.78      48        累涨修正：26.19     净值区间：84      91      94      96      97      60
        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.09      累涨：19.75     9.60      4.52      5.63      10日：3.65      1.11      0.83      0.74      119       累涨修正：26.17     净值区间：82      88      92      71      81      61
        INDEX_CN_BIG.put("562890", "指数-大盘             ");//A50ETF嘉实            市值：4.26      累涨：17.73     6.83      4.74      6.16      10日：4.56      1.38      1.21      0.52      54        累涨修正：26.09     净值区间：62      74      82      82      89      62
        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.52      累涨：17.89     5.16      5.79      6.94      10日：4.24      2.06      0.93      1.02      46        累涨修正：26.05     净值区间：93      93      95      78      82      63
        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.62      累涨：20.13     9.01      5.07      6.05      10日：4.09      0.74      0.54      1.02      83        累涨修正：26.04     净值区间：94      97      98      98      99      64
        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.23      累涨：18.30     6.85      4.99      6.46      10日：4.11      1.33      1.06      0.35      52        累涨修正：25.86     净值区间：67      81      85      86      93      65
        INDEX_CN_BIG.put("159216", "指数-大盘             ");//深证100ETF大成        市值：0.19      累涨：                    6.63      7.98      10日：6.02      1.74      1.74      1.37      28        累涨修正：25.85     净值区间：75      83      59      59              66
        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：31.06     累涨：17.94     7.69      4.59      5.66      10日：3.96      1.31      1.31      0.59      105       累涨修正：25.83     净值区间：73      77      86      86      92      67
        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.24      累涨：18.36     7.03      5.35      5.98      10日：4.30      1.35      0.90      0.96      49        累涨修正：25.81     净值区间：88      94      96      96      98      68
        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：3.83      累涨：17.52     6.06      4.87      6.59      10日：4.72      1.34      1.10      0.86      57        累涨修正：25.78     净值区间：82      89      92      93      96      69
        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：9.62      累涨：17.94     7.02      5.00      5.92      10日：4.23      1.22      1.13      0.61      75        累涨修正：25.65     净值区间：65      74      84      84      90      70
        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：5.76      累涨：17.79     6.51      5.11      6.17      10日：4.34      1.34      1.09      0.78      51        累涨修正：25.65     净值区间：78      86      94      94      95      71
        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.52      累涨：19.63     9.89      4.22      5.52      10日：2.64      1.86      0.73      0.70      117       累涨修正：25.59     净值区间：81      88      93      93      95      72
        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：36.00     累涨：17.72     6.48      5.07      6.17      10日：4.50      1.27      1.05      0.82      53        累涨修正：25.59     净值区间：79      85      91      92      95      73
        INDEX_CN_BIG.put("560350", "指数-大盘             ");//XD中证A50ETF指数基金  市值：25.53     累涨：17.32     6.44      4.75      6.13      10日：4.59      1.33      1.15      0.54      70        累涨修正：25.54     净值区间：22      38      61      61      75      74
        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：2.87      累涨：18.13     7.38      4.64      6.11      10日：3.67      1.89      0.92      0.96      79        累涨修正：25.53     净值区间：100     100     100     100     100     75
        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：9.77      累涨：17.75     6.03      5.28      6.44      10日：4.58      1.20      1.00      0.70      58        累涨修正：25.53     净值区间：77      84      90      91      95      76
        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：4.00      累涨：17.91     6.99      4.65      6.27      10日：4.29      1.31      1.00      0.99      65        累涨修正：25.51     净值区间：94      96      98      98      99      77
        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1717.03   累涨：17.83     6.31      5.20      6.32      10日：4.45      1.19      1.02      0.80      59        累涨修正：25.51     净值区间：80      86      91      92      95      78
        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.23      累涨：18.01     7.28      4.76      5.97      10日：4.32      1.14      0.96      0.75      88        累涨修正：25.39     净值区间：83      87      92      93      96      79
        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.01      累涨：18.01     6.44      5.51      6.06      10日：3.94      1.14      1.14      0.79      100       累涨修正：25.37     净值区间：89      93      97      97      98      80
        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：67.00     累涨：17.09     6.16      4.88      6.05      10日：4.63      1.21      1.21      0.60      90        累涨修正：25.35     净值区间：64      71      82      82      89      81
        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：64.16     累涨：17.76     6.56      5.07      6.13      10日：4.25      1.29      1.01      0.81      62        累涨修正：25.32     净值区间：81      87      92      93      95      82
        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：5.44      累涨：17.53     6.32      4.90      6.31      10日：4.40      1.24      1.06      0.88      68        累涨修正：25.29     净值区间：81      86      92      92      95      83
        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：43.26     累涨：18.40     7.32      5.09      5.99      10日：3.96      1.04      0.92      0.62      95        累涨修正：25.24     净值区间：79      89      92      84      89      84
        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：24.27     累涨：17.38     6.91      4.51      5.96      10日：4.35      1.23      1.14      0.70      99        累涨修正：25.24     净值区间：65      74      83      83      90      85
        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：15.21     累涨：17.48     6.91      4.73      5.84      10日：4.12      1.33      1.15      0.53      96        累涨修正：25.23     净值区间：62      72      80      80      88      86
        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：2.04      累涨：17.74     6.14      5.66      5.94      10日：4.18      1.30      1.00      0.77      81        累涨修正：25.22     净值区间：85      93      94      94      98      87
        INDEX_CN_BIG.put("515330", "指数-大盘             ");//沪深300ETF天弘        市值：92.10     累涨：17.34     6.29      4.87      6.18      10日：4.44      1.26      1.08      0.71      74        累涨修正：25.2      净值区间：76      83      90      90      94      88
        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：34.86     累涨：17.55     6.34      5.15      6.06      10日：4.32      1.23      1.03      0.84      71        累涨修正：25.16     净值区间：81      87      92      92      95      89
        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：2.88      累涨：18.14     7.13      4.78      6.23      10日：3.97      1.23      0.90      1.14      77        累涨修正：25.14     净值区间：96      98      98      98      99      90
        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：28.58     累涨：17.81     6.51      5.21      6.09      10日：4.06      1.21      1.03      0.84      78        累涨修正：25.14     净值区间：84      88      93      93      78      91
        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：0.90      累涨：17.96     6.80      5.93      5.23      10日：3.34      2.45      0.68      0.19      89        累涨修正：25.11     净值区间：65      79      83      88      92      92
        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1995.06   累涨：17.60     6.34      5.05      6.21      10日：4.44      1.17      0.95      0.87      69        累涨修正：25.11     净值区间：82      88      92      93      96      93
        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2695.22   累涨：17.45     6.34      4.94      6.17      10日：4.51      1.23      0.95      0.84      67        累涨修正：25.09     净值区间：80      87      91      92      95      94
        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3767.02   累涨：17.29     6.18      4.99      6.12      10日：4.54      1.25      1.00      0.85      73        累涨修正：25.08     净值区间：81      87      92      91      93      95
        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：9.68      累涨：17.09     6.54      4.67      5.88      10日：4.42      1.25      1.16      0.53      98        累涨修正：25.08     净值区间：62      70      81      81      89      96
        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：36.05     累涨：17.27     6.21      4.91      6.15      10日：4.47      1.20      1.06      0.79      82        累涨修正：25.06     净值区间：82      88      92      93      96      97
        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：6.03      累涨：16.09     5.49      4.76      5.84      10日：4.05      2.54      1.19      0.00      106       累涨修正：25.06     净值区间：94      96      97      97      98      98
        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：41.24     累涨：17.30     6.53      4.71      6.06      10日：4.46      1.21      1.04      0.43      86        累涨修正：25.05     净值区间：57      67      79      79      86      99
        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：14.25     累涨：17.72     6.08      5.35      6.29      10日：4.14      1.16      1.00      0.83      85        累涨修正：25.02     净值区间：81      87      92      93      95      100
        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：15.82     累涨：18.06     7.08      4.57      6.41      10日：3.98      0.96      0.96      0.69      108       累涨修正：24.92     净值区间：83      91      93      94      96      101
        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：0.96      累涨：16.83     6.60      4.28      5.95      10日：4.45      1.47      1.08      0.58      94        累涨修正：24.91     净值区间：75      83      89      89      94      102
        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.80      累涨：17.41     6.24      4.96      6.21      10日：4.45      1.12      0.94      0.77      84        累涨修正：24.86     净值区间：78      84      90      91      94      103
        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：0.84      累涨：17.18     5.64      5.81      5.73      10日：3.86      2.37      0.72      0.54      93        累涨修正：24.85     净值区间：96      98      98      99      99      104
        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：5.85      累涨：16.75     6.29      4.31      6.15      10日：4.41      1.29      1.20      0.68      103       累涨修正：24.85     净值区间：69      77      85      85      91      105
        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：2.03      累涨：16.43     6.11      4.59      5.73      10日：3.61      2.37      1.22      0.00      91        累涨修正：24.85     净值区间：95      97      97      98      99      106
        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.49      累涨：17.27     7.09      4.94      5.24      10日：2.95      2.41      1.06      0.00      109       累涨修正：24.75     净值区间：90      94      96      96      98      107
        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：14.13     累涨：17.36     6.22      4.88      6.26      10日：4.32      1.18      0.94      0.71      87        累涨修正：24.74     净值区间：72      81      88      89      94      108
        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：16.27     累涨：17.44     6.48      5.04      5.92      10日：4.22      1.17      0.95      0.90      97        累涨修正：24.73     净值区间：82      88      92      93      96      109
        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：7.48      累涨：16.77     5.73      5.46      5.58      10日：4.02      2.38      0.76      0.56      92        累涨修正：24.69     净值区间：92      96      97      97      98      110
        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.15      累涨：16.78     6.79      4.17      5.82      10日：3.86      1.50      1.26      0.53      120       累涨修正：24.66     净值区间：80      84      90      90      96      111
        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.19      累涨：16.69     5.68      5.60      5.41      10日：4.04      2.39      0.76      0.47      91        累涨修正：24.64     净值区间：96      98      98      98      99      112
        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：30.82     累涨：16.87     6.54      4.27      6.06      10日：4.46      1.21      1.04      0.60      102       累涨修正：24.62     净值区间：67      73      83      83      90      113
        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.47      累涨：17.80     7.01      5.01      5.78      10日：3.96      1.10      0.79      0.91      107       累涨修正：24.44     净值区间：97      99      99      99      99      114
        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.31      累涨：17.82     6.45      5.03      6.34      10日：3.52      1.03      1.03      0.19      114       累涨修正：24.43     净值区间：69      79      86      87      89      115
        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.80      累涨：17.70     7.14      4.87      5.69      10日：3.86      1.27      0.76      0.93      104       累涨修正：24.35     净值区间：91      56      56      56      64      116
        INDEX_CN_BIG.put("159390", "指数-大盘             ");//A50指数ETF            市值：3.16      累涨：16.82     6.13      4.60      6.09      10日：4.07      1.21      1.12      0.75      115       累涨修正：24.34     净值区间：70      76      86      74      81      117
        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：4.91      累涨：17.74     7.04      4.59      6.11      10日：3.93      0.98      0.83      0.83      116       累涨修正：24.31     净值区间：89      94      97      97      97      118
        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：2.15      累涨：16.80     6.13      4.75      5.92      10日：4.00      1.40      1.05      0.81      46        累涨修正：24.3      净值区间：88      92      96      96      97      119
        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.73      累涨：17.73     7.33      4.84      5.56      10日：3.86      1.00      0.83      0.74      123       累涨修正：24.25     净值区间：95      98      99      99      99      120
        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.16      累涨：15.21     5.19      4.50      5.52      10日：4.17      2.20      1.31      0.35      124       累涨修正：24.2      净值区间：81      86      90      90      95      121
        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：186.56    累涨：15.74     5.34      5.11      5.29      10日：3.50      2.64      1.15      -0.19     118       累涨修正：24.18     净值区间：81      87      90      92      94      122
        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：27.95     累涨：19.39     8.34      5.55      5.50      10日：3.74      0.50      0.25      0.98      113       累涨修正：24.13     净值区间：93      94      97      98      99      123
        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.32      累涨：16.78     6.36      4.74      5.68      10日：4.27      1.37      0.84      2.00      45        累涨修正：24.1      净值区间：75      80      89      89      91      124
        INDEX_CN_BIG.put("159391", "指数-大盘             ");//大盘价值ETF           市值：0.18      累涨：                    5.13      8.31      10日：5.02      2.64      1.45      -0.36     36        累涨修正：24        净值区间：78      88      96      96              125
        INDEX_CN_BIG.put("515300", "指数-大盘             ");//300红利低波ETF        市值：56.00     累涨：15.26     6.05      4.16      5.05      10日：3.67      2.52      1.21      -0.43     139       累涨修正：23.87     净值区间：68      81      83      76      86      126
        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.24      累涨：16.43     6.44      4.61      5.38      10日：4.08      1.38      0.98      0.88      48        累涨修正：23.85     净值区间：85      97      97      97      97      127
        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：17.12     累涨：16.93     6.47      4.86      5.60      10日：3.99      1.04      0.83      0.72      126       累涨修正：23.62     净值区间：75      83      90      90      94      128
        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：1.90      累涨：16.88     6.70      4.53      5.65      10日：3.92      1.00      0.90      0.69      137       累涨修正：23.6      净值区间：74      86      90      90      94      129
        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：15.58     累涨：16.65     5.99      5.11      5.55      10日：2.96      2.35      0.81      -0.20     121       累涨修正：23.58     净值区间：71      82      85      89      92      130
        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：1.34      累涨：16.51     6.05      4.99      5.47      10日：3.92      1.19      0.98      0.72      129       累涨修正：23.58     净值区间：79      85      90      92      95      131
        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：106.68    累涨：15.73     6.19      4.46      5.08      10日：3.35      2.46      1.02      -0.27     135       累涨修正：23.58     净值区间：75      83      86      89      93      132
        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：55.53     累涨：15.35     6.40      4.32      4.63      10日：3.62      2.47      1.06      0.07      130       累涨修正：23.56     净值区间：90      93      95      95      97      133
        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.71      累涨：17.56     7.72      5.05      4.79      10日：3.40      0.87      0.77      0.67      134       累涨修正：23.37     净值区间：73      90      71      71      77      134
        INDEX_CN_BIG.put("159211", "指数-大盘             ");//深证100ETF富国        市值：3.61      累涨：                    7.00      6.89      10日：4.87      1.51      1.51      1.41      37        累涨修正：23.29     净值区间：94      94      97      97              135
        INDEX_CN_BIG.put("512240", "指数-大盘             ");//A50ETF龙头            市值：0.39      累涨：16.76     6.23      4.90      5.63      10日：3.71      1.00      0.90      0.89      140       累涨修正：23.27     净值区间：68      87      87      87      91      136
        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.48      累涨：16.36     6.05      4.42      5.89      10日：3.69      1.50      0.86      0.64      49        累涨修正：23.27     净值区间：85      94      94      95      96      137
        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利ETF广发           市值：0.71      累涨：14.94     5.24      4.54      5.16      10日：3.42      2.46      1.22      0.00      143       累涨修正：23.26     净值区间：90      94      95      97      97      138
        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.61      累涨：16.98     6.98      4.68      5.32      10日：3.55      1.20      0.73      0.53      131       累涨修正：23.19     净值区间：81      86      91      91      95      139
        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：0.49      累涨：17.37     6.98      4.76      5.63      10日：3.37      1.06      0.67      0.95      133       累涨修正：23.14     净值区间：40      50      68      68      80      140
        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.74      累涨：14.74     5.29      4.20      5.25      10日：3.58      2.56      1.09      -0.18     144       累涨修正：23.06     净值区间：82      91      94      76      81      141
        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.26      累涨：16.39     6.94      3.83      5.62      10日：3.70      1.07      0.90      0.73      146       累涨修正：22.96     净值区间：71      85      90      90      93      142
        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：5.81      累涨：16.45     6.62      4.26      5.57      10日：4.16      1.01      0.66      0.58      136       累涨修正：22.94     净值区间：71      80      89      89      93      143
        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：83.32     累涨：14.83     5.53      4.29      5.01      10日：3.32      2.51      1.14      0.00      152       累涨修正：22.94     净值区间：90      94      95      96      97      144
        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：13.63     累涨：16.38     6.49      5.30      4.59      10日：3.65      1.66      0.62      0.51      110       累涨修正：22.93     净值区间：94      96      98      98      99      145
        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：1.62      累涨：16.74     6.24      4.98      5.52      10日：3.87      1.15      0.57      0.66      128       累涨修正：22.9      净值区间：100     100     100     100     100     146
        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：0.62      累涨：16.37     6.34      4.84      5.19      10日：3.59      1.09      0.89      0.88      145       累涨修正：22.83     净值区间：29      42      44      50      53      147
        INDEX_CN_BIG.put("159661", "指数-大盘             ");//A100ETF嘉实           市值：0.30      累涨：16.42     6.30      4.48      5.64      10日：3.94      1.05      0.70      0.86      141       累涨修正：22.81     净值区间：76      87      91      91      95      148
        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.40      累涨：16.45     6.69      4.28      5.48      10日：3.77      1.03      0.75      0.93      148       累涨修正：22.75     净值区间：73      87      90      52      60      149
        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.48      累涨：16.07     5.75      5.53      4.79      10日：2.83      2.19      0.81      0.18      127       累涨修正：22.71     净值区间：16      25      31      35      49      150
        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：2.98      累涨：16.09     6.16      4.56      5.37      10日：3.89      0.96      0.86      0.76      162       累涨修正：22.66     净值区间：77      84      90      90      94      151
        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：44.11     累涨：16.04     6.02      4.04      5.98      10日：3.92      1.09      0.80      0.58      150       累涨修正：22.65     净值区间：75      83      90      90      94      152
        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.54      累涨：17.40     7.13      5.37      4.90      10日：3.41      1.06      0.29      0.10      125       累涨修正：22.45     净值区间：92      97      98      98      99      153
        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1661.81   累涨：16.02     5.81      4.19      6.02      10日：3.98      1.03      0.71      0.60      147       累涨修正：22.45     净值区间：76      82      90      90      94      154
        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：2.46      累涨：17.14     7.46      4.19      5.49      10日：3.41      0.84      0.50      0.75      158       累涨修正：22.39     净值区间：95      97      98      99      99      155
        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：2.00      累涨：16.06     6.22      3.60      6.24      10日：4.04      0.97      0.66      0.56      138       累涨修正：22.39     净值区间：78      84      92      92      95      156
        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：66.99     累涨：14.36     5.24      4.27      4.85      10日：3.39      2.47      1.03      0.19      154       累涨修正：22.28     净值区间：97      98      98      98      99      157
        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：17.89     累涨：16.40     5.98      4.29      6.13      10日：3.73      0.96      0.56      0.40      153       累涨修正：22.21     净值区间：73      77      89      89      93      158
        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：3.01      累涨：15.64     6.47      4.39      4.78      10日：3.79      1.05      0.86      0.48      161       累涨修正：22.2      净值区间：67      81      85      85      92      159
        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波ETF天弘       市值：39.85     累涨：13.91     5.62      4.17      4.12      10日：3.34      2.39      1.27      0.17      166       累涨修正：22.18     净值区间：96      98      98      98      99      160
        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：4.29      累涨：15.85     5.94      4.99      4.92      10日：3.52      1.16      0.77      0.77      151       累涨修正：22.07     净值区间：95      97      98      98      99      161
        INDEX_CN_BIG.put("530080", "指数-大盘             ");//上证180ETF天弘        市值：0.39      累涨：16.05     5.81      4.75      5.49      10日：3.64      0.85      0.76      0.66      169       累涨修正：22.06     净值区间：89      95      96      96      98      162
        INDEX_CN_BIG.put("510800", "指数-大盘             ");//50ETF基金             市值：4.81      累涨：15.69     5.73      3.93      6.03      10日：3.99      0.95      0.71      0.63      160       累涨修正：22.05     净值区间：75      82      90      90      94      163
        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF广发         市值：0.79      累涨：15.76     5.87      3.75      6.14      10日：3.89      0.97      0.70      0.61      156       累涨修正：22.02     净值区间：79      87      90      94      97      164
        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.41      累涨：15.96     6.76      3.89      5.31      10日：3.37      1.15      0.76      0.38      163       累涨修正：22        净值区间：89      94      98      98      77      165
        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.27      累涨：16.53     6.07      4.49      5.97      10日：3.22      1.00      0.58      0.08      165       累涨修正：21.91     净值区间：79      76      89      91      94      166
        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：210.32    累涨：16.25     6.56      4.26      5.43      10日：3.70      0.67      0.61      0.74      170       累涨修正：21.84     净值区间：89      94      96      96      97      167
        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：1.70      累涨：16.55     6.95      4.36      5.24      10日：3.42      0.80      0.50      0.59      164       累涨修正：21.77     净值区间：88      94      95      96      98      168
        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.22      累涨：16.06     5.55      4.67      5.84      10日：3.45      1.09      0.58      0.07      159       累涨修正：21.76     净值区间：72      84      92      92      96      169
        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：1.72      累涨：16.03     6.08      4.13      5.82      10日：3.60      0.87      0.51      0.66      173       累涨修正：21.52     净值区间：82      92      94      94      95      170
        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：10.23     累涨：13.53     5.59      4.23      3.71      10日：3.24      2.28      1.23      0.09      172       累涨修正：21.51     净值区间：95      97      98      98      98      171
        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.19      累涨：15.83     6.17      4.65      5.01      10日：3.50      0.89      0.59      0.79      177       累涨修正：21.4      净值区间：83      93      93      94      96      172
        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.41      累涨：15.35     5.73      4.57      5.05      10日：3.48      1.07      0.71      0.82      53        累涨修正：21.32     净值区间：50      69      72      72      81      173
        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.53      累涨：15.13     5.65      3.72      5.76      10日：3.76      1.03      0.68      0.59      175       累涨修正：21.28     净值区间：73      89      92      92      94      174
        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.87      累涨：16.29     8.26      3.89      4.14      10日：2.70      1.35      0.45      0.00      149       累涨修正：21.24     净值区间：88      95      43      43      61      175
        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：2.11      累涨：16.10     5.91      4.48      5.71      10日：3.37      0.77      0.48      0.47      180       累涨修正：21.2      净值区间：22      31      53      53      62      176
        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：0.82      累涨：15.44     5.58      3.94      5.92      10日：3.55      0.90      0.48      0.42      179       累涨修正：20.85     净值区间：74      79      89      89      93      177
        INDEX_CN_BIG.put("159207", "指数-大盘             ");//高股息ETF             市值：3.68      累涨：16.07     7.03      5.60      3.44      10日：2.58      1.42      0.38      0.19      122       累涨修正：20.83     净值区间：86      93      98      98      98      178
        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：1.25      累涨：15.59     6.46      4.09      5.04      10日：3.38      0.77      0.48      0.76      182       累涨修正：20.7      净值区间：95      51      51      51      51      179
        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.45      累涨：16.00     5.31      4.90      5.79      10日：3.27      0.55      0.37      0.67      176       累涨修正：20.56     净值区间：69      80      88      88      74      180
        INDEX_CN_BIG.put("563700", "指数-大盘             ");//红利价值ETF           市值：0.54      累涨：                    6.10      6.10      10日：3.31      2.36      1.32      0.09      101       累涨修正：20.51     净值区间：88      92      94      96              181
        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.46      累涨：15.05     5.59      4.72      4.74      10日：2.87      1.66      0.46      0.09      26        累涨修正：20.5      净值区间：83      93      94      96      97      182
        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：23.82     累涨：13.30     4.73      4.11      4.46      10日：3.08      2.01      1.05      0.19      178       累涨修正：20.49     净值区间：95      97      98      98      99      183
        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：0.97      累涨：16.81     7.83      4.56      4.42      10日：2.37      0.79      0.24      0.54      171       累涨修正：20.45     净值区间：93      94      94      95      96      184
        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.89      累涨：15.96     6.67      4.82      4.47      10日：2.46      1.19      0.37      0.66      155       累涨修正：20.35     净值区间：100     100     72      80      83      185
        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：4.98      累涨：13.33     3.31      4.97      5.05      10日：4.00      1.36      0.73      0.51      51        累涨修正：20.15     净值区间：94      97      98      98      98      186
        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：0.96      累涨：14.73     4.81      4.90      5.02      10日：2.88      1.57      0.46      0.09      27        累涨修正：20.1      净值区间：77      90      91      93      96      187
        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：7.09      累涨：16.03     6.66      4.65      4.72      10日：2.27      1.01      0.31      0.47      174       累涨修正：19.93     净值区间：86      92      93      94      96      188
        INDEX_CN_BIG.put("159219", "指数-大盘             ");//深证100ETF融通        市值：0.25      累涨：                              8.03      10日：6.13      1.85      1.85      1.46      76        累涨修正：19.71     净值区间：84      90      93      93              189
        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.35      累涨：14.65     5.58      4.66      4.41      10日：2.93      0.82      0.44      0.25      185       累涨修正：19.28     净值区间：89      95      97      97      98      190
        INDEX_CN_BIG.put("560820", "指数-大盘             ");//中证A50ETF新华        市值：0.13      累涨：                    4.81      6.02      10日：4.26      1.44      1.34      0.48      111       累涨修正：19.21     净值区间：62      80      80      80              191
        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：33.72     累涨：14.72     5.78      4.56      4.38      10日：3.12      0.82      0.27      0.34      184       累涨修正：19.2      净值区间：90      95      97      97      97      192
        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：3.91      累涨：14.45     4.96      5.61      3.88      10日：2.64      1.70      0.19      0.09      142       累涨修正：19.17     净值区间：72      82      85      85      92      193
        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF嘉实       市值：18.42     累涨：14.88     6.04      4.40      4.44      10日：3.11      0.75      0.21      0.48      187       累涨修正：19.16     净值区间：95      98      98      98      99      194
        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：0.92      累涨：14.13     4.90      4.93      4.30      10日：2.21      1.50      0.58      -0.06     167       累涨修正：19        净值区间：83      84      69      83      90      195
        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.32      累涨：16.00     6.85      6.01      3.14      10日：1.74      0.63      0.28      0.00      157       累涨修正：18.93     净值区间：25      4       14      19      38      196
        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：23.45     累涨：13.63     5.10      4.53      4.00      10日：2.90      1.17      0.55      0.43      183       累涨修正：18.8      净值区间：56      72      81      61      61      197
        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：17.92     累涨：14.16     5.42      4.22      4.52      10日：3.19      0.75      0.27      0.41      189       累涨修正：18.64     净值区间：89      95      97      97      97      198
        INDEX_CN_BIG.put("510320", "指数-大盘             ");//沪深300ETF中金        市值：4.84      累涨：                    4.76      6.19      10日：4.04      1.34      1.05      0.76      112       累涨修正：18.43     净值区间：82      29      39      45              199
        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.26      累涨：13.86     5.37      4.61      3.88      10日：2.72      1.03      0.39      0.51      186       累涨修正：18.39     净值区间：64      79      86      68      68      200
        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：2.60      累涨：14.71     5.20      5.50      4.01      10日：2.00      1.00      0.33      0.13      181       累涨修正：18.37     净值区间：86      93      80      89      94      201
        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：55.53     累涨：14.25     5.86      4.24      4.15      10日：2.85      0.47      0.39      0.53      190       累涨修正：18.35     净值区间：94      97      98      98      98      202
        INDEX_CN_BIG.put("512250", "指数-大盘             ");//中证A50ETF招商        市值：0.12      累涨：                    4.71      5.88      10日：3.97      1.31      1.22      0.28      132       累涨修正：18.31     净值区间：39      55      66      31              203
        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：5.94      累涨：13.80     4.30      5.28      4.22      10日：1.87      1.24      0.34      0.48      168       累涨修正：17.59     净值区间：100     100     77      86      91      204
        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：51.91     累涨：13.04     5.56      3.75      3.73      10日：2.69      0.39      0.39      0.55      192       累涨修正：16.9      净值区间：83      91      93      93      95      205
        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：28.19     累涨：12.32     3.94      4.21      4.17      10日：2.75      0.49      0.42      0.70      191       累涨修正：16.4      净值区间：94      97      98      98      98      206
        INDEX_CN_BIG.put("561750", "指数-大盘             ");//中证A50ETF博时        市值：1.77      累涨：                              5.25      10日：3.52      1.00      1.00      0.40      188       累涨修正：11.77     净值区间：59      69      81                      207
        INDEX_CN_BIG.put("563060", "指数-大盘             ");//央企50ETF             市值：0.21      累涨：                              3.29      10日：1.39      0.20      0.10      0.00      193       累涨修正：5.08      净值区间：50      77      81                      208
        INDEX_CN_BIG.put("159228", "指数-大盘             ");//红利低波ETF长城       市值：2.76      累涨：                                        10日：3.08      2.18      1.08      -0.10               累涨修正：          净值区间：83      87                              209
        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：80.41     累涨：                                        10日：                              0.23                累涨修正：          净值区间：                                        210
        INDEX_CN_BIG.put("159263", "指数-大盘             ");//价值ETF               市值：4.68      累涨：                                        10日：                              0.20                累涨修正：          净值区间：                                        211
        INDEX_CN_BIG.put("563900", "指数-大盘             ");//XD沪深300自由现金流ETF摩根市值：2.19      累涨：                                        10日：                              0.19                累涨修正：          净值区间：                                        212
        INDEX_CN_BIG.put("561770", "指数-大盘             ");//中证A100指数ETF       市值：1.83      累涨：                                        10日：2.56      0.88      0.78      0.58                累涨修正：          净值区间：76      83                              213
        INDEX_CN_BIG.put("159238", "指数-大盘             ");//300ETF增强            市值：0.88      累涨：                              6.59      10日：4.39      1.64      1.06      0.67                累涨修正：          净值区间：95      97      98                      214
        INDEX_CN_BIG.put("562080", "指数-大盘             ");//300现金流ETF          市值：1.80      累涨：                                        10日：                              -0.09               累涨修正：          净值区间：                                        215
    }

    public static Map<String, String> INDEX_CN_CITY = new HashMap<>();//指数-国内城市

    static {
        INDEX_CN_CITY.put("159976", "指数-国内城市         ");//湾创ETF               市值：1.19      累涨：33.24     7.08      16.06     13.43     8.12      4.73      1
        INDEX_CN_CITY.put("512970", "指数-国内城市         ");//大湾区ETF             市值：0.75      累涨：29.62     9.03      14.23     9.72      6.35      4.34      2
        INDEX_CN_CITY.put("159623", "指数-国内城市         ");//成渝经济圈ETF         市值：32.83     累涨：29.66     7.39      17.26     8.94      5.74      3.04      3
        INDEX_CN_CITY.put("159743", "指数-国内城市         ");//湖北ETF               市值：1.57      累涨：40.34     12.22     20.84     14.69     5.67      2.86      4
        INDEX_CN_CITY.put("517160", "指数-国内城市         ");//长江保护主题ETF       市值：13.73     累涨：22.55     4.70      11.26     9.63      5.63      4.10      5
        INDEX_CN_CITY.put("512870", "指数-国内城市         ");//杭州湾区ETF           市值：0.41      累涨：33.69     11.23     17.08     12.09     5.51      3.32      6
        INDEX_CN_CITY.put("517330", "指数-国内城市         ");//长江保护ETF           市值：13.72     累涨：22.51     4.98      11.97     8.90      5.47      3.81      7
        INDEX_CN_CITY.put("515760", "指数-国内城市         ");//浙江国资ETF           市值：1.78      累涨：22.05     6.08      11.51     7.53      5.15      2.60      8
        INDEX_CN_CITY.put("517850", "指数-国内城市         ");//张江ETF               市值：0.63      累涨：47.34     14.21     25.01     15.55     5.06      2.61      9
        INDEX_CN_CITY.put("512650", "指数-国内城市         ");//长三角ETF             市值：3.94      累涨：25.38     7.56      13.08     9.40      5.01      3.10      10
        INDEX_CN_CITY.put("512190", "指数-国内城市         ");//浙商之江凤凰ETF       市值：0.61      累涨：19.24     6.80      9.42      7.09      3.58      2.79      15
        INDEX_CN_CITY.put("510810", "指数-国内城市         ");//上海国企ETF           市值：76.95     累涨：20.42     7.35      10.53     5.90      3.39      2.18      16
    }

    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_NOT_USA);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
        INDEX.putAll(INDEX_CN_CITY);
//        INDEX.putAll(INDEX_HK);
    }

    public static Map<String, String> TOP_INDEX = new HashMap<>();//指数-全部-etf

    static {
        TOP_INDEX.putAll(TOP_INDEX_CN_NOT);
        TOP_INDEX.putAll(TOP_INDEX_CN_NOT_USA);
        TOP_INDEX.putAll(TOP_INDEX_CN_BIG);
        TOP_INDEX.putAll(TOP_INDEX_CN_1000);
        TOP_INDEX.putAll(TOP_INDEX_688);
        TOP_INDEX.putAll(TOP_INDEX_300);
//        TOP_INDEX.putAll(TOP_INDEX_CN_CITY);
//        TOP_INDEX.putAll(INDEX_HK);
    }

    /**
     * 金融
     */
    public static Map<String, String> TOP_JINRONG_GOLD = new HashMap<>();//金融-黄金
    static {
        TOP_JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：1.16      累涨：36.12     9.77      18.40     7.95      10日：4.40      1.94      0.62      1.41      1         累涨修正：43.7      净值区间：77      44      59      67      69      1
    }
    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金
    static {
        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：1.16      累涨：36.12     9.77      18.40     7.95      10日：4.40      1.94      0.62      1.41      1         累涨修正：43.7      净值区间：77      44      59      67      69      1
        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.47      累涨：36.63     10.29     18.95     7.39      10日：4.04      1.41      0.50      1.49      6         累涨修正：43.08     净值区间：80      47      68      61      64      2
        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：45.30     累涨：36.21     10.87     17.41     7.93      10日：3.79      1.57      0.62      1.85      2         累涨修正：42.81     净值区间：81      49      55      71      74      3
        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金股票ETF基金       市值：0.33      累涨：36.22     9.49      18.70     8.03      10日：3.73      1.25      0.59      1.59      9         累涨修正：42.38     净值区间：71      50      61      50      61      4
        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：1.33      累涨：35.31     9.63      18.03     7.65      10日：3.92      1.46      0.43      1.90      5         累涨修正：41.55     净值区间：78      46      56      57      59      5
        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：6.08      累涨：33.94     8.92      18.00     7.02      10日：3.91      1.50      0.57      1.69      7         累涨修正：40.49     净值区间：85      69      69      75      77      6
        JINRONG_GOLD.put("518680", "金融-黄金             ");//金ETF                 市值：28.12     累涨：28.73     13.83     10.72     4.18      10日：3.35      1.50      0.85      0.61      3         累涨修正：35.28     净值区间：88      78      57      50      38      7
        JINRONG_GOLD.put("518600", "金融-黄金             ");//上海金ETF             市值：21.57     累涨：28.98     12.79     12.28     3.91      10日：3.16      1.33      0.81      0.64      18        累涨修正：35.09     净值区间：93      79      55      73      67      8
        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：21.29     累涨：27.99     12.93     10.94     4.12      10日：3.28      1.54      0.90      0.68      4         累涨修正：34.61     净值区间：86      79      58      47      41      9
        JINRONG_GOLD.put("518890", "金融-黄金             ");//中银上海金ETF         市值：20.50     累涨：27.52     12.60     10.63     4.29      10日：3.33      1.55      0.86      0.62      8         累涨修正：34.12     净值区间：90      77      43      39      40      10
        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：12.05     累涨：27.69     12.87     10.76     4.06      10日：3.26      1.39      0.84      0.63      11        累涨修正：34.02     净值区间：82      79      53      45      45      11
        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：607.41    累涨：27.60     12.82     10.65     4.13      10日：3.25      1.43      0.85      0.61      10        累涨修正：33.98     净值区间：91      77      57      49      40      12
        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：285.34    累涨：27.38     12.71     10.57     4.10      10日：3.28      1.45      0.86      0.57      13        累涨修正：33.83     净值区间：92      78      55      50      41      13
        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：36.62     累涨：27.57     12.83     10.69     4.05      10日：3.17      1.40      0.83      0.61      15        累涨修正：33.8      净值区间：93      77      54      50      41      14
        JINRONG_GOLD.put("159830", "金融-黄金             ");//上海金ETF             市值：15.50     累涨：27.33     12.60     10.60     4.13      10日：3.32      1.43      0.84      0.60      12        累涨修正：33.76     净值区间：91      78      51      49      41      15
        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：187.00    累涨：27.45     12.66     10.68     4.11      10日：3.24      1.42      0.81      0.65      14        累涨修正：33.73     净值区间：92      77      54      49      41      16
        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：48.84     累涨：27.40     12.69     10.65     4.06      10日：3.24      1.41      0.81      0.63      16        累涨修正：33.67     净值区间：92      77      54      50      40      17
        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：262.92    累涨：27.34     12.71     10.58     4.05      10日：3.18      1.37      0.81      0.60      20        累涨修正：33.51     净值区间：91      78      55      49      40      18
        JINRONG_GOLD.put("159834", "金融-黄金             ");//金ETF                 市值：10.16     累涨：27.08     12.57     10.47     4.04      10日：3.26      1.45      0.85      0.61      17        累涨修正：33.49     净值区间：86      77      42      43      41      19
        JINRONG_GOLD.put("159831", "金融-黄金             ");//上海金ETF嘉实         市值：7.18      累涨：27.16     12.72     10.49     3.95      10日：3.19      1.44      0.81      0.64      19        累涨修正：33.41     净值区间：88      78      51      49      48      20
    }

    public static Map<String, String> TOP_JINRONG_BANK = new HashMap<>();//金融-银行
    static {
        TOP_JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF基金           市值：6.30      累涨：33.07     12.90     6.79      13.38     10日：6.19      2.32      1.74      0.53      1         累涨修正：45.06     净值区间：42      72      80      86      90      1
    }
    public static Map<String, String> JINRONG_BANK = new HashMap<>();//金融-银行
    static {
        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF基金           市值：6.30      累涨：33.07     12.90     6.79      13.38     10日：6.19      2.32      1.74      0.53      1         累涨修正：45.06     净值区间：42      72      80      86      90      1
        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：10.32     累涨：32.74     12.48     6.69      13.57     10日：6.25      2.23      1.72      0.06      3         累涨修正：44.66     净值区间：40      73      80      86      90      2
        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：57.55     累涨：32.71     12.49     6.86      13.36     10日：6.25      2.13      1.75      0.31      2         累涨修正：44.59     净值区间：42      73      81      86      90      3
        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：17.34     累涨：32.71     12.80     6.67      13.24     10日：6.12      2.11      1.66      0.84      5         累涨修正：44.26     净值区间：42      73      80      86      90      4
        JINRONG_BANK.put("512730", "金融-银行             ");//银行ETF指数           市值：1.15      累涨：32.36     12.30     6.63      13.43     10日：6.21      2.24      1.58      0.55      4         累涨修正：43.97     净值区间：43      72      81      87      91      5
        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.50      累涨：32.15     12.16     6.92      13.07     10日：6.05      2.11      1.78      0.07      7         累涨修正：43.87     净值区间：39      72      58      68      75      6
        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：21.54     累涨：32.53     12.74     6.84      12.95     10日：5.97      1.83      1.49      0.48      6         累涨修正：43.31     净值区间：41      72      81      86      90      7
        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：8.34      累涨：31.61     12.32     6.22      13.07     10日：5.96      2.13      1.72      0.41      8         累涨修正：43.14     净值区间：41      72      80      86      90      8
        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：135.67    累涨：31.91     12.65     6.80      12.46     10日：5.50      1.68      1.68      0.90      9         累涨修正：42.45     净值区间：43      1       1       1       1       9
        JINRONG_BANK.put("517900", "金融-银行             ");//银行AH优选ETF         市值：8.44      累涨：30.97     10.20     9.05      11.72     10日：5.60      1.93      1.51      0.61      10        累涨修正：41.52     净值区间：34      72      77      86      90      10
    }

    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券
    public static Map<String, String> TOP_JINRONG_ZHENGQUAN = new HashMap<>();

    static {
        TOP_JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：76.43     累涨：43.00     11.75     16.35     14.90     10日：6.31      5.39      2.89      1.44      1         累涨修正：60.48     净值区间：87      89      91      96      80      1
    }

    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：76.43     累涨：43.00     11.75     16.35     14.90     10日：6.31      5.39      2.89      1.44      1         累涨修正：60.48     净值区间：87      89      91      96      80      1
        JINRONG_ZHENGQUAN.put("513140", "金融-证券             ");//港股金融ETF           市值：0.80      累涨：32.70     8.99      13.54     10.17     10日：3.08      2.49      1.75      0.50      6         累涨修正：41.77     净值区间：89      89      95      98      98      2
        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.34      累涨：27.60     8.02      8.94      10.64     10日：3.31      3.21      2.23      1.14      5         累涨修正：38.58     净值区间：98      98      59      75      56      3
        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.09      累涨：27.36     7.57      9.17      10.62     10日：3.36      3.24      2.03      0.82      3         累涨修正：38.02     净值区间：91      91      48      71      54      4
        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：294.52    累涨：26.91     7.47      9.18      10.26     10日：3.35      3.35      2.10      0.94      2         累涨修正：37.81     净值区间：87      87      48      70      53      5
        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：230.52    累涨：26.81     7.34      9.32      10.15     10日：3.30      3.30      2.09      0.98      4         累涨修正：37.59     净值区间：88      89      48      70      54      6
        JINRONG_ZHENGQUAN.put("513190", "金融-证券             ");//港股通金融ETF         市值：9.89      累涨：28.57     8.59      10.39     9.59      10日：2.77      2.24      1.91      0.71      16        累涨修正：37.4      净值区间：90      90      95      98      95      7
        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.49      累涨：27.04     7.65      9.29      10.10     10日：3.13      3.13      1.95      0.92      10        累涨修正：37.2      净值区间：91      91      49      71      55      8
        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：69.27     累涨：28.08     8.56      8.12      11.40     10日：2.90      2.77      1.71      0.91      15        累涨修正：37.17     净值区间：93      93      57      78      72      9
        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：9.99      累涨：26.59     7.25      9.19      10.15     10日：3.19      3.19      2.09      0.90      12        累涨修正：37.15     净值区间：88      88      48      70      54      10
        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：66.15     累涨：26.58     7.28      9.10      10.20     10日：3.20      3.20      2.03      0.85      9         累涨修正：37.04     净值区间：86      87      47      70      53      11
        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：3.65      累涨：26.40     7.53      9.33      9.54      10日：3.23      3.23      2.09      0.94      7         累涨修正：37.04     净值区间：88      88      50      72      56      12
        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：15.01     累涨：26.30     6.70      9.59      10.01     10日：3.24      3.24      2.06      0.88      8         累涨修正：36.9      净值区间：91      91      48      71      58      13
        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：17.68     累涨：26.36     7.14      9.18      10.04     10日：3.24      3.24      2.02      0.89      11        累涨修正：36.88     净值区间：90      90      47      71      54      14
        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：61.89     累涨：26.29     6.94      9.38      9.97      10日：3.17      3.17      2.00      1.04      14        累涨修正：36.63     净值区间：90      90      49      71      54      15
        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：7.75      累涨：25.94     6.94      9.11      9.89      10日：3.26      3.26      2.00      1.03      13        累涨修正：36.46     净值区间：91      91      48      71      55      16
        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：18.84     累涨：26.18     6.95      9.21      10.02     10日：3.03      3.03      1.86      1.14      18        累涨修正：35.96     净值区间：93      94      46      69      54      17
        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.75      累涨：25.87     6.91      9.04      9.92      10日：3.08      3.08      1.90      1.15      22        累涨修正：35.83     净值区间：95      95      52      73      56      18
        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：3.84      累涨：25.70     6.85      9.31      9.54      10日：3.00      3.00      1.99      0.78      24        累涨修正：35.68     净值区间：90      90      49      71      53      19
        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.46      累涨：24.96     6.73      9.53      8.70      10日：3.12      3.12      2.13      1.22      20        累涨修正：35.46     净值区间：94      94      60      79      59      20
        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.25      累涨：25.44     6.60      8.54      10.30     10日：3.04      3.04      1.88      0.92      21        累涨修正：35.28     净值区间：92      92      49      72      55      21
        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.71      累涨：25.93     7.72      7.51      10.70     10日：2.80      2.80      1.72      0.89      17        累涨修正：34.97     净值区间：92      92      52      75      65      22
        JINRONG_ZHENGQUAN.put("159940", "金融-证券             ");//金融地产ETF           市值：10.11     累涨：25.51     6.09      9.75      9.67      10日：3.34      2.57      1.62      -0.08     3         累涨修正：34.66     净值区间：85      86      79      91      91      23
        JINRONG_ZHENGQUAN.put("159933", "金融-证券             ");//国投金融地产ETF       市值：1.44      累涨：24.97     6.83      8.54      9.60      10日：3.38      2.31      1.84      0.21      1         累涨修正：34.34     净值区间：67      67      73      88      88      24
        JINRONG_ZHENGQUAN.put("159931", "金融-证券             ");//金融ETF               市值：0.58      累涨：24.42     6.78      7.47      10.17     10日：3.89      2.03      1.64      0.11      19        累涨修正：33.62     净值区间：88      89      69      85      84      25
        JINRONG_ZHENGQUAN.put("510650", "金融-证券             ");//金融地产ETF           市值：0.41      累涨：23.87     6.05      8.07      9.75      10日：3.24      1.92      1.92      0.11      8         累涨修正：32.87     净值区间：93      94      90      96      96      26
        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.85      累涨：23.44     5.47      10.50     7.47      10日：3.19      2.68      1.29      0.59      23        累涨修正：31.89     净值区间：100     100     83      95      61      27
        JINRONG_ZHENGQUAN.put("512640", "金融-证券             ");//金融地产ETF基金       市值：0.71      累涨：22.48     6.09      7.35      9.04      10日：2.82      2.08      1.69      0.17      9         累涨修正：30.76     净值区间：90      90      77      92      92      28
        JINRONG_ZHENGQUAN.put("510230", "金融-证券             ");//金融ETF               市值：48.14     累涨：21.92     5.74      6.74      9.44      10日：3.03      1.85      1.78      0.29      25        累涨修正：30.36     净值区间：90      90      88      95      95      29
    }

    public static Map<String, String> TOP_JINRONG_FANGDICHAN = new HashMap<>();//金融-地产

    static {
        TOP_JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：6.44      累涨：26.07     11.00     5.33      9.74      10日：5.78      3.57      2.79      0.15      2         累涨修正：41        净值区间：90      91      96      96      59      1
    }

    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();//金融-地产

    static {
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：6.44      累涨：26.07     11.00     5.33      9.74      10日：5.78      3.57      2.79      0.15      2         累涨修正：41        净值区间：90      91      96      96      59      1
        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.51      累涨：27.96     9.01      6.81      12.14     10日：5.98      2.74      2.15      -0.35     1         累涨修正：40.98     净值区间：69      69      71      79      87      2
        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：63.31     累涨：26.08     10.88     5.05      10.15     10日：5.70      3.31      2.72      -0.07     3         累涨修正：40.53     净值区间：86      88      94      94      57      3
        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.38      累涨：28.63     10.42     6.66      11.55     10日：5.18      2.24      1.75      0.13      4         累涨修正：39.55     净值区间：89      93      96      97      98      4
        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.08     累涨：27.49     8.90      7.10      11.49     10日：5.35      1.97      1.73      0.31      5         累涨修正：38.27     净值区间：95      96      98      98      99      5
        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF嘉实       市值：0.75      累涨：26.14     8.49      6.59      11.06     10日：5.36      2.05      1.65      0.40      6         累涨修正：36.85     净值区间：91      94      97      98      98      6
        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.50      累涨：19.26     5.71      4.51      9.04      10日：6.41      4.78      1.89      0.16      8         累涨修正：34.23     净值区间：77      86      91      91      91      7
        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.58      累涨：19.00     6.05      4.35      8.60      10日：6.12      4.64      1.89      0.31      9         累涨修正：33.54     净值区间：78      88      91      91      91      8
        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：4.95      累涨：19.50     6.25      4.57      8.68      10日：5.97      4.36      1.73      0.68      7         累涨修正：33.29     净值区间：74      86      90      90      90      9
        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：6.29      累涨：20.09     8.18      2.86      9.05      10日：5.16      2.85      2.28      0.00      10        累涨修正：32.66     净值区间：87      89      94      89      46      10
        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.87      累涨：18.91     7.52      2.75      8.64      10日：4.98      2.73      2.39      -0.17     11        累涨修正：31.4      净值区间：89      90      95      90      47      11
        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.38      累涨：17.33     6.74      4.37      6.22      10日：4.08      2.33      1.62      0.10      13        累涨修正：26.98     净值区间：72      79      82      82      87      12
        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：4.52      累涨：17.17     6.33      3.78      7.06      10日：3.93      2.77      1.33      0.56      12        累涨修正：26.53     净值区间：92      94      97      97      97      13
        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.05      累涨：16.43     6.15      3.75      6.53      10日：3.71      2.85      1.36      0.52      14        累涨修正：25.71     净值区间：92      94      97      97      97      14
        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：1.08      累涨：15.44     6.12      3.29      6.03      10日：4.38      2.18      1.74      0.43      18        累涨修正：25.48     净值区间：83      88      90      90      93      15
        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.48      累涨：15.50     5.73      3.47      6.30      10日：4.01      1.94      1.94      -0.11     20        累涨修正：25.33     净值区间：74      82      84      84      90      16
        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：0.94      累涨：16.61     6.51      3.44      6.66      10日：3.19      2.39      1.19      0.69      15        累涨修正：24.57     净值区间：92      95      97      97      97      17
        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：22.58     累涨：16.93     6.09      4.66      6.18      10日：2.80      1.67      1.02      0.92      19        累涨修正：23.44     净值区间：96      97      99      99      99      18
        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.58      累涨：16.80     6.17      6.38      4.25      10日：1.45      0.41      0.41      0.42      17        累涨修正：19.48     净值区间：83      45      45      63      81      19
        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.64      累涨：16.68     6.58      7.17      2.93      10日：0.80      0.30      0.30      0.20      16        累涨修正：18.38     净值区间：82      73      50      53      85      20
        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.63      累涨：13.97     5.64      5.66      2.67      10日：0.59      0.20      0.20      0.49      21        累涨修正：15.16     净值区间：83      71      68      64      84      21
    }

    public static Map<String, String> JINRONG_CASH = new HashMap<>();//金融-现金
    public static Map<String, String> TOP_JINRONG_CASH = new HashMap<>();

    static {
    }

    static {
        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：2.51      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        1
        JINRONG_CASH.put("563900", "金融-现金             ");//沪深300自由现金流ETF摩根市值：1.86      累涨：                                        10日：1.46      0.49      0.29      -0.10               累涨修正：          净值区间：33      11      46                      2
        JINRONG_CASH.put("563780", "金融-现金             ");//现金流全指ETF         市值：1.23      累涨：                                        10日：2.46      1.18                0.00                累涨修正：          净值区间：36      32                              3
        JINRONG_CASH.put("159221", "金融-现金             ");//现金流100ETF          市值：1.50      累涨：                                        10日：2.18      1.19      0.30      0.00                累涨修正：          净值区间：58      43                              4
        JINRONG_CASH.put("159233", "金融-现金             ");//自由现金流ETF基金     市值：6.52      累涨：                                        10日：                              -0.20               累涨修正：          净值区间：                                        5
        JINRONG_CASH.put("159232", "金融-现金             ");//现金流ETF南方         市值：6.00      累涨：                                        10日：                              -0.10               累涨修正：          净值区间：                                        6
        JINRONG_CASH.put("159229", "金融-现金             ");//自由现金流ETF广发     市值：0.68      累涨：                                        10日：3.46      1.09      0.10      -0.10               累涨修正：          净值区间：14      13                              7
        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：15.25     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        8
        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.71      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        9
        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.98      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        10
        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.24      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        11
        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.31      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        12
        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.90      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        13
        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：5.45      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        14
        JINRONG_CASH.put("561080", "金融-现金             ");//全指现金流ETF华安     市值：0.55      累涨：                                        10日：                              -0.10               累涨修正：          净值区间：                                        15
        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.20      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        16
        JINRONG_CASH.put("159225", "金融-现金             ");//现金流ETF基金         市值：0.58      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        17
        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：35.85     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        18
        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：                                        10日：                              -0.04               累涨修正：          净值区间：                                        19
        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：37.63     累涨：                                        10日：                              0.03                累涨修正：          净值区间：                                        20
        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：783.69    累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        21
        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.34      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        22
        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.40      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        23
        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.37      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        24
        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.66      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        25
        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：13.64     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        26
        JINRONG_CASH.put("159222", "金融-现金             ");//自由现金流ETF易方达   市值：5.58      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        27
        JINRONG_CASH.put("159235", "金融-现金             ");//中证现金流ETF         市值：4.37      累涨：                                        10日：                              -0.29               累涨修正：          净值区间：                                        28
        JINRONG_CASH.put("561870", "金融-现金             ");//自由现金流ETF全指     市值：1.83      累涨：                                        10日：3.03      1.37      0.20      -0.10               累涨修正：          净值区间：20      17                              29
        JINRONG_CASH.put("516460", "金融-现金             ");//现金流ETF800          市值：0.34      累涨：                                        10日：                              -0.39               累涨修正：          净值区间：                                        30
        JINRONG_CASH.put("159236", "金融-现金             ");//自由现金流ETF工银     市值：1.63      累涨：                                        10日：2.57      1.28      0.10      -0.30               累涨修正：          净值区间：15      13                              31
        JINRONG_CASH.put("563990", "金融-现金             ");//800现金流ETF          市值：1.18      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        32
        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：36.24     累涨：                                        10日：                              -0.10               累涨修正：          净值区间：                                        33
        JINRONG_CASH.put("563770", "金融-现金             ");//全指现金流ETF         市值：0.47      累涨：                                        10日：2.68      1.29                -0.10               累涨修正：          净值区间：21      17                              34
        JINRONG_CASH.put("563680", "金融-现金             ");//800自由现金流ETF      市值：0.46      累涨：                                        10日：2.36      1.08      0.10      -0.10               累涨修正：          净值区间：25      36                              35
        JINRONG_CASH.put("563830", "金融-现金             ");//全指现金流ETF基金     市值：0.95      累涨：                                        10日：          1.40      0.40      -0.30               累涨修正：          净值区间：15      17                              36
        JINRONG_CASH.put("563390", "金融-现金             ");//现金流ETF全指         市值：2.99      累涨：                                        10日：                              -0.29               累涨修正：          净值区间：                                        37
        JINRONG_CASH.put("562080", "金融-现金             ");//300现金流ETF          市值：1.73      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        38
        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：803.99    累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        39
        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.31      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        40
        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.29      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        41
        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.16      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        42
        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.35      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        43
        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.99      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        44
        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.52      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        45
        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.13      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        46
        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：11.17     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        47
        JINRONG_CASH.put("511670", "金融-现金             ");//华泰天天金ETF         市值：0.16      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        48
        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：109.89    累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        49
    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();

    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
    }

    public static Map<String, String> TOP_JINRONG = new HashMap<>();

    static {
        TOP_JINRONG.putAll(TOP_JINRONG_ZHENGQUAN);
        TOP_JINRONG.putAll(TOP_JINRONG_GOLD);
        TOP_JINRONG.putAll(TOP_JINRONG_BANK);
        TOP_JINRONG.putAll(TOP_JINRONG_FANGDICHAN);
        TOP_JINRONG.putAll(TOP_JINRONG_CASH);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }

    /**
     * TOP_BIZ
     */
    public static Map<String, String> TOP_BIZ = new HashMap<>();

    static {
        TOP_BIZ.putAll(TOP_XIAOFEI);
        TOP_BIZ.putAll(TOP_KEJI);
        TOP_BIZ.putAll(TOP_YILIAO);
        TOP_BIZ.putAll(TOP_JINRONG);
        TOP_BIZ.putAll(TOP_ZIYUAN);
    }

    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31 etf共收录：670
     * 2025-06-06 etf共收录：1068
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }

    /**
     *
     */
    public static Map<String, String> ETF_TOP_All = new HashMap<>();

    static {
        ETF_TOP_All.putAll(TOP_INDEX);
        ETF_TOP_All.putAll(TOP_BIZ);
    }


    /**
     * ETF涨幅数据：查询数据根据名称列表模糊查询
     */
    private static void findByTypeName(String date, List nameLikeList, List nameNoLikeList, String typeEn, String typeCn, Map<String, String> typeMap) {
        System.out.println("    public static Map<String, String> TOP_" + typeEn + " = new HashMap<>();//" + typeCn);
        System.out.println("    static {");
        System.out.println("    }");
        System.out.println("    public static Map<String, String> " + typeEn + " = new HashMap<>();//" + typeCn);
//        String typeEn = "";
//        String typeCn = "";
        CondEtfAdrCount condition = new CondEtfAdrCount();
        condition.setDate(date);
        condition.setOrderBy(ADR_UP_SUM_TOTAL_DESC);//ADR_UP_SUM_TOTAL_DESC  ADR_UP_SUM_1_60_DESC
        condition.setLikeNameList(nameLikeList);
        condition.setNotLikeNameList(nameNoLikeList);

//
        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
//        EtfControl.saveOrUpdateListNetLastDay(condition, date, true);//保存或更新ETF涨幅次数-批量更新基础信息

        if (etfListLikeName == null) {
            System.out.println("数据为null");
        }
        int num = 0;//序号
        etfListLikeName = etfListLikeName.stream().filter(e -> e != null).sorted(Comparator.comparing(EtfAdrCountVo::getADR_UP_SUM_TOTAL, Comparator.nullsFirst(BigDecimal::compareTo)).reversed()).collect(Collectors.toList());

        System.out.println("    static {");
        for (EtfAdrCountVo vo : etfListLikeName) {
            StringBuffer sb = new StringBuffer();

            sb.append("        ");
            sb.append(typeEn + ".put(\"").append(StockUtil.formatStName(vo.getF12(), SIZE_6)).append("\"");
            sb.append(", \"" + StockUtil.formatStName(typeCn, SIZE_22) + "\");");
//            sb.append(", \"" + StockUtil.formatStName(vo.getF14(), SIZE_22) + "\");");
            sb.append("//");
            sb.append(StockUtil.formatStName(vo.getF14(), SIZE_22));
            sb.append(StockUtil.formatStName("市值：", SIZE_6));
            BigDecimal marketValue = null;
            if (vo.getF20() != null) {
                marketValue = vo.getF20().divide(NUM_YI_1, 2, BigDecimal.ROUND_HALF_UP);
            }
            sb.append(StockUtil.formatDouble(marketValue, SIZE_10));
            sb.append(StockUtil.formatStName("累涨：", SIZE_6));
            if (vo.getADR_UP_SUM_1_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_40_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_40_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_20_40() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_20_40().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_20() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_20().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatStName("10日：", SIZE_6));
            if (vo.getADR_UP_SUM_1_10() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_10().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_5() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_5().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_3() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_3().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getF3() != null) {
                sb.append(StockUtil.formatDouble(vo.getF3().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_ORDER_STAT(), SIZE_10));
            sb.append(StockUtil.formatStName("累涨修正：", SIZE_10));
//            sb.append(StockUtil.formatDouble(vo.getAdrUpSum_60_and_10c6(), SIZE_10));
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_TOTAL(), SIZE_10));

            sb.append(StockUtil.formatStName("净值区间：", SIZE_10));
            BigDecimal curArea = vo.getNET_AREA_DAY_5();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_10();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_20();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_40();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_60();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }

            sb.append(StockUtil.formatInt(++num, SIZE_6));


            System.out.println(sb);
        }
        System.out.println("    }");


    }

    public static void main(String[] args) {
//        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
        String date = "2025-07-17";

        //////        //etf头部数据
//        List<String> zqdmList = new ArrayList<>(ContMapEtfAll.TOP_XIAOFEI.keySet());
//        int count = 0;
//        for (String zqdm : zqdmList) {
//            System.out.println(++count + ":" + zqdm + ":" + ETF_All.get(zqdm));
//        }

        String name = "";
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT, null, "INDEX_CN_NOT", ContEtfTypeName.INDEX_CN_NOT, ContMapEtfAll.INDEX_CN_NOT);//指数-外盘
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT_USA,  ContEtfNameKey.INDEX_CN_NOT_USA_NOLIKE, "INDEX_CN_NOT_USA", ContEtfTypeName.INDEX_CN_NOT_USA, ContMapEtfAll.INDEX_CN_NOT_USA);//指数-外盘-美股
//        name = "INDEX_CN_1000";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-中小盘");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_1000, ContEtfNameKey.INDEX_CN_1000_NOLIKE, name, ContEtfTypeName.INDEX_CN_1000, ContMapEtfAll.INDEX_CN_1000);
//        findByTypeName(date, ContEtfNameKey.INDEX_300, ContEtfNameKey.INDEX_300_NOLIKE, "INDEX_300", ContEtfTypeName.INDEX_300, ContMapEtfAll.INDEX_300);//指数-创业板
//        findByTypeName(date, ContEtfNameKey.INDEX_688, ContEtfNameKey.INDEX_688_NOLIKE, "INDEX_688", ContEtfTypeName.INDEX_688, ContMapEtfAll.INDEX_688);//指数-科创板
//        name = "INDEX_CN_BIG";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-大盘");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_BIG, ContEtfNameKey.INDEX_CN_BIG_NOLIKE, name, ContEtfTypeName.INDEX_CN_BIG, ContMapEtfAll.INDEX_CN_BIG);


//        name = "ZIYUAN_OIL";
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();//资源-石油");
//        System.out.println("    static {");
//        System.out.println("    }");
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//资源-石油");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_OIL, null, name, ContEtfTypeName.ZIYUAN_OIL, ContMapEtfAll.ZIYUAN_OIL);//资源-石油

//        name = "ZIYUAN_XIYOU";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_XIYOU, null, name, ContEtfTypeName.ZIYUAN_XIYOU, ContMapEtfAll.ZIYUAN_XIYOU);
//        name = "ZIYUAN_COMMON";
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_COMMON, ContEtfNameKey.ZIYUAN_COMMON_NOLIKE, name, ContEtfTypeName.ZIYUAN_COMMON, ContMapEtfAll.ZIYUAN_COMMON);
        //        name = "ZIYUAN_NONGYE";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_NONGYE, null, name, ContEtfTypeName.ZIYUAN_NONGYE, ContMapEtfAll.ZIYUAN_NONGYE);
//        findByTypeName(date, ContEtfNameKey.ZIYUAN, ContEtfNameKey.ZIYUAN_NOLIKE, "ZIYUAN", ContEtfTypeName.ZIYUAN_STR, ContMapEtfAll.ZIYUAN);


//        String name = "YILIAO_COMMON";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//医疗");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.YILIAO_COMMON, null, name, ContEtfTypeName.YILIAO_COMMON, ContMapEtfAll.YILIAO_COMMON);

//        findByTypeName(date, ContEtfNameKey.JINRONG_GOLD, ContEtfNameKey.JINRONG_GOLD_NOLIKE, "JINRONG_GOLD", ContEtfTypeName.JINRONG_GOLD, ContMapEtfAll.JINRONG_GOLD);
//        findByTypeName(date, ContEtfNameKey.JINRONG_BANK, null, "JINRONG_BANK", ContEtfTypeName.JINRONG_BANK, ContMapEtfAll.JINRONG_BANK);//金融-银行
//        System.out.println("    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_ZHENGQUAN = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_ZHENGQUAN,  ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE, "JINRONG_ZHENGQUAN", ContEtfTypeName.JINRONG_ZHENGQUAN, ContMapEtfAll.JINRONG_ZHENGQUAN);
//        name = "JINRONG_FANGDICHAN";
//        System.out.println("    public static Map<String, String> TOP_JINRONG_FANGDICHAN = new HashMap<>();//金融-地产");
//        System.out.println("    static {");
//        System.out.println("    }");
//        System.out.println("    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();//金融-地产");
//        findByTypeName(date, ContEtfNameKey.JINRONG_FANGDICHAN, null, name, ContEtfTypeName.JINRONG_FANGDICHAN, ContMapEtfAll.JINRONG_FANGDICHAN);
//        System.out.println("    public static Map<String, String> JINRONG_CASH = new HashMap<>();//金融-现金");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_CASH = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_CASH,  null, "JINRONG_CASH", ContEtfTypeName.JINRONG_CASH, ContMapEtfAll.JINRONG_CASH);

//        System.out.println("    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_COMMON, ContEtfNameKey.XIAOFEI_COMMON_NOLIKE, "XIAOFEI_COMMON", ContEtfTypeName.XIAOFEI_COMMON, ContMapEtfAll.XIAOFEI_COMMON);
//        name = "XIAOFEI_MEDIA";
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();//消费-文娱传媒");
//        System.out.println("    static {");
//        System.out.println("    }");
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//消费-文娱传媒");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_MEDIA, null, name, ContEtfTypeName.XIAOFEI_MEDIA, ContMapEtfAll.XIAOFEI_MEDIA);
//        name = "XIAOFEI_WINE";
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();//消费-吃喝玩乐");
//        System.out.println("    static {");
//        System.out.println("    }");
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//消费-吃喝玩乐");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_WINE, null, name, ContEtfTypeName.XIAOFEI_WINE, ContMapEtfAll.XIAOFEI_WINE);



        findByTypeName(date, ContEtfNameKey.KEJI_HK, null, "KEJI_HK", ContEtfTypeName.KEJI_HK, ContMapEtfAll.KEJI_HK);//科技-香港
//        findByTypeName(date, ContEtfNameKey.KEJI_JUNGONG, null, "KEJI_JUNGONG", ContEtfTypeName.KEJI_JUNGONG, ContMapEtfAll.KEJI_JUNGONG);//科技-军工
//        findByTypeName(date, ContEtfNameKey.KEJI_GONG_YE, ContEtfNameKey.KEJI_GONG_YE_NOLIKE, "KEJI_GONG_YE", ContEtfTypeName.KEJI_GONG_YE, ContMapEtfAll.KEJI_GONG_YE);
//        findByTypeName(date, ContEtfNameKey.KEJI_RUAN_JIAN, null, "KEJI_RUAN_JIAN", ContEtfTypeName.KEJI_RUAN_JIAN, ContMapEtfAll.KEJI_RUAN_JIAN);
//        findByTypeName(date, ContEtfNameKey.KEJI_XIN_PIAN, null, "KEJI_XIN_PIAN", ContEtfTypeName.KEJI_XIN_PIAN, ContMapEtfAll.KEJI_XIN_PIAN);
//        findByTypeName(date, ContEtfNameKey.KEJI_TONG_XIN, null, "KEJI_TONG_XIN", ContEtfTypeName.KEJI_TONG_XIN, ContMapEtfAll.KEJI_TONG_XIN);
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_ENERGY, null, "KEJI_NEW_ENERGY", ContEtfTypeName.KEJI_NEW_ENERGY, ContMapEtfAll.KEJI_NEW_ENERGY);
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_CAR, null, "KEJI_NEW_CAR", ContEtfTypeName.KEJI_NEW_CAR, ContMapEtfAll.KEJI_NEW_CAR);//科技-汽车
    }
}
