package utils;

import java.util.HashMap;
import java.util.Map;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {

    /**
     * 指数-香港指数
     */
    public static Map<String, String> YILIAO = new HashMap<>();//指数-科创板
    static {
        YILIAO.put("159892", "医疗                  ");//恒生医药ETF           市值：45.37     累涨：43.32     5.92      13.41     24.59     13.50     3.20      1
        YILIAO.put("159567", "医疗                  ");//港股创新药ETF         市值：4.92      累涨：42.73     5.83      14.10     24.22     12.82     2.82      2
        YILIAO.put("520500", "医疗                  ");//恒生创新药ETF         市值：1.77      累涨：41.33     0.71      16.01     25.29     12.78     2.21      3
        YILIAO.put("159570", "医疗                  ");//港股通创新药ETF       市值：14.60     累涨：45.78     6.44      15.87     24.88     12.54     2.69      4
        YILIAO.put("513780", "医疗                  ");//港股创新药50ETF       市值：1.68      累涨：44.56     6.82      14.86     23.50     11.72     2.34      5
        YILIAO.put("513200", "医疗                  ");//港股通医药ETF         市值：31.90     累涨：44.02     5.65      14.85     24.23     11.66     3.41      6
        YILIAO.put("513700", "医疗                  ");//香港医药ETF           市值：9.27      累涨：43.09     5.06      14.59     23.44     11.41     3.79      7
        YILIAO.put("520700", "医疗                  ");//港股创新药ETF基金     市值：0.89      累涨：43.26     5.29      12.91     25.17     11.41     2.14      8
        YILIAO.put("159776", "医疗                  ");//港股通医药ETF         市值：1.27      累涨：41.52     5.27      13.73     23.02     11.38     3.45      9
        YILIAO.put("159718", "医疗                  ");//港股医药ETF           市值：2.25      累涨：41.89     5.56      13.48     23.35     11.24     3.57      10
        YILIAO.put("513120", "医疗                  ");//港股创新药ETF         市值：134.75    累涨：42.52     6.61      14.32     22.39     10.25     1.91      11
        YILIAO.put("588860", "医疗                  ");//科创医药ETF           市值：5.29      累涨：34.29     4.14      10.58     20.75     10.16     3.40      12
        YILIAO.put("517120", "医疗                  ");//创新药ETF华泰柏瑞     市值：3.22      累涨：35.97     6.21      13.14     17.22     9.10      1.90      13
        YILIAO.put("588700", "医疗                  ");//科创医药指数ETF       市值：3.62      累涨：33.16     4.34      11.02     19.12     9.08      2.90      14
        YILIAO.put("517110", "医疗                  ");//创新药沪深港ETF       市值：2.80      累涨：34.10     4.94      12.66     16.88     8.43      1.98      15
        YILIAO.put("517380", "医疗                  ");//创新药沪港深ETF       市值：2.37      累涨：32.28     5.26      11.14     16.07     8.23      1.43      16
        YILIAO.put("159622", "医疗                  ");//创新药ETF沪港深       市值：2.04      累涨：36.58     6.94      13.58     16.82     8.21      1.43      17
        YILIAO.put("159992", "医疗                  ");//创新药ETF             市值：120.86    累涨：27.67     4.38      9.56      14.75     7.84      2.38      18
        YILIAO.put("159748", "医疗                  ");//创新药ETF富国         市值：2.44      累涨：34.49     5.26      13.01     17.31     7.84      1.54      19
        YILIAO.put("516080", "医疗                  ");//创新药ETF易方达       市值：4.20      累涨：26.95     3.92      9.88      14.09     7.38      1.80      20
        YILIAO.put("516060", "医疗                  ");//创新药产业ETF         市值：1.20      累涨：27.85     3.98      10.89     13.83     7.33      2.45      21
        YILIAO.put("515120", "医疗                  ");//创新药ETF             市值：38.28     累涨：27.66     4.59      9.82      14.22     7.30      2.06      22
        YILIAO.put("159858", "医疗                  ");//创新药ETF南方         市值：2.29      累涨：28.07     5.42      9.14      14.25     7.29      2.14      23
        YILIAO.put("159835", "医疗                  ");//创新药50ETF           市值：1.22      累涨：26.70     4.40      9.22      13.83     7.18      2.16      24
        YILIAO.put("517990", "医疗                  ");//医药ETF沪港深         市值：0.38      累涨：27.68     4.11      10.61     14.46     6.70      1.43      25
        YILIAO.put("159859", "医疗                  ");//生物医药ETF           市值：33.25     累涨：29.47     4.69      10.15     15.76     6.30      2.78      26
        YILIAO.put("512120", "医疗                  ");//医药50ETF             市值：3.50      累涨：23.82     4.26      8.45      11.86     6.14      2.72      27
        YILIAO.put("560900", "医疗                  ");//创新药企ETF           市值：0.37      累涨：26.80     4.99      9.31      13.45     6.10      1.95      28
        YILIAO.put("512010", "医疗                  ");//医药ETF               市值：226.13    累涨：26.14     5.08      8.77      13.72     5.82      2.25      29
        YILIAO.put("512290", "医疗                  ");//生物医药ETF           市值：38.52     累涨：30.65     5.22      11.63     15.70     5.75      2.70      30
        YILIAO.put("159508", "医疗                  ");//生物医药ETF基金       市值：0.43      累涨：27.86     4.76      9.40      14.91     5.62      2.65      31
        YILIAO.put("159938", "医疗                  ");//医药卫生ETF           市值：47.69     累涨：23.81     4.75      8.25      12.16     5.21      2.62      32
        YILIAO.put("159838", "医疗                  ");//医药50ETF             市值：2.17      累涨：24.97     5.54      8.48      12.28     5.16      2.24      33
        YILIAO.put("510660", "医疗                  ");//医药卫生ETF           市值：0.91      累涨：23.50     4.49      8.56      11.42     4.94      2.02      34
        YILIAO.put("515960", "医疗                  ");//医药健康ETF           市值：2.28      累涨：23.39     5.08      8.34      11.10     4.83      1.81      35
        YILIAO.put("159929", "医疗                  ");//医药ETF               市值：22.14     累涨：24.80     4.88      8.51      12.87     4.80      2.23      36
        YILIAO.put("515950", "医疗                  ");//医药龙头ETF           市值：6.68      累涨：23.43     5.08      8.41      11.62     4.42      1.76      37    
    }
    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板
    static {
        INDEX_688.put("588780", "指数-科创板           ");//科创芯片设计ETF       市值：1.98      累涨：60.76     3.40      26.55     31.40     22.03     7.89      1
        INDEX_688.put("588760", "指数-科创板           ");//人工智能ETF科创       市值：10.82     累涨：43.02               13.05     31.75     19.45     9.31      2
        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：18.08     累涨：55.29               25.42     31.80     19.28     9.23      3
        INDEX_688.put("588930", "指数-科创板           ");//科创板人工智能ETF     市值：5.97      累涨：52.01               23.18     30.11     18.76     9.25      4
        INDEX_688.put("588990", "指数-科创板           ");//科创芯片ETF博时       市值：2.25      累涨：62.59     16.13     19.31     27.53     18.54     7.05      5
        INDEX_688.put("588890", "指数-科创板           ");//科创芯片ETF南方       市值：4.99      累涨：63.15     15.73     20.24     27.65     18.44     7.34      6
        INDEX_688.put("588730", "指数-科创板           ");//科创人工智能ETF       市值：3.60      累涨：40.15               12.52     29.65     18.15     8.88      7
        INDEX_688.put("588290", "指数-科创板           ");//科创芯片ETF基金       市值：24.86     累涨：62.47     15.61     19.83     27.50     17.80     6.98      8
        INDEX_688.put("588200", "指数-科创板           ");//科创芯片ETF           市值：225.55    累涨：63.38     15.98     20.20     27.66     17.79     6.94      9
        INDEX_688.put("588750", "指数-科创板           ");//科创芯片50ETF         市值：12.78     累涨：49.28     1.67      21.07     26.74     17.52     6.42      10
        INDEX_688.put("588810", "指数-科创板           ");//科创芯片ETF富国       市值：0.72      累涨：56.65               14.34     42.78     16.69     6.00      11
        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.48      累涨：56.92     13.55     19.27     24.55     15.79     6.17      12
        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：3.10      累涨：57.23     13.35     19.79     24.38     15.56     6.47      13
        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：1.29      累涨：27.91               6.00      22.68     14.73     5.16      14
        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.32      累涨：49.33     10.00     16.05     24.28     14.70     5.94      15
        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.89      累涨：46.82     9.59      15.45     22.49     14.63     5.56      16
        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：607.02    累涨：47.59     10.10     15.03     23.23     14.59     5.62      17
        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：5.98      累涨：49.39     11.49     16.85     21.57     14.56     6.18      18
        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：130.93    累涨：47.65     9.89      15.58     23.05     14.54     5.60      19
        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：2.22      累涨：28.32               6.59      22.31     14.45     5.24      20
        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：45.99     累涨：46.64     9.66      15.05     22.70     14.41     5.59      21
        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：58.93     累涨：46.96     10.24     15.02     22.48     14.32     5.39      22
        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.38      累涨：46.39     9.89      14.67     22.79     14.21     5.28      23
        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：34.68     累涨：45.31     9.03      15.16     21.89     14.13     5.17      24
        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：807.24    累涨：47.44     10.31     15.37     22.60     14.03     5.47      25
        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：2.94      累涨：52.82     13.30     19.73     20.57     12.67     4.67      26
        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：2.21      累涨：52.88     12.57     20.23     20.43     12.62     4.35      27
        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.41      累涨：50.53     12.41     18.94     19.68     12.37     3.97      28
        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：0.98      累涨：44.22     9.88      14.52     20.66     12.34     4.75      29
        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.81      累涨：34.11     4.48      14.86     17.95     11.52     3.60      30
        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.30      累涨：12.97                         12.97     11.36     3.64      31
        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：2.99      累涨：50.22     11.40     18.95     21.02     11.30     5.63      32
        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.72      累涨：50.43     11.04     19.34     21.03     11.04     5.24      33
        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：2.89      累涨：50.54     11.04     19.23     21.13     11.02     5.38      34
        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：74.84     累涨：51.35     11.62     19.53     21.36     10.96     5.16      35
        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：43.77     累涨：50.51     10.99     19.96     20.61     10.91     5.28      36
        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.53      累涨：52.33     11.53     21.30     20.30     10.83     5.74      37
        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.34      累涨：42.70               21.20     22.79     10.71     5.50      38
        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：57.84     累涨：50.33     11.25     19.60     20.63     10.66     5.06      39
        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：37.48     累涨：50.34     11.22     19.71     20.60     10.62     5.03      40
        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：11.27     累涨：49.70     10.94     19.53     20.28     10.43     4.95      41
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.66      累涨：46.55     2.93      22.83     22.36     10.24     5.41      42
        INDEX_688.put("588860", "指数-科创板           ");//科创医药ETF           市值：5.29      累涨：34.29     4.14      10.58     20.75     10.16     3.40      43
        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：24.60     累涨：38.72     8.46      13.72     18.49     10.00     3.31      44
        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.44      累涨：50.04     11.30     19.65     20.12     9.62      4.73      45
        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：15.87     累涨：37.68     8.44      13.30     17.66     9.31      3.30      46
        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.72      累涨：38.54     8.40      14.22     17.89     9.28      2.99      47
        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：91.63     累涨：38.60     8.96      13.77     17.65     9.21      3.43      48
        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.52      累涨：36.08     5.28      14.36     18.00     9.18      3.19      49
        INDEX_688.put("588700", "指数-科创板           ");//科创医药指数ETF       市值：3.62      累涨：33.16     4.34      11.02     19.12     9.08      2.90      50
        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：48.38     累涨：36.30     7.99      13.62     16.45     8.97      3.06      51
        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：43.72     累涨：38.46     8.35      14.38     17.50     8.96      3.05      52
        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：18.56     累涨：37.64     8.29      13.84     17.58     8.90      2.81      53
        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.98      累涨：36.83     6.66      14.54     17.39     8.82      3.23      54
        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：25.12     累涨：37.32     8.17      13.89     16.99     8.79      3.00      55
        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.76      累涨：38.75     8.51      14.54     17.63     8.76      3.09      56
        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.60      累涨：36.08     8.26      13.34     16.10     8.74      2.82      57
        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：12.01     累涨：36.75     8.06      13.82     16.61     8.70      3.03      58
        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.89      累涨：35.66     8.18      12.58     16.85     8.63      2.89      59
        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：18.49     累涨：36.21     8.09      13.17     16.70     8.57      2.87      60
        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.28      累涨：36.00     8.53      13.21     15.81     8.06      2.76      61
        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：2.66      累涨：29.12     6.54      9.98      13.71     7.82      4.08      62
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：1.30      累涨：6.80                          6.80      6.80      5.25      63
        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：12.33     累涨：4.76                          4.76      4.76      4.76      64
        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：9.44      累涨：4.26                          4.26      4.26      4.26      65
        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：10.16     累涨：4.24                          4.24      4.24      4.24      66
        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：6.26      累涨：2.90                          2.90      2.90      2.90      67
        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：8.90      累涨：2.80                          2.80      2.80      2.80      68
        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：9.87      累涨：2.70                          2.70      2.70      2.70      69
        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：6.76      累涨：2.70                          2.70      2.70      2.70      70
        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：10.82     累涨：2.54                          2.54      2.54      2.54      71
        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：10.74     累涨：2.51                          2.51      2.51      2.51      72
        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：5.57      累涨：2.39                          2.39      2.39      2.39      73
        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：15.50     累涨：2.31                          2.31      2.31      2.31      74
        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：15.28     累涨：2.31                          2.31      2.31      2.31      75
        INDEX_688.put("589600", "指数-科创板           ");//N科创综指ETF富国      市值：18.60     累涨：                                                            76
    }
    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股
    static {
        INDEX_HK.put("159792", "指数-港股             ");//港股通互联网ETF       市值：388.73    累涨：72.87     10.36     23.70     41.42     22.65     11.10     1
        INDEX_HK.put("159568", "指数-港股             ");//港股互联网ETF         市值：3.74      累涨：74.28     11.36     23.39     41.80     22.22     11.44     2
        INDEX_HK.put("159688", "指数-港股             ");//恒生互联网ETF         市值：5.89      累涨：66.05     9.77      21.96     36.55     22.14     11.87     3
        INDEX_HK.put("513330", "指数-港股             ");//恒生互联网ETF         市值：246.47    累涨：65.95     9.04      21.85     37.02     22.14     11.71     4
        INDEX_HK.put("513040", "指数-港股             ");//港股通互联网ETF       市值：4.89      累涨：72.96     10.32     24.65     40.48     21.95     11.16     5
        INDEX_HK.put("513160", "指数-港股             ");//港股科技30ETF         市值：10.13     累涨：76.30     11.73     28.61     37.07     21.62     11.26     6
        INDEX_HK.put("159750", "指数-港股             ");//港股科技50ETF         市值：4.88      累涨：68.01     9.45      24.85     35.81     21.34     7.75      7
        INDEX_HK.put("513770", "指数-港股             ");//港股互联网ETF         市值：43.02     累涨：72.90     9.75      24.98     40.74     21.21     11.27     8
        INDEX_HK.put("159741", "指数-港股             ");//恒生科技ETF基金       市值：6.38      累涨：67.91     10.33     25.03     34.62     20.41     9.31      9
        INDEX_HK.put("513130", "指数-港股             ");//恒生科技ETF           市值：242.05    累涨：68.21     10.66     25.25     34.37     20.24     9.36      10
        INDEX_HK.put("159740", "指数-港股             ");//恒生科技ETF           市值：56.29     累涨：66.29     9.85      24.68     34.28     20.04     9.06      11
        INDEX_HK.put("513380", "指数-港股             ");//恒生科技ETF龙头       市值：35.84     累涨：68.23     10.54     25.85     34.48     19.95     9.03      12
        INDEX_HK.put("513580", "指数-港股             ");//恒生科技ETF指数基金   市值：21.59     累涨：68.06     11.15     25.33     33.90     19.82     9.04      13
        INDEX_HK.put("159636", "指数-港股             ");//港股通科技30ETF       市值：156.13    累涨：68.76     11.50     23.98     35.71     19.74     8.64      14
        INDEX_HK.put("513180", "指数-港股             ");//恒生科技指数ETF       市值：262.81    累涨：68.06     11.12     25.38     33.87     19.54     8.76      15
        INDEX_HK.put("513010", "指数-港股             ");//恒生科技ETF易方达     市值：102.71    累涨：66.65     10.37     25.09     33.59     19.45     8.94      16
        INDEX_HK.put("159742", "指数-港股             ");//恒生科技指数ETF       市值：15.54     累涨：66.41     10.33     25.18     33.34     19.39     8.83      17
        INDEX_HK.put("513260", "指数-港股             ");//恒生科技ETF基金       市值：27.00     累涨：67.84     11.29     25.48     33.49     19.38     8.96      18
        INDEX_HK.put("513890", "指数-港股             ");//恒生科技HKETF         市值：3.73      累涨：66.33     10.37     24.98     33.80     19.05     8.49      19
        INDEX_HK.put("513980", "指数-港股             ");//港股科技50ETF         市值：102.16    累涨：69.55     10.37     26.64     35.12     18.68     7.13      20
        INDEX_HK.put("159735", "指数-港股             ");//港股消费ETF           市值：5.31      累涨：63.13     11.15     20.18     34.59     18.26     7.77      21
        INDEX_HK.put("513860", "指数-港股             ");//港股通科技ETF         市值：12.63     累涨：68.27     10.36     26.06     34.92     18.03     7.45      22
        INDEX_HK.put("513150", "指数-港股             ");//港股通科技ETF华泰柏瑞 市值：1.72      累涨：69.95     11.65     27.19     33.93     17.94     7.16      23
        INDEX_HK.put("513230", "指数-港股             ");//港股消费ETF           市值：2.72      累涨：60.27     10.31     19.88     33.10     17.69     7.02      24
        INDEX_HK.put("520600", "指数-港股             ");//港股汽车ETF           市值：6.77      累涨：57.45               31.08     36.38     17.60     5.33      25
        INDEX_HK.put("513070", "指数-港股             ");//港股消费ETF易方达     市值：3.16      累涨：60.45     11.54     19.98     32.02     17.21     6.66      26
        INDEX_HK.put("513020", "指数-港股             ");//港股科技ETF           市值：5.46      累涨：68.69     10.31     26.92     34.26     17.15     7.09      27
        INDEX_HK.put("159751", "指数-港股             ");//港股科技ETF           市值：4.91      累涨：65.71     9.62      25.73     33.25     16.82     6.58      28
        INDEX_HK.put("513320", "指数-港股             ");//恒生新经济ETF         市值：2.66      累涨：64.04     10.25     24.66     32.73     16.41     6.43      29
        INDEX_HK.put("159323", "指数-港股             ");//港股通汽车ETF         市值：1.69      累涨：46.70               22.44     28.09     16.07     4.47      30
        INDEX_HK.put("513900", "指数-港股             ");//港股通100ETF          市值：1.59      累涨：47.72     7.68      14.15     27.64     15.84     6.93      31
        INDEX_HK.put("159788", "指数-港股             ");//港股通100ETF          市值：1.04      累涨：47.56     8.17      15.22     26.12     15.38     6.82      32
        INDEX_HK.put("513750", "指数-港股             ");//港股非银ETF           市值：10.43     累涨：45.21     10.38     12.58     23.54     15.15     6.23      33
        INDEX_HK.put("513550", "指数-港股             ");//港股通50ETF           市值：28.69     累涨：45.93     8.65      13.20     25.25     14.31     6.02      34
        INDEX_HK.put("159850", "指数-港股             ");//恒生国企ETF           市值：9.97      累涨：49.30     11.06     15.32     24.58     13.70     5.48      35
        INDEX_HK.put("159892", "指数-港股             ");//恒生医药ETF           市值：45.37     累涨：43.32     5.92      13.41     24.59     13.50     3.20      36
        INDEX_HK.put("513600", "指数-港股             ");//恒生指数ETF           市值：14.03     累涨：45.35     9.03      13.79     24.12     13.48     5.96      37
        INDEX_HK.put("513660", "指数-港股             ");//恒生ETF               市值：43.79     累涨：44.67     9.15      13.35     23.65     13.47     5.76      38
        INDEX_HK.put("159318", "指数-港股             ");//恒生港股通ETF         市值：0.59      累涨：44.57     8.25      14.12     23.75     13.32     5.58      39
        INDEX_HK.put("513990", "指数-港股             ");//港股通ETF             市值：0.91      累涨：44.87     7.10      14.56     24.58     13.27     5.71      40
        INDEX_HK.put("159920", "指数-港股             ");//恒生ETF               市值：179.03    累涨：43.68     8.79      12.84     23.61     13.21     5.69      41
        INDEX_HK.put("510900", "指数-港股             ");//H股ETF                市值：105.33    累涨：47.93     10.39     15.06     24.08     13.17     5.47      42
        INDEX_HK.put("513210", "指数-港股             ");//恒生ETF易方达         市值：0.58      累涨：44.26     8.83      13.33     23.33     13.17     5.69      43
        INDEX_HK.put("159954", "指数-港股             ");//H股ETF                市值：4.39      累涨：48.78     10.32     15.57     24.59     12.99     5.55      44
        INDEX_HK.put("159312", "指数-港股             ");//恒生ETF港股通         市值：0.59      累涨：43.03     8.53      12.45     23.70     12.97     5.28      45
        INDEX_HK.put("159567", "指数-港股             ");//港股创新药ETF         市值：4.92      累涨：42.73     5.83      14.10     24.22     12.82     2.82      46
        INDEX_HK.put("520500", "指数-港股             ");//恒生创新药ETF         市值：1.77      累涨：41.33     0.71      16.01     25.29     12.78     2.21      47
        INDEX_HK.put("159570", "指数-港股             ");//港股通创新药ETF       市值：14.60     累涨：45.78     6.44      15.87     24.88     12.54     2.69      48
        INDEX_HK.put("159712", "指数-港股             ");//港股通50ETF           市值：0.61      累涨：47.94     8.64      12.50     28.62     12.53     5.18      49
        INDEX_HK.put("159960", "指数-港股             ");//恒生中国企业ETF       市值：5.88      累涨：44.05     9.49      13.46     22.86     12.35     5.57      50
        INDEX_HK.put("159711", "指数-港股             ");//港股通ETF             市值：0.64      累涨：44.01     9.31      13.15     23.26     12.26     5.21      51
        INDEX_HK.put("159506", "指数-港股             ");//恒生医疗ETF           市值：8.33      累涨：45.39     5.79      15.22     24.85     12.09     3.94      52
        INDEX_HK.put("513780", "指数-港股             ");//港股创新药50ETF       市值：1.68      累涨：44.56     6.82      14.86     23.50     11.72     2.34      53
        INDEX_HK.put("513200", "指数-港股             ");//港股通医药ETF         市值：31.90     累涨：44.02     5.65      14.85     24.23     11.66     3.41      54
        INDEX_HK.put("520520", "指数-港股             ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：37.62     11.39     10.66     16.86     11.44     4.71      55
        INDEX_HK.put("520700", "指数-港股             ");//港股创新药ETF基金     市值：0.89      累涨：43.26     5.29      12.91     25.17     11.41     2.14      56
        INDEX_HK.put("159776", "指数-港股             ");//港股通医药ETF         市值：1.27      累涨：41.52     5.27      13.73     23.02     11.38     3.45      57
        INDEX_HK.put("159303", "指数-港股             ");//恒生医疗ETF基金       市值：0.86      累涨：44.86     5.24      15.55     24.07     11.35     3.71      58
        INDEX_HK.put("159718", "指数-港股             ");//港股医药ETF           市值：2.25      累涨：41.89     5.56      13.48     23.35     11.24     3.57      59
        INDEX_HK.put("513060", "指数-港股             ");//恒生医疗ETF           市值：152.92    累涨：42.30     5.85      12.75     23.95     11.17     3.57      60
        INDEX_HK.put("513280", "指数-港股             ");//恒生生物科技ETF       市值：2.17      累涨：43.03     6.21      15.00     22.52     11.11     2.77      61
        INDEX_HK.put("159615", "指数-港股             ");//恒生生物科技ETF       市值：3.64      累涨：41.64     5.80      13.57     22.96     10.91     2.71      62
        INDEX_HK.put("513970", "指数-港股             ");//恒生消费ETF           市值：6.26      累涨：35.38     10.17     11.23     14.68     10.76     4.60      63
        INDEX_HK.put("513120", "指数-港股             ");//港股创新药ETF         市值：134.75    累涨：42.52     6.61      14.32     22.39     10.25     1.91      64
        INDEX_HK.put("159557", "指数-港股             ");//恒生医疗指数ETF       市值：2.35      累涨：42.60     7.20      13.89     21.51     10.09     3.24      65
        INDEX_HK.put("513140", "指数-港股             ");//港股金融ETF           市值：0.78      累涨：34.21     9.40      9.17      16.14     9.65      4.46      66
        INDEX_HK.put("159699", "指数-港股             ");//恒生消费ETF           市值：8.32      累涨：35.28     10.70     11.56     13.97     9.03      2.76      67
        INDEX_HK.put("513190", "指数-港股             ");//港股通金融ETF         市值：5.00      累涨：36.39     11.52     10.63     14.24     8.36      3.65      68
        INDEX_HK.put("513170", "指数-港股             ");//恒生央企ETF           市值：4.50      累涨：31.61     9.99      7.94      14.00     8.00      2.85      69
        INDEX_HK.put("159726", "指数-港股             ");//恒生红利ETF           市值：5.74      累涨：28.79     9.66      6.42      13.28     7.84      3.64      70
        INDEX_HK.put("513690", "指数-港股             ");//港股红利ETF博时       市值：36.67     累涨：27.35     10.36     5.45      11.54     7.13      2.94      71
        INDEX_HK.put("520550", "指数-港股             ");//港股红利低波ETF       市值：1.86      累涨：13.09               3.03      10.06     6.69      3.18      72
        INDEX_HK.put("513920", "指数-港股             ");//港股通央企红利ETF     市值：33.10     累涨：30.14     11.07     7.90      11.85     6.55      2.41      73
        INDEX_HK.put("513950", "指数-港股             ");//恒生红利ETF           市值：10.65     累涨：26.42     10.18     5.72      10.61     6.38      2.73      74
        INDEX_HK.put("159519", "指数-港股             ");//港股国企ETF           市值：2.00      累涨：31.17     11.92     7.71      11.54     6.29      2.79      75
        INDEX_HK.put("159545", "指数-港股             ");//恒生红利低波ETF       市值：8.70      累涨：25.33     8.78      6.66      9.97      6.13      2.68      76
        INDEX_HK.put("520890", "指数-港股             ");//港股通红利低波ETF     市值：0.72      累涨：38.16     21.58     6.92      9.83      6.12      2.72      77
        INDEX_HK.put("513810", "指数-港股             ");//港股国企ETF           市值：0.48      累涨：31.01     11.58     7.58      11.85     6.02      2.30      78
        INDEX_HK.put("513910", "指数-港股             ");//港股央企红利ETF       市值：25.97     累涨：29.85     13.67     7.00      9.80      5.84      2.48      79
        INDEX_HK.put("513630", "指数-港股             ");//港股红利指数ETF       市值：91.82     累涨：24.69     8.60      6.44      9.65      5.67      2.91      80
        INDEX_HK.put("159333", "指数-港股             ");//港股央企红利ETF       市值：4.88      累涨：39.17     24.09     6.35      8.82      4.75      1.67      81
        INDEX_HK.put("159569", "指数-港股             ");//港股红利低波ETF       市值：1.46      累涨：26.56     14.30     5.16      7.10      4.40      2.69      82
        INDEX_HK.put("513530", "指数-港股             ");//港股通红利ETF         市值：14.51     累涨：24.66     11.77     5.05      7.84      4.01      2.00      83
        INDEX_HK.put("159302", "指数-港股             ");//港股高股息ETF         市值：1.16      累涨：22.94     9.76      5.75      7.43      3.97      1.80      84
        INDEX_HK.put("520900", "指数-港股             ");//红利ETF港股           市值：29.29     累涨：26.43     11.24     6.76      8.54      3.95      2.42      85
        INDEX_HK.put("520990", "指数-港股             ");//港股央企红利50ETF     市值：48.33     累涨：27.26     12.63     6.80      8.27      3.82      2.52      86
        INDEX_HK.put("159331", "指数-港股             ");//红利港股ETF           市值：0.88      累涨：32.97     21.94     4.83      6.20      3.58      1.96      87
        INDEX_HK.put("159691", "指数-港股             ");//港股红利ETF           市值：59.67     累涨：20.70     9.74      4.96      6.28      3.23      1.85      88
        INDEX_HK.put("513820", "指数-港股             ");//港股红利ETF基金       市值：19.90     累涨：21.95     10.29     5.20      6.46      3.12      1.66      89
        INDEX_HK.put("520660", "指数-港股             ");//港股通央企红利ETF南方 市值：11.02     累涨：24.80     12.14     6.42      6.46      2.52      1.65      90
        INDEX_HK.put("513830", "指数-港股             ");//N港股红利ETF          市值：8.49      累涨：                                                            91
    }

    /**
     * 科技-工业
     */
    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();
    static {
        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：32.52     累涨：40.87     9.22      15.14     16.51     10.53     8.19      1
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：68.16     累涨：38.12     9.60      14.85     13.67     8.71      7.53      2
        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：116.81    累涨：38.59     9.36      15.61     13.62     8.02      6.56      3
        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：8.42      累涨：38.34     9.48      15.59     13.27     7.63      6.51      4
        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.80      累涨：37.57     9.36      15.72     12.49     7.63      6.11      5
        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：36.49     累涨：37.94     9.40      15.51     13.03     7.56      6.32      6
    }
    /**
     * 科技-工业
     */
    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();
    static {
        KEJI_GONG_YE.put("520600", "科技-工业             ");//港股汽车ETF           市值：6.77      累涨：57.45               31.08     36.38     17.60     5.33      1
        KEJI_GONG_YE.put("159323", "科技-工业             ");//港股通汽车ETF         市值：1.69      累涨：46.70               22.44     28.09     16.07     4.47      2
        KEJI_GONG_YE.put("159757", "科技-工业             ");//电池30ETF             市值：3.55      累涨：40.43     6.49      18.20     18.07     10.30     5.75      3
        KEJI_GONG_YE.put("561160", "科技-工业             ");//锂电池ETF             市值：6.80      累涨：37.42     5.31      17.80     16.31     10.16     5.17      4
        KEJI_GONG_YE.put("516390", "科技-工业             ");//新能源汽车ETF         市值：3.89      累涨：38.42     4.62      17.88     17.39     9.94      5.18      5
        KEJI_GONG_YE.put("159796", "科技-工业             ");//电池50ETF             市值：11.37     累涨：36.01     3.96      16.81     17.27     9.89      5.34      6
        KEJI_GONG_YE.put("159755", "科技-工业             ");//电池ETF               市值：36.73     累涨：41.81     6.23      18.92     18.72     9.86      5.28      7
        KEJI_GONG_YE.put("159767", "科技-工业             ");//电池龙头ETF           市值：1.27      累涨：40.28     6.55      18.01     17.89     9.70      4.94      8
        KEJI_GONG_YE.put("159566", "科技-工业             ");//储能电池ETF           市值：1.42      累涨：40.46     8.62      17.31     16.98     9.66      3.94      9
        KEJI_GONG_YE.put("159775", "科技-工业             ");//新能源车电池ETF       市值：0.65      累涨：38.13     5.31      17.71     17.05     9.61      5.30      10
        KEJI_GONG_YE.put("561910", "科技-工业             ");//电池ETF               市值：7.18      累涨：34.49     4.35      16.39     15.76     9.59      4.38      11
        KEJI_GONG_YE.put("159840", "科技-工业             ");//锂电池ETF             市值：11.32     累涨：39.58     5.95      17.96     17.89     9.36      5.02      12
        KEJI_GONG_YE.put("516660", "科技-工业             ");//新能源车ETF基金       市值：3.70      累涨：38.87     5.25      18.42     17.15     9.19      4.90      13
        KEJI_GONG_YE.put("159637", "科技-工业             ");//新能源车龙头ETF       市值：9.24      累涨：37.37     4.57      18.05     16.37     9.16      4.88      14
        KEJI_GONG_YE.put("515030", "科技-工业             ");//新能源车ETF           市值：50.45     累涨：39.29     5.50      18.59     16.71     9.14      4.68      15
        KEJI_GONG_YE.put("562880", "科技-工业             ");//电池ETF基金           市值：3.72      累涨：35.95     5.15      16.69     15.86     9.10      4.63      16
        KEJI_GONG_YE.put("159806", "科技-工业             ");//新能源车ETF           市值：11.20     累涨：37.97     4.29      17.95     17.38     9.04      4.51      17
        KEJI_GONG_YE.put("516520", "科技-工业             ");//智能驾驶ETF           市值：4.18      累涨：57.66     12.31     26.68     21.39     8.64      4.76      18
        KEJI_GONG_YE.put("515250", "科技-工业             ");//智能汽车ETF           市值：9.46      累涨：58.88     12.60     27.35     21.15     8.52      4.33      19
        KEJI_GONG_YE.put("159795", "科技-工业             ");//智能汽车ETF基金       市值：0.43      累涨：57.36     12.67     26.82     20.31     8.49      4.35      20
        KEJI_GONG_YE.put("560000", "科技-工业             ");//智慧电车ETF           市值：0.10      累涨：42.30     8.38      18.54     17.14     8.49      4.06      21
        KEJI_GONG_YE.put("159565", "科技-工业             ");//汽车零部件ETF         市值：0.88      累涨：46.76     8.44      22.89     15.82     8.34      4.15      22
        KEJI_GONG_YE.put("159305", "科技-工业             ");//储能电池50ETF         市值：0.50      累涨：37.34     7.56      16.36     15.63     8.24      2.62      23
        KEJI_GONG_YE.put("562700", "科技-工业             ");//汽车零部件ETF         市值：0.35      累涨：45.85     7.85      23.77     15.83     8.09      3.80      24
        KEJI_GONG_YE.put("159306", "科技-工业             ");//汽车零件ETF           市值：0.19      累涨：44.54     7.54      22.97     14.80     7.86      3.81      25
        KEJI_GONG_YE.put("159889", "科技-工业             ");//智能汽车ETF           市值：0.58      累涨：57.26     12.98     26.63     19.66     7.72      4.40      26
        KEJI_GONG_YE.put("562260", "科技-工业             ");//汽车配件ETF           市值：0.14      累涨：43.23     7.42      22.34     14.66     7.62      3.53      27
        KEJI_GONG_YE.put("516380", "科技-工业             ");//智能电动车ETF         市值：1.04      累涨：40.53     7.73      19.04     16.18     6.40      3.04      28
        KEJI_GONG_YE.put("516590", "科技-工业             ");//智能汽车ETF易方达     市值：1.03      累涨：39.31     7.55      18.94     14.86     6.26      3.01      29
        KEJI_GONG_YE.put("159872", "科技-工业             ");//智能网联汽车ETF       市值：0.55      累涨：47.94     11.00     23.22     15.72     6.18      3.97      30
        KEJI_GONG_YE.put("159512", "科技-工业             ");//汽车ETF               市值：0.87      累涨：34.49     9.31      17.71     9.93      4.13      3.15      31
        KEJI_GONG_YE.put("516110", "科技-工业             ");//汽车ETF               市值：6.68      累涨：34.12     8.75      18.00     9.63      3.93      2.45      32
    }
    /**
     * 科技-软件
     */
    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();
    static {
        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算沪港深ETF       市值：3.38      累涨：79.49     11.84     28.27     45.14     21.34     10.35     1
        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：10.82     累涨：43.02               13.05     31.75     19.45     9.31      2
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：6.99      累涨：74.04     11.31     27.13     40.68     19.38     10.54     3
        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：18.08     累涨：55.29               25.42     31.80     19.28     9.23      4
        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：5.97      累涨：52.01               23.18     30.11     18.76     9.25      5
        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：3.60      累涨：40.15               12.52     29.65     18.15     8.88      6
        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：4.65      累涨：77.46     11.90     30.13     38.56     17.22     10.85     7
        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：20.58     累涨：76.04     13.58     28.57     36.89     16.98     8.00      8
        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：5.19      累涨：76.70     13.56     29.80     36.43     16.97     7.81      9
        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：3.00      累涨：75.03     11.92     30.42     36.75     16.70     10.38     10
        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.81      累涨：76.46     13.07     30.89     37.01     16.48     8.74      11
        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：0.62      累涨：74.65     12.07     29.76     36.21     16.33     9.90      12
        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：4.92      累涨：73.58     11.95     30.10     35.19     16.26     8.28      13
        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.17      累涨：74.06     12.68     28.90     35.45     16.09     7.82      14
        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：37.37     累涨：73.06     12.32     29.61     35.10     16.07     8.38      15
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：13.43     累涨：69.01     9.88      30.39     32.09     15.83     7.99      16
        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.48      累涨：56.92     13.55     19.27     24.55     15.79     6.17      17
        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.75      累涨：73.05     12.14     29.67     35.39     15.65     8.00      18
        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.76      累涨：60.10     11.51     22.61     28.33     15.59     8.22      19
        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：3.10      累涨：57.23     13.35     19.79     24.38     15.56     6.47      20
        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：7.55      累涨：71.83     12.33     29.27     34.51     15.48     8.17      21
        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//数据ETF               市值：1.67      累涨：69.97     11.83     28.41     33.32     15.40     8.44      22
        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：14.43     累涨：69.89     10.35     30.53     31.54     15.19     10.21     23
        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：2.97      累涨：65.84     10.30     29.50     28.48     15.14     9.98      24
        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：149.80    累涨：64.63     14.13     23.80     29.74     14.93     7.06      25
        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：0.84      累涨：62.69     13.84     23.61     26.79     14.89     7.22      26
        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.20      累涨：69.88     10.36     30.37     31.60     14.88     9.55      27
        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：1.67      累涨：65.00     13.94     25.52     27.61     14.86     6.77      28
        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：0.58      累涨：63.38     13.49     25.91     27.82     14.80     7.20      29
        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：32.32     累涨：69.49     9.53      30.78     32.83     14.72     9.50      30
        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.91      累涨：70.99     9.67      32.61     33.75     14.53     9.41      31
        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.50      累涨：68.66     10.40     30.74     31.04     14.46     10.08     32
        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：0.86      累涨：65.00     14.03     24.92     27.59     14.43     7.21      33
        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：18.25     累涨：64.06     14.28     23.45     29.33     14.40     7.21      34
        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.50      累涨：69.25     9.50      31.21     31.90     14.25     9.19      35
        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：27.99     累涨：65.07     13.99     24.84     29.55     14.21     6.92      36
        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.76      累涨：62.69     11.70     24.86     28.91     13.96     7.64      37
        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：51.30     累涨：63.04     14.32     23.04     28.55     13.62     6.86      38
        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.70      累涨：63.64     11.72     26.84     27.90     13.57     8.28      39
        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：5.94      累涨：72.48     16.02     30.33     26.13     13.36     6.51      40
        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.61      累涨：67.38     12.16     29.56     29.43     12.91     6.62      41
        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：8.71      累涨：67.95     12.30     29.38     29.94     12.84     7.21      42
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：47.42     累涨：68.38     12.58     29.68     29.46     12.77     7.28      43
        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.34      累涨：69.55     15.49     28.19     25.87     12.54     6.66      44
        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.48      累涨：67.25     14.57     27.63     25.05     12.52     6.65      45
        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：114.85    累涨：67.94     14.27     28.26     25.41     12.38     6.60      46
        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：45.89     累涨：68.03     14.63     28.25     25.36     12.36     6.38      47
        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：6.82      累涨：64.37     13.92     25.81     24.64     12.15     6.66      48
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人100ETF          市值：4.49      累涨：63.47     12.90     25.77     24.80     12.05     6.59      49
        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：6.27      累涨：58.24     13.22     23.43     23.36     10.88     5.70      50
        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：17.10     累涨：56.58     13.10     22.68     22.01     10.41     5.54      51
        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.38      累涨：54.11     12.01     22.64     20.84     10.06     5.31      52
    }

    /**
     * 科技-芯片
     */
    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();
    static {
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：1.98      累涨：60.76     3.40      26.55     31.40     22.03     7.89      1
        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.25      累涨：62.59     16.13     19.31     27.53     18.54     7.05      2
        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：4.99      累涨：63.15     15.73     20.24     27.65     18.44     7.34      3
        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：24.86     累涨：62.47     15.61     19.83     27.50     17.80     6.98      4
        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：225.55    累涨：63.38     15.98     20.20     27.66     17.79     6.94      5
        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：12.78     累涨：49.28     1.67      21.07     26.74     17.52     6.42      6
        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.72      累涨：56.65               14.34     42.78     16.69     6.00      7
        KEJI_XIN_PIAN.put("159511", "科技-芯片             ");//通信ETF南方           市值：0.97      累涨：53.68     12.50     16.86     25.63     14.95     4.86      8
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.56      累涨：70.39     19.54     24.68     26.84     14.88     6.20      9
        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.12      累涨：60.38     15.32     19.67     26.05     14.27     6.47      10
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.72      累涨：68.33     19.17     24.74     25.02     14.26     6.17      11
        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片产业ETF           市值：9.59      累涨：57.35     14.31     19.79     23.58     13.83     5.99      12
        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：256.43    累涨：57.63     14.57     19.80     23.81     13.51     5.60      13
        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.47     累涨：56.19     14.11     18.95     23.77     13.50     5.77      14
        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：12.78     累涨：58.45     14.85     20.39     23.47     13.41     5.64      15
        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：46.34     累涨：57.45     14.56     19.70     23.81     13.39     5.17      16
        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.16      累涨：56.21     14.81     18.72     23.22     13.30     5.54      17
        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：117.03    累涨：57.51     14.35     20.03     23.56     13.23     5.68      18
        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.10     累涨：57.21     15.08     19.68     22.91     13.18     5.41      19
        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：215.10    累涨：58.81     14.78     20.68     23.54     13.05     5.85      20
        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：5.03      累涨：58.55     15.24     20.78     22.93     13.00     5.54      21
        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.78      累涨：55.43     14.29     19.44     22.50     12.43     5.40      22
        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.41      累涨：54.04     13.83     18.93     21.61     12.27     5.26      23
        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.10      累涨：50.57     10.56     18.09     22.07     11.50     5.75      24
        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.58      累涨：47.83     10.08     16.36     21.39     11.14     5.33      25
        KEJI_XIN_PIAN.put("159695", "科技-芯片             ");//通信ETF               市值：1.15      累涨：52.36     12.00     20.83     21.20     10.66     5.11      26
        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：4.30      累涨：54.64     13.34     21.83     20.77     10.25     5.02      27
        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.20      累涨：43.58     8.12      16.09     19.45     10.13     5.53      28
        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.85      累涨：44.68     7.61      18.25     18.82     10.00     5.24      29
        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：15.77     累涨：52.19     13.30     20.39     19.53     9.85      4.60      30
        KEJI_XIN_PIAN.put("159811", "科技-芯片             ");//5G50ETF               市值：1.14      累涨：56.42     14.70     22.28     21.48     9.72      4.12      31
        KEJI_XIN_PIAN.put("159583", "科技-芯片             ");//通信设备ETF           市值：0.77      累涨：57.12     15.00     23.72     20.20     9.58      4.59      32
        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：2.00      累涨：50.12     13.07     19.47     18.39     9.37      4.53      33
        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：5.08      累涨：49.14     13.11     19.18     18.03     9.12      4.41      34
        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.89      累涨：42.52     8.01      16.87     17.82     9.10      5.00      35
        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.33      累涨：41.16     8.45      15.50     17.49     8.95      4.81      36
        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：21.04     累涨：42.68     8.17      16.58     18.12     8.85      4.96      37
        KEJI_XIN_PIAN.put("515880", "科技-芯片             ");//通信ETF               市值：33.58     累涨：60.41     16.05     27.24     19.93     8.82      4.38      38
        KEJI_XIN_PIAN.put("515050", "科技-芯片             ");//5G通信ETF             市值：65.17     累涨：60.51     16.88     26.32     19.36     8.42      4.05      39
        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.77      累涨：52.32     14.64     21.51     17.09     8.31      3.58      40
        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.13      累涨：53.42     14.00     24.03     17.98     8.24      3.69      41
        KEJI_XIN_PIAN.put("159994", "科技-芯片             ");//5GETF                 市值：15.24     累涨：60.01     16.77     26.41     18.59     8.23      3.99      42
        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.90      累涨：52.67     14.77     21.76     16.94     7.78      3.32      43
        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：4.27      累涨：45.83     11.60     18.65     16.72     7.73      4.44      44
        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：5.20      累涨：52.21     14.50     21.35     17.55     7.71      3.35      45
        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：2.07      累涨：44.42     12.23     18.44     14.97     7.33      3.71      46
        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.76      累涨：49.83     14.75     20.27     16.13     6.43      2.42      47
        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：5.94      累涨：41.00     8.95      17.76     14.75     5.90      1.95      48
        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：23.86     累涨：53.79     14.83     24.60     14.93     5.27      3.07      49
    }
    /**
     * 科技-香港科技
     */
    public static Map<String, String> KEJI_HK = new HashMap<>();
    static {
        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：388.73    累涨：72.87     10.36     23.70     41.42     22.65     11.10     1
        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.74      累涨：74.28     11.36     23.39     41.80     22.22     11.44     2
        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：59.53     累涨：66.99     10.61     21.14     36.99     22.20     10.48     3
        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：5.89      累涨：66.05     9.77      21.96     36.55     22.14     11.87     4
        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：246.47    累涨：65.95     9.04      21.85     37.02     22.14     11.71     5
        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：15.97     累涨：66.60     10.47     21.22     36.87     22.02     10.34     6
        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：4.89      累涨：72.96     10.32     24.65     40.48     21.95     11.16     7
        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：394.14    累涨：67.89     10.78     20.78     38.56     21.85     10.24     8
        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：10.13     累涨：76.30     11.73     28.61     37.07     21.62     11.26     9
        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：4.88      累涨：68.01     9.45      24.85     35.81     21.34     7.75      10
        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：43.02     累涨：72.90     9.75      24.98     40.74     21.21     11.27     11
        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.96      累涨：64.72     11.05     20.75     34.99     20.56     9.23      12
        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：6.38      累涨：67.91     10.33     25.03     34.62     20.41     9.31      13
        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：242.05    累涨：68.21     10.66     25.25     34.37     20.24     9.36      14
        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.48      累涨：65.62     9.70      22.94     35.74     20.04     11.57     15
        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：56.29     累涨：66.29     9.85      24.68     34.28     20.04     9.06      16
        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：35.84     累涨：68.23     10.54     25.85     34.48     19.95     9.03      17
        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：21.59     累涨：68.06     11.15     25.33     33.90     19.82     9.04      18
        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：156.13    累涨：68.76     11.50     23.98     35.71     19.74     8.64      19
        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：262.81    累涨：68.06     11.12     25.38     33.87     19.54     8.76      20
        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：102.71    累涨：66.65     10.37     25.09     33.59     19.45     8.94      21
        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：15.54     累涨：66.41     10.33     25.18     33.34     19.39     8.83      22
        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：27.00     累涨：67.84     11.29     25.48     33.49     19.38     8.96      23
        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：3.73      累涨：66.33     10.37     24.98     33.80     19.05     8.49      24
        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：5.05      累涨：61.32     9.21      21.98     33.14     18.88     9.86      25
        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：5.53      累涨：80.10     9.28      40.86     38.23     18.72     7.13      26
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：102.16    累涨：69.55     10.37     26.64     35.12     18.68     7.13      27
        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：3.39      累涨：64.47     9.86      23.82     33.44     18.65     9.65      28
        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：12.63     累涨：68.27     10.36     26.06     34.92     18.03     7.45      29
        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.72      累涨：69.95     11.65     27.19     33.93     17.94     7.16      30
        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.92      累涨：64.74     11.59     22.98     33.02     17.78     9.66      31
        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：3.95      累涨：63.64     9.63      24.74     31.77     17.69     7.27      32
        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：5.46      累涨：68.69     10.31     26.92     34.26     17.15     7.09      33
        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：4.91      累涨：65.71     9.62      25.73     33.25     16.82     6.58      34
        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：2.66      累涨：64.04     10.25     24.66     32.73     16.41     6.43      35
        KEJI_HK.put("517350", "科技-香港             ");//中概科技ETF           市值：1.02      累涨：54.35     10.30     20.59     25.09     13.87     5.52      36
        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.56      累涨：52.37     11.71     21.80     20.13     9.52      5.09      37
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
    }

    /**
     * 金融-证券
     */
    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();
    static {

    }
    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();

    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
    }

    /**
     * 消费-香港消费
     */
    public static Map<String, String> XIAOFEI_HK = new HashMap<>();
    static {
        XIAOFEI_HK.put("513590", "消费-香港消费         ");//香港消费ETF           市值：5.67      累涨：63.16     9.68      19.40     36.63     22.32     6.93      1
        XIAOFEI_HK.put("159735", "消费-香港消费         ");//港股消费ETF           市值：5.31      累涨：63.13     11.15     20.18     34.59     18.26     7.77      2
        XIAOFEI_HK.put("513230", "消费-香港消费         ");//港股消费ETF           市值：2.72      累涨：60.27     10.31     19.88     33.10     17.69     7.02      3
        XIAOFEI_HK.put("513070", "消费-香港消费         ");//港股消费ETF易方达     市值：3.16      累涨：60.45     11.54     19.98     32.02     17.21     6.66      4
        XIAOFEI_HK.put("159793", "消费-香港消费         ");//线上消费ETF平安       市值：0.40      累涨：60.93     10.15     19.31     32.99     16.12     9.44      5
        XIAOFEI_HK.put("517550", "消费-香港消费         ");//消费ETF沪港深         市值：0.42      累涨：42.75     11.64     12.28     21.27     12.73     4.90      6
        XIAOFEI_HK.put("159728", "消费-香港消费         ");//在线消费ETF           市值：0.63      累涨：61.11     13.29     23.39     26.07     11.46     7.74      7
        XIAOFEI_HK.put("520520", "消费-香港消费         ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：37.62     11.39     10.66     16.86     11.44     4.71      8
        XIAOFEI_HK.put("159725", "消费-香港消费         ");//线上消费ETF           市值：0.51      累涨：59.73     10.91     23.06     27.58     11.21     7.41      9
        XIAOFEI_HK.put("513970", "消费-香港消费         ");//恒生消费ETF           市值：6.26      累涨：35.38     10.17     11.23     14.68     10.76     4.60      10
        XIAOFEI_HK.put("159699", "消费-香港消费         ");//恒生消费ETF           市值：8.32      累涨：35.28     10.70     11.56     13.97     9.03      2.76      11
    }
    /**
     * 消费-游戏
     */
    public static Map<String, String> XIAOFEI_GAME = new HashMap<>();
    static {
        XIAOFEI_GAME.put("517770", "消费-游戏             ");//游戏传媒ETF           市值：0.30      累涨：53.93     10.10     17.90     26.66     14.30     9.13      1
        XIAOFEI_GAME.put("516770", "消费-游戏             ");//游戏ETF华泰柏瑞       市值：1.13      累涨：67.08     12.02     25.66     30.79     11.37     7.33      2
        XIAOFEI_GAME.put("159869", "消费-游戏             ");//游戏ETF               市值：49.74     累涨：66.75     12.44     26.03     30.25     10.98     7.15      3
        XIAOFEI_GAME.put("516010", "消费-游戏             ");//游戏ETF               市值：13.38     累涨：66.58     12.56     26.03     29.61     10.77     6.67      4
    }
    /**
     * 消费-旅游
     */
    public static Map<String, String> XIAOFEI_TRAVEL = new HashMap<>();
    static {
        XIAOFEI_TRAVEL.put("159378", "消费-旅游             ");//通用航空ETF           市值：6.26      累涨：31.88               14.47     19.09     9.75      5.93      1
        XIAOFEI_TRAVEL.put("159766", "消费-旅游             ");//旅游ETF               市值：23.99     累涨：27.65     10.74     8.56      8.96      5.33      1.35      2
        XIAOFEI_TRAVEL.put("562510", "消费-旅游             ");//旅游ETF               市值：6.83      累涨：27.34     11.03     8.32      8.59      4.98      1.35      3
    }
    /**
     * 消费-影视
     */
    public static Map<String, String> XIAOFEI_FILM = new HashMap<>();
    static {
        XIAOFEI_FILM.put("159855", "消费-影视             ");//影视ETF               市值：0.65      累涨：64.86     15.92     19.39     30.92     8.60      5.77      1
        XIAOFEI_FILM.put("516620", "消费-影视             ");//影视ETF               市值：0.62      累涨：64.35     15.26     19.46     30.56     8.47      5.57      2
    }
    /**
     * 消费-食品
     */
    public static Map<String, String> XIAOFEI_FOOD = new HashMap<>();
    static {
        XIAOFEI_FOOD.put("516900", "消费-食品             ");//食品饮料ETF基金       市值：0.56      累涨：25.91     4.59      9.63      11.86     7.37      3.43      1
        XIAOFEI_FOOD.put("515170", "消费-食品             ");//食品饮料ETF           市值：35.01     累涨：24.37     5.38      8.99      10.00     4.86      3.45      2
        XIAOFEI_FOOD.put("515710", "消费-食品             ");//食品ETF               市值：9.66      累涨：23.48     5.26      9.31      9.08      4.57      2.75      3
        XIAOFEI_FOOD.put("159843", "消费-食品             ");//食品饮料ETF           市值：3.04      累涨：24.12     5.02      9.36      9.90      4.44      2.89      4
        XIAOFEI_FOOD.put("159862", "消费-食品             ");//食品ETF               市值：0.51      累涨：24.31     5.57      8.88      9.86      4.27      2.63      5
        XIAOFEI_FOOD.put("159736", "消费-食品             ");//饮食ETF               市值：51.63     累涨：23.74     6.13      8.84      8.77      3.83      2.68      6
    }
    /**
     * 消费-酒
     */
    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();
    static {
        XIAOFEI_WINE.put("512690", "消费-酒               ");//酒ETF                 市值：127.91    累涨：29.62     7.98      8.74      14.32     6.79      1.69      1
    }
    /**
     * 消费-家电
     */
    public static Map<String, String> XIAOFEI_HOUSE = new HashMap<>();
    static {
        XIAOFEI_HOUSE.put("159996", "消费-家电             ");//家电ETF               市值：16.64     累涨：34.63     10.38     15.76     10.10     6.03      2.86      1
        XIAOFEI_HOUSE.put("561120", "消费-家电             ");//家电ETF               市值：1.12      累涨：34.03     10.10     15.84     9.57      5.48      2.81      2
        XIAOFEI_HOUSE.put("159328", "消费-家电             ");//家电ETF易方达         市值：1.28      累涨：30.95     9.93      14.13     8.98      4.74      2.60      3
        XIAOFEI_HOUSE.put("560880", "消费-家电             ");//家电ETF龙头           市值：4.52      累涨：32.26     10.43     15.21     9.04      4.68      2.54      4
        XIAOFEI_HOUSE.put("159730", "消费-家电             ");//龙头家电ETF           市值：0.51      累涨：25.56     6.86      13.02     7.77      4.10      1.81      5
    }
    /**
     * 消费-养老
     */
    public static Map<String, String> XIAOFEI_OLD = new HashMap<>();
    static {
        XIAOFEI_OLD.put("516560", "消费-养老             ");//养老ETF               市值：1.14      累涨：23.24     8.67      6.71      8.64      3.78      1.39      1
    }
    /**
     * 消费-物流
     */
    public static Map<String, String> XIAOFEI_EXPRESS = new HashMap<>();
    static {
        XIAOFEI_EXPRESS.put("516530", "消费-物流             ");//物流快递ETF           市值：0.71      累涨：18.50     6.53      7.61      5.63      2.43      1.27      1
        XIAOFEI_EXPRESS.put("516910", "消费-物流             ");//物流ETF               市值：0.56      累涨：17.85     6.39      7.37      5.19      2.30      1.10      2
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI = new HashMap<>();
    static {
        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_GAME);
        XIAOFEI.putAll(XIAOFEI_TRAVEL);
        XIAOFEI.putAll(XIAOFEI_FILM);
        XIAOFEI.putAll(XIAOFEI_FOOD);
        XIAOFEI.putAll(XIAOFEI_WINE);
        XIAOFEI.putAll(XIAOFEI_HOUSE);
        XIAOFEI.putAll(XIAOFEI_OLD);
        XIAOFEI.putAll(XIAOFEI_EXPRESS);
    }






    public static Map<String, String> INDEX_ALL_NOT_CN = new HashMap<>();//指数-全部-etf-国外指数
    public static Map<String, String> INDEX_ALL_CN = new HashMap<>();//指数-全部-etf-国内
    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_ALL_NOT_CN);
        INDEX.putAll(INDEX_ALL_CN);
        INDEX.putAll(INDEX_HK);
    }
    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
    }
    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     * 
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }
}
