package utils;

import ttjj.dto.CondEtfAdrCount;
import ttjj.dto.EtfAdrCountVo;
import ttjj.service.EtfAdrCountService;

import java.math.BigDecimal;
import java.util.*;
import java.util.stream.Collectors;

import static utils.Content.*;

/**
 * 常量-ETF精简数据
 */
public class ContMapEtfSimple {
    /**
     * 指数-科创板
     */
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板

    static {
//        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：32.02     累涨：52.54     22.34     16.81     13.39     10日：3.43      1.38      2         累涨修正：74.58     1
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.38      累涨：41.66     13.88     15.05     12.73     10日：4.03      1.36      1         累涨修正：59.22     2
//        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.24      累涨：40.66     14.54     14.91     11.21     10日：2.86      1.18      4         累涨修正：57.47     3
//        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：3.76      累涨：42.75     16.63     17.28     8.84      10日：1.27      1.10      14        累涨修正：57.39     4
//        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：2.21      累涨：42.23     16.58     17.21     8.44      10日：1.13      1.13      18        累涨修正：56.92     5
//        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.41      累涨：38.35     12.42     16.50     9.43      10日：2.61      1.56      3         累涨修正：56.25     6
//        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.39      累涨：40.03     16.57     11.25     12.21     10日：6.51      0.39      1         累涨修正：56.01     7
//        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：2.93      累涨：37.55     13.91     14.72     8.92      10日：2.48      1.46      7         累涨修正：55.63     8
//        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：2.75      累涨：37.98     13.12     15.49     9.37      10日：2.75      1.49      2         累涨修正：55.39     9
//        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.37      累涨：41.81     15.89     17.34     8.58      10日：1.18      0.98      19        累涨修正：54.95     10
//        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.36      累涨：37.10     13.39     14.34     9.37      10日：2.07      1.34      9         累涨修正：54.93     11
//        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.28      累涨：39.39     16.04     11.14     12.21     10日：6.51      0.33      2         累涨修正：54.5      12
//        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：49.21     累涨：37.64     13.09     15.28     9.27      10日：2.28      1.36      6         累涨修正：54.22     13
//        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：10.54     累涨：37.04     12.67     15.64     8.73      10日：1.97      1.36      13        累涨修正：53        14
//        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.34      累涨：37.20     13.26     14.91     9.03      10日：2.25      1.30      12        累涨修正：52.99     15
//        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：61.77     累涨：37.50     13.20     15.44     8.86      10日：2.19      1.36      10        累涨修正：52.43     16
//        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：32.81     累涨：37.37     13.07     15.21     9.09      10日：2.39      1.26      8         累涨修正：52.3      17
//        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：32.42     累涨：36.92     12.43     15.48     9.01      10日：2.34      1.29      11        累涨修正：52.01     18
//        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.71      累涨：35.10     11.86     13.87     9.37      10日：2.96      0.83      15        累涨修正：50.15     19
//        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：82.41     累涨：30.66     12.16     8.60      9.90      10日：4.50      0.75      17        累涨修正：47.91     20
//        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：43.56     累涨：28.92     11.38     8.12      9.42      10日：4.28      0.93      20        累涨修正：47.71     21
//        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：2.48      累涨：37.87     18.00     14.01     5.86      10日：1.51      0.53      40        累涨修正：46.72     22
//        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.31      累涨：38.72     18.18     14.74     5.80      10日：1.36      0.46      41        累涨修正：46.5      23
//        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：22.87     累涨：29.65     11.66     8.17      9.82      10日：4.38      0.73      36        累涨修正：46.44     24
//        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.62      累涨：35.14     11.54     14.44     9.16      10日：2.84      0.51      22        累涨修正：46.43     25
//        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.23      累涨：28.42     11.17     7.55      9.70      10日：4.36      0.91      40        累涨修正：46.38     26
//        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：1.32      累涨：                    16.03     11.97     10日：3.70      1.25      5         累涨修正：46.21     27
//        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：21.89     累涨：29.74     12.81     7.36      9.57      10日：4.23      0.72      21        累涨修正：46.12     28
//        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：14.51     累涨：29.86     11.88     8.22      9.76      10日：4.08      0.72      37        累涨修正：45.94     29
//        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.66      累涨：28.20     11.74     7.39      9.07      10日：3.88      0.85      26        累涨修正：45.31     30
//        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：17.35     累涨：28.93     11.66     8.09      9.18      10日：4.06      0.74      29        累涨修正：45.19     31
//        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：11.02     累涨：28.00     11.09     7.61      9.30      10日：4.40      0.74      25        累涨修正：44.94     32
//        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.08      累涨：33.56     17.15     10.31     6.10      10日：1.80      0.70      41        累涨修正：44.86     33
//        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：3.17      累涨：23.73     9.54      6.62      7.57      10日：3.79      1.21      33        累涨修正：44.62     34
//        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.33      累涨：29.17     12.16     7.93      9.08      10日：3.78      0.69      31        累涨修正：44.32     35
//        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：17.36     累涨：30.32     11.92     9.04      9.36      10日：3.97      0.54      27        累涨修正：44.2      36
//        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.20      累涨：28.45     10.88     8.14      9.43      10日：3.70      0.74      43        累涨修正：43.99     37
//        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：56.84     累涨：33.72     16.95     11.62     5.15      10日：1.41      0.63      47        累涨修正：43.47     38
//        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：40.41     累涨：29.66     11.72     8.50      9.44      10日：4.27      0.37      30        累涨修正：42.27     39
//        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.49      累涨：28.72     11.27     8.25      9.20      10日：3.94      0.51      35        累涨修正：42.21     40
//        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.20      累涨：33.18     16.40     11.55     5.23      10日：1.38      0.56      50        累涨修正：42.1      41
//        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：1.92      累涨：33.60     17.27     11.19     5.14      10日：1.36      0.49      52        累涨修正：41.71     42
//        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：113.41    累涨：33.54     16.81     11.71     5.02      10日：1.36      0.49      54        累涨修正：41.65     43
//        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：794.72    累涨：34.18     16.34     12.26     5.58      10日：1.52      0.39      51        累涨修正：41.51     44
//        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：607.31    累涨：33.53     16.96     11.23     5.34      10日：1.37      0.40      53        累涨修正：40.67     45
//        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.72      累涨：32.85     16.62     11.14     5.09      10日：1.42      0.43      56        累涨修正：40.42     46
//        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：43.51     累涨：33.08     16.67     11.41     5.00      10日：1.25      0.39      58        累涨修正：39.87     47
//        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：1.86      累涨：32.94     17.17     10.38     5.39      10日：0.87      0.39      57        累涨修正：38.97     48
//        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：32.14     累涨：32.85     16.16     11.63     5.06      10日：1.23      0.31      60        累涨修正：38.72     49
//        INDEX_688.put("588660", "指数-科创板           ");//科创创业50ETF基金     市值：3.43      累涨：                    9.64      9.92      10日：4.56      0.87      16        累涨修正：38.25     50
//        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：6.23      累涨：35.67     17.30     12.64     5.73      10日：0.69                55        累涨修正：37.05     51
//        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：27.28     累涨：                    13.83     7.90      10日：2.33      0.96      24        累涨修正：36.18     52
//        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：8.40      累涨：                    15.21     7.96      10日：2.14      0.76      23        累涨修正：35.81     53
//        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：0.94      累涨：31.09     14.47     11.91     4.71      10日：0.94      0.24      62        累涨修正：35.61     54
//        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：8.65      累涨：                    13.60     7.59      10日：2.33      0.96      28        累涨修正：34.94     55
//        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：28.34     累涨：                    15.16     7.12      10日：1.93      0.76      34        累涨修正：34.5      56
//        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：21.95     累涨：                    13.70     7.31      10日：1.92      0.86      37        累涨修正：33.54     57
//        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：7.80      累涨：                    14.20     7.10      10日：1.92      0.75      40        累涨修正：33.39     58
//        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：7.26      累涨：                    14.28     7.18      10日：1.70      0.75      42        累涨修正：33.11     59
//        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：6.29      累涨：                    12.85     8.34      10日：1.89      0.74      38        累涨修正：33.11     60
//        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：10.66     累涨：                    13.13     7.58      10日：2.11      0.85      32        累涨修正：32.81     61
//        INDEX_688.put("589630", "指数-科创板           ");//科创综指ETF国泰       市值：11.90     累涨：                    15.18     7.22      10日：1.59      0.64      43        累涨修正：32.62     62
//        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：8.25      累涨：                    13.94     7.39      10日：1.91      0.64      44        累涨修正：32.19     63
//        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：8.31      累涨：                    13.03     7.06      10日：1.83      0.76      46        累涨修正：32.11     64
//        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：13.83     累涨：                    12.92     6.89      10日：1.92      0.87      39        累涨修正：31.68     65
//        INDEX_688.put("589600", "指数-科创板           ");//科创综指ETF富国       市值：17.52     累涨：                    13.19     7.44      10日：1.95      0.55      45        累涨修正：30.58     66
//        INDEX_688.put("588170", "指数-科创板           ");//科创半导体ETF         市值：2.46      累涨：                              8.34      10日：2.36      1.24      36        累涨修正：26.7      67
//        INDEX_688.put("588840", "指数-科创板           ");//科创板50ETF基金       市值：1.84      累涨：                    11.34     5.31      10日：1.42      0.44      61        累涨修正：24.33     68
//        INDEX_688.put("588910", "指数-科创板           ");//科创价值ETF           市值：9.41      累涨：                              8.81      10日：2.62      0.42      49        累涨修正：18.67     69
//        INDEX_688.put("589300", "指数-科创板           ");//科创综指ETF嘉实       市值：0.62      累涨：                              7.63      10日：2.05      0.79      48        累涨修正：18.32     70
//        INDEX_688.put("589060", "指数-科创板           ");//科创综指ETF东财       市值：2.01      累涨：                              6.89      10日：1.63      0.72      59        累涨修正：17.37     71
//        INDEX_688.put("588040", "指数-科创板           ");//科创50ETF指数         市值：0.23      累涨：                              5.07      10日：1.15      0.58      63        累涨修正：13.75     72
//        INDEX_688.put("588770", "指数-科创板           ");//科创信息技术ETF摩根   市值：3.25      累涨：                              5.59      10日：1.56      0.32      64        累涨修正：12.23     73
//        INDEX_688.put("588720", "指数-科创板           ");//科创50ETF中银         市值：3.77      累涨：                              4.92      10日：0.89      0.40      64        累涨修正：11.1      74
//        INDEX_688.put("588850", "指数-科创板           ");//科创机械ETF           市值：0.25      累涨：                                        10日：3.64      0.48      51        累涨修正：10.53     75
//        INDEX_688.put("589980", "指数-科创板           ");//科创100ETF汇添富      市值：7.88      累涨：                                        10日：          1.43                累涨修正：          76
    }

    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股

    static {
        INDEX_HK.put("513980", "指数-港股             ");//港股科技50ETF         市值：144.58    累涨：61.82     26.56     15.90     19.36     10日：6.44      3.41      1         累涨修正：109.2     1
//        INDEX_HK.put("513150", "指数-港股             ");//港股通科技ETF华泰柏瑞 市值：1.39      累涨：59.57     25.29     15.89     18.39     10日：6.42      3.42      2         累涨修正：106.88    2
//        INDEX_HK.put("513860", "指数-港股             ");//港股通科技ETF         市值：18.79     累涨：60.03     25.10     14.62     20.31     10日：5.87      2.98      5         累涨修正：103.57    3
//        INDEX_HK.put("513020", "指数-港股             ");//港股科技ETF           市值：10.98     累涨：57.55     24.12     15.37     18.06     10日：6.08      3.10      6         累涨修正：102.55    4
//        INDEX_HK.put("159751", "指数-港股             ");//港股科技ETF           市值：5.87      累涨：56.06     23.68     15.31     17.07     10日：5.44      3.45      13        累涨修正：102.09    5
//        INDEX_HK.put("159750", "指数-港股             ");//港股科技50ETF         市值：5.67      累涨：58.98     28.08     13.99     16.91     10日：5.55      2.90      7         累涨修正：100.58    6
//        INDEX_HK.put("159788", "指数-港股             ");//港股通100ETF          市值：1.41      累涨：60.89     21.85     20.14     18.90     10日：4.98      2.32      1         累涨修正：96.37     7
//        INDEX_HK.put("159636", "指数-港股             ");//港股通科技30ETF       市值：220.60    累涨：59.13     26.64     14.30     18.19     10日：5.21      2.36      9         累涨修正：95.51     8
//        INDEX_HK.put("513320", "指数-港股             ");//恒生新经济ETF         市值：1.66      累涨：55.30     23.18     14.01     18.11     10日：5.93      2.40      12        累涨修正：93.56     9
//        INDEX_HK.put("159735", "指数-港股             ");//港股消费ETF           市值：6.73      累涨：55.16     25.87     11.33     17.96     10日：5.86      2.06      2         累涨修正：89.54     10
//        INDEX_HK.put("513070", "指数-港股             ");//港股消费ETF易方达     市值：5.69      累涨：53.57     24.87     12.05     16.65     10日：5.64      2.09      3         累涨修正：87.84     11
//        INDEX_HK.put("513040", "指数-港股             ");//港股通互联网ETF       市值：6.96      累涨：57.87     27.91     11.53     18.43     10日：4.89      1.83      15        累涨修正：87.78     12
//        INDEX_HK.put("159792", "指数-港股             ");//港股通互联网ETF       市值：463.79    累涨：57.88     29.06     10.52     18.30     10日：4.74      1.77      17        累涨修正：86.83     13
//        INDEX_HK.put("513230", "指数-港股             ");//港股消费ETF           市值：3.37      累涨：52.53     24.96     11.71     15.86     10日：5.60      2.08      4         累涨修正：86.61     14
//        INDEX_HK.put("517360", "指数-港股             ");//沪港深科技ETF         市值：0.39      累涨：47.78     20.96     10.42     16.40     10日：4.88      2.61      29        累涨修正：86.25     15
//        INDEX_HK.put("159569", "指数-港股             ");//港股红利低波ETF       市值：1.26      累涨：32.91     9.83      9.86      13.22     10日：8.06      3.33      3         累涨修正：85.1      16
//        INDEX_HK.put("513380", "指数-港股             ");//恒生科技ETF龙头       市值：48.79     累涨：55.95     26.22     13.54     16.19     10日：6.04      1.55      14        累涨修正：85.08     17
//        INDEX_HK.put("513770", "指数-港股             ");//港股互联网ETF         市值：48.19     累涨：57.22     27.60     11.24     18.38     10日：4.73      1.64      18        累涨修正：84.72     18
//        INDEX_HK.put("159568", "指数-港股             ");//港股互联网ETF         市值：3.28      累涨：57.62     28.94     10.82     17.86     10日：4.53      1.63      21        累涨修正：84.61     19
//        INDEX_HK.put("513330", "指数-港股             ");//恒生互联网ETF         市值：234.06    累涨：56.42     29.27     11.24     15.91     10日：5.45      1.47      20        累涨修正：83.49     20
//        INDEX_HK.put("159312", "指数-港股             ");//恒生ETF港股通         市值：0.72      累涨：49.84     18.39     19.15     12.30     10日：5.27      2.09      7         累涨修正：83.37     21
//        INDEX_HK.put("159741", "指数-港股             ");//恒生科技ETF基金       市值：8.37      累涨：55.32     26.66     13.28     15.38     10日：5.72      1.43      19        累涨修正：82.49     22
//        INDEX_HK.put("159318", "指数-港股             ");//恒生港股通ETF         市值：0.59      累涨：48.95     18.33     18.96     11.66     10日：5.14      2.11      9         累涨修正：82.44     23
//        INDEX_HK.put("513750", "指数-港股             ");//港股非银ETF           市值：16.60     累涨：51.99     23.33     11.46     17.20     10日：7.60      1.38      2         累涨修正：82.37     24
//        INDEX_HK.put("159688", "指数-港股             ");//恒生互联网ETF         市值：9.10      累涨：57.70     29.19     12.00     16.51     10日：5.16      1.23      23        累涨修正：81.55     25
//        INDEX_HK.put("513260", "指数-港股             ");//恒生科技ETF基金       市值：44.07     累涨：54.81     25.69     13.69     15.43     10日：5.59      1.32      22        累涨修正：80.51     26
//        INDEX_HK.put("513130", "指数-港股             ");//恒生科技ETF           市值：249.60    累涨：55.06     26.38     13.54     15.14     10日：5.55      1.28      25        累涨修正：80.24     27
//        INDEX_HK.put("159711", "指数-港股             ");//港股通ETF             市值：0.66      累涨：47.91     18.76     16.19     12.96     10日：5.47      1.92      4         累涨修正：79.97     28
//        INDEX_HK.put("513900", "指数-港股             ");//港股通100ETF          市值：1.58      累涨：52.75     21.21     18.13     13.41     10日：4.83      1.53      13        累涨修正：79.24     29
//        INDEX_HK.put("513580", "指数-港股             ");//恒生科技ETF指数基金   市值：23.41     累涨：55.47     25.86     13.64     15.97     10日：5.53      1.13      24        累涨修正：78.96     30
//        INDEX_HK.put("159712", "指数-港股             ");//港股通50ETF           市值：0.39      累涨：52.02     17.97     20.14     13.91     10日：4.83      1.54      17        累涨修正：78.62     31
//        INDEX_HK.put("513210", "指数-港股             ");//恒生ETF易方达         市值：0.53      累涨：47.25     18.81     14.00     14.44     10日：5.34      1.86      6         累涨修正：78.39     32
//        INDEX_HK.put("513010", "指数-港股             ");//恒生科技ETF易方达     市值：112.48    累涨：54.36     25.71     13.29     15.36     10日：5.65      1.10      26        累涨修正：77.76     33
//        INDEX_HK.put("159742", "指数-港股             ");//恒生科技指数ETF       市值：19.35     累涨：54.06     25.22     13.78     15.06     10日：5.55      1.10      27        累涨修正：77.26     34
//        INDEX_HK.put("159850", "指数-港股             ");//恒生国企ETF           市值：8.92      累涨：42.66     19.95     9.93      12.78     10日：5.73      2.09      5         累涨修正：77.11     35
//        INDEX_HK.put("513180", "指数-港股             ");//恒生科技指数ETF       市值：271.21    累涨：54.11     25.56     13.29     15.26     10日：5.33      1.12      30        累涨修正：77.09     36
//        INDEX_HK.put("159960", "指数-港股             ");//恒生中国企业ETF       市值：5.37      累涨：40.02     17.77     9.63      12.62     10日：5.78      2.29      10        累涨修正：76.77     37
//        INDEX_HK.put("159740", "指数-港股             ");//恒生科技ETF           市值：72.67     累涨：53.59     25.80     12.84     14.95     10日：5.29      1.14      31        累涨修正：76.71     38
//        INDEX_HK.put("513160", "指数-港股             ");//港股科技30ETF         市值：11.38     累涨：54.85     26.46     11.95     16.44     10日：4.64      1.11      28        累涨修正：76.34     39
//        INDEX_HK.put("513890", "指数-港股             ");//恒生科技HKETF         市值：4.04      累涨：52.93     25.16     12.66     15.11     10日：5.45      1.12      32        累涨修正：76.15     40
//        INDEX_HK.put("513530", "指数-港股             ");//港股通红利ETF         市值：17.87     累涨：29.12     7.45      10.20     11.47     10日：7.70      2.77      8         累涨修正：74.99     41
//        INDEX_HK.put("159331", "指数-港股             ");//红利港股ETF           市值：0.74      累涨：29.99     6.64      12.80     10.55     10日：7.24      2.70      11        累涨修正：74.17     42
//        INDEX_HK.put("510900", "指数-港股             ");//H股ETF                市值：92.65     累涨：40.95     19.39     9.20      12.36     10日：5.41      2.00      16        累涨修正：73.77     43
//        INDEX_HK.put("520990", "指数-港股             ");//港股央企红利50ETF     市值：48.36     累涨：25.17     6.94      8.90      9.33      10日：6.55      3.17      29        累涨修正：73.14     44
//        INDEX_HK.put("513820", "指数-港股             ");//港股红利ETF基金       市值：26.00     累涨：28.24     6.62      10.43     11.19     10日：7.69      2.67      12        累涨修正：72.99     45
//        INDEX_HK.put("513660", "指数-港股             ");//恒生ETF               市值：40.31     累涨：41.32     18.89     9.71      12.72     10日：5.20      1.87      18        累涨修正：72.29     46
//        INDEX_HK.put("513600", "指数-港股             ");//恒生指数ETF           市值：16.23     累涨：41.49     18.69     9.90      12.90     10日：5.42      1.75      14        累涨修正：71.58     47
//        INDEX_HK.put("159954", "指数-港股             ");//H股ETF                市值：4.16      累涨：40.75     19.08     9.35      12.32     10日：5.25      1.84      22        累涨修正：71.49     48
//        INDEX_HK.put("513990", "指数-港股             ");//港股通ETF             市值：1.05      累涨：45.09     19.12     15.80     10.17     10日：4.44      1.59      26        累涨修正：71.46     49
//        INDEX_HK.put("517550", "指数-港股             ");//消费ETF沪港深         市值：0.54      累涨：40.86     21.02     8.78      11.06     10日：4.87      1.76      5         累涨修正：69.96     50
//        INDEX_HK.put("159691", "指数-港股             ");//港股红利ETF           市值：61.53     累涨：27.87     8.15      10.11     9.61      10日：5.40      2.81      24        累涨修正：69.58     51
//        INDEX_HK.put("513550", "指数-港股             ");//港股通50ETF           市值：26.02     累涨：44.03     19.73     10.20     14.10     10日：4.85      1.42      21        累涨修正：69.35     52
//        INDEX_HK.put("520900", "指数-港股             ");//红利ETF港股           市值：21.01     累涨：24.61     6.85      9.00      8.76      10日：6.52      2.88      31        累涨修正：69.33     53
//        INDEX_HK.put("159333", "指数-港股             ");//港股央企红利ETF       市值：5.53      累涨：27.90     8.84      8.32      10.74     10日：6.58      2.56      23        累涨修正：69.22     54
//        INDEX_HK.put("159920", "指数-港股             ");//恒生ETF               市值：160.27    累涨：40.99     18.86     9.43      12.70     10日：4.97      1.66      25        累涨修正：69.19     55
//        INDEX_HK.put("520660", "指数-港股             ");//港股通央企红利ETF南方 市值：10.72     累涨：23.41     5.66      8.03      9.72      10日：6.55      2.91      30        累涨修正：68.52     56
//        INDEX_HK.put("513910", "指数-港股             ");//港股央企红利ETF       市值：25.96     累涨：30.20     10.16     10.08     9.96      10日：6.23      2.31      20        累涨修正：68.07     57
//        INDEX_HK.put("159302", "指数-港股             ");//港股高股息ETF         市值：1.16      累涨：29.35     6.97      11.09     11.29     10日：6.68      2.29      15        累涨修正：67.9      58
//        INDEX_HK.put("517350", "指数-港股             ");//科技ETF沪港深         市值：0.87      累涨：41.49     18.78     9.02      13.69     10日：4.14      1.61      34        累涨修正：67.48     59
//        INDEX_HK.put("159726", "指数-港股             ");//恒生红利ETF           市值：4.85      累涨：33.27     13.88     9.53      9.86      10日：5.25      2.07      27        累涨修正：66.54     60
//        INDEX_HK.put("517390", "指数-港股             ");//云计算ETF沪港深       市值：3.03      累涨：51.70     24.96     9.40      17.34     10日：4.28      0.45      9         累涨修正：65.21     61
//        INDEX_HK.put("520520", "指数-港股             ");//恒生消费ETF华泰柏瑞   市值：0.80      累涨：43.76     19.55     14.49     9.72      10日：3.98      1.19      6         累涨修正：64.81     62
//        INDEX_HK.put("159699", "指数-港股             ");//恒生消费ETF           市值：13.99     累涨：40.94     17.55     13.38     10.01     10日：4.20      1.29      7         累涨修正：63.53     63
//        INDEX_HK.put("513970", "指数-港股             ");//恒生消费ETF           市值：17.94     累涨：42.89     19.06     14.07     9.76      10日：3.93      1.09      8         累涨修正：62.74     64
//        INDEX_HK.put("513830", "指数-港股             ");//港股红利ETF           市值：2.79      累涨：                    10.26     10.44     10日：6.61      2.57      19        累涨修正：61.49     65
//        INDEX_HK.put("517660", "指数-港股             ");//物联网ETF沪港深       市值：0.46      累涨：39.01     16.65     9.60      12.76     10日：4.60      1.15      6         累涨修正：60.86     66
//        INDEX_HK.put("513690", "指数-港股             ");//港股红利ETF博时       市值：39.90     累涨：27.94     10.72     7.82      9.40      10日：5.16      1.98      35        累涨修正：60.04     67
//        INDEX_HK.put("513810", "指数-港股             ");//港股国企ETF           市值：0.93      累涨：34.14     10.66     10.33     13.15     10日：4.18      1.59      28        累涨修正：59.99     68
//        INDEX_HK.put("513140", "指数-港股             ");//港股金融ETF           市值：0.78      累涨：37.44     14.76     10.38     12.30     10日：5.16      1.11      3         累涨修正：59.97     69
//        INDEX_HK.put("513190", "指数-港股             ");//港股通金融ETF         市值：8.96      累涨：33.34     14.25     9.22      9.87      10日：5.84      1.33      4         累涨修正：59.65     70
//        INDEX_HK.put("520890", "指数-港股             ");//港股通红利低波ETF     市值：0.58      累涨：28.77     10.27     9.01      9.49      10日：5.47      1.65      32        累涨修正：57.86     71
//        INDEX_HK.put("513920", "指数-港股             ");//港股通央企红利ETF     市值：33.59     累涨：30.48     11.88     9.55      9.05      10日：4.48      1.64      36        累涨修正：57.48     72
//        INDEX_HK.put("513950", "指数-港股             ");//恒生红利ETF           市值：12.35     累涨：28.04     10.09     8.07      9.88      10日：5.34      1.65      33        累涨修正：56.87     73
//        INDEX_HK.put("159545", "指数-港股             ");//恒生红利低波ETF       市值：14.36     累涨：28.58     10.47     7.96      10.15     10日：5.30      1.55      34        累涨修正：56.23     74
//        INDEX_HK.put("520550", "指数-港股             ");//港股红利低波ETF       市值：3.89      累涨：26.71     10.16     6.80      9.75      10日：5.20      1.66      37        累涨修正：55.37     75
//        INDEX_HK.put("513170", "指数-港股             ");//恒生央企ETF           市值：6.29      累涨：28.34     12.16     10.03     6.15      10日：4.11      1.62      38        累涨修正：54.38     76
//        INDEX_HK.put("513630", "指数-港股             ");//港股红利指数ETF       市值：105.56    累涨：26.71     9.68      7.90      9.13      10日：4.61      1.45      40        累涨修正：51.88     77
//        INDEX_HK.put("159519", "指数-港股             ");//港股国企ETF           市值：2.09      累涨：26.44     10.97     7.81      7.66      10日：3.80      1.51      41        累涨修正：50.65     78
//        INDEX_HK.put("517000", "指数-港股             ");//沪港深500ETF          市值：3.65      累涨：28.31     11.97     7.03      9.31      10日：4.05      1.26      35        累涨修正：50.27     79
//        INDEX_HK.put("517170", "指数-港股             ");//沪港深ETF             市值：0.36      累涨：28.72     11.69     8.28      8.75      10日：4.48      1.14      39        累涨修正：50.22     80
//        INDEX_HK.put("517010", "指数-港股             ");//沪港深500ETF易方达    市值：0.73      累涨：28.39     11.57     8.22      8.60      10日：3.96      1.14      29        累涨修正：48.85     81
//        INDEX_HK.put("517030", "指数-港股             ");//沪港深300ETF易方达    市值：0.70      累涨：24.87     9.62      7.43      7.82      10日：5.02      1.25      42        累涨修正：48.66     82
//        INDEX_HK.put("517080", "指数-港股             ");//沪港深500ETF基金      市值：3.86      累涨：27.87     11.67     7.17      9.03      10日：3.85      1.17      42        累涨修正：48.44     83
//        INDEX_HK.put("517300", "指数-港股             ");//沪港深300ETF          市值：26.52     累涨：23.98     10.14     6.28      7.56      10日：3.78      1.00      43        累涨修正：42.54     84
//        INDEX_HK.put("159202", "指数-港股             ");//恒生互联网科技ETF     市值：1.26      累涨：                              16.07     10日：4.47      0.97      35        累涨修正：35.68     85
//        INDEX_HK.put("159220", "指数-港股             ");//港股通红利ETF         市值：2.19      累涨：                                        10日：          1.47                累涨修正：          86
    }


    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股

    static {
        INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：6.41      累涨：72.91     23.94     26.33     22.64     10日：20.33     5.15      1         累涨修正：144.67    1
        INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：6.43      累涨：81.81     29.23     34.91     17.67     10日：13.10     2.09      2         累涨修正：118.75    2
//        INDEX_CN_NOT_USA.put("159502", "指数-外盘-美股        ");//标普生物科技ETF       市值：13.06     累涨：41.26     7.22      16.29     17.75     10日：8.15      5.62      29        累涨修正：108.25    3
//        INDEX_CN_NOT_USA.put("513290", "指数-外盘-美股        ");//纳指生物科技ETF       市值：12.39     累涨：38.92     6.88      16.65     15.39     10日：8.43      5.65      30        累涨修正：103.16    4
//        INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：95.39     累涨：52.21     9.52      22.78     19.91     10日：10.04     1.26      3         累涨修正：86.15     5
        INDEX_CN_NOT_USA.put("513390", "指数-外盘-美股        ");//纳指100ETF            市值：27.97     累涨：45.76     5.88      23.11     16.77     10日：8.20      1.41      4         累涨修正：76.83     6
//        INDEX_CN_NOT_USA.put("159513", "指数-外盘-美股        ");//纳斯达克100指数ETF    市值：60.03     累涨：45.50     7.17      21.01     17.32     10日：8.17      1.25      5         累涨修正：74.47     7
//        INDEX_CN_NOT_USA.put("159632", "指数-外盘-美股        ");//纳斯达克ETF           市值：93.30     累涨：45.54     7.38      20.89     17.27     10日：7.99      1.21      10        累涨修正：74.41     8
//        INDEX_CN_NOT_USA.put("513110", "指数-外盘-美股        ");//纳斯达克100ETF        市值：40.78     累涨：44.16     6.13      21.28     16.75     10日：8.08      1.31      7         累涨修正：74.31     9
//        INDEX_CN_NOT_USA.put("513100", "指数-外盘-美股        ");//纳指ETF               市值：146.19    累涨：45.07     8.61      20.25     16.21     10日：8.18      1.23      8         累涨修正：74.05     10
//        INDEX_CN_NOT_USA.put("159696", "指数-外盘-美股        ");//纳指ETF易方达         市值：30.07     累涨：43.95     5.80      21.34     16.81     10日：8.09      1.34      6         累涨修正：73.89     11
//        INDEX_CN_NOT_USA.put("159501", "指数-外盘-美股        ");//纳斯达克指数ETF       市值：75.48     累涨：43.66     5.73      21.07     16.86     10日：8.07      1.26      9         累涨修正：73.66     12
//        INDEX_CN_NOT_USA.put("159941", "指数-外盘-美股        ");//纳指ETF               市值：252.20    累涨：45.30     8.48      21.04     15.78     10日：8.11      1.20      11        累涨修正：73.53     13
//        INDEX_CN_NOT_USA.put("513350", "指数-外盘-美股        ");//标普油气ETF           市值：6.18      累涨：48.48     11.02     21.18     16.28     10日：11.25     0.55      1         累涨修正：73.18     14
//        INDEX_CN_NOT_USA.put("159659", "指数-外盘-美股        ");//纳斯达克100ETF        市值：51.45     累涨：43.74     5.69      21.32     16.73     10日：7.85      1.22      13        累涨修正：72.86     15
//        INDEX_CN_NOT_USA.put("513300", "指数-外盘-美股        ");//纳斯达克ETF           市值：90.80     累涨：43.99     7.54      20.52     15.93     10日：7.72      1.21      14        累涨修正：72.74     16
//        INDEX_CN_NOT_USA.put("513870", "指数-外盘-美股        ");//纳指ETF富国           市值：17.81     累涨：43.82     5.79      21.01     17.02     10日：7.74      1.17      15        累涨修正：71.68     17
//        INDEX_CN_NOT_USA.put("159577", "指数-外盘-美股        ");//美国50ETF             市值：11.06     累涨：42.51     5.68      21.59     15.24     10日：6.90      1.48      12        累涨修正：71.47     18
//        INDEX_CN_NOT_USA.put("159518", "指数-外盘-美股        ");//标普油气ETF           市值：8.30      累涨：45.80     8.02      21.73     16.05     10日：11.03     0.57      2         累涨修正：70.14     19
//        INDEX_CN_NOT_USA.put("513850", "指数-外盘-美股        ");//美国50ETF             市值：20.83     累涨：42.09     5.73      21.79     14.57     10日：6.90      1.19      17        累涨修正：67.93     20
//        INDEX_CN_NOT_USA.put("159660", "指数-外盘-美股        ");//纳指100ETF            市值：29.28     累涨：41.74     5.88      21.12     14.74     10日：7.32      1.02      16        累涨修正：67.6      21
//        INDEX_CN_NOT_USA.put("513650", "指数-外盘-美股        ");//标普500ETF南方        市值：35.23     累涨：39.28     5.57      20.43     13.28     10日：6.48      1.77      18        累涨修正：66.67     22
//        INDEX_CN_NOT_USA.put("159655", "指数-外盘-美股        ");//标普ETF               市值：33.35     累涨：39.08     5.77      20.16     13.15     10日：6.15      1.69      19        累涨修正：64.93     23
//        INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：187.44    累涨：37.83     5.38      19.03     13.42     10日：6.25      1.60      20        累涨修正：63.38     24
//        INDEX_CN_NOT_USA.put("513400", "指数-外盘-美股        ");//道琼斯ETF             市值：17.10     累涨：34.41     5.45      18.11     10.85     10日：5.34      2.38      21        累涨修正：62.24     25
//        INDEX_CN_NOT_USA.put("562060", "指数-外盘-美股        ");//标普红利ETF           市值：14.72     累涨：19.33     6.29      6.03      7.01      10日：4.76      1.99      42        累涨修正：50.74     26
    }

    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘

    static {
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.50      累涨：51.60     13.48     13.74     24.38     10日：11.20     3.53      1         累涨修正：105.13    2
//        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.42      累涨：43.35     16.28     13.25     13.82     10日：4.46      2.68      5         累涨修正：76.85     3
//        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：1.79      累涨：40.09     12.59     11.86     15.64     10日：4.69      2.81      6         累涨修正：76.53     4
//        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.18      累涨：44.00     15.52     12.60     15.88     10日：5.74      2.38      2         累涨修正：76.41     5
//        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.53      累涨：37.11     11.89     9.99      15.23     10日：5.71      2.94      11        累涨修正：75.97     6
//        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：5.83      累涨：40.81     12.64     12.11     16.06     10日：5.83      2.54      3         累涨修正：75.93     7
//        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.14      累涨：41.41     12.26     13.84     15.31     10日：5.52      2.10      4         累涨修正：75.55     8
//        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.58      累涨：36.97     12.23     9.46      15.28     10日：5.36      2.80      12        累涨修正：73.73     9
//        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：22.97     累涨：38.79     11.85     12.19     14.75     10日：5.14      2.57      10        累涨修正：72.16     10
//        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.50      累涨：40.12     12.31     12.06     15.75     10日：4.71      2.35      9         累涨修正：70.84     11
//        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.27      累涨：40.22     11.52     10.66     18.04     10日：5.15      2.09      13        累涨修正：70.43     12
//        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.64      累涨：39.61     13.15     10.56     15.90     10日：5.05      2.39      7         累涨修正：69.14     13
//        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.14      累涨：41.61     13.55     12.17     15.89     10日：4.11      2.37      8         累涨修正：68.83     14
//        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.18      累涨：32.46     8.97      9.41      14.08     10日：6.51      1.97      17        累涨修正：67.15     15
//        INDEX_CN_1000.put("513650", "指数-中小盘           ");//标普500ETF南方        市值：35.23     累涨：39.28     5.57      20.43     13.28     10日：6.48      1.77      18        累涨修正：66.67     16
//        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF指数       市值：0.19      累涨：37.17     11.52     11.81     13.84     10日：4.44      2.03      14        累涨修正：64.67     17
//        INDEX_CN_1000.put("513500", "指数-中小盘           ");//标普500ETF            市值：187.44    累涨：37.83     5.38      19.03     13.42     10日：6.25      1.60      20        累涨修正：63.38     18
//        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.11      累涨：34.73     12.07     10.18     12.48     10日：4.42      1.84      15        累涨修正：60.59     19
//        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：6.75      累涨：34.26     12.29     9.19      12.78     10日：4.95      1.71      16        累涨修正：60.31     20
        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.12      累涨：32.26     12.78     9.05      10.43     10日：2.62      1.90      33        累涨修正：58.4      21
//        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.57      累涨：34.17     11.20     10.78     12.19     10日：4.13      1.63      18        累涨修正：57.7      22
//        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.12      累涨：31.61     11.47     8.59      11.55     10日：4.53      1.45      19        累涨修正：56.62     23
//        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.31      累涨：29.96     10.58     8.17      11.21     10日：4.60      1.57      20        累涨修正：56.43     24
//        INDEX_CN_1000.put("159521", "指数-中小盘           ");//国证2000ETF指数基金   市值：0.18      累涨：32.28     11.24     9.94      11.10     10日：3.71      1.71      21        累涨修正：56.41     25
//        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.42      累涨：33.42     11.66     10.99     10.77     10日：3.55      1.60      22        累涨修正：56.23     26
//        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.78      累涨：26.07     8.13      6.99      10.95     10日：5.60      1.72      36        累涨修正：56.19     27
//        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：2.93      累涨：28.78     12.14     7.24      9.40      10日：4.49      1.48      23        累涨修正：54.04     28
//        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：365.07    累涨：29.60     10.78     8.50      10.32     10日：3.67      1.54      31        累涨修正：53.32     29
//        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：0.92      累涨：28.26     10.27     7.27      10.72     10日：4.09      1.44      32        累涨修正：52.28     30
//        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：627.84    累涨：29.60     10.92     7.94      10.74     10日：3.97      1.43      24        累涨修正：52.15     31
//        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：3.04      累涨：32.80     10.74     9.95      12.11     10日：3.43      1.35      25        累涨修正：52.13     32
//        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：3.97      累涨：24.09     7.88      7.10      9.11      10日：4.21      1.81      43        累涨修正：51.79     33
//        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.18      累涨：34.40     14.46     9.22      10.72     10日：3.10      1.26      26        累涨修正：51.73     34
//        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：288.24    累涨：29.12     10.50     8.05      10.57     10日：3.91      1.34      28        累涨修正：51.68     35
//        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.42      累涨：27.79     9.40      8.64      9.75      10日：3.34      1.67      39        累涨修正：51.51     36
//        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：18.86     累涨：29.01     10.46     7.81      10.74     10日：3.84      1.36      30        累涨修正：51.37     37
//        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：113.46    累涨：29.37     10.53     8.20      10.64     10日：3.60      1.30      40        累涨修正：50.87     38
//        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.48      累涨：32.09     12.12     10.38     9.59      10日：3.33      1.05      34        累涨修正：50.3      39
//        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.65      累涨：28.31     11.97     7.03      9.31      10日：4.05      1.26      35        累涨修正：50.27     40
        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.41      累涨：30.14     8.80      12.47     8.87      10日：3.84      1.24      27        累涨修正：50.13     41
//        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.39      累涨：35.31     11.37     11.18     12.76     10日：2.90      1.00      41        累涨修正：50.01     42
//        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：1.06      累涨：29.60     10.82     9.05      9.73      10日：3.08      1.50      38        累涨修正：49.46     43
//        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.73      累涨：28.39     11.57     8.22      8.60      10日：3.96      1.14      29        累涨修正：48.85     44
//        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.33      累涨：30.15     10.31     9.82      10.02     10日：3.19      1.36      37        累涨修正：48.76     45
//        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：3.86      累涨：27.87     11.67     7.17      9.03      10日：3.85      1.17      42        累涨修正：48.44     46
//        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.52      累涨：21.57     8.50      6.29      6.78      10日：2.70      1.83      63        累涨修正：47.1      47
//        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.21      累涨：24.49     8.15      8.98      7.36      10日：3.32      1.60      44        累涨修正：46.49     48
//        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.15      累涨：24.64     8.95      8.44      7.25      10日：2.85      1.67      45        累涨修正：45.98     49
//        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.86      累涨：24.19     7.92      7.99      8.28      10日：4.19      1.11      20        累涨修正：44.78     50
//        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.11      累涨：24.50     8.19      9.30      7.01      10日：2.91      1.34      47        累涨修正：43.52     51
//        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.58      累涨：26.45     10.14     8.60      7.71      10日：3.30      0.89      46        累涨修正：42.84     52
//        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500指数ETF           市值：143.46    累涨：21.88     6.78      8.40      6.70      10日：4.04      1.13      48        累涨修正：42.39     53
//        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：62.47     累涨：20.48     6.77      7.03      6.68      10日：3.98      1.15      51        累涨修正：41.09     54
//        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.16      累涨：20.59     6.84      6.75      7.00      10日：3.31      1.24      73        累涨修正：40.85     55
//        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.37      累涨：23.44     7.69      8.66      7.09      10日：3.07      0.99      50        累涨修正：40.47     56
//        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：99.20     累涨：20.49     6.96      6.87      6.66      10日：4.04      1.06      56        累涨修正：40.23     57
//        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.77      累涨：22.47     8.49      7.53      6.45      10日：2.60      1.14      74        累涨修正：40.21     58
//        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：23.93     累涨：20.40     6.84      7.21      6.35      10日：3.75      1.11      65        累涨修正：40.11     59
//        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：5.28      累涨：21.20     7.93      6.20      7.07      10日：3.95      0.98      58        累涨修正：39.88     60
//        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.29      累涨：23.24     8.61      7.14      7.49      10日：3.03      0.96      52        累涨修正：39.86     61
//        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：25.79     累涨：21.07     6.73      7.61      6.73      10日：3.89      1.00      53        累涨修正：39.85     62
//        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：204.47    累涨：20.90     7.77      6.49      6.64      10日：3.70      1.05      68        累涨修正：39.85     63
//        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：9.56      累涨：21.57     7.12      8.34      6.11      10日：3.63      1.00      61        累涨修正：39.83     64
//        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：56.08     累涨：20.82     7.22      6.95      6.65      10日：3.59      1.02      78        累涨修正：39.22     65
//        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：4.28      累涨：19.90     6.65      7.07      6.18      10日：3.79      1.06      82        累涨修正：39.14     66
//        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：173.21    累涨：21.56     7.30      7.74      6.52      10日：3.83      0.90      57        累涨修正：39.12     67
//        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：161.47    累涨：20.27     6.99      7.02      6.26      10日：3.87      1.01      70        累涨修正：39.12     68
//        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：18.30     累涨：23.97     8.69      7.77      7.51      10日：2.95      0.83      54        累涨修正：39        69
//        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.51      累涨：24.40     9.63      8.55      6.22      10日：2.66      0.84      77        累涨修正：38.96     70
//        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.23      累涨：24.33     8.74      7.53      8.06      10日：3.14      0.89      49        累涨修正：38.86     71
//        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：105.78    累涨：24.42     9.19      7.71      7.52      10日：2.92      0.78      55        累涨修正：38.84     72
//        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：187.24    累涨：20.72     7.30      6.54      6.88      10日：3.82      0.95      71        累涨修正：38.81     73
//        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：6.64      累涨：23.78     8.81      7.70      7.27      10日：2.84      0.84      59        累涨修正：38.7      74
//        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：29.15     累涨：20.03     6.60      6.72      6.71      10日：3.83      1.00      79        累涨修正：38.69     75
//        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：10.17     累涨：23.08     8.37      7.36      7.35      10日：3.01      0.86      67        累涨修正：38.56     76
//        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：28.30     累涨：23.32     8.15      7.65      7.52      10日：2.82      0.87      66        累涨修正：38.53     77
//        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.45      累涨：21.25     7.43      7.37      6.45      10日：3.90      0.86      64        累涨修正：38.51     78
//        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：46.26     累涨：20.13     6.94      6.65      6.54      10日：3.69      1.00      88        累涨修正：38.51     79
//        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：52.36     累涨：19.99     6.76      6.67      6.56      10日：3.65      1.01      90        累涨修正：38.4      80
//        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：1.21      累涨：18.97     6.93      5.59      6.45      10日：3.73      1.08      91        累涨修正：38.31     81
//        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.32      累涨：19.70     5.58      7.45      6.67      10日：4.15      0.93      60        累涨修正：38.23     82
//        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：33.38     累涨：19.73     6.48      6.37      6.88      10日：3.70      1.00      95        累涨修正：38.13     83
//        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：117.33    累涨：23.33     8.39      7.54      7.40      10日：2.91      0.81      72        累涨修正：38.06     84
//        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.49      累涨：20.45     7.66      6.68      6.11      10日：3.50      0.96      98        累涨修正：38.01     85
//        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：5.22      累涨：24.52     9.38      8.12      7.02      10日：2.27      0.81      69        累涨修正：37.97     86
//        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：2.17      累涨：17.23     4.21      6.29      6.73      10日：3.93      1.17      75        累涨修正：37.96     87
//        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：2.90      累涨：22.42     8.23      7.05      7.14      10日：2.87      0.89      85        累涨修正：37.95     88
//        INDEX_CN_1000.put("563360", "指数-中小盘           ");//中证A500ETF基金       市值：89.77     累涨：20.95     6.96      7.69      6.30      10日：3.51      0.90      87        累涨修正：37.87     89
//        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.35      累涨：18.68     5.86      7.11      5.71      10日：2.83      1.23      106       累涨修正：37.87     90
//        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：4.16      累涨：19.45     6.83      5.75      6.87      10日：3.88      0.96      86        累涨修正：37.77     91
//        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：21.05     累涨：22.98     8.44      6.48      8.06      10日：2.82      0.83      93        累涨修正：37.75     92
//        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：1.06      累涨：22.23     8.15      6.74      7.34      10日：2.79      0.90      94        累涨修正：37.71     93
//        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1096.57   累涨：23.33     8.67      7.25      7.41      10日：2.82      0.79      76        累涨修正：37.66     94
//        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：130.77    累涨：19.52     7.01      6.02      6.49      10日：3.94      0.93      89        累涨修正：37.63     95
//        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.64      累涨：23.04     9.11      6.53      7.40      10日：3.27      0.72      80        累涨修正：37.5      96
//        INDEX_CN_1000.put("560530", "指数-中小盘           ");//中证A500ETF摩根       市值：81.46     累涨：19.44     6.76      6.22      6.46      10日：3.82      0.93      100       累涨修正：37.31     97
//        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.70      累涨：24.43     9.87      6.91      7.65      10日：2.96      0.82      62        累涨修正：37.27     98
//        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：164.35    累涨：20.68     7.42      7.03      6.23      10日：3.61      0.84      99        累涨修正：37.14     99
//        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：1.81      累涨：19.89     6.36      7.09      6.44      10日：3.64      0.90      102       累涨修正：37.07     100
//        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：18.23     6.63      5.38      6.22      10日：3.74      1.03      103       累涨修正：37.04     101
//        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：11.98     累涨：23.40     8.54      7.63      7.23      10日：2.38      0.80      84        累涨修正：36.96     102
//        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：39.48     累涨：19.66     6.42      7.05      6.19      10日：3.62      0.90      105       累涨修正：36.8      103
//        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.57      累涨：24.45     9.79      7.44      7.22      10日：2.33      0.68      83        累涨修正：36.59     104
//        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.30      累涨：25.48     9.45      9.60      6.43      10日：2.12      0.74      81        累涨修正：36.39     105
//        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：66.78     累涨：18.69     6.64      5.60      6.45      10日：3.61      0.95      108       累涨修正：36.36     106
//        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.22      累涨：21.64     7.60      6.36      7.68      10日：3.12      0.84      92        累涨修正：36.28     107
//        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：37.47     累涨：18.60     6.48      5.31      6.81      10日：3.82      0.90      101       累涨修正：36.14     108
//        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：6.84      累涨：22.11     8.63      6.39      7.09      10日：2.74      0.77      104       累涨修正：36.06     109
//        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：146.36    累涨：18.48     7.23      5.15      6.10      10日：3.54      0.83      109       累涨修正：34.69     110
//        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：14.68     累涨：18.30     6.84      5.29      6.17      10日：3.35      0.88      110       累涨修正：34.68     111
//        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.77      累涨：22.54     7.58      6.99      7.97      10日：2.91      0.56      97        累涨修正：34.52     112
//        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.25      累涨：23.03     8.38      7.72      6.93      10日：2.10      0.77      96        累涨修正：34.23     113
//        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.84      累涨：22.10     8.64      6.63      6.83      10日：2.45      0.69      107       累涨修正：34.1      114
//        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：14.29     累涨：18.98     6.64      6.41      5.93      10日：3.49      0.60      111       累涨修正：32.56     115
//        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.58      累涨：18.76     7.25      6.10      5.41      10日：2.15      0.59      112       累涨修正：29.55     116
//        INDEX_CN_1000.put("563650", "指数-中小盘           ");//中证A500龙头ETF       市值：1.68      累涨：                              6.85      10日：3.85      1.11      156       累涨修正：26.76     117
//        INDEX_CN_1000.put("563660", "指数-中小盘           ");//A500ETF银河           市值：2.88      累涨：                              6.56      10日：3.76      0.91      180       累涨修正：24.09     118
//        INDEX_CN_1000.put("159215", "指数-中小盘           ");//中证A500ETF指数基金   市值：20.81     累涨：                              6.21      10日：3.32      0.80      190       累涨修正：21.65     119
//        INDEX_CN_1000.put("563990", "指数-中小盘           ");//800现金流ETF          市值：1.41      累涨：                                        10日：                              累涨修正：          120
//        INDEX_CN_1000.put("563680", "指数-中小盘           ");//800自由现金流ETF      市值：1.20      累涨：                                        10日：                              累涨修正：          121
//        INDEX_CN_1000.put("516460", "指数-中小盘           ");//现金流ETF800          市值：0.88      累涨：                                        10日：                              累涨修正：          122
//        INDEX_CN_1000.put("563550", "指数-中小盘           ");//A500增强ETF摩根       市值：7.04      累涨：                                        10日：                              累涨修正：          123
    }

    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板

    static {
        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.27      累涨：37.91     12.18     7.53      18.20     10日：11.32     4.05      1         累涨修正：89.35     1
//        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.40      累涨：34.95     9.94      8.02      16.99     10日：9.35      1.99      5         累涨修正：75.54     2
//        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：248.65    累涨：34.32     11.25     7.12      15.95     10日：8.62      1.99      3         累涨修正：73.45     3
//        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.19      累涨：41.51     13.65     11.52     16.34     10日：5.21      1.84      2         累涨修正：72.17     4
//        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：2.43      累涨：33.51     11.55     6.16      15.80     10日：8.68      1.91      7         累涨修正：71.88     5
        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.23      累涨：43.87     15.10     12.55     16.22     10日：5.80      1.56      4         累涨修正：71.44     6
//        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：45.76     累涨：33.91     10.75     7.10      16.06     10日：8.63      1.81      6         累涨修正：71.08     7
//        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：13.98     累涨：33.16     10.72     6.45      15.99     10日：8.31      1.91      10        累涨修正：70.79     8
//        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：3.77      累涨：32.62     10.43     6.17      16.02     10日：8.44      1.87      13        累涨修正：70.07     9
//        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.20      累涨：41.11     13.97     11.35     15.79     10日：5.73      1.57      8         累涨修正：69.84     10
//        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.61      累涨：33.44     10.69     6.84      15.91     10日：8.25      1.72      12        累涨修正：68.86     11
//        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：3.63      累涨：32.10     10.68     5.75      15.67     10日：8.41      1.80      15        累涨修正：68.72     12
//        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.20      累涨：42.70     13.64     13.04     16.02     10日：4.97      1.32      11        累涨修正：67.16     13
//        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.58      累涨：41.29     13.82     12.44     15.03     10日：5.22      1.38      14        累涨修正：66.91     14
//        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：39.37     累涨：36.52     10.93     9.97      15.62     10日：6.19      1.43      16        累涨修正：64.63     15
//        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.84      累涨：33.08     10.71     8.78      13.59     10日：7.02      1.59      19        累涨修正：64.61     16
//        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：831.27    累涨：31.49     10.29     7.36      13.84     10日：7.17      1.59      21        累涨修正：63.32     17
//        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.87      累涨：36.07     11.83     8.31      15.93     10日：7.34      1.24      9         累涨修正：63.13     18
//        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：98.93     累涨：31.78     10.63     7.55      13.60     10日：7.07      1.55      22        累涨修正：62.97     19
//        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.33      累涨：31.52     10.46     7.27      13.79     10日：7.16      1.55      23        累涨修正：62.89     20
//        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.07      累涨：30.47     10.17     6.61      13.69     10日：6.76      1.68      30        累涨修正：62.47     21
//        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：45.59     累涨：30.62     10.22     6.80      13.60     10日：6.90      1.61      29        累涨修正：62.13     22
//        INDEX_300.put("159957", "指数-创业板           ");//创业板ETF华夏         市值：16.89     累涨：30.27     10.27     6.55      13.45     10日：7.08      1.59      31        累涨修正：61.92     23
//        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.18      累涨：30.56     9.96      7.20      13.40     10日：7.16      1.79      26        累涨修正：61.84     24
//        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：91.03     累涨：29.95     10.04     6.36      13.55     10日：7.09      1.61      33        累涨修正：61.84     25
//        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.66      累涨：43.52     13.07     16.94     13.51     10日：3.80      1.11      24        累涨修正：61.79     26
//        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：25.26     累涨：29.96     10.17     6.22      13.57     10日：6.92      1.63      34        累涨修正：61.73     27
//        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.31      累涨：31.75     9.82      7.23      14.70     10日：7.52      1.35      28        累涨修正：61.64     28
//        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：5.04      累涨：30.67     10.06     6.92      13.69     10日：7.05      1.52      32        累涨修正：61.49     29
//        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：6.67      累涨：33.78     11.65     7.28      14.85     10日：8.05      1.02      17        累涨修正：61.1      30
//        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.44      累涨：34.39     11.03     9.15      14.21     10日：5.95      1.48      20        累涨修正：60.96     31
//        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：20.39     累涨：30.10     10.24     6.52      13.34     10日：6.88      1.53      39        累涨修正：60.69     32
//        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：0.93      累涨：27.67     9.33      6.36      11.98     10日：6.06      2.13      38        累涨修正：60.56     33
//        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.48      累涨：30.39     10.58     6.97      12.84     10日：6.17      1.53      35        累涨修正：59.56     34
//        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.24      累涨：31.69     10.89     8.23      12.57     10日：6.22      1.44      25        累涨修正：59.06     35
//        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.50      累涨：35.33     10.31     11.02     14.00     10日：5.46      1.25      27        累涨修正：57.48     36
//        INDEX_300.put("159836", "指数-创业板           ");//创业板300ETF天弘      市值：1.81      累涨：30.32     10.43     6.91      12.98     10日：5.53      1.38      41        累涨修正：56.56     37
//        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.24      累涨：30.09     11.19     5.57      13.33     10日：5.77      1.12      42        累涨修正：53.95     38
//        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：2.10      累涨：31.29     10.84     8.50      11.95     10日：5.86      0.72      18        累涨修正：50.93     39
//        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：22.87     累涨：29.65     11.66     8.17      9.82      10日：4.38      0.73      36        累涨修正：46.44     40
//        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.23      累涨：28.42     11.17     7.55      9.70      10日：4.36      0.91      40        累涨修正：46.38     41
//        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：14.51     累涨：29.86     11.88     8.22      9.76      10日：4.08      0.72      37        累涨修正：45.94     42
//        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：4.83      累涨：27.93     7.59      10.47     9.87      10日：4.64      0.66      44        累涨修正：44.47     43
//        INDEX_300.put("159368", "指数-创业板           ");//创业板新能源ETF华夏   市值：1.21      累涨：                              14.73     10日：6.38      1.52      36        累涨修正：44.21     44
//        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.20      累涨：28.45     10.88     8.14      9.43      10日：3.70      0.74      43        累涨修正：43.99     45
//        INDEX_300.put("159377", "指数-创业板           ");//创业板医药ETF国泰     市值：0.25      累涨：                              8.35      10日：4.42      2.06      69        累涨修正：39.85     46
    }

    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘

    static {
//        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.18      累涨：32.46     8.97      9.41      14.08     10日：6.51      1.97      17        累涨修正：67.15     1
        INDEX_CN_BIG.put("159721", "指数-大盘             ");//深证100ETF永赢        市值：0.85      累涨：29.91     11.32     7.98      10.61     10日：7.58      1.57      18        累涨修正：62.34     2
//        INDEX_CN_BIG.put("159836", "指数-大盘             ");//创业板300ETF天弘      市值：1.81      累涨：30.32     10.43     6.91      12.98     10日：5.53      1.38      41        累涨修正：56.56     3
//        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.12      累涨：23.08     7.74      6.07      9.27      10日：5.80      2.46      10        累涨修正：55.79     4
//        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.67      累涨：27.65     9.21      8.95      9.49      10日：4.14      1.90      1         累涨修正：54.87     5
//        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.09      累涨：23.79     8.42      6.66      8.71      10日：5.69      1.73      4         累涨修正：54.2      6
//        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.05      累涨：24.06     4.49      8.62      10.95     10日：6.51      3.61      8         累涨修正：54.11     7
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.58      累涨：23.04     8.61      5.87      8.56      10日：5.35      1.81      7         累涨修正：53.65     8
//        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.55      累涨：26.52     9.68      9.43      7.41      10日：4.66      1.55      22        累涨修正：52.89     9
//        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：1.94      累涨：24.13     7.74      7.31      9.08      10日：5.31      1.55      6         累涨修正：51.8      10
//        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.62      累涨：23.61     8.40      7.84      7.37      10日：4.87      1.64      3         累涨修正：51.39     11
//        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：2.96      累涨：24.67     7.99      7.39      9.29      10日：5.19      1.48      5         累涨修正：51.33     12
//        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：14.67     累涨：33.05     12.22     9.13      11.70     10日：5.53      0.61      16        累涨修正：50.82     13
//        INDEX_CN_BIG.put("562060", "指数-大盘             ");//标普红利ETF           市值：14.72     累涨：19.33     6.29      6.03      7.01      10日：4.76      1.99      42        累涨修正：50.74     14
//        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.39      累涨：22.32     7.07      6.11      9.14      10日：5.26      1.62      22        累涨修正：50.66     15
//        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.52      累涨：22.73     8.62      5.02      9.09      10日：5.61      1.61      11        累涨修正：50.61     16
//        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.45      累涨：22.65     7.94      6.32      8.39      10日：4.86      1.65      17        累涨修正：50.52     17
//        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.55      累涨：23.11     8.79      8.60      5.72      10日：4.18      1.73      25        累涨修正：50.5      18
//        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：63.53     累涨：23.02     7.90      5.80      9.32      10日：5.32      1.52      18        累涨修正：50.38     19
//        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：2.59      累涨：32.72     11.19     9.50      12.03     10日：5.63      0.58      14        累涨修正：50.36     20
//        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.76      累涨：23.45     7.97      6.43      9.05      10日：5.22      1.49      15        累涨修正：50.28     21
//        INDEX_CN_BIG.put("515780", "指数-大盘             ");//浦银MSCI中国ETF       市值：0.08      累涨：20.92     6.51      5.49      8.92      10日：3.97      1.98      57        累涨修正：50.08     22
//        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：2.17      累涨：32.22     11.21     9.02      11.99     10日：5.68      0.59      17        累涨修正：50.07     23
//        INDEX_CN_BIG.put("512360", "指数-大盘             ");//MSCI中国A股ETF基金    市值：0.63      累涨：23.89     7.90      8.14      7.85      10日：5.38      1.69      2         累涨修正：49.95     24
        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：40.87     累涨：22.48     8.09      6.98      7.41      10日：5.06      1.56      9         累涨修正：49.76     25
//        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.16      累涨：22.36     7.66      5.68      9.02      10日：5.38      1.49      24        累涨修正：49.51     26
//        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.70      累涨：24.87     9.62      7.43      7.82      10日：5.02      1.25      42        累涨修正：48.66     27
//        INDEX_CN_BIG.put("562890", "指数-大盘             ");//中证A50指数ETF        市值：4.58      累涨：22.38     8.33      6.71      7.34      10日：5.00      1.48      13        累涨修正：48.66     28
//        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：10.45     累涨：22.82     8.12      6.99      7.71      10日：4.81      1.47      12        累涨修正：48.61     29
//        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：3.54      累涨：20.77     5.98      8.95      5.84      10日：4.20      1.71      47        累涨修正：47.98     30
//        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.49      累涨：21.60     8.27      4.55      8.78      10日：5.24      1.44      26        累涨修正：47.92     31
//        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：18.44     累涨：22.31     8.02      7.07      7.22      10日：4.92      1.42      16        累涨修正：47.77     32
//        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：32.93     累涨：22.57     7.85      7.51      7.21      10日：4.60      1.44      19        累涨修正：47.61     33
//        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：48.11     累涨：23.22     7.90      7.72      7.60      10日：4.73      1.32      14        累涨修正：47.2      34
//        INDEX_CN_BIG.put("562530", "指数-大盘             ");//中证1000价值ETF       市值：0.52      累涨：21.57     8.50      6.29      6.78      10日：2.70      1.83      63        累涨修正：47.1      35
//        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：1.94      累涨：23.59     8.44      5.86      9.29      10日：4.57      1.27      30        累涨修正：46.7      36
//        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：4.93      累涨：25.06     8.17      11.25     5.64      10日：3.28      1.37      33        累涨修正：46.69     37
//        INDEX_CN_BIG.put("560350", "指数-大盘             ");//中证A50ETF指数基金    市值：29.36     累涨：22.34     7.89      7.29      7.16      10日：4.85      1.33      20        累涨修正：46.67     38
//        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：10.49     累涨：21.29     8.16      5.97      7.16      10日：5.00      1.39      28        累涨修正：46.58     39
//        INDEX_CN_BIG.put("560500", "指数-大盘             ");//500质量成长ETF        市值：5.21      累涨：24.49     8.15      8.98      7.36      10日：3.32      1.60      44        累涨修正：46.49     40
//        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.46      累涨：22.89     8.16      8.70      6.03      10日：4.62      1.29      32        累涨修正：46.32     41
//        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：1.19      累涨：19.99     3.72      9.37      6.90      10日：4.75      1.50      34        累涨修正：45.99     42
//        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：10.90     累涨：21.41     8.00      6.52      6.89      10日：4.77      1.34      33        累涨修正：45.69     43
//        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：1.20      累涨：18.23     3.81      8.81      5.61      10日：3.50      1.98      19        累涨修正：45.68     44
//        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.62      累涨：24.95     9.98      7.57      7.40      10日：4.49      1.06      21        累涨修正：45.59     45
//        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：6.97      累涨：20.51     5.27      9.63      5.61      10日：3.84      1.58      81        累涨修正：45.57     46
//        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：0.95      累涨：20.62     6.86      6.84      6.92      10日：4.23      1.49      43        累涨修正：45.47     47
//        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：51.73     累涨：22.18     8.27      6.77      7.14      10日：4.98      1.21      27        累涨修正：45.45     48
//        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：35.99     累涨：22.68     8.37      7.17      7.14      10日：4.72      1.21      23        累涨修正：45.43     49
//        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：25.47     累涨：22.19     8.05      7.19      6.95      10日：4.69      1.22      31        累涨修正：44.99     50
//        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.28      累涨：22.23     8.04      7.68      6.51      10日：4.92      1.17      29        累涨修正：44.94     51
//        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.39      累涨：27.40     8.41      10.84     8.15      10日：3.55      0.93      37        累涨修正：44.73     52
//        INDEX_CN_BIG.put("159966", "指数-大盘             ");//创业板价值ETF         市值：4.83      累涨：27.93     7.59      10.47     9.87      10日：4.64      0.66      44        累涨修正：44.47     53
//        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.22      累涨：21.86     8.02      4.67      9.17      10日：4.51      1.23      46        累涨修正：44.41     54
//        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：17.33     累涨：19.24     5.91      6.89      6.44      10日：3.83      1.59      76        累涨修正：44.39     55
//        INDEX_CN_BIG.put("512550", "指数-大盘             ");//A50ETF基金            市值：3.57      累涨：21.11     8.29      5.48      7.34      10日：5.20      1.16      35        累涨修正：44.27     56
//        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：72.07     累涨：21.35     7.93      6.38      7.04      10日：4.80      1.21      38        累涨修正：44.26     57
//        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.31      累涨：19.66     7.34      5.81      6.51      10日：4.64      1.39      41        累涨修正：44.23     58
//        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：6.90      累涨：20.64     8.14      5.59      6.91      10日：4.59      1.29      45        累涨修正：44.01     59
//        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：5.06      累涨：23.44     8.37      5.92      9.15      10日：4.35      1.07      36        累涨修正：43.91     60
//        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.12      累涨：21.37     7.64      7.36      6.37      10日：4.53      1.22      41        累涨修正：43.85     61
//        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：162.69    累涨：20.59     5.24      8.24      7.11      10日：4.33      1.32      40        累涨修正：43.77     62
//        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：8.14      累涨：19.33     5.04      7.10      7.19      10日：4.41      1.40      48        累涨修正：43.55     63
//        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：2.77      累涨：21.50     4.36      11.25     5.89      10日：3.44      1.37      104       累涨修正：43.45     64
//        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.53      累涨：21.69     5.52      9.75      6.42      10日：3.78      1.29      65        累涨修正：43.44     65
//        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.71      累涨：20.35     5.58      9.30      5.47      10日：3.84      1.39      91        累涨修正：43.32     66
//        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.38      累涨：20.45     6.25      8.17      6.03      10日：3.66      1.54      73        累涨修正：43.17     67
//        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.47      累涨：21.64     8.26      6.43      6.95      10日：4.69      1.10      39        累涨修正：43.12     68
//        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：1.80      累涨：22.72     7.90      8.73      6.09      10日：4.10      1.07      49        累涨修正：42.69     69
//        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：3.01      累涨：20.20     8.02      5.92      6.26      10日：4.37      1.25      56        累涨修正：42.69     70
//        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：26.52     累涨：23.98     10.14     6.28      7.56      10日：3.78      1.00      43        累涨修正：42.54     71
//        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：204.43    累涨：18.74     4.84      8.29      5.61      10日：4.13      1.41      87        累涨修正：42.51     72
//        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：31.62     累涨：21.68     9.11      7.85      4.72      10日：3.04      1.34      75        累涨修正：42.5      73
//        INDEX_CN_BIG.put("159351", "指数-大盘             ");//A500指数ETF           市值：143.46    累涨：21.88     6.78      8.40      6.70      10日：4.04      1.13      48        累涨修正：42.39     74
//        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.65      累涨：21.17     5.62      7.55      8.00      10日：5.15      0.98      44        累涨修正：42.25     75
//        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：0.87      累涨：18.11     6.53      5.30      6.28      10日：4.34      1.40      89        累涨修正：42.19     76
//        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.72      累涨：20.44     5.14      8.39      6.91      10日：3.89      1.26      63        累涨修正：42.08     77
//        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.58      累涨：18.26     4.14      7.71      6.41      10日：3.87      1.46      77        累涨修正：42.06     78
//        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.81      累涨：20.42     6.62      7.11      6.69      10日：4.10      1.22      66        累涨修正：42.04     79
//        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.49      累涨：18.92     4.47      8.02      6.43      10日：4.32      1.31      54        累涨修正：41.97     80
//        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：1.92      累涨：20.24     7.69      6.36      6.19      10日：4.23      1.20      71        累涨修正：41.9      81
//        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：8.29      累涨：19.60     6.09      7.51      6.00      10日：4.20      1.26      83        累涨修正：41.86     82
//        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：7.50      累涨：19.57     7.32      5.11      7.14      10日：4.16      1.26      69        累涨修正：41.75     83
//        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波ETF基金       市值：1.62      累涨：21.05     5.27      8.82      6.96      10日：4.27      1.10      51        累涨修正：41.69     84
//        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：42.17     累涨：19.36     6.54      5.65      7.17      10日：4.26      1.25      68        累涨修正：41.63     85
//        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：1.98      累涨：18.89     7.53      4.84      6.52      10日：4.84      1.18      67        累涨修正：41.55     86
//        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.31      累涨：21.11     7.78      6.23      7.10      10日：4.92      0.96      50        累涨修正：41.51     87
//        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：0.68      累涨：23.08     8.17      6.96      7.95      10日：3.59      1.02      61        累涨修正：41.48     88
//        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.29      累涨：21.29     8.01      6.23      7.05      10日：4.42      1.02      42        累涨修正：41.35     89
//        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：1.02      累涨：21.65     6.01      8.81      6.83      10日：4.60      0.95      52        累涨修正：41.3      90
//        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.15      累涨：19.78     7.81      5.59      6.38      10日：4.25      1.17      72        累涨修正：41.15     91
//        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.24      累涨：21.12     6.23      8.28      6.61      10日：4.23      1.05      60        累涨修正：41.13     92
//        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.30      累涨：18.34     5.78      6.57      5.99      10日：4.51      1.25      96        累涨修正：41.11     93
//        INDEX_CN_BIG.put("159339", "指数-大盘             ");//A500ETF               市值：62.47     累涨：20.48     6.77      7.03      6.68      10日：3.98      1.15      51        累涨修正：41.09     94
//        INDEX_CN_BIG.put("562330", "指数-大盘             ");//中证500价值ETF        市值：0.16      累涨：20.59     6.84      6.75      7.00      10日：3.31      1.24      73        累涨修正：40.85     95
//        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：15.80     累涨：17.65     3.95      7.35      6.35      10日：4.11      1.36      82        累涨修正：40.83     96
//        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.41      累涨：20.56     8.83      7.23      4.50      10日：3.07      1.28      98        累涨修正：40.78     97
//        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.32      累涨：19.25     6.70      6.17      6.38      10日：4.04      1.22      92        累涨修正：40.75     98
//        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：2.87      累涨：17.87     6.48      4.74      6.65      10日：3.89      1.37      111       累涨修正：40.72     99
//        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：2.55      累涨：18.95     4.64      7.10      7.21      10日：4.15      1.22      70        累涨修正：40.67     100
//        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：89.27     累涨：18.74     5.53      7.70      5.51      10日：3.70      1.32      123       累涨修正：40.66     101
//        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：84.34     累涨：18.30     4.64      7.76      5.90      10日：3.42      1.39      117       累涨修正：40.43     102
//        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.53      累涨：18.38     5.22      5.70      7.46      10日：4.77      1.13      78        累涨修正：40.35     103
//        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：15.71     累涨：19.19     4.85      7.52      6.82      10日：4.14      1.17      74        累涨修正：40.34     104
//        INDEX_CN_BIG.put("560610", "指数-大盘             ");//A500指数ETF           市值：99.20     累涨：20.49     6.96      6.87      6.66      10日：4.04      1.06      56        累涨修正：40.23     105
//        INDEX_CN_BIG.put("159362", "指数-大盘             ");//A500ETF工银           市值：23.93     累涨：20.40     6.84      7.21      6.35      10日：3.75      1.11      65        累涨修正：40.11     106
//        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.53      累涨：17.30     6.31      4.73      6.26      10日：4.34      1.27      106       累涨修正：39.95     107
//        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：25.60     累涨：20.14     7.74      6.00      6.40      10日：4.12      1.05      84        累涨修正：39.93     108
//        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：18.40     累涨：22.46     8.87      7.29      6.30      10日：4.21      0.82      55        累涨修正：39.9      109
//        INDEX_CN_BIG.put("159379", "指数-大盘             ");//A500ETF融通           市值：5.28      累涨：21.20     7.93      6.20      7.07      10日：3.95      0.98      58        累涨修正：39.88     110
//        INDEX_CN_BIG.put("159358", "指数-大盘             ");//中证A500ETF基金       市值：25.79     累涨：21.07     6.73      7.61      6.73      10日：3.89      1.00      53        累涨修正：39.85     111
//        INDEX_CN_BIG.put("159338", "指数-大盘             ");//中证A500ETF           市值：204.47    累涨：20.90     7.77      6.49      6.64      10日：3.70      1.05      68        累涨修正：39.85     112
//        INDEX_CN_BIG.put("563860", "指数-大盘             ");//A500ETF海富通         市值：9.56      累涨：21.57     7.12      8.34      6.11      10日：3.63      1.00      61        累涨修正：39.83     113
//        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：0.97      累涨：20.82     5.66      7.56      7.60      10日：4.83      0.84      59        累涨修正：39.72     114
//        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：2.33      累涨：19.96     7.20      6.69      6.07      10日：4.07      1.05      100       累涨修正：39.65     115
//        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：1.84      累涨：21.90     8.41      7.72      5.77      10日：4.08      0.87      80        累涨修正：39.63     116
//        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：71.13     累涨：18.63     5.62      7.59      5.42      10日：3.62      1.24      135       累涨修正：39.51     117
//        INDEX_CN_BIG.put("563880", "指数-大盘             ");//中证A500指数ETF       市值：56.08     累涨：20.82     7.22      6.95      6.65      10日：3.59      1.02      78        累涨修正：39.22     118
//        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2654.72   累涨：20.49     7.52      6.92      6.05      10日：4.00      0.97      103       累涨修正：39.16     119
//        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.45      累涨：19.42     6.92      6.67      5.83      10日：4.59      0.96      44        累涨修正：39.16     120
//        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1655.71   累涨：21.62     8.76      6.99      5.87      10日：3.98      0.87      95        累涨修正：39.15     121
//        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：4.19      累涨：20.51     7.09      7.19      6.23      10日：3.98      0.97      94        累涨修正：39.14     122
//        INDEX_CN_BIG.put("159376", "指数-大盘             ");//A500ETF指数基金       市值：4.28      累涨：19.90     6.65      7.07      6.18      10日：3.79      1.06      82        累涨修正：39.14     123
//        INDEX_CN_BIG.put("159352", "指数-大盘             ");//中证A500ETF南方       市值：173.21    累涨：21.56     7.30      7.74      6.52      10日：3.83      0.90      57        累涨修正：39.12     124
//        INDEX_CN_BIG.put("563220", "指数-大盘             ");//中证A500ETF富国       市值：161.47    累涨：20.27     6.99      7.02      6.26      10日：3.87      1.01      70        累涨修正：39.12     125
//        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.48      累涨：18.88     3.43      10.12     5.33      10日：3.21      1.31      23        累涨修正：39.08     126
//        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：2.04      累涨：19.09     7.43      5.70      5.96      10日：4.15      1.06      47        累涨修正：39.05     127
//        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.14      累涨：18.20     7.05      5.00      6.15      10日：3.99      1.17      128       累涨修正：39.05     128
//        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.93      累涨：18.86     6.39      6.16      6.31      10日：3.75      1.15      134       累涨修正：39.01     129
//        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：10.71     累涨：19.37     6.67      6.65      6.05      10日：4.14      1.03      112       累涨修正：38.98     130
//        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：3.80      累涨：19.70     8.11      5.19      6.40      10日：4.30      0.97      85        累涨修正：38.97     131
//        INDEX_CN_BIG.put("563800", "指数-大盘             ");//中证A500ETF龙头       市值：187.24    累涨：20.72     7.30      6.54      6.88      10日：3.82      0.95      71        累涨修正：38.81     132
//        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF指数         市值：0.75      累涨：22.05     8.54      7.85      5.66      10日：3.93      0.80      90        累涨修正：38.71     133
//        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：1.87      累涨：20.43     7.92      6.51      6.00      10日：4.13      0.91      108       累涨修正：38.7      134
//        INDEX_CN_BIG.put("159359", "指数-大盘             ");//中证A500ETF华安       市值：29.15     累涨：20.03     6.60      6.72      6.71      10日：3.83      1.00      79        累涨修正：38.69     135
//        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.26      累涨：19.64     6.82      6.97      5.85      10日：4.01      1.00      48        累涨修正：38.66     136
//        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：1.01      累涨：19.58     7.79      5.77      6.02      10日：4.09      0.99      119       累涨修正：38.65     137
//        INDEX_CN_BIG.put("159661", "指数-大盘             ");//中证A100指数ETF       市值：0.28      累涨：18.79     7.94      4.55      6.30      10日：4.13      1.05      105       累涨修正：38.6      138
//        INDEX_CN_BIG.put("159356", "指数-大盘             ");//A500ETF基金           市值：52.36     累涨：19.99     6.76      6.67      6.56      10日：3.65      1.01      90        累涨修正：38.4      139
//        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：36.21     累涨：19.17     7.09      5.98      6.10      10日：4.22      0.98      109       累涨修正：38.39     140
//        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：1.45      累涨：20.82     6.28      7.43      7.11      10日：4.37      0.80      79        累涨修正：38.36     141
//        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.31      累涨：20.88     7.77      7.26      5.85      10日：3.72      0.91      127       累涨修正：38.33     142
//        INDEX_CN_BIG.put("560750", "指数-大盘             ");//A500ETF申万菱信       市值：1.21      累涨：18.97     6.93      5.59      6.45      10日：3.73      1.08      91        累涨修正：38.31     143
//        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：2.84      累涨：19.28     6.61      6.22      6.45      10日：3.95      1.01      115       累涨修正：38.29     144
//        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1966.23   累涨：20.26     7.58      6.62      6.06      10日：4.05      0.90      116       累涨修正：38.26     145
//        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：77.45     累涨：19.52     6.87      6.43      6.22      10日：4.09      0.96      113       累涨修正：38.26     146
//        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：25.21     累涨：16.50     5.21      6.65      4.64      10日：3.34      1.37      162       累涨修正：38.25     147
//        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.32      累涨：19.70     5.58      7.45      6.67      10日：4.15      0.93      60        累涨修正：38.23     148
//        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：35.54     累涨：19.13     7.14      5.86      6.13      10日：4.25      0.96      110       累涨修正：38.19     149
//        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.63      累涨：21.58     8.35      6.86      6.37      10日：3.46      0.88      101       累涨修正：38.18     150
//        INDEX_CN_BIG.put("159360", "指数-大盘             ");//中证A500ETF天弘       市值：33.38     累涨：19.73     6.48      6.37      6.88      10日：3.70      1.00      95        累涨修正：38.13     151
//        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利100ETF            市值：0.78      累涨：18.14     5.13      7.75      5.26      10日：3.59      1.16      149       累涨修正：38.08     152
//        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：21.29     累涨：18.81     7.18      5.62      6.01      10日：4.11      1.00      131       累涨修正：38.03     153
//        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.10      累涨：18.81     7.13      5.46      6.22      10日：3.88      1.04      133       累涨修正：38.01     154
//        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：2.17      累涨：17.23     4.21      6.29      6.73      10日：3.93      1.17      75        累涨修正：37.96     155
//        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.75      累涨：18.74     6.54      5.68      6.52      10日：3.99      1.02      122       累涨修正：37.94     156
//        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.43      累涨：19.29     6.68      6.42      6.19      10日：3.82      1.00      132       累涨修正：37.93     157
//        INDEX_CN_BIG.put("563360", "指数-大盘             ");//中证A500ETF基金       市值：89.77     累涨：20.95     6.96      7.69      6.30      10日：3.51      0.90      87        累涨修正：37.87     158
//        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：5.74      累涨：18.78     7.05      5.59      6.14      10日：4.32      0.95      118       累涨修正：37.87     159
//        INDEX_CN_BIG.put("159617", "指数-大盘             ");//500价值ETF            市值：0.35      累涨：18.68     5.86      7.11      5.71      10日：2.83      1.23      106       累涨修正：37.87     160
//        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：38.28     累涨：18.84     7.46      5.28      6.10      10日：4.17      0.97      125       累涨修正：37.85     161
//        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：1.16      累涨：18.13     4.68      8.02      5.43      10日：3.26      1.20      146       累涨修正：37.85     162
//        INDEX_CN_BIG.put("159380", "指数-大盘             ");//A500ETF东财           市值：4.16      累涨：19.45     6.83      5.75      6.87      10日：3.88      0.96      86        累涨修正：37.77     163
//        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：62.50     累涨：18.59     3.98      8.45      6.16      10日：3.26      1.15      126       累涨修正：37.76     164
//        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：16.34     累涨：17.41     6.84      4.32      6.25      10日：3.95      1.69      97        累涨修正：37.67     165
//        INDEX_CN_BIG.put("159353", "指数-大盘             ");//中证A500ETF景顺       市值：130.77    累涨：19.52     7.01      6.02      6.49      10日：3.94      0.93      89        累涨修正：37.63     166
//        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1702.35   累涨：18.90     7.39      5.42      6.09      10日：4.19      0.94      130       累涨修正：37.62     167
//        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：6.12      累涨：20.87     8.40      6.62      5.85      10日：3.75      0.83      129       累涨修正：37.5      168
//        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.50      累涨：19.57     6.71      6.85      6.01      10日：3.68      0.96      145       累涨修正：37.49     169
//        INDEX_CN_BIG.put("515330", "指数-大盘             ");//沪深300ETF天弘        市值：94.87     累涨：19.31     6.92      6.26      6.13      10日：3.96      0.92      136       累涨修正：37.35     170
//        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：41.90     累涨：19.16     6.13      6.78      6.25      10日：3.15      1.08      140       累涨修正：37.34     171
//        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：39.06     累涨：20.19     7.58      6.70      5.91      10日：3.84      0.86      139       累涨修正：37.33     172
//        INDEX_CN_BIG.put("560530", "指数-大盘             ");//中证A500ETF摩根       市值：81.46     累涨：19.44     6.76      6.22      6.46      10日：3.82      0.93      100       累涨修正：37.31     173
//        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：5.90      累涨：19.39     7.11      6.23      6.05      10日：4.00      0.90      138       累涨修正：37.29     174
//        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：1.09      累涨：20.01     7.67      6.97      5.37      10日：3.12      1.00      147       累涨修正：37.25     175
//        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：2.07      累涨：21.49     8.80      6.76      5.93      10日：3.80      0.74      120       累涨修正：37.23     176
//        INDEX_CN_BIG.put("512050", "指数-大盘             ");//A500ETF基金           市值：164.35    累涨：20.68     7.42      7.03      6.23      10日：3.61      0.84      99        累涨修正：37.14     177
//        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.56      累涨：19.58     8.32      4.93      6.33      10日：4.54      0.77      99        累涨修正：37.13     178
//        INDEX_CN_BIG.put("159216", "指数-大盘             ");//深证100ETF大成        市值：0.25      累涨：                              9.06      10日：5.32      1.58      53        累涨修正：37.08     179
//        INDEX_CN_BIG.put("159386", "指数-大盘             ");//A500ETF永赢           市值：1.81      累涨：19.89     6.36      7.09      6.44      10日：3.64      0.90      102       累涨修正：37.07     180
//        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：9.34      累涨：18.24     6.64      5.51      6.09      10日：4.15      0.95      141       累涨修正：36.99     181
//        INDEX_CN_BIG.put("159357", "指数-大盘             ");//中证A500指数ETF       市值：39.48     累涨：19.66     6.42      7.05      6.19      10日：3.62      0.90      105       累涨修正：36.8      182
//        INDEX_CN_BIG.put("530080", "指数-大盘             ");//上证180ETF天弘        市值：0.51      累涨：19.25     6.63      7.26      5.36      10日：3.48      0.96      153       累涨修正：36.77     183
//        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3817.63   累涨：18.85     7.48      5.56      5.81      10日：4.01      0.90      151       累涨修正：36.77     184
//        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：20.04     累涨：17.89     6.79      4.94      6.16      10日：4.03      0.97      144       累涨修正：36.62     185
//        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：9.50      累涨：17.33     4.59      7.02      5.72      10日：3.27      1.15      163       累涨修正：36.52     186
//        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：4.89      累涨：18.51     7.04      5.41      6.06      10日：3.82      0.93      159       累涨修正：36.38     187
//        INDEX_CN_BIG.put("560510", "指数-大盘             ");//中证A500ETF           市值：66.78     累涨：18.69     6.64      5.60      6.45      10日：3.61      0.95      108       累涨修正：36.36     188
//        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：21.03     累涨：20.00     7.26      6.40      6.34      10日：3.47      0.84      142       累涨修正：36.18     189
//        INDEX_CN_BIG.put("512020", "指数-大盘             ");//A500ETF指数           市值：37.47     累涨：18.60     6.48      5.31      6.81      10日：3.82      0.90      101       累涨修正：36.14     190
//        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.48      累涨：18.87     6.73      6.22      5.92      10日：3.77      0.88      50        累涨修正：36.09     191
//        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.60      累涨：18.54     7.09      5.38      6.07      10日：3.90      0.88      155       累涨修正：36.02     192
//        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：5.96      累涨：20.39     6.66      8.31      5.42      10日：3.39      0.80      152       累涨修正：35.97     193
//        INDEX_CN_BIG.put("159207", "指数-大盘             ");//高股息ETF             市值：3.06      累涨：                              6.59      10日：3.99      1.94      114       累涨修正：35.91     194
//        INDEX_CN_BIG.put("510800", "指数-大盘             ");//50ETF基金             市值：5.02      累涨：20.29     7.99      6.55      5.75      10日：3.78      0.72      148       累涨修正：35.77     195
//        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：4.00      累涨：18.57     6.60      5.77      6.20      10日：3.70      0.89      161       累涨修正：35.76     196
//        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：7.04      累涨：17.84     5.13      7.45      5.26      10日：3.18      1.05      166       累涨修正：35.75     197
//        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：0.94      累涨：19.88     8.75      5.45      5.68      10日：3.85      0.74      150       累涨修正：35.72     198
//        INDEX_CN_BIG.put("159212", "指数-大盘             ");//深100ETF南方          市值：1.08      累涨：                              9.61      10日：5.17      1.43      62        累涨修正：35.68     199
//        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.84      累涨：16.35     3.87      6.90      5.58      10日：3.00      1.18      176       累涨修正：35.33     200
//        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.55      累涨：19.71     6.78      7.94      4.99      10日：3.24      0.81      160       累涨修正：35.1      201
//        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.40      累涨：18.25     7.59      4.83      5.83      10日：3.70      0.85      173       累涨修正：35        202
//        INDEX_CN_BIG.put("159211", "指数-大盘             ");//深证100ETF富国        市值：0.21      累涨：                              9.03      10日：5.28      1.52      58        累涨修正：34.98     203
//        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：2.95      累涨：20.73     6.42      9.20      5.11      10日：3.14      0.70      164       累涨修正：34.71     204
//        INDEX_CN_BIG.put("159361", "指数-大盘             ");//A500ETF易方达         市值：146.36    累涨：18.48     7.23      5.15      6.10      10日：3.54      0.83      109       累涨修正：34.69     205
//        INDEX_CN_BIG.put("512080", "指数-大盘             ");//A500ETF中金           市值：14.68     累涨：18.30     6.84      5.29      6.17      10日：3.35      0.88      110       累涨修正：34.68     206
//        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.57      累涨：18.71     8.20      5.07      5.44      10日：3.84      0.75      165       累涨修正：34.64     207
//        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.37      累涨：20.33     6.54      8.33      5.46      10日：3.38      0.67      158       累涨修正：34.46     208
//        INDEX_CN_BIG.put("560820", "指数-大盘             ");//中证A50ETF新华        市值：0.28      累涨：                              7.51      10日：5.02      1.53      64        累涨修正：34.38     209
//        INDEX_CN_BIG.put("515300", "指数-大盘             ");//300红利低波ETF        市值：56.32     累涨：16.30     3.91      6.34      6.05      10日：3.47      1.00      172       累涨修正：34.24     210
//        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：206.98    累涨：19.26     7.02      7.43      4.81      10日：3.01      0.80      171       累涨修正：34.08     211
//        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：55.37     累涨：18.85     6.10      7.79      4.96      10日：2.93      0.85      175       累涨修正：34.06     212
//        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波ETF天弘       市值：38.30     累涨：17.27     4.13      7.78      5.36      10日：3.15      0.95      174       累涨修正：34.02     213
//        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：50.95     累涨：20.94     6.40      9.97      4.57      10日：2.39      0.72      170       累涨修正：33.64     214
//        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：5.75      累涨：19.60     5.58      7.77      6.25      10日：3.76      0.58      143       累涨修正：33.5      215
//        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.81      累涨：18.29     5.53      7.29      5.47      10日：3.02      0.83      181       累涨修正：33.46     216
//        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：0.99      累涨：19.35     5.43      8.86      5.06      10日：2.64      0.80      178       累涨修正：33.43     217
//        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.63      累涨：20.45     7.45      7.21      5.79      10日：2.39      0.71      168       累涨修正：33.04     218
//        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.48      累涨：19.68     6.91      7.17      5.60      10日：3.04      0.65      177       累涨修正：32.91     219
//        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：28.26     累涨：18.30     5.58      8.07      4.65      10日：2.63      0.85      179       累涨修正：32.91     220
//        INDEX_CN_BIG.put("512240", "指数-大盘             ");//A50ETF龙头            市值：0.68      累涨：                              7.07      10日：4.71      1.49      88        累涨修正：32.88     221
//        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.23      累涨：20.66     8.44      5.41      6.81      10日：3.88      0.40      124       累涨修正：32.82     222
//        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：0.97      累涨：18.79     5.25      7.67      5.87      10日：3.92      0.54      157       累涨修正：32.57     223
//        INDEX_CN_BIG.put("563500", "指数-大盘             ");//中证A500ETF华宝       市值：14.29     累涨：18.98     6.64      6.41      5.93      10日：3.49      0.60      111       累涨修正：32.56     224
//        INDEX_CN_BIG.put("159209", "指数-大盘             ");//中证红利质量ETF       市值：2.16      累涨：                              6.71      10日：4.64      1.50      93        累涨修正：32.49     225
//        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.34      累涨：18.61     5.18      7.15      6.28      10日：3.45      0.60      167       累涨修正：32.11     226
//        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.34      累涨：17.72     5.31      6.55      5.86      10日：3.10      0.71      186       累涨修正：31.73     227
//        INDEX_CN_BIG.put("512250", "指数-大盘             ");//中证A50ETF招商        市值：0.16      累涨：                              7.43      10日：4.91      1.31      86        累涨修正：31.66     228
//        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：6.97      累涨：18.15     5.14      7.68      5.33      10日：2.73      0.72      184       累涨修正：31.53     229
//        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.40      累涨：18.77     7.13      7.12      4.52      10日：2.43      0.68      183       累涨修正：31.11     230
//        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：1.69      累涨：17.36     6.77      5.46      5.13      10日：3.13      0.68      189       累涨修正：31.1      231
//        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF基金       市值：18.49     累涨：19.37     6.81      7.36      5.20      10日：2.72      0.56      182       累涨修正：30.97     232
//        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：18.14     累涨：20.83     6.49      9.11      5.23      10日：2.74      0.42      169       累涨修正：30.93     233
//        INDEX_CN_BIG.put("159390", "指数-大盘             ");//A50指数ETF            市值：2.73      累涨：                              7.11      10日：4.60      1.31      102       累涨修正：30.72     234
//        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：44.72     累涨：120.73    108.65    6.22      5.86      10日：3.89      0.81      121       累涨修正：28.77     235
//        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：3.00      累涨：16.34     6.07      4.60      5.67      10日：2.80      0.61      191       累涨修正：28.65     236
//        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：33.23     累涨：18.25     6.28      6.89      5.08      10日：2.87      0.42      188       累涨修正：28.61     237
//        INDEX_CN_BIG.put("563650", "指数-大盘             ");//中证A500龙头ETF       市值：1.68      累涨：                              6.85      10日：3.85      1.11      156       累涨修正：26.76     238
//        INDEX_CN_BIG.put("159391", "指数-大盘             ");//大盘价值ETF           市值：0.27      累涨：                              7.84      10日：4.59      0.85      137       累涨修正：26.37     239
//        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：2.78      累涨：                    294.38    6.02      10日：4.17      0.95      107       累涨修正：24.81     240
//        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：0.89      累涨：                    7.61      5.39      10日：3.07      0.49      187       累涨修正：24.53     241
//        INDEX_CN_BIG.put("563700", "指数-大盘             ");//红利价值ETF           市值：0.89      累涨：                                        10日：4.66      1.38      154       累涨修正：24.5      242
//        INDEX_CN_BIG.put("563660", "指数-大盘             ");//A500ETF银河           市值：2.88      累涨：                              6.56      10日：3.76      0.91      180       累涨修正：24.09     243
//        INDEX_CN_BIG.put("159215", "指数-大盘             ");//中证A500ETF指数基金   市值：20.81     累涨：                              6.21      10日：3.32      0.80      190       累涨修正：21.65     244
//        INDEX_CN_BIG.put("510320", "指数-大盘             ");//沪深300ETF中金        市值：4.42      累涨：                                        10日：4.09      1.06      185       累涨修正：19.84     245
//        INDEX_CN_BIG.put("562080", "指数-大盘             ");//300现金流ETF          市值：1.63      累涨：                                        10日：                              累涨修正：          246
//        INDEX_CN_BIG.put("563900", "指数-大盘             ");//沪深300自由现金流ETF摩根市值：1.82      累涨：                                        10日：4.70      1.95                累涨修正：          247
//        INDEX_CN_BIG.put("563060", "指数-大盘             ");//央企50ETF             市值：0.94      累涨：                                        10日：                              累涨修正：          248
//        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：76.79     累涨：                                        10日：                              累涨修正：          249
//        INDEX_CN_BIG.put("159219", "指数-大盘             ");//深证100ETF融通        市值：0.47      累涨：                                        10日：          1.48                累涨修正：          250
//        INDEX_CN_BIG.put("563550", "指数-大盘             ");//A500增强ETF摩根       市值：7.04      累涨：                                        10日：                              累涨修正：          251
    }

    public static Map<String, String> INDEX_CN_CITY = new HashMap<>();//指数-国内城市

    static {
//        INDEX_CN_CITY.put("159976", "指数-国内城市         ");//湾创ETF               市值：1.19      累涨：33.24     7.08      16.06     13.43     8.12      4.73      1
//        INDEX_CN_CITY.put("512970", "指数-国内城市         ");//大湾区ETF             市值：0.75      累涨：29.62     9.03      14.23     9.72      6.35      4.34      2
//        INDEX_CN_CITY.put("159623", "指数-国内城市         ");//成渝经济圈ETF         市值：32.83     累涨：29.66     7.39      17.26     8.94      5.74      3.04      3
//        INDEX_CN_CITY.put("159743", "指数-国内城市         ");//湖北ETF               市值：1.57      累涨：40.34     12.22     20.84     14.69     5.67      2.86      4
//        INDEX_CN_CITY.put("517160", "指数-国内城市         ");//长江保护主题ETF       市值：13.73     累涨：22.55     4.70      11.26     9.63      5.63      4.10      5
//        INDEX_CN_CITY.put("512870", "指数-国内城市         ");//杭州湾区ETF           市值：0.41      累涨：33.69     11.23     17.08     12.09     5.51      3.32      6
//        INDEX_CN_CITY.put("517330", "指数-国内城市         ");//长江保护ETF           市值：13.72     累涨：22.51     4.98      11.97     8.90      5.47      3.81      7
//        INDEX_CN_CITY.put("515760", "指数-国内城市         ");//浙江国资ETF           市值：1.78      累涨：22.05     6.08      11.51     7.53      5.15      2.60      8
//        INDEX_CN_CITY.put("517850", "指数-国内城市         ");//张江ETF               市值：0.63      累涨：47.34     14.21     25.01     15.55     5.06      2.61      9
//        INDEX_CN_CITY.put("512650", "指数-国内城市         ");//长三角ETF             市值：3.94      累涨：25.38     7.56      13.08     9.40      5.01      3.10      10
//        INDEX_CN_CITY.put("512190", "指数-国内城市         ");//浙商之江凤凰ETF       市值：0.61      累涨：19.24     6.80      9.42      7.09      3.58      2.79      15
//        INDEX_CN_CITY.put("510810", "指数-国内城市         ");//上海国企ETF           市值：76.95     累涨：20.42     7.35      10.53     5.90      3.39      2.18      16
    }

    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘

    static {
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.69     累涨：53.45     18.76     18.38     16.31     10日：7.87      4.43      1         累涨修正：101.33    1
//        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：16.14     累涨：41.41     11.98     14.93     14.50     10日：5.91      3.61      2         累涨修正：82.65     2
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：8.84      累涨：36.33     10.15     15.75     10.43     10日：5.38      3.06      4         累涨修正：74.8      3
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：10.06     累涨：38.64     7.71      19.68     11.25     10日：9.75      0.29      3         累涨修正：59.3      4
        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：5.56      累涨：34.23     9.15      13.99     11.09     10日：3.92      1.35      6         累涨修正：56.92     5
//        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：5.49      累涨：42.58     4.76      28.61     9.21      10日：3.28      1.18      7         累涨修正：54.56     6
//        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：16.35     累涨：42.67     8.04      19.31     15.32     10日：4.29      0.57      5         累涨修正：53.53     7
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：13.60     累涨：33.63     6.73      19.36     7.54      10日：2.02      1.04      8         累涨修正：46.66     8
//        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：13.99     累涨：30.21     5.30      17.08     7.83      10日：2.64      1.11      12        累涨修正：45.74     9
//        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：14.23     累涨：30.23     5.99      16.07     8.17      10日：2.62      1.20      9         累涨修正：45.52     10
//        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：8.40      累涨：32.71     8.18      17.51     7.02      10日：2.21      1.10      11        累涨修正：45.38     11
//        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.72      累涨：31.58     6.12      18.33     7.13      10日：1.94      0.83      13        累涨修正：44.59     12
//        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：8.35      累涨：29.84     4.01      18.56     7.27      10日：5.05      0.60      10        累涨修正：43.74     13
    }

    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_NOT_USA);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_HK);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
        INDEX.putAll(INDEX_CN_CITY);
    }

    /**
     * 金融-证券
     */
    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券

    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：72.97     累涨：48.06     20.47     12.15     15.44     10日：7.36      1.37      1         累涨修正：74.21     1
//        JINRONG_ZHENGQUAN.put("513190", "金融-证券             ");//港股通金融ETF         市值：9.24      累涨：33.27     14.18     9.57      9.52      10日：5.57      1.33      4         累涨修正：59.04     2
//        JINRONG_ZHENGQUAN.put("513140", "金融-证券             ");//港股金融ETF           市值：0.79      累涨：36.41     13.73     10.70     11.98     10日：5.16      1.11      3         累涨修正：58.94     3
//        JINRONG_ZHENGQUAN.put("159931", "金融-证券             ");//金融ETF               市值：0.59      累涨：24.99     8.15      7.33      9.51      10日：5.83      1.58      12        累涨修正：54.03     4
//        JINRONG_ZHENGQUAN.put("510650", "金融-证券             ");//金融地产ETF           市值：0.41      累涨：25.15     7.73      7.86      9.56      10日：5.17      1.03      6         累涨修正：46.82     5
        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：68.66     累涨：28.16     10.37     7.39      10.40     10日：6.89      0.39      2         累涨修正：46.23     6
//        JINRONG_ZHENGQUAN.put("510230", "金融-证券             ");//金融ETF               市值：47.81     累涨：22.65     7.46      6.28      8.91      10日：5.06      0.96      25        累涨修正：43.33     7
//        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.69      累涨：26.07     10.10     6.22      9.75      10日：6.49      0.32      6         累涨修正：42.01     8
//        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.08      累涨：26.69     9.57      7.31      9.81      10日：6.30      0.24      7         累涨修正：41.93     9
//        JINRONG_ZHENGQUAN.put("159940", "金融-证券             ");//金融地产ETF           市值：10.17     累涨：25.41     7.50      9.64      8.27      10日：4.55      0.60      10        累涨修正：41.11     10
//        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：9.85      累涨：26.94     10.23     7.12      9.59      10日：6.04      0.24      5         累涨修正：41.1      11
//        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：65.33     累涨：26.55     9.99      6.82      9.74      10日：6.13      0.19      10        累涨修正：40.9      12
//        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：17.39     累涨：26.25     9.88      6.92      9.45      10日：6.00      0.30      15        累涨修正：40.85     13
//        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：18.40     累涨：26.83     10.12     7.02      9.69      10日：6.28      0.18      8         累涨修正：40.74     14
//        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.48      累涨：26.91     9.91      7.18      9.82      10日：6.03      0.15      9         累涨修正：40.62     15
//        JINRONG_ZHENGQUAN.put("159933", "金融-证券             ");//国投金融地产ETF       市值：1.46      累涨：24.38     7.38      8.49      8.51      10日：4.59      0.74      13        累涨修正：40.23     16
//        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.35      累涨：27.12     9.73      6.61      10.78     10日：6.46                14        累涨修正：40.04     17
//        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：3.80      累涨：26.17     9.94      7.06      9.17      10日：5.74      0.20      17        累涨修正：39.85     18
//        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：60.98     累涨：26.68     10.09     7.00      9.59      10日：5.85      0.10      16        累涨修正：39.48     19
//        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：286.74    累涨：27.05     10.41     7.02      9.62      10日：5.86      0.09      11        累涨修正：39.13     20
//        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：228.10    累涨：26.78     9.94      7.46      9.38      10日：5.95      0.10      13        累涨修正：39.08     21
//        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.73      累涨：26.30     9.81      7.19      9.30      10日：5.78      0.10      18        累涨修正：38.96     22
//        JINRONG_ZHENGQUAN.put("512640", "金融-证券             ");//金融地产ETF基金       市值：0.75      累涨：23.17     7.80      7.46      7.91      10日：4.50      0.61      15        累涨修正：38.88     23
//        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：7.59      累涨：26.10     9.81      7.15      9.14      10日：5.78      0.09      23        累涨修正：38.65     24
//        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：14.71     累涨：26.02     9.24      7.46      9.32      10日：5.78      0.09      20        累涨修正：37.94     25
//        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.86      累涨：22.89     6.62      9.39      6.88      10日：2.82      1.11      21        累涨修正：37.73     26
//        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.22      累涨：25.64     9.54      6.62      9.48      10日：6.01                22        累涨修正：37.66     27
//        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：3.62      累涨：26.55     9.98      7.70      8.87      10日：5.44                19        累涨修正：37.43     28
//        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.46      累涨：24.86     9.07      7.77      8.02      10日：5.13      0.09      24        累涨修正：36.11     29
    }

    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金

    static {
        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：5.99      累涨：61.90     17.77     32.68     11.45     10日：7.58      6.76      1         累涨修正：146.66    1
//        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：1.50      累涨：61.36     17.64     33.21     10.51     10日：7.44      6.41      3         累涨修正：142.76    2
//        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：42.95     累涨：61.18     17.94     31.71     11.53     10日：7.31      6.34      2         累涨修正：142.46    3
//        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：1.09      累涨：64.52     18.75     35.31     10.46     10日：7.05      6.19      6         累涨修正：141.32    4
//        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金股票ETF基金       市值：0.36      累涨：61.03     19.17     31.15     10.71     10日：7.06      6.33      5         累涨修正：139.04    5
//        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.52      累涨：57.68     17.80     29.01     10.87     10日：7.11      6.39      4         累涨修正：137.08    6
        JINRONG_GOLD.put("518680", "金融-黄金             ");//金ETF                 市值：25.60     累涨：41.11     6.57      21.42     13.12     10日：5.56      5.56      18        累涨修正：97.78     7
//        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：20.50     累涨：37.48     6.63      17.04     13.81     10日：5.82      5.82      7         累涨修正：95.99     8
//        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：9.51      累涨：38.10     6.63      17.66     13.81     10日：5.60      5.60      8         累涨修正：94.94     9
//        JINRONG_GOLD.put("159830", "金融-黄金             ");//上海金ETF             市值：14.92     累涨：36.89     6.54      17.00     13.35     10日：5.63      5.63      13        累涨修正：94.54     10
//        JINRONG_GOLD.put("159831", "金融-黄金             ");//上海金ETF基金         市值：6.64      累涨：37.20     6.64      17.09     13.47     10日：5.55      5.55      15        累涨修正：94.51     11
//        JINRONG_GOLD.put("518600", "金融-黄金             ");//上海金ETF             市值：19.48     累涨：38.06     6.67      17.77     13.62     10日：5.57      5.57      10        累涨修正：94.16     12
//        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：35.40     累涨：37.31     6.89      17.13     13.29     10日：5.59      5.59      9         累涨修正：94.09     13
//        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：594.83    累涨：36.92     6.65      16.87     13.40     10日：5.60      5.60      11        累涨修正：93.9      14
//        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：44.80     累涨：37.07     6.69      17.06     13.32     10日：5.58      5.58      14        累涨修正：93.86     15
//        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：179.23    累涨：36.95     6.70      17.09     13.16     10日：5.58      5.58      12        累涨修正：93.81     16
//        JINRONG_GOLD.put("518890", "金融-黄金             ");//中银上海金ETF         市值：20.43     累涨：36.55     6.48      16.94     13.13     10日：5.63      5.63      16        累涨修正：93.57     17
//        JINRONG_GOLD.put("159834", "金融-黄金             ");//金ETF                 市值：10.01     累涨：36.56     6.60      16.80     13.16     10日：5.52      5.52      20        累涨修正：93.48     18
//        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：261.70    累涨：37.08     6.71      16.93     13.44     10日：5.51      5.51      17        累涨修正：93.31     19
//        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：285.00    累涨：36.75     6.72      16.96     13.07     10日：5.50      5.50      19        累涨修正：92.99     20
    }

    public static Map<String, String> JINRONG_BANK = new HashMap<>();

    static {
        JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：2.14      累涨：29.22     10.42     8.44      10.36     10日：6.18      2.10      4         累涨修正：64.68     1
//        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：41.29     累涨：28.28     7.56      9.76      10.96     10日：5.78      1.95      1         累涨修正：61.29     2
//        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：14.07     累涨：28.54     7.19      10.18     11.17     10日：5.91      1.89      2         累涨修正：61.15     3
//        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.26      累涨：28.19     7.33      10.23     10.63     10日：5.55      1.90      5         累涨修正：60.19     4
//        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF基金           市值：3.82      累涨：27.56     7.65      8.69      11.22     10日：5.79      1.83      3         累涨修正：59.27     5
//        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：81.84     累涨：27.00     7.49      8.43      11.08     10日：5.73      1.87      6         累涨修正：59.03     6
//        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：10.22     累涨：27.75     7.47      9.54      10.74     10日：5.61      1.78      9         累涨修正：58.55     7
//        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：5.06      累涨：26.67     7.22      8.70      10.75     10日：5.87      1.83      7         累涨修正：58.54     8
//        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：14.79     累涨：27.44     7.50      9.08      10.86     10日：5.69      1.73      8         累涨修正：57.85     9
//        JINRONG_BANK.put("512730", "金融-银行             ");//中证银行ETF           市值：0.81      累涨：26.45     6.78      9.16      10.51     10日：5.60      1.76      10        累涨修正：57.01     10
    }

    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();

    static {
//        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.66      累涨：21.61     3.59      10.58     7.44      10日：4.96      1.99      2         累涨修正：50.48     1
//        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.41      累涨：25.15     7.73      7.86      9.56      10日：5.17      1.03      6         累涨修正：46.82     2
//        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.72      累涨：23.48     3.97      12.57     6.94      10日：4.89      1.59      4         累涨修正：46.55     3
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：6.50      累涨：34.13     10.94     17.51     5.68      10日：2.48      1.56      3         累涨修正：45.33     4
//        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.70      累涨：21.15     3.59      9.26      8.30      10日：5.97      1.63      5         累涨修正：45.28     5
//        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：64.94     累涨：33.15     10.63     16.18     6.34      10日：2.79      1.62      1         累涨修正：45.21     6
//        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.60      累涨：20.80     3.73      9.68      7.39      10日：3.57      1.93      7         累涨修正：43.43     7
//        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.17     累涨：25.41     7.50      9.64      8.27      10日：4.55      0.60      10        累涨修正：41.11     8
//        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：0.54      累涨：20.52     4.00      10.02     6.50      10日：3.07      1.64      8         累涨修正：40.85     9
//        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.46      累涨：24.38     7.38      8.49      8.51      10日：4.59      0.74      13        累涨修正：40.23     10
//        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.52      累涨：19.04     3.84      8.86      6.34      10日：2.82      1.61      16        累涨修正：39.38     11
//        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：5.53      累涨：28.06     11.37     11.28     5.41      10日：1.92      1.22      9         累涨修正：39.16     12
//        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF基金       市值：0.75      累涨：23.17     7.80      7.46      7.91      10日：4.50      0.61      15        累涨修正：38.88     13
//        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.75      累涨：31.64     11.41     16.23     4.00      10日：1.70      0.85      12        累涨修正：38.44     14
//        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.52      累涨：27.33     11.75     11.11     4.47      10日：1.60      0.96      14        累涨修正：37.73     15
//        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：23.92     累涨：24.52     7.83      10.38     6.31      10日：3.22      0.75      11        累涨修正：37.25     16
//        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：6.61      累涨：30.06     10.60     15.22     4.24      10日：1.69      0.76      17        累涨修正：36.48     17
//        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.52      累涨：26.03     10.69     10.22     5.12      10日：1.44      0.80      18        累涨修正：34.35     18
//        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：0.95      累涨：22.83     8.27      9.20      5.36      10日：2.41      0.50      19        累涨修正：32.45     19
//        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：5.46      累涨：21.61     7.33      8.57      5.71      10日：2.50      0.48      20        累涨修正：30.56     20
//        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.06      累涨：21.87     7.54      8.87      5.46      10日：2.34      0.43      21        累涨修正：30.51     21
    }

    public static Map<String, String> JINRONG_CASH = new HashMap<>();

//    static {
//        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：15.73     累涨：3.41                          3.41      3.31      2.10      1
//        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：23.23     累涨：3.69                          3.69      2.89      1.19      2
//        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：31.68     累涨：0.59      0.02      0.35      0.23      0.14      0.13      3
//        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：0.36      0.10      0.12      0.14      0.10      0.07      4
//        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：611.01    累涨：0.42      0.14      0.17      0.11      0.06      0.02      5
//        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：12.90     累涨：0.19      0.05      0.09      0.05      0.04      0.01      6
//        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.54      累涨：0.15      0.03      0.07      0.05      0.03      0.02      7
//        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：683.98    累涨：0.19      0.03      0.11      0.05      0.02      0.01      8
//        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.14      累涨：16.28     0.26      15.95     0.07      0.02      0.01      9
//        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.44      累涨：16.24     0.06      16.18     0.04      0.02      0.01      10
//        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.59      累涨：0.11      0.03      0.05      0.03      0.02      0.01      11
//        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：5.97      累涨：0.16      0.06      0.07      0.03      0.02      0.01      12
//        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.54      累涨：10.52     0.04      9.90      0.58      0.01                13
//        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.16      累涨：7.74      0.25      7.45      0.04      0.01                14
//        JINRONG_CASH.put("511670", "金融-现金             ");//华泰天天金ETF         市值：0.17      累涨：18.67     0.02      18.58     0.07      0.01                15
//        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.28      累涨：3.49      0.06      3.39      0.04      0.01                16
//        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.30      累涨：10.32     0.14      10.15     0.03      0.01                17
//        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：7.58      累涨：0.20      0.07      0.10      0.03      0.01                18
//        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.23      累涨：9.32      0.04      9.25      0.03      0.01                19
//        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：109.28    累涨：0.14      0.05      0.06      0.03      0.01                20
//        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.21      累涨：13.09     0.08      12.96     0.05      0.01                21
//        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：1.68      累涨：0.23      0.05      0.15      0.04      0.01                22
//        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.37      累涨：0.10      0.04      0.05      0.01      0.01                23
//        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.43      累涨：0.10      0.05      0.04      0.01      0.01                24
//        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.35      累涨：17.18     0.06      17.10     0.02                          25
//        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.60      累涨：                                                            26
//        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.82      累涨：                                                            27
//        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：9.90      累涨：                                                            28
//        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.26      累涨：25.15     0.07      25.07     0.01                          29
//        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.94      累涨：0.09      0.03      0.06                                    30
//        JINRONG_CASH.put("562080", "金融-现金             ");//N300现金流ETF
//        JINRONG_CASH.put("159225", "金融-现金             ");//现金流ETF基金         市值：3.99      累涨：                                                            1
//        JINRONG_CASH.put("159222", "金融-现金             ");//自由现金流ETF易方达   市值：10.47     累涨：                                                            2
//    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();

    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
    }

    /**
     * 资源
     */
    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();//资源-石油

    static {
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：6.25      累涨：48.48     11.02     21.18     16.28     10日：11.25     0.55      1         累涨修正：73.18     1
//        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：8.39      累涨：45.80     8.02      21.73     16.05     10日：11.03     0.57      2         累涨修正：70.14     2
//        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：0.55      累涨：21.80     6.76      7.62      7.42      10日：4.33      1.29      3         累涨修正：44.65     3
//        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：0.74      累涨：22.16     6.04      9.51      6.61      10日：3.65      1.36      4         累涨修正：44.42     4
//        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：1.01      累涨：21.82     6.54      7.56      7.72      10日：3.61      1.20      7         累涨修正：42.24     5
//        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.23      累涨：23.76     7.04      9.86      6.86      10日：3.56      0.99      5         累涨修正：41.77     6
//        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.12      累涨：19.72     5.07      6.65      8.00      10日：3.85      1.28      6         累涨修正：41.5      7
//        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.24      累涨：22.58     7.62      7.74      7.22      10日：3.35      1.11      8         累涨修正：41.49     8
//        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：0.59      累涨：21.01     5.90      8.65      6.46      10日：3.43      1.21      9         累涨修正：41.18     9
//        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.31      累涨：18.89     4.83      7.15      6.91      10日：3.18      0.75      10        累涨修正：33.5      10
    }

    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();

    static {
        ZIYUAN_NONGYE.put("159865", "资源-农业             ");//养殖ETF               市值：35.07     累涨：30.11     7.55      15.09     7.47      10日：3.74      2.54      1         累涨修正：63.15     1
//        ZIYUAN_NONGYE.put("159587", "资源-农业             ");//粮食50ETF             市值：0.55      累涨：32.64     7.47      16.66     8.51      10日：2.92      2.21      4         累涨修正：62.16     2
//        ZIYUAN_NONGYE.put("159698", "资源-农业             ");//粮食ETF               市值：3.73      累涨：31.48     6.74      16.75     7.99      10日：2.74      2.17      5         累涨修正：60.83     3
//        ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.34      累涨：32.40     7.61      17.43     7.36      10日：3.36      2.07      2         累涨修正：60.77     4
//        ZIYUAN_NONGYE.put("516670", "资源-农业             ");//畜牧养殖ETF           市值：6.36      累涨：31.20     7.71      16.68     6.81      10日：3.40      2.15      3         累涨修正：60.6      5
//        ZIYUAN_NONGYE.put("159867", "资源-农业             ");//畜牧ETF               市值：5.77      累涨：30.41     7.78      16.11     6.52      10日：3.18      2.00      6         累涨修正：58.77     6
//        ZIYUAN_NONGYE.put("562900", "资源-农业             ");//农业ETF易方达         市值：0.74      累涨：27.42     7.70      13.72     6.00      10日：3.28      1.77      7         累涨修正：53.45     7
//        ZIYUAN_NONGYE.put("159825", "资源-农业             ");//农业ETF               市值：20.87     累涨：29.05     8.69      14.22     6.14      10日：2.49      1.46      9         累涨修正：50.09     8
//        ZIYUAN_NONGYE.put("159827", "资源-农业             ");//农业50ETF             市值：1.01      累涨：29.92     9.39      14.70     5.83      10日：2.44      1.35      10        累涨修正：49.65     9
//        ZIYUAN_NONGYE.put("516810", "资源-农业             ");//农业50ETF             市值：1.80      累涨：27.05     8.25      12.76     6.04      10日：2.30      1.58      11        累涨修正：49.03     10
//        ZIYUAN_NONGYE.put("159616", "资源-农业             ");//农牧ETF               市值：0.60      累涨：29.48     8.98      13.61     6.89      10日：2.52      1.25      8         累涨修正：47.29     11
//        ZIYUAN_NONGYE.put("516550", "资源-农业             ");//农业ETF               市值：2.07      累涨：23.08     7.75      10.35     4.98      10日：2.65      1.71      12        累涨修正：47.19     12
    }

    public static Map<String, String> ZIYUAN_XIYOU = new HashMap<>();

    static {
        ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：16.15     累涨：40.46     16.97     12.56     10.93     3.88      5日： 2.32      1         累涨修正：63.74     1
//        ZIYUAN_XIYOU.put("516780", "资源-稀有             ");//稀土ETF               市值：8.67      累涨：38.10     16.97     11.76     9.37      3.92      5日： 2.31      4         累涨修正：61.62     2
//        ZIYUAN_XIYOU.put("159715", "资源-稀有             ");//稀土ETF易方达         市值：1.90      累涨：38.12     16.17     11.56     10.39     3.86      5日： 2.22      6         累涨修正：61.28     3
        ZIYUAN_XIYOU.put("159652", "资源-稀有             ");//有色50ETF             市值：2.62      累涨：35.54     7.13      14.34     14.07     4.03      5日：           2         累涨修正：59.72     4
//        ZIYUAN_XIYOU.put("512400", "资源-稀有             ");//有色金属ETF           市值：45.33     累涨：35.16     7.58      13.64     13.94     3.99      5日： 0.19      3         累涨修正：59.10     5
//        ZIYUAN_XIYOU.put("159876", "资源-稀有             ");//有色龙头ETF           市值：0.67      累涨：33.33     6.52      13.33     13.48     4.06      5日： 0.27      5         累涨修正：57.69     6
//        ZIYUAN_XIYOU.put("159881", "资源-稀有             ");//有色60ETF             市值：0.50      累涨：31.78     6.40      13.39     11.99     4.17      5日： 0.20      8         累涨修正：56.80     7
//        ZIYUAN_XIYOU.put("516650", "资源-稀有             ");//有色金属ETF基金       市值：1.07      累涨：32.68     6.43      13.95     12.30     3.96      5日： 0.20      7         累涨修正：56.44     8
//        ZIYUAN_XIYOU.put("159713", "资源-稀有             ");//稀土ETF               市值：3.07      累涨：34.80     14.99     11.77     8.04      3.51      5日： 2.02      11        累涨修正：55.86     9
//        ZIYUAN_XIYOU.put("159871", "资源-稀有             ");//有色金属ETF           市值：0.90      累涨：32.95     6.89      13.51     12.55     3.70      5日：           9         累涨修正：55.15     10
//        ZIYUAN_XIYOU.put("159880", "资源-稀有             ");//有色ETF基金           市值：0.94      累涨：31.73     6.28      13.34     12.11     3.65      5日：           14        累涨修正：53.63     11
//        ZIYUAN_XIYOU.put("560860", "资源-稀有             ");//工业有色ETF           市值：3.85      累涨：31.08     7.34      12.89     10.85     3.67      5日： 1.38      10        累涨修正：53.10     12
//        ZIYUAN_XIYOU.put("159671", "资源-稀有             ");//稀有金属ETF基金       市值：4.91      累涨：32.80     10.38     12.16     10.26     2.54      5日： 0.74      12        累涨修正：48.04     13
//        ZIYUAN_XIYOU.put("561800", "资源-稀有             ");//稀有金属ETF基金       市值：0.88      累涨：34.32     11.41     13.12     9.79      2.14      5日： 0.58      13        累涨修正：47.16     14
//        ZIYUAN_XIYOU.put("562800", "资源-稀有             ");//稀有金属ETF           市值：8.88      累涨：31.67     11.19     11.52     8.96      2.49      5日： 0.61      15        累涨修正：46.61     15
//        ZIYUAN_XIYOU.put("159608", "资源-稀有             ");//稀有金属ETF           市值：2.15      累涨：30.97     10.69     11.74     8.54      2.17      5日： 0.54      16        累涨修正：43.99     16
//        ZIYUAN_XIYOU.put("159980", "资源-稀有             ");//有色ETF               市值：9.24      累涨：21.94     5.16      7.51      9.27      3.40      5日： 1.02      17        累涨修正：42.34     17
    }

    static {
        ZIYUAN_XIYOU.put("159652", "资源-稀有             ");//有色50ETF             市值：2.57      累涨：36.79     12.28     12.78     11.73     10日：4.92      2.95      1         累涨修正：79.08     1
//        ZIYUAN_XIYOU.put("159880", "资源-稀有             ");//有色ETF基金           市值：0.91      累涨：32.91     11.16     10.83     10.92     10日：4.98      3.01      3         累涨修正：75.98     2
//        ZIYUAN_XIYOU.put("512400", "资源-稀有             ");//有色金属ETF           市值：45.12     累涨：35.42     12.11     12.07     11.24     10日：4.55      2.56      2         累涨修正：72.68     3
//        ZIYUAN_XIYOU.put("159876", "资源-稀有             ");//有色龙头ETF           市值：0.67      累涨：34.62     11.52     11.69     11.41     10日：4.60      2.52      4         累涨修正：71.54     4
//        ZIYUAN_XIYOU.put("159881", "资源-稀有             ");//有色60ETF             市值：0.50      累涨：32.98     11.45     10.16     11.37     10日：4.64      2.61      6         累涨修正：70.97     5
//        ZIYUAN_XIYOU.put("516650", "资源-稀有             ");//有色金属ETF基金       市值：1.15      累涨：33.75     11.84     10.95     10.96     10日：4.54      2.52      5         累涨修正：70.55     6
//        ZIYUAN_XIYOU.put("159871", "资源-稀有             ");//有色金属ETF           市值：0.81      累涨：33.51     11.85     11.18     10.48     10日：4.34      2.49      7         累涨修正：68.95     7
//        ZIYUAN_XIYOU.put("560860", "资源-稀有             ");//工业有色ETF           市值：4.00      累涨：31.86     11.67     9.62      10.57     10日：4.39      1.58      11        累涨修正：58.02     8
        ZIYUAN_XIYOU.put("159715", "资源-稀有             ");//稀土ETF易方达         市值：1.93      累涨：34.74     10.91     9.11      14.72     10日：5.03      0.70      8         累涨修正：52.5      9
//        ZIYUAN_XIYOU.put("516780", "资源-稀有             ");//稀土ETF               市值：9.36      累涨：33.89     11.80     7.83      14.26     10日：4.72      0.75      10        累涨修正：51.58     10
//        ZIYUAN_XIYOU.put("562800", "资源-稀有             ");//稀有金属ETF           市值：8.69      累涨：30.53     11.95     8.00      10.58     10日：4.79      1.00      9         累涨修正：51.11     11
//        ZIYUAN_XIYOU.put("159608", "资源-稀有             ");//稀有金属ETF           市值：2.15      累涨：29.95     11.61     8.05      10.29     10日：4.52      0.87      15        累涨修正：48.56     12
//        ZIYUAN_XIYOU.put("561800", "资源-稀有             ");//稀有金属ETF基金       市值：0.89      累涨：32.87     13.72     9.25      9.90      10日：4.48      0.56      13        累涨修正：47.99     13
//        ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：17.79     累涨：35.71     11.78     9.88      14.05     10日：4.09      0.36      12        累涨修正：47.85     14
//        ZIYUAN_XIYOU.put("159713", "资源-稀有             ");//稀土ETF               市值：3.29      累涨：31.85     11.04     7.00      13.81     10日：4.32      0.63      16        累涨修正：47.42     15
//        ZIYUAN_XIYOU.put("159671", "资源-稀有             ");//稀有金属ETF基金       市值：4.93      累涨：31.57     11.92     9.23      10.42     10日：4.16      0.58      14        累涨修正：46.27     16
//        ZIYUAN_XIYOU.put("159980", "资源-稀有             ");//有色ETF               市值：8.37      累涨：20.75     6.55      8.17      6.03      10日：3.37      0.84      17        累涨修正：36.73     17
    }


    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();

    static {
        ZIYUAN_COMMON.put("561330", "资源-通用             ");//矿业ETF               市值：0.77      累涨：34.39     12.01     10.85     11.53     10日：5.07      3.08      2         累涨修正：78.41     1
//        ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.16      累涨：36.16     12.16     11.22     12.78     10日：4.48      2.67      1         累涨修正：74.49     2
//        ZIYUAN_COMMON.put("562010", "资源-通用             ");//绿色能源ETF           市值：0.15      累涨：27.41     9.35      6.81      11.25     10日：7.02      2.90      5         累涨修正：71.39     3
//        ZIYUAN_COMMON.put("510410", "资源-通用             ");//资源ETF               市值：3.51      累涨：30.96     8.62      13.45     8.89      10日：4.08      2.42      3         累涨修正：65.74     4
//        ZIYUAN_COMMON.put("515220", "资源-通用             ");//煤炭ETF               市值：36.32     累涨：27.18     9.70      10.74     6.74      10日：4.78      2.63      6         累涨修正：65.67     5
//        ZIYUAN_COMMON.put("510170", "资源-通用             ");//大宗商品ETF           市值：1.52      累涨：29.87     8.22      13.65     8.00      10日：3.33      1.72      9         累涨修正：55.45     6
//        ZIYUAN_COMMON.put("516480", "资源-通用             ");//新材料ETF基金         市值：0.13      累涨：28.72     9.36      10.63     8.73      10日：5.26      1.35      4         累涨修正：54.09     7
//        ZIYUAN_COMMON.put("159761", "资源-通用             ");//新材料50ETF           市值：1.38      累涨：26.34     10.11     7.26      8.97      10日：4.63      1.60      7         累涨修正：53.2      8
//        ZIYUAN_COMMON.put("159945", "资源-通用             ");//能源ETF基金           市值：0.28      累涨：23.14     6.36      11.16     5.62      10日：4.12      1.86      12        累涨修正：51.84     9
//        ZIYUAN_COMMON.put("159930", "资源-通用             ");//能源ETF               市值：2.53      累涨：22.93     6.18      11.00     5.75      10日：4.04      1.85      13        累涨修正：51.36     10
//        ZIYUAN_COMMON.put("159981", "资源-通用             ");//能源化工ETF           市值：4.59      累涨：24.91     3.96      8.45      12.50     10日：7.49      1.00      11        累涨修正：50.89     11
//        ZIYUAN_COMMON.put("159703", "资源-通用             ");//新材料ETF             市值：0.53      累涨：25.89     9.26      7.88      8.75      10日：4.50      1.55      8         累涨修正：50.75     12
//        ZIYUAN_COMMON.put("516710", "资源-通用             ");//新材料50ETF           市值：0.41      累涨：25.40     9.90      6.96      8.54      10日：4.43      1.47      10        累涨修正：50.43     13
//        ZIYUAN_COMMON.put("588160", "资源-通用             ");//科创材料ETF           市值：1.71      累涨：35.10     11.86     13.87     9.37      10日：2.96      0.83      15        累涨修正：50.15     14
//        ZIYUAN_COMMON.put("159944", "资源-通用             ");//材料ETF               市值：0.22      累涨：25.66     8.47      8.72      8.47      10日：3.32      1.50      15        累涨修正：48.8      15
//        ZIYUAN_COMMON.put("159985", "资源-通用             ");//豆粕ETF               市值：26.81     累涨：24.20     9.68      10.48     4.04      10日：2.21      1.74      17        累涨修正：47.76     16
//        ZIYUAN_COMMON.put("588010", "资源-通用             ");//科创新材料ETF         市值：2.62      累涨：35.14     11.54     14.44     9.16      10日：2.84      0.51      22        累涨修正：46.43     17
//        ZIYUAN_COMMON.put("159763", "资源-通用             ");//新材料ETF基金         市值：0.53      累涨：26.50     9.92      8.27      8.31      10日：3.89      1.08      14        累涨修正：46.16     18
//        ZIYUAN_COMMON.put("562850", "资源-通用             ");//央企能源ETF           市值：1.20      累涨：18.23     3.81      8.81      5.61      10日：3.50      1.98      19        累涨修正：45.68     19
//        ZIYUAN_COMMON.put("515210", "资源-通用             ");//钢铁ETF               市值：20.00     累涨：30.65     13.36     8.66      8.63      10日：2.04      0.98      16        累涨修正：45.51     20
//        ZIYUAN_COMMON.put("516360", "资源-通用             ");//新材料ETF             市值：0.54      累涨：23.73     9.23      6.54      7.96      10日：3.94      1.20      20        累涨修正：44.81     21
//        ZIYUAN_COMMON.put("516890", "资源-通用             ");//新材料ETF指数基金     市值：0.24      累涨：24.34     9.81      6.19      8.34      10日：3.61      1.20      18        累涨修正：44.76     22
//        ZIYUAN_COMMON.put("561790", "资源-通用             ");//央企现代能源ETF       市值：0.48      累涨：18.88     3.43      10.12     5.33      10日：3.21      1.31      23        累涨修正：39.08     23
//        ZIYUAN_COMMON.put("561260", "资源-通用             ");//能源ETF               市值：0.47      累涨：16.46     4.20      6.91      5.35      10日：3.23      1.32      26        累涨修正：37.44     24
//        ZIYUAN_COMMON.put("159870", "资源-通用             ");//化工ETF               市值：14.05     累涨：23.21     6.91      7.83      8.47      10日：3.03      0.71      21        累涨修正：37.08     25
//        ZIYUAN_COMMON.put("516020", "资源-通用             ");//化工ETF               市值：4.42      累涨：23.85     7.68      7.98      8.19      10日：2.86      0.67      22        累涨修正：36.94     26
//        ZIYUAN_COMMON.put("516120", "资源-通用             ");//化工50ETF             市值：1.82      累涨：23.32     7.26      8.00      8.06      10日：2.64      0.66      24        累涨修正：35.86     27
//        ZIYUAN_COMMON.put("516220", "资源-通用             ");//化工龙头ETF           市值：1.16      累涨：22.53     6.87      7.30      8.36      10日：2.74      0.64      25        累涨修正：35.05     28
//        ZIYUAN_COMMON.put("516570", "资源-通用             ");//化工行业ETF           市值：0.62      累涨：20.11     5.85      7.60      6.66      10日：2.81      0.70      27        累涨修正：33.43     29
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();

    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_NONGYE);
        ZIYUAN.putAll(ZIYUAN_XIYOU);
        ZIYUAN.putAll(ZIYUAN_COMMON);
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI = new HashMap<>();
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用

    static {
        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.35      累涨：31.62     11.95     8.82      10.85     10日：5.33      2.77      1         累涨修正：65.05     1
        XIAOFEI_COMMON.put("159996", "消费-通用             ");//家电ETF               市值：14.17     累涨：30.27     11.39     7.57      11.31     10日：5.19      2.14      2         累涨修正：64.19     2
//        XIAOFEI_COMMON.put("561120", "消费-通用             ");//家电ETF               市值：1.11      累涨：28.62     10.38     7.34      10.90     10日：4.99      1.98      4         累涨修正：60.38     3
//        XIAOFEI_COMMON.put("560880", "消费-通用             ");//家电ETF龙头           市值：4.20      累涨：27.67     9.63      7.40      10.64     10日：5.06      1.98      5         累涨修正：59.57     4
//        XIAOFEI_COMMON.put("159730", "消费-通用             ");//龙头家电ETF           市值：0.39      累涨：26.25     9.22      7.21      9.82      10日：5.58      2.01      9         累涨修正：59.52     5
//        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.26      累涨：26.96     9.65      7.37      9.94      10日：4.80      2.58      6         累涨修正：58.78     6
//        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.62      累涨：24.95     5.25      9.32      10.38     10日：6.59      1.82      3         累涨修正：58.15     7
//        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.07      累涨：24.10     7.76      9.31      7.03      10日：3.91      2.68      8         累涨修正：56.22     8
//        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.72      累涨：23.30     5.61      8.27      9.42      10日：6.06      1.89      10        累涨修正：56.21     9
//        XIAOFEI_COMMON.put("159328", "消费-通用             ");//家电ETF易方达         市值：1.20      累涨：25.52     9.41      6.59      9.52      10日：4.98      1.61      12        累涨修正：51.79     10
//        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.35      累涨：30.74     14.24     10.90     5.60      10日：3.11      1.12      12        累涨修正：49.28     11
//        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.80      累涨：28.51     10.37     8.86      9.28      10日：3.53      1.18      22        累涨修正：46.87     12
//        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：23.89     累涨：25.26     10.56     9.41      5.29      10日：3.91      1.18      7         累涨修正：46.06     13
//        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：17.14     累涨：22.09     8.82      7.19      6.08      10日：3.20      1.50      21        累涨修正：44.99     14
//        XIAOFEI_COMMON.put("516600", "消费-通用             ");//消费服务ETF           市值：0.82      累涨：22.24     9.43      7.48      5.33      10日：3.65      1.32      17        累涨修正：44.06     15
//        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：0.81      累涨：23.96     10.53     8.27      5.16      10日：3.67      1.15      13        累涨修正：43.95     16
//        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.65      累涨：22.77     9.91      7.67      5.19      10日：3.72      1.13      16        累涨修正：42.64     17
//        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.42      累涨：22.51     8.78      8.42      5.31      10日：3.46      1.05      20        累涨修正：40.98     18
//        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：141.45    累涨：25.13     11.77     9.96      3.40      10日：2.55      0.97      14        累涨修正：40.9      19
//        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：4.46      累涨：28.71     13.48     11.51     3.72      10日：2.16      0.82      11        累涨修正：40.65     20
//        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.77      累涨：24.60     11.97     9.02      3.61      10日：2.70      0.90      15        累涨修正：39.9      21
//        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：4.99      累涨：24.16     12.08     8.78      3.30      10日：2.58      0.87      19        累涨修正：38.89     22
//        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.79      累涨：24.95     11.88     9.72      3.35      10日：2.44      0.77      18        累涨修正：38.3      23
//        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.02      累涨：20.33     8.65      6.64      5.04      10日：3.22      0.90      23        累涨修正：36.67     24
//        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.27      累涨：24.18     11.60     9.34      3.24      10日：2.46      0.67      22        累涨修正：36.47     25
    }

    public static Map<String, String> XIAOFEI_HK = new HashMap<>();//消费-香港消费

    static {
        XIAOFEI_HK.put("513590", "消费-香港消费         ");//香港消费ETF           市值：3.87      累涨：59.89     29.53     12.40     17.96     10日：5.68      1.92      1         累涨修正：92.37     1
//        XIAOFEI_HK.put("159735", "消费-香港消费         ");//港股消费ETF           市值：6.73      累涨：55.16     25.87     11.33     17.96     10日：5.86      2.06      2         累涨修正：89.54     2
//        XIAOFEI_HK.put("513070", "消费-香港消费         ");//港股消费ETF易方达     市值：5.69      累涨：53.57     24.87     12.05     16.65     10日：5.64      2.09      3         累涨修正：87.84     3
//        XIAOFEI_HK.put("513230", "消费-香港消费         ");//港股消费ETF           市值：3.37      累涨：52.53     24.96     11.71     15.86     10日：5.60      2.08      4         累涨修正：86.61     4
//        XIAOFEI_HK.put("517550", "消费-香港消费         ");//消费ETF沪港深         市值：0.54      累涨：40.86     21.02     8.78      11.06     10日：4.87      1.76      5         累涨修正：69.96     5
//        XIAOFEI_HK.put("520520", "消费-香港消费         ");//恒生消费ETF华泰柏瑞   市值：0.80      累涨：43.76     19.55     14.49     9.72      10日：3.98      1.19      6         累涨修正：64.81     6
//        XIAOFEI_HK.put("159699", "消费-香港消费         ");//恒生消费ETF           市值：13.99     累涨：40.94     17.55     13.38     10.01     10日：4.20      1.29      7         累涨修正：63.53     7
//        XIAOFEI_HK.put("513970", "消费-香港消费         ");//恒生消费ETF           市值：17.94     累涨：42.89     19.06     14.07     9.76      10日：3.93      1.09      8         累涨修正：62.74     8
//        XIAOFEI_HK.put("159725", "消费-香港消费         ");//线上消费ETF           市值：0.52      累涨：35.25     14.58     8.11      12.56     10日：3.89      1.90      9         累涨修正：62.18     9
//        XIAOFEI_HK.put("159728", "消费-香港消费         ");//在线消费ETF           市值：0.59      累涨：37.37     14.32     9.36      13.69     10日：3.74      1.39      10        累涨修正：60.14     10
//        XIAOFEI_HK.put("159793", "消费-香港消费         ");//线上消费ETF基金       市值：0.35      累涨：43.55     20.93     10.44     12.18     10日：2.77      0.56      11        累涨修正：55.25     11
    }

    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒

    static {
        XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.35      累涨：41.63     16.81     11.30     13.52     10日：4.44      2.51      1         累涨修正：77.49     1
//        XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：15.75     累涨：40.98     16.33     10.48     14.17     10日：4.53      2.43      2         累涨修正：75.44     2
//        XIAOFEI_MEDIA.put("159869", "消费-文娱传媒         ");//游戏ETF               市值：64.52     累涨：39.54     16.41     9.79      13.34     10日：4.14      2.23      3         累涨修正：71.72     3
//        XIAOFEI_MEDIA.put("516620", "消费-文娱传媒         ");//影视ETF               市值：0.49      累涨：36.81     15.23     10.46     11.12     10日：4.41      2.22      5         累涨修正：70.05     4
//        XIAOFEI_MEDIA.put("516190", "消费-文娱传媒         ");//文娱传媒ETF           市值：0.18      累涨：35.59     13.96     9.42      12.21     10日：4.37      2.16      6         累涨修正：67.39     5
//        XIAOFEI_MEDIA.put("159855", "消费-文娱传媒         ");//影视ETF               市值：0.55      累涨：36.52     15.49     10.62     10.41     10日：3.87      2.24      4         累涨修正：67.22     6
//        XIAOFEI_MEDIA.put("512980", "消费-文娱传媒         ");//传媒ETF               市值：26.23     累涨：37.26     16.16     9.60      11.50     10日：3.75      1.64      7         累涨修正：62.8      7
//        XIAOFEI_MEDIA.put("159805", "消费-文娱传媒         ");//传媒ETF               市值：1.37      累涨：36.07     15.88     9.35      10.84     10日：2.95      1.71      9         累涨修正：60.15     8
//        XIAOFEI_MEDIA.put("517770", "消费-文娱传媒         ");//游戏传媒ETF           市值：0.30      累涨：40.00     19.92     8.73      11.35     10日：3.29      1.04      8         累涨修正：58.02     9
    }

    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐

    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.18      累涨：34.80     8.83      21.10     4.87      10日：3.10      1.62      1         累涨修正：55.74     1
//        XIAOFEI_WINE.put("159766", "消费-吃喝玩乐         ");//旅游ETF               市值：28.33     累涨：34.80     9.07      21.10     4.63      10日：2.84      1.49      2         累涨修正：53.72     2
//        XIAOFEI_WINE.put("159736", "消费-吃喝玩乐         ");//食品饮料ETF天弘       市值：48.35     累涨：27.58     12.91     10.91     3.76      10日：3.06      1.11      5         累涨修正：45.91     3
//        XIAOFEI_WINE.put("516900", "消费-吃喝玩乐         ");//食品饮料ETF基金       市值：0.77      累涨：31.64     17.46     10.33     3.85      10日：2.88      0.64      3         累涨修正：44.44     4
//        XIAOFEI_WINE.put("159862", "消费-吃喝玩乐         ");//食品ETF               市值：0.41      累涨：29.70     14.03     11.65     4.02      10日：2.87      0.72      4         累涨修正：43.36     5
//        XIAOFEI_WINE.put("515710", "消费-吃喝玩乐         ");//食品ETF               市值：8.72      累涨：28.16     13.69     10.32     4.15      10日：2.87      0.64      6         累涨修正：40.94     6
//        XIAOFEI_WINE.put("159843", "消费-吃喝玩乐         ");//食品饮料ETF           市值：2.76      累涨：27.67     14.35     9.89      3.43      10日：2.83      0.60      7         累涨修正：39.93     7
        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：108.10    累涨：28.75     15.87     9.20      3.68      10日：2.83      0.34      8         累涨修正：38.15     8
//        XIAOFEI_WINE.put("515170", "消费-吃喝玩乐         ");//食品饮料ETF           市值：33.21     累涨：27.30     14.02     9.56      3.72      10日：2.53      0.51      9         累涨修正：37.97     9
    }

    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_MEDIA);
        XIAOFEI.putAll(XIAOFEI_WINE);
    }


    /**
     * 医疗
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗

    static {
        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：5.13      累涨：76.64     23.38     28.69     24.57     10日：13.95     10.38     1         累涨修正：203.18    1
//        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：101.22    累涨：73.88     22.04     27.10     24.74     10日：13.70     10.40     3         累涨修正：200.63    2
//        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：2.60      累涨：74.85     23.08     27.33     24.44     10日：13.25     10.21     6         累涨修正：199.52    3
//        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：35.30     累涨：77.57     24.59     27.84     25.14     10日：13.53     9.99      2         累涨修正：198.07    4
//        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：4.94      累涨：76.83     23.94     28.44     24.45     10日：12.77     9.56      5         累涨修正：191.78    5
//        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：16.67     累涨：77.30     24.96     28.47     23.87     10日：12.61     9.73      4         累涨修正：191.21    6
//        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：21.44     累涨：72.91     23.39     26.34     23.18     10日：12.34     9.42      7         累涨修正：187.21    7
//        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：42.44     累涨：69.86     23.57     24.61     21.68     10日：10.89     8.53      8         累涨修正：171.33    8
//        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.33      累涨：68.65     21.86     25.12     21.67     10日：11.06     8.36      9         累涨修正：170.55    9
//        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：2.82      累涨：68.95     21.67     25.82     21.46     10日：10.84     8.21      10        累涨修正：169.32    10
//        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：29.07     累涨：63.37     20.53     22.42     20.42     10日：10.51     7.91      11        累涨修正：159.36    11
//        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：97.64     累涨：64.05     19.91     22.49     21.65     10日：10.46     7.47      12        累涨修正：153.77    12
//        YILIAO_COMMON.put("159217", "医疗-通用             ");//港股通创新药ETF工银   市值：35.94     累涨：                              25.98     10日：14.38     10.32     28        累涨修正：153.77    13
//        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：10.42     累涨：61.95     19.91     22.83     19.21     10日：9.59      7.35      15        累涨修正：151.97    14
//        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.27      累涨：62.76     20.48     22.68     19.60     10日：9.90      7.28      13        累涨修正：150.53    15
//        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.75      累涨：63.60     19.46     24.29     19.85     10日：9.26      7.15      16        累涨修正：149.57    16
//        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：2.55      累涨：61.79     20.21     23.11     18.47     10日：9.65      7.19      14        累涨修正：148.07    17
//        YILIAO_COMMON.put("159316", "医疗-通用             ");//恒生创新药ETF         市值：2.01      累涨：                              23.73     10日：12.15     9.82      35        累涨修正：144.01    18
//        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：0.69      累涨：61.10     20.25     20.74     20.11     10日：9.02      6.88      17        累涨修正：142.5     19
//        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药沪深港ETF       市值：2.55      累涨：48.75     15.23     17.59     15.93     10日：8.87      5.68      19        累涨修正：121.62    20
//        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：2.78      累涨：49.90     15.89     17.58     16.43     10日：8.22      5.80      18        累涨修正：121.11    21
//        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：2.06      累涨：48.24     15.08     17.75     15.41     10日：7.58      5.70      20        累涨修正：116.37    22
//        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：3.79      累涨：49.04     14.45     19.86     14.73     10日：7.59      5.39      21        累涨修正：114.2     23
//        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：13.06     累涨：41.26     7.22      16.29     17.75     10日：8.15      5.62      29        累涨修正：108.25    24
//        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药ETF天弘         市值：3.87      累涨：43.90     13.94     16.22     13.74     10日：6.07      5.00      22        累涨修正：103.69    25
//        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：12.39     累涨：38.92     6.88      16.65     15.39     10日：8.43      5.65      30        累涨修正：103.16    26
//        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.37      累涨：37.30     12.04     12.73     12.53     10日：6.63      4.68      24        累涨修正：95.88     27
//        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：106.44    累涨：39.03     12.58     13.84     12.61     10日：6.51      4.58      23        累涨修正：95.71     28
//        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：2.04      累涨：36.96     11.88     12.53     12.55     10日：6.72      4.62      26        累涨修正：95.2      29
//        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：37.25     累涨：37.66     12.33     13.22     12.11     10日：6.34      4.68      25        累涨修正：94.19     30
//        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：3.20      累涨：43.60     14.30     16.81     12.49     10日：5.01      3.81      31        累涨修正：91.61     31
//        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.33      累涨：36.19     10.89     13.21     12.09     10日：5.90      4.63      34        累涨修正：90.94     32
//        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：2.78      累涨：43.45     12.82     18.09     12.54     10日：5.28      3.69      27        累涨修正：90.12     33
//        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：0.96      累涨：35.70     12.19     12.35     11.16     10日：6.11      4.30      32        累涨修正：89.69     34
//        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.21      累涨：35.25     11.84     12.12     11.29     10日：5.58      4.34      36        累涨修正：86.8      35
//        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.36      累涨：36.83     11.88     12.72     12.23     10日：6.00      3.93      33        累涨修正：84.92     36
//        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.58      累涨：31.15     10.03     12.03     9.09      10日：6.09      4.43      37        累涨修正：82.75     37
//        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.77      累涨：31.30     10.63     10.30     10.37     10日：5.76      3.82      38        累涨修正：80.36     38
//        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.19      累涨：29.90     9.23      12.93     7.74      10日：4.57      4.25      44        累涨修正：74.66     39
//        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.43      累涨：29.20     10.04     9.25      9.91      10日：5.25      3.56      41        累涨修正：73.82     40
//        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：12.62     累涨：30.89     10.65     10.52     9.72      10日：5.13      3.11      40        累涨修正：72.21     41
//        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.11      累涨：31.10     11.51     9.74      9.85      10日：5.22      3.11      39        累涨修正：72.11     42
//        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.28      累涨：28.44     9.75      9.35      9.34      10日：4.88      3.50      45        累涨修正：71.94     43
//        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：15.39     累涨：29.80     11.44     9.47      8.89      10日：4.38      3.20      42        累涨修正：69.63     44
//        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：34.14     累涨：28.09     11.47     9.05      7.57      10日：4.33      2.88      51        累涨修正：66.4      45
//        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.34      累涨：29.62     10.07     10.60     8.95      10日：4.76      2.58      43        累涨修正：65.98     46
//        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.17      累涨：28.35     9.21      11.68     7.46      10日：4.93      2.93      50        累涨修正：65.82     47
//        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：38.08     累涨：29.06     10.77     8.73      9.56      10日：5.19      2.46      46        累涨修正：65.73     48
//        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：50.15     累涨：27.04     8.94      9.58      8.52      10日：4.87      2.74      49        累涨修正：64.68     49
//        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.44      累涨：27.52     11.35     8.49      7.68      10日：3.74      2.62      59        累涨修正：62.84     50
//        YILIAO_COMMON.put("588250", "医疗-通用             ");//科创生物医药ETF       市值：1.68      累涨：                              12.79     10日：5.49      3.98      47        累涨修正：62.65     51
//        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.86      累涨：26.89     9.37      8.93      8.59      10日：4.53      2.70      52        累涨修正：62.5      52
//        YILIAO_COMMON.put("159366", "医疗-通用             ");//港股医疗ETF           市值：0.25      累涨：                              15.37     10日：5.65      3.30      48        累涨修正：60.45     53
//        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.58      累涨：26.25     8.31      10.00     7.94      10日：5.19      2.85      53        累涨修正：60.42     54
//        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.79      累涨：27.06     10.80     8.28      7.98      10日：4.20      2.26      57        累涨修正：60.32     55
//        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：217.48    累涨：27.16     10.56     8.45      8.15      10日：4.15      2.20      58        累涨修正：59.66     56
//        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：21.92     累涨：25.16     8.75      8.37      8.04      10日：4.32      2.65      60        累涨修正：59.66     57
//        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：6.53      累涨：25.73     9.41      8.31      8.01      10日：3.89      2.50      65        累涨修正：59.47     58
//        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：6.19      累涨：25.83     10.21     8.16      7.46      10日：4.32      2.46      63        累涨修正：59.36     59
//        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.18      累涨：25.53     6.44      11.90     7.19      10日：4.75      2.67      55        累涨修正：58.87     60
//        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：2.06      累涨：25.43     9.93      8.13      7.37      10日：3.63      2.17      68        累涨修正：55.3      61
//        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：256.58    累涨：28.09     11.52     7.73      8.84      10日：4.05      1.56      54        累涨修正：53.35     62
//        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：16.25     累涨：28.36     11.23     7.92      9.21      10日：3.98      1.49      56        累涨修正：52.71     63
//        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：22.46     累涨：26.36     10.48     6.95      8.93      10日：4.29      1.51      61        累涨修正：51.55     64
//        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：9.67      累涨：27.26     10.66     8.22      8.38      10日：4.01      1.33      62        累涨修正：49.91     65
//        YILIAO_COMMON.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.86      累涨：22.24     5.59      10.42     6.23      10日：3.54      2.34      70        累涨修正：46.87     66
//        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.74      累涨：25.83     7.11      10.20     8.52      10日：4.10      1.16      64        累涨修正：46.79     67
//        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.83      累涨：26.60     8.48      9.75      8.37      10日：3.96      1.08      66        累涨修正：46.4      68
//        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.68      累涨：24.08     7.75      7.65      8.68      10日：4.29      1.24      67        累涨修正：46.3      69
//        YILIAO_COMMON.put("159647", "医疗-通用             ");//中药ETF               市值：7.25      累涨：22.07     5.69      10.23     6.15      10日：3.32      2.17      74        累涨修正：46.07     70
//        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.18      累涨：25.35     8.52      9.20      7.63      10日：3.41      1.26      72        累涨修正：46.03     71
//        YILIAO_COMMON.put("560080", "医疗-通用             ");//中药ETF               市值：19.14     累涨：22.76     6.24      10.15     6.37      10日：3.16      2.10      77        累涨修正：45.46     72
//        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.16      累涨：23.13     6.97      7.71      8.45      10日：4.06      1.19      71        累涨修正：44.34     73
//        YILIAO_COMMON.put("562390", "医疗-通用             ");//中药50ETF             市值：0.61      累涨：22.02     5.63      10.47     5.92      10日：3.05      2.09      78        累涨修正：43.76     74
//        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.82      累涨：25.48     8.77      9.09      7.62      10日：3.58      0.89      73        累涨修正：42.43     75
//        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.83      累涨：24.67     9.31      7.32      8.04      10日：3.65      0.85      75        累涨修正：41.32     76
//        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：16.29     累涨：24.57     6.44      10.16     7.97      10日：3.39      0.84      76        累涨修正：40.59     77
//        YILIAO_COMMON.put("159377", "医疗-通用             ");//创业板医药ETF国泰     市值：0.25      累涨：                              8.35      10日：4.42      2.06      69        累涨修正：39.85     78
//        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.53      累涨：20.53     6.94      6.16      7.43      10日：3.54      0.97      79        累涨修正：36.6      79
    }

    public static Map<String, String> YILIAO = new HashMap<>();//医疗

    static {
        YILIAO.putAll(YILIAO_COMMON);
    }


    /**
     * 科技
     */
    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();//科技-军工

    static {
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：91.42     累涨：44.51     13.51     12.42     18.58     10日：10.41     1.79      1         累涨修正：83.9      1
//        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：43.24     累涨：45.56     15.36     12.87     17.33     10日：9.55      1.69      2         累涨修正：83.25     2
//        KEJI_JUNGONG.put("159638", "科技-军工             ");//高端装备ETF           市值：11.98     累涨：42.25     12.26     12.53     17.46     10日：9.40      1.56      3         累涨修正：78.21     3
//        KEJI_JUNGONG.put("159378", "科技-军工             ");//通用航空ETF           市值：5.74      累涨：41.66     12.72     10.37     18.57     10日：7.21      1.11      4         累涨修正：68.29     4
//        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：44.30     累涨：37.70     11.40     10.71     15.59     10日：8.02      1.22      6         累涨修正：66.53     5
//        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：6.55      累涨：37.99     11.47     11.35     15.17     10日：7.67      1.11      7         累涨修正：65.54     6
//        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：138.82    累涨：38.90     11.67     11.51     15.72     10日：7.75      1.07      5         累涨修正：65.47     7
//        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.41      累涨：37.91     11.45     11.03     15.43     10日：7.68      0.83      9         累涨修正：62.4      8
//        KEJI_JUNGONG.put("516320", "科技-军工             ");//高端装备ETF           市值：0.75      累涨：24.76     8.06      6.22      10.48     10日：5.30      1.11      10        累涨修正：47.57     9
//        KEJI_JUNGONG.put("562910", "科技-军工             ");//高端制造ETF           市值：0.96      累涨：24.31     7.80      6.17      10.34     10日：5.01      0.96      12        累涨修正：44.89     10
//        KEJI_JUNGONG.put("159231", "科技-军工             ");//通用航空ETF华宝       市值：0.39      累涨：                                        10日：7.98      1.33      8         累涨修正：29.26     11
//        KEJI_JUNGONG.put("159208", "科技-军工             ");//航天航空ETF           市值：0.68      累涨：                                        10日：          1.19      11        累涨修正：13.09     12
//        KEJI_JUNGONG.put("159227", "科技-军工             ");//航空航天ETF           市值：4.14      累涨：                                        10日：                              累涨修正：          13
//        KEJI_JUNGONG.put("159392", "科技-军工             ");//航空ETF               市值：2.28      累涨：                                        10日：          2.25                累涨修正：          14
    }

    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();//科技-通用

    static {
//        KEJI_GONG_YE.put("159542", "科技-通用             ");//工程机械ETF           市值：0.09      累涨：43.67     14.82     8.88      19.97     10日：12.48     10.50     3         累涨修正：114.27    1
        KEJI_GONG_YE.put("159667", "科技-通用             ");//工业母机ETF           市值：4.15      累涨：47.33     18.64     10.34     18.35     10日：6.31      1.94      1         累涨修正：70.79     2
//        KEJI_GONG_YE.put("159723", "科技-通用             ");//科技龙头ETF           市值：0.74      累涨：40.04     18.56     8.29      13.19     10日：3.36      1.85      9         累涨修正：67.11     3
//        KEJI_GONG_YE.put("159663", "科技-通用             ");//机床ETF               市值：0.80      累涨：46.15     17.70     10.66     17.79     10日：5.83      1.60      2         累涨修正：65.47     4
//        KEJI_GONG_YE.put("159786", "科技-通用             ");//VRETF                 市值：1.21      累涨：34.49     9.94      9.88      14.67     10日：5.31      1.54      4         累涨修正：61.21     5
//        KEJI_GONG_YE.put("517660", "科技-通用             ");//物联网ETF沪港深       市值：0.46      累涨：39.01     16.65     9.60      12.76     10日：4.60      1.15      6         累涨修正：60.86     6
//        KEJI_GONG_YE.put("159896", "科技-通用             ");//物联网ETF南方         市值：0.90      累涨：34.66     12.39     9.25      13.02     10日：5.12      1.42      5         累涨修正：58.7      7
//        KEJI_GONG_YE.put("159701", "科技-通用             ");//物联网ETF招商         市值：0.19      累涨：35.63     11.32     12.11     12.20     10日：4.20      1.15      8         累涨修正：56.68     8
//        KEJI_GONG_YE.put("159777", "科技-通用             ");//创科技ETF             市值：0.94      累涨：32.09     9.64      9.88      12.57     10日：6.25      1.06      7         累涨修正：56.25     9
//        KEJI_GONG_YE.put("516960", "科技-通用             ");//机械ETF               市值：0.16      累涨：24.50     8.11      6.25      10.14     10日：5.42      1.80      24        累涨修正：54.16     10
//        KEJI_GONG_YE.put("512330", "科技-通用             ");//信息科技ETF           市值：5.41      累涨：39.31     15.52     11.89     11.90     10日：3.50      0.71      11        累涨修正：54.12     11
//        KEJI_GONG_YE.put("159886", "科技-通用             ");//机械ETF               市值：0.55      累涨：24.81     8.75      6.24      9.82      10日：4.97      1.74      28        累涨修正：53.89     12
//        KEJI_GONG_YE.put("516330", "科技-通用             ");//物联网ETF             市值：0.15      累涨：33.81     11.19     9.60      13.02     10日：4.74      1.04      10        累涨修正：53.26     13
//        KEJI_GONG_YE.put("159653", "科技-通用             ");//ESG300ETF             市值：0.55      累涨：26.52     9.68      9.43      7.41      10日：4.66      1.55      22        累涨修正：52.89     14
//        KEJI_GONG_YE.put("515200", "科技-通用             ");//创新100ETF            市值：1.60      累涨：30.48     10.27     8.73      11.48     10日：4.44      1.21      23        累涨修正：52.67     15
//        KEJI_GONG_YE.put("516720", "科技-通用             ");//ESGETF                市值：0.23      累涨：24.59     8.98      7.70      7.91      10日：5.81      2.48      20        累涨修正：51.66     16
//        KEJI_GONG_YE.put("516260", "科技-通用             ");//物联网50ETF           市值：0.98      累涨：32.44     10.75     9.77      11.92     10日：4.42      1.08      12        累涨修正：51.48     17
//        KEJI_GONG_YE.put("159895", "科技-通用             ");//物联网ETF易方达       市值：0.66      累涨：33.88     12.01     9.51      12.36     10日：4.16      0.84      19        累涨修正：51.44     18
//        KEJI_GONG_YE.put("512770", "科技-通用             ");//战略新兴ETF           市值：2.03      累涨：30.72     11.53     8.22      10.97     10日：4.77      1.07      21        累涨修正：50.98     19
//        KEJI_GONG_YE.put("159773", "科技-通用             ");//创业板科技ETF         市值：2.10      累涨：31.29     10.84     8.50      11.95     10日：5.86      0.72      18        累涨修正：50.93     20
//        KEJI_GONG_YE.put("560170", "科技-通用             ");//央企科技ETF           市值：14.67     累涨：33.05     12.22     9.13      11.70     10日：5.53      0.61      16        累涨修正：50.82     21
//        KEJI_GONG_YE.put("510770", "科技-通用             ");//G60创新ETF            市值：0.16      累涨：28.68     10.82     9.56      8.30      10日：3.03      1.43      26        累涨修正：50.47     22
//        KEJI_GONG_YE.put("159709", "科技-通用             ");//物联网ETF工银         市值：0.74      累涨：33.25     12.79     8.72      11.74     10日：4.78      0.91      15        累涨修正：50.44     23
//        KEJI_GONG_YE.put("563050", "科技-通用             ");//央企科技50ETF         市值：2.59      累涨：32.72     11.19     9.50      12.03     10日：5.63      0.58      14        累涨修正：50.36     24
//        KEJI_GONG_YE.put("515860", "科技-通用             ");//科技ETF基金           市值：1.72      累涨：31.61     12.16     8.85      10.60     10日：4.18      0.98      25        累涨修正：50.12     25
//        KEJI_GONG_YE.put("562380", "科技-通用             ");//央企科技引领ETF       市值：2.17      累涨：32.22     11.21     9.02      11.99     10日：5.68      0.59      17        累涨修正：50.07     26
//        KEJI_GONG_YE.put("515090", "科技-通用             ");//可持续发展ETF         市值：0.07      累涨：19.63     8.00      3.76      7.87      10日：5.29      1.67      31        累涨修正：48.58     27
//        KEJI_GONG_YE.put("159717", "科技-通用             ");//ESGETF                市值：0.51      累涨：21.95     7.85      6.51      7.59      10日：5.32      1.38      30        累涨修正：47.77     28
//        KEJI_GONG_YE.put("563210", "科技-通用             ");//专精特新ETF           市值：0.27      累涨：35.64     14.33     13.76     7.55      10日：2.19      0.70      29        累涨修正：47.72     29
//        KEJI_GONG_YE.put("560810", "科技-通用             ");//央企ESGETF            市值：4.93      累涨：25.06     8.17      11.25     5.64      10日：3.28      1.37      33        累涨修正：46.69     30
//        KEJI_GONG_YE.put("560990", "科技-通用             ");//中金科技先锋ETF       市值：0.29      累涨：26.33     10.58     8.12      7.63      10日：3.52      1.21      35        累涨修正：46.68     31
//        KEJI_GONG_YE.put("560280", "科技-通用             ");//工程机械ETF           市值：1.34      累涨：34.54     14.45     10.65     9.44      10日：2.46      0.78      27        累涨修正：45.87     32
//        KEJI_GONG_YE.put("515750", "科技-通用             ");//科技50ETF             市值：6.38      累涨：30.36     12.05     7.38      10.93     10日：3.25      0.92      36        累涨修正：45.37     33
//        KEJI_GONG_YE.put("516050", "科技-通用             ");//科技龙头ETF           市值：4.10      累涨：31.46     13.48     8.75      9.23      10日：3.43      0.60      32        累涨修正：44.92     34
//        KEJI_GONG_YE.put("515580", "科技-通用             ");//科技100ETF            市值：4.13      累涨：28.10     9.72      9.38      9.00      10日：3.44      0.86      37        累涨修正：44.44     35
//        KEJI_GONG_YE.put("159206", "科技-通用             ");//卫星ETF               市值：1.15      累涨：                    11.07     14.14     10日：5.95      0.65      13        累涨修正：44.26     36
//        KEJI_GONG_YE.put("159791", "科技-通用             ");//300ESGETF             市值：0.31      累涨：19.66     7.34      5.81      6.51      10日：4.64      1.39      41        累涨修正：44.23     37
//        KEJI_GONG_YE.put("561130", "科技-通用             ");//国货ETF               市值：1.61      累涨：22.12     9.18      5.85      7.09      10日：4.60      1.14      39        累涨修正：43.86     38
//        KEJI_GONG_YE.put("515000", "科技-通用             ");//科技ETF               市值：30.80     累涨：30.97     12.87     8.54      9.56      10日：3.21      0.47      38        累涨修正：42.56     39
//        KEJI_GONG_YE.put("510160", "科技-通用             ");//产业升级ETF           市值：2.37      累涨：19.56     4.81      8.33      6.42      10日：4.58      1.20      40        累涨修正：41.92     40
//        KEJI_GONG_YE.put("159621", "科技-通用             ");//MSCIESGETF            市值：0.29      累涨：21.29     8.01      6.23      7.05      10日：4.42      1.02      42        累涨修正：41.35     41
//        KEJI_GONG_YE.put("516800", "科技-通用             ");//智能制造ETF           市值：1.64      累涨：32.87     14.12     9.81      8.94      10日：2.13      0.36      34        累涨修正：41.09     42
//        KEJI_GONG_YE.put("561500", "科技-通用             ");//漂亮50ETF             市值：0.56      累涨：22.73     9.52      7.03      6.18      10日：1.83      1.22      43        累涨修正：39.81     43
//        KEJI_GONG_YE.put("561900", "科技-通用             ");//沪深300ESGETF         市值：0.45      累涨：19.42     6.92      6.67      5.83      10日：4.59      0.96      44        累涨修正：39.16     44
//        KEJI_GONG_YE.put("516830", "科技-通用             ");//300ESGETF             市值：2.04      累涨：19.09     7.43      5.70      5.96      10日：4.15      1.06      47        累涨修正：39.05     45
//        KEJI_GONG_YE.put("560180", "科技-通用             ");//沪深300ESGETF南方     市值：0.26      累涨：19.64     6.82      6.97      5.85      10日：4.01      1.00      48        累涨修正：38.66     46
//        KEJI_GONG_YE.put("560650", "科技-通用             ");//核心50ETF             市值：0.10      累涨：24.75     10.23     8.45      6.07      10日：1.44      0.84      45        累涨修正：36.87     47
//        KEJI_GONG_YE.put("510990", "科技-通用             ");//180ESGETF             市值：0.48      累涨：18.87     6.73      6.22      5.92      10日：3.77      0.88      50        累涨修正：36.09     48
//        KEJI_GONG_YE.put("159807", "科技-通用             ");//科技ETF               市值：9.74      累涨：25.85     10.33     8.13      7.39      10日：2.64      0.41      46        累涨修正：35.64     49
//        KEJI_GONG_YE.put("510090", "科技-通用             ");//ESGETF基金            市值：0.81      累涨：18.69     6.86      5.62      6.21      10日：4.37      0.68      49        累涨修正：34.91     50
//        KEJI_GONG_YE.put("588850", "科技-通用             ");//科创机械ETF           市值：0.25      累涨：                                        10日：3.64      0.48      51        累涨修正：10.53     51
//        KEJI_GONG_YE.put("159218", "科技-通用             ");//卫星产业ETF           市值：2.05      累涨：                                        10日：                              累涨修正：          52
    }

    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件

    static {
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：14.27     累涨：54.13     20.30     12.47     21.36     10日：6.93      0.97      1         累涨修正：74.88     1
//        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：32.02     累涨：52.54     22.34     16.81     13.39     10日：3.43      1.38      2         累涨修正：74.58     2
//        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：8.14      累涨：51.68     21.72     16.52     13.44     10日：3.23      1.32      5         累涨修正：72.66     3
//        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：7.68      累涨：50.61     21.07     16.57     12.97     10日：2.91      1.04      12        累涨修正：67.87     4
        KEJI_RUAN_JIAN.put("513360", "科技-软件             ");//教育ETF               市值：5.89      累涨：40.95     19.53     6.75      14.67     10日：4.89      1.54      13        累涨修正：66.34     5
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：5.95      累涨：51.58     23.02     9.87      18.69     10日：4.64      0.43      4         累涨修正：65.59     6
//        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算ETF沪港深       市值：3.03      累涨：51.70     24.96     9.40      17.34     10日：4.28      0.45      9         累涨修正：65.21     7
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人50ETF           市值：5.53      累涨：48.02     16.41     9.97      21.64     10日：6.10      0.76      10        累涨修正：64.45     8
//        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.74      累涨：48.56     20.11     10.66     17.79     10日：4.18      0.64      3         累涨修正：63.96     9
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：44.70     累涨：47.75     18.53     11.31     17.91     10日：7.22      0.07      11        累涨修正：62.96     10
//        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：14.28     累涨：49.18     16.59     11.07     21.52     10日：5.65      0.61      6         累涨修正：62.92     11
//        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.75      累涨：46.64     17.67     10.81     18.16     10日：7.27      0.09      16        累涨修正：62.17     12
//        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：9.35      累涨：45.86     18.29     10.69     16.88     10日：6.37      0.17      15        累涨修正：60.47     13
//        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：14.33     累涨：45.34     16.46     16.72     12.16     10日：2.54      0.91      34        累涨修正：60.43     14
//        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：131.36    累涨：45.17     17.24     10.10     17.83     10日：4.59      0.81      8         累涨修正：60.04     15
//        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：54.53     累涨：44.98     17.16     10.11     17.71     10日：4.55      0.67      14        累涨修正：59.91     16
//        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：5.43      累涨：46.11     18.01     10.01     18.09     10日：4.39      0.55      7         累涨修正：59.26     17
//        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.35      累涨：43.91     16.84     9.46      17.61     10日：4.65      0.74      18        累涨修正：59.11     18
//        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.61      累涨：44.37     17.01     9.84      17.52     10日：4.36      0.63      19        累涨修正：58.13     19
//        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：35.78     累涨：41.45     16.94     9.81      14.70     10日：4.26      0.93      20        累涨修正：58.03     20
//        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：162.73    累涨：41.51     17.77     9.89      13.85     10日：4.11      0.88      17        累涨修正：57.87     21
//        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：19.46     累涨：41.01     17.34     10.42     13.25     10日：3.70      0.84      22        累涨修正：56.6      22
//        KEJI_RUAN_JIAN.put("159586", "科技-软件             ");//计算机ETF南方         市值：3.38      累涨：41.60     17.47     8.17      15.96     10日：3.70      0.67      23        累涨修正：56.37     23
//        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.56      累涨：37.83     16.34     8.88      12.61     10日：4.05      0.78      38        累涨修正：54.51     24
//        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：18.65     累涨：41.96     20.06     8.10      13.80     10日：2.78      0.60      31        累涨修正：54.12     25
//        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：5.41      累涨：39.31     15.52     11.89     11.90     10日：3.50      0.71      11        累涨修正：54.12     26
//        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：52.00     累涨：39.66     16.54     10.08     13.04     10日：3.55      0.77      24        累涨修正：54.04     27
//        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.91      累涨：40.28     19.06     9.98      11.24     10日：2.54      0.68      32        累涨修正：52.84     28
//        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.41      累涨：42.84     19.19     8.50      15.15     10日：3.36      0.28      25        累涨修正：52.64     29
//        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：4.13      累涨：41.96     19.65     8.64      13.67     10日：2.89      0.44      30        累涨修正：52.58     30
//        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：6.02      累涨：42.03     18.82     8.23      14.98     10日：3.42      0.28      27        累涨修正：51.95     31
//        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//云计算50ETF           市值：1.32      累涨：42.63     18.38     8.61      15.64     10日：3.29      0.21      35        累涨修正：51.52     32
//        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.13      累涨：41.01     19.01     8.31      13.69     10日：2.75      0.45      36        累涨修正：51.46     33
//        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：34.66     累涨：43.95     19.08     9.00      15.87     10日：3.74                26        累涨修正：51.43     34
//        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：5.25      累涨：43.33     19.31     9.00      15.02     10日：3.35      0.09      29        累涨修正：51.02     35
//        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.05      累涨：40.48     17.78     8.07      14.63     10日：3.55      0.30      37        累涨修正：50.88     36
//        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：0.70      累涨：40.55     17.85     9.64      13.06     10日：3.18      0.32      39        累涨修正：50.43     37
//        KEJI_RUAN_JIAN.put("512720", "科技-软件             ");//计算机ETF             市值：11.61     累涨：38.10     17.99     7.08      13.03     10日：3.31      0.39      44        累涨修正：49.01     38
//        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：2.70      累涨：40.33     18.44     9.26      12.63     10日：3.01      0.24      43        累涨修正：48.99     39
//        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：3.13      累涨：39.69     17.68     8.04      13.97     10日：2.96      0.25      48        累涨修正：48.36     40
//        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：13.26     累涨：38.99     17.70     7.59      13.70     10日：3.31      0.25      47        累涨修正：48.36     41
//        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.73      累涨：37.99     17.00     8.19      12.80     10日：3.71      0.24      52        累涨修正：48.05     42
//        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.51      累涨：39.10     17.27     8.47      13.36     10日：2.87      0.29      51        累涨修正：48.03     43
//        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：4.22      累涨：39.82     18.80     8.55      12.47     10日：2.74      0.24      55        累涨修正：47.94     44
//        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：29.35     累涨：39.04     16.94     7.70      14.40     10日：3.22      0.13      57        累涨修正：46.91     45
//        KEJI_RUAN_JIAN.put("159998", "科技-软件             ");//计算机ETF             市值：27.64     累涨：37.19     17.26     7.25      12.68     10日：2.93      0.35      58        累涨修正：46.9      46
//        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：2.48      累涨：37.87     18.00     14.01     5.86      10日：1.51      0.53      40        累涨修正：46.72     47
//        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.31      累涨：38.72     18.18     14.74     5.80      10日：1.36      0.46      41        累涨修正：46.5      48
//        KEJI_RUAN_JIAN.put("589520", "科技-软件             ");//科创人工智能ETF华宝   市值：2.44      累涨：                    16.39     12.95     10日：2.73      1.03      33        累涨修正：46.13     49
//        KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：2.39      累涨：                              21.50     10日：6.44      1.37      21        累涨修正：44.69     50
//        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.31      累涨：32.94     12.51     9.64      10.79     10日：3.17      0.47      49        累涨修正：44.45     51
//        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：1.58      累涨：37.09     17.48     11.14     8.47      10日：1.74      0.34      45        累涨修正：44.31     52
//        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.34      累涨：37.24     16.11     7.97      13.16     10日：2.80      0.13      61        累涨修正：44.27     53
//        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.52      累涨：37.54     16.45     7.55      13.54     10日：2.90                60        累涨修正：43.34     54
//        KEJI_RUAN_JIAN.put("560800", "科技-软件             ");//数字经济ETF           市值：7.53      累涨：34.24     16.06     9.94      8.24      10日：2.21      0.39      59        累涨修正：42.95     55
//        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：15.58     累涨：33.54     13.19     10.42     9.93      10日：2.89      0.33      54        累涨修正：42.95     56
//        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：0.47      累涨：36.47     17.68     10.13     8.66      10日：1.76      0.26      50        累涨修正：42.85     57
//        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：0.71      累涨：36.41     17.21     10.94     8.26      10日：1.62      0.26      56        累涨修正：42.51     58
//        KEJI_RUAN_JIAN.put("159658", "科技-软件             ");//数字经济ETF           市值：2.07      累涨：32.87     15.67     9.19      8.01      10日：2.24      0.25      62        累涨修正：40.1      59
//        KEJI_RUAN_JIAN.put("159388", "科技-软件             ");//创业板人工智能ETF国泰 市值：1.97      累涨：                              21.46     10日：6.11      0.42      28        累涨修正：38.3      60
//        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：0.84      累涨：32.73     16.73     8.18      7.82      10日：1.01      0.26      63        累涨修正：37.61     61
//        KEJI_RUAN_JIAN.put("589010", "科技-软件             ");//科创人工智能ETF华夏   市值：0.97      累涨：                              12.34     10日：2.93      1.18      53        累涨修正：31.18     62
//        KEJI_RUAN_JIAN.put("560630", "科技-软件             ");//机器人产业ETF         市值：4.89      累涨：                              16.48     10日：3.36      0.53      42        累涨修正：26.79     63
//        KEJI_RUAN_JIAN.put("159213", "科技-软件             ");//机器人ETF基金         市值：0.51      累涨：                                        10日：4.77      0.96      46        累涨修正：16.74     64
//        KEJI_RUAN_JIAN.put("588770", "科技-软件             ");//科创信息技术ETF摩根   市值：3.25      累涨：                              5.59      10日：1.56      0.32      64        累涨修正：12.23     65
//        KEJI_RUAN_JIAN.put("159382", "科技-软件             ");//创业板人工智能ETF南方 市值：0.55      累涨：                                        10日：          1.00                累涨修正：          66
    }

    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片

    static {
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：2.46      累涨：56.36     25.84     22.29     8.23      10日：1.90      0.86      1         累涨修正：69.62     1
//        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：17.41     累涨：34.50     8.73      11.75     14.02     10日：5.41      1.29      4         累涨修正：58.6      2
//        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：14.17     累涨：43.79     19.90     17.29     6.60      10日：1.87      0.80      10        累涨修正：56.33     3
//        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：3.96      累涨：31.07     11.01     7.14      12.92     10日：6.04      1.28      7         累涨修正：56.11     4
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.39      累涨：42.23     18.25     16.37     7.61      10日：1.89      0.84      2         累涨修正：55.25     5
//        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.61      累涨：41.77     17.40     17.00     7.37      10日：1.72      0.87      3         累涨修正：54.78     6
//        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：246.66    累涨：43.83     20.43     17.37     6.03      10日：1.84      0.60      20        累涨修正：54.11     7
//        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：4.20      累涨：33.59     10.48     11.78     11.33     10日：4.17      0.96      8         累涨修正：52.49     8
//        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.92      累涨：34.41     11.15     11.95     11.31     10日：4.06      0.90      11        累涨修正：52.43     9
//        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：23.46     累涨：43.43     20.49     17.43     5.51      10日：1.42      0.55      30        累涨修正：52.32     10
//        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.41      累涨：39.66     17.33     15.77     6.56      10日：1.59      0.85      18        累涨修正：52.19     11
//        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：5.64      累涨：42.48     20.52     16.59     5.37      10日：1.53      0.59      29        累涨修正：52.03     12
//        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：47.76     累涨：36.92     15.89     14.24     6.79      10日：1.90      1.02      5         累涨修正：51.94     13
//        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：106.76    累涨：36.85     15.77     14.42     6.66      10日：2.10      0.97      6         累涨修正：51.72     14
//        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：4.75      累涨：35.37     11.08     13.43     10.86     10日：4.33      0.86      15        累涨修正：51.67     15
//        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：4.77      累涨：36.89     15.54     14.64     6.71      10日：2.04      0.96      9         累涨修正：51.53     16
//        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.38      累涨：42.35     20.48     16.50     5.37      10日：1.44      0.57      35        累涨修正：51.5      17
//        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.90      累涨：33.76     10.82     11.66     11.28     10日：4.00      0.88      21        累涨修正：51.44     18
//        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：237.73    累涨：36.62     16.04     14.13     6.45      10日：1.87      0.99      14        累涨修正：51.25     19
//        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：219.38    累涨：37.46     15.78     14.70     6.98      10日：1.93      0.88      12        累涨修正：51        20
//        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片ETF天弘           市值：9.47      累涨：37.15     16.01     14.40     6.74      10日：1.90      0.82      19        累涨修正：49.97     21
//        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.18      累涨：35.23     14.57     14.38     6.28      10日：2.12      0.94      17        累涨修正：49.81     22
//        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.13      累涨：34.08     11.63     10.98     11.47     10日：4.04      0.68      24        累涨修正：49.64     23
//        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.58      累涨：35.82     15.76     14.08     5.98      10日：1.66      0.88      32        累涨修正：48.82     24
//        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：11.65     累涨：37.79     16.27     14.72     6.80      10日：1.71      0.67      25        累涨修正：48.58     25
//        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.05     累涨：35.96     15.81     14.16     5.99      10日：1.64      0.83      34        累涨修正：48.37     26
//        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：12.12     累涨：33.31     13.10     10.83     9.38      10日：3.41      0.74      26        累涨修正：48.27     27
//        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.67      累涨：34.39     11.50     15.56     7.33      10日：1.95      0.90      13        累涨修正：48.19     28
//        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.10     累涨：36.67     15.52     14.70     6.45      10日：1.78      0.72      28        累涨修正：48.15     29
//        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.65      累涨：33.57     12.51     13.69     7.37      10日：2.23      0.92      16        累涨修正：48.15     30
//        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.70      累涨：35.85     14.81     15.23     5.81      10日：1.50      0.82      36        累涨修正：47.87     31
//        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：3.83      累涨：36.95     13.87     11.77     11.31     10日：3.44      0.36      27        累涨修正：47.79     32
//        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.93      累涨：41.64     19.23     17.35     5.06      10日：1.12      0.28      39        累涨修正：46.96     33
//        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：1.80      累涨：28.51     10.37     8.86      9.28      10日：3.53      1.18      22        累涨修正：46.87     34
//        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.58      累涨：31.66     9.50      10.83     11.33     10日：3.95      0.66      33        累涨修正：46.82     35
//        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：22.40     累涨：32.54     11.29     13.79     7.46      10日：2.15      0.89      23        累涨修正：46.63     36
//        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：4.44      累涨：31.19     11.76     9.80      9.63      10日：3.73      0.59      31        累涨修正：45.14     37
//        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.07      累涨：34.21     13.57     14.64     6.00      10日：1.55      0.70      38        累涨修正：45.01     38
//        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.21      累涨：32.28     11.63     14.10     6.55      10日：1.49      0.84      40        累涨修正：44.5      39
//        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.85      累涨：33.86     13.42     14.93     5.51      10日：1.41      0.71      41        累涨修正：44.49     40
//        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：1.48      累涨：32.21     12.22     10.89     9.10      10日：3.26      0.38      37        累涨修正：42.91     41
//        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.58      累涨：32.22     12.02     14.06     6.14      10日：1.18      0.68      42        累涨修正：42.06     42
//        KEJI_XIN_PIAN.put("588170", "科技-芯片             ");//科创半导体ETF         市值：2.46      累涨：                              8.34      10日：2.36      1.24      36        累涨修正：26.7      43
//        KEJI_XIN_PIAN.put("589100", "科技-芯片             ");//科创芯片ETF国泰       市值：1.16      累涨：                              5.32      10日：1.43      0.51      43        累涨修正：13.79     44
    }

    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();

    static {
        KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：25.28     累涨：44.89     14.06     12.83     18.00     10日：8.10      1.13      1         累涨修正：68.41     1
//        KEJI_TONG_XIN.put("159583", "科技-通信             ");//通信设备ETF           市值：0.66      累涨：41.36     14.55     11.09     15.72     10日：7.81      0.92      2         累涨修正：63.25     2
//        KEJI_TONG_XIN.put("159811", "科技-通信             ");//5G50ETF               市值：1.05      累涨：40.75     15.38     10.57     14.80     10日：5.82      1.01      4         累涨修正：62.94     3
//        KEJI_TONG_XIN.put("159695", "科技-通信             ");//通信ETF               市值：1.03      累涨：38.28     14.98     8.86      14.44     10日：6.46      1.39      3         累涨修正：62.85     4
//        KEJI_TONG_XIN.put("515050", "科技-通信             ");//5G通信ETF             市值：61.47     累涨：41.81     13.31     10.37     18.13     10日：7.17      0.67      6         累涨修正：62.19     5
//        KEJI_TONG_XIN.put("159994", "科技-通信             ");//5GETF                 市值：14.64     累涨：42.43     13.46     11.43     17.54     10日：6.84      0.70      5         累涨修正：61.36     6
//        KEJI_TONG_XIN.put("159507", "科技-通信             ");//电信ETF               市值：0.48      累涨：37.88     14.63     9.25      14.00     10日：6.10      0.86      7         累涨修正：58.21     7
//        KEJI_TONG_XIN.put("563010", "科技-通信             ");//电信ETF               市值：1.48      累涨：32.81     16.74     6.76      9.31      10日：4.71      0.88      8         累涨修正：51.91     8
//        KEJI_TONG_XIN.put("159511", "科技-通信             ");//通信ETF南方           市值：0.81      累涨：37.30     19.03     7.65      10.62     10日：3.98      0.59      10        累涨修正：51.75     9
//        KEJI_TONG_XIN.put("560690", "科技-通信             ");//电信ETF基金           市值：0.25      累涨：31.23     16.24     5.86      9.13      10日：4.34      1.01      9         累涨修正：51.02     10
//        KEJI_TONG_XIN.put("560300", "科技-通信             ");//电信50ETF             市值：0.72      累涨：34.21     18.39     7.00      8.82      10日：4.30      0.67      11        累涨修正：50.18     11
    }

    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港科技

    static {
        KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：5.34      累涨：65.37     13.95     29.18     22.24     10日：13.99     2.01      4         累涨修正：115.46    1
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：144.58    累涨：61.82     26.56     15.90     19.36     10日：6.44      3.41      1         累涨修正：109.2     2
//        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：4.91      累涨：59.10     25.57     15.17     18.36     10日：6.04      3.30      3         累涨修正：106.92    3
//        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.39      累涨：59.57     25.29     15.89     18.39     10日：6.42      3.42      2         累涨修正：106.88    4
//        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：18.79     累涨：60.03     25.10     14.62     20.31     10日：5.87      2.98      5         累涨修正：103.57    5
//        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：10.98     累涨：57.55     24.12     15.37     18.06     10日：6.08      3.10      6         累涨修正：102.55    6
//        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：5.87      累涨：56.06     23.68     15.31     17.07     10日：5.44      3.45      13        累涨修正：102.09    7
//        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：5.67      累涨：58.98     28.08     13.99     16.91     10日：5.55      2.90      7         累涨修正：100.58    8
//        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：4.05      累涨：56.37     24.75     13.97     17.65     10日：6.15      2.79      8         累涨修正：97.82     9
//        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：220.60    累涨：59.13     26.64     14.30     18.19     10日：5.21      2.36      9         累涨修正：95.51     10
//        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：1.66      累涨：55.30     23.18     14.01     18.11     10日：5.93      2.40      12        累涨修正：93.56     11
//        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：6.96      累涨：57.87     27.91     11.53     18.43     10日：4.89      1.83      15        累涨修正：87.78     12
//        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：463.79    累涨：57.88     29.06     10.52     18.30     10日：4.74      1.77      17        累涨修正：86.83     13
//        KEJI_HK.put("517360", "科技-香港             ");//沪港深科技ETF         市值：0.39      累涨：47.78     20.96     10.42     16.40     10日：4.88      2.61      29        累涨修正：86.25     14
//        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：48.79     累涨：55.95     26.22     13.54     16.19     10日：6.04      1.55      14        累涨修正：85.08     15
//        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：48.59     累涨：58.59     30.78     9.15      18.66     10日：6.02      1.31      10        累涨修正：85.04     16
//        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：48.19     累涨：57.22     27.60     11.24     18.38     10日：4.73      1.64      18        累涨修正：84.72     17
//        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.28      累涨：57.62     28.94     10.82     17.86     10日：4.53      1.63      21        累涨修正：84.61     18
//        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：234.06    累涨：56.42     29.27     11.24     15.91     10日：5.45      1.47      20        累涨修正：83.49     19
//        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.72      累涨：55.40     28.65     8.16      18.59     10日：6.19      1.36      11        累涨修正：82.74     20
//        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：8.37      累涨：55.32     26.66     13.28     15.38     10日：5.72      1.43      19        累涨修正：82.49     21
//        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：344.45    累涨：58.12     29.74     9.56      18.82     10日：5.91      1.06      16        累涨修正：81.6      22
//        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：9.10      累涨：57.70     29.19     12.00     16.51     10日：5.16      1.23      23        累涨修正：81.55     23
//        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：44.07     累涨：54.81     25.69     13.69     15.43     10日：5.59      1.32      22        累涨修正：80.51     24
//        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：249.60    累涨：55.06     26.38     13.54     15.14     10日：5.55      1.28      25        累涨修正：80.24     25
//        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：23.41     累涨：55.47     25.86     13.64     15.97     10日：5.53      1.13      24        累涨修正：78.96     26
//        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：112.48    累涨：54.36     25.71     13.29     15.36     10日：5.65      1.10      26        累涨修正：77.76     27
//        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：19.35     累涨：54.06     25.22     13.78     15.06     10日：5.55      1.10      27        累涨修正：77.26     28
//        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：271.21    累涨：54.11     25.56     13.29     15.26     10日：5.33      1.12      30        累涨修正：77.09     29
//        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：72.67     累涨：53.59     25.80     12.84     14.95     10日：5.29      1.14      31        累涨修正：76.71     30
//        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：11.38     累涨：54.85     26.46     11.95     16.44     10日：4.64      1.11      28        累涨修正：76.34     31
//        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：4.04      累涨：52.93     25.16     12.66     15.11     10日：5.45      1.12      32        累涨修正：76.15     32
//        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.82      累涨：45.77     22.81     7.66      15.30     10日：4.02      1.43      33        累涨修正：69.54     33
//        KEJI_HK.put("517350", "科技-香港             ");//科技ETF沪港深         市值：0.87      累涨：41.49     18.78     9.02      13.69     10日：4.14      1.61      34        累涨修正：67.48     34
//        KEJI_HK.put("159723", "科技-香港             ");//科技龙头ETF           市值：0.74      累涨：40.04     18.56     8.29      13.19     10日：3.36      1.85      9         累涨修正：67.11     35
//        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：2.86      累涨：46.17     23.25     7.89      15.03     10日：4.37      1.00      36        累涨修正：65.91     36
//        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.18      累涨：46.53     25.08     7.30      14.15     10日：3.46      0.84      37        累涨修正：62.69     37
//        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：4.34      累涨：45.29     23.20     7.96      14.13     10日：3.74      0.88      38        累涨修正：62.45     38
//        KEJI_HK.put("516050", "科技-香港             ");//科技龙头ETF           市值：4.10      累涨：31.46     13.48     8.75      9.23      10日：3.43      0.60      32        累涨修正：44.92     39
//        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.52      累涨：30.55     12.30     7.22      11.03     10日：3.36      0.84      39        累涨修正：44.83     40
//        KEJI_HK.put("159202", "科技-香港             ");//恒生互联网科技ETF     市值：1.26      累涨：                              16.07     10日：4.47      0.97      35        累涨修正：35.68     41
//        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：11.17     累涨：                                        10日：                    40        累涨修正：0         42
    }

    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源

    static {
        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.15      累涨：27.41     9.35      6.81      11.25     10日：7.02      2.90      5         累涨修正：71.39     1
//        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：20.01     累涨：25.49     8.08      7.04      10.37     10日：6.57      2.34      6         累涨修正：64.37     2
//        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.24      累涨：24.20     7.91      6.98      9.31      10日：5.39      2.54      15        累涨修正：61.03     3
//        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：1.08      累涨：23.25     5.09      9.79      8.37      10日：4.19      2.56      25        累涨修正：59.79     4
//        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：0.92      累涨：27.15     10.76     5.46      10.93     10日：6.55      1.85      7         累涨修正：58.99     5
//        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：8.93      累涨：26.94     10.11     5.69      11.14     10日：6.53      1.84      8         累涨修正：58.63     6
//        KEJI_NEW_ENERGY.put("159625", "科技-新能源           ");//绿色电力ETF           市值：3.46      累涨：23.91     4.76      10.80     8.35      10日：4.14      2.46      30        累涨修正：58.62     7
//        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：6.98      累涨：23.60     7.13      7.73      8.74      10日：4.90      2.23      27        累涨修正：57.93     8
//        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：1.88      累涨：23.75     7.37      7.12      9.26      10日：5.10      2.26      22        累涨修正：57.9      9
//        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.87      累涨：24.59     8.11      7.52      8.96      10日：5.00      2.09      20        累涨修正：57.58     10
//        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：6.54      累涨：26.40     10.23     5.51      10.66     10日：5.96      1.68      23        累涨修正：56.8      11
//        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.24      累涨：23.39     8.43      6.11      8.85      10日：4.89      2.23      42        累涨修正：56.79     12
//        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：2.96      累涨：26.55     8.63      6.22      11.70     10日：6.07      1.77      13        累涨修正：56.62     13
//        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：2.72      累涨：22.94     7.69      6.79      8.46      10日：5.06      2.13      40        累涨修正：56.49     14
//        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.64      累涨：23.69     7.57      7.22      8.90      10日：6.19      1.85      18        累涨修正：56.42     15
//        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：2.03      累涨：27.75     9.54      6.17      12.04     10日：6.25      1.60      11        累涨修正：56.24     16
//        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.39      累涨：40.03     16.57     11.25     12.21     10日：6.51      0.39      1         累涨修正：56.01     17
//        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.60      累涨：21.58     6.44      5.56      9.58      10日：6.12      2.01      38        累涨修正：55.93     18
//        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：11.88     累涨：25.20     8.90      6.68      9.62      10日：5.80      1.73      33        累涨修正：55.83     19
//        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：10.86     累涨：23.83     7.66      7.16      9.01      10日：4.90      2.10      29        累涨修正：55.82     20
//        KEJI_NEW_ENERGY.put("560960", "科技-新能源           ");//碳中和60指数ETF       市值：0.12      累涨：26.77     11.19     6.85      8.73      10日：7.73      1.21      12        累涨修正：55.54     21
//        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.53      累涨：23.55     7.47      6.45      9.63      10日：6.35      1.73      28        累涨修正：55.28     22
//        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.55      累涨：23.21     6.90      7.22      9.09      10日：5.99      1.81      32        累涨修正：55.1      23
//        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.28      累涨：39.39     16.04     11.14     12.21     10日：6.51      0.33      2         累涨修正：54.5      24
//        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：44.56     累涨：26.25     9.91      5.53      10.81     10日：6.46      1.41      17        累涨修正：54.33     25
//        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.55      累涨：23.72     5.04      10.82     7.86      10日：3.76      2.34      31        累涨修正：54.32     26
//        KEJI_NEW_ENERGY.put("562960", "科技-新能源           ");//绿色电力ETF易方达     市值：0.87      累涨：23.65     4.85      10.35     8.45      10日：3.95      2.24      35        累涨修正：54.23     27
//        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.14      累涨：26.99     10.03     6.19      10.77     10日：5.90      1.35      24        累涨修正：53.64     28
//        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：6.53      累涨：22.69     7.26      7.11      8.32      10日：4.63      1.97      45        累涨修正：53.62     29
//        KEJI_NEW_ENERGY.put("561170", "科技-新能源           ");//绿色电力ETF           市值：1.21      累涨：23.68     4.84      10.92     7.92      10日：3.65      2.24      37        累涨修正：53.03     30
//        KEJI_NEW_ENERGY.put("560580", "科技-新能源           ");//电力ETF南方           市值：0.55      累涨：23.28     4.80      10.60     7.88      10日：3.71      2.04      43        累涨修正：52.44     31
//        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.59      累涨：24.14     8.19      6.32      9.63      10日：5.84      1.51      41        累涨修正：51.52     32
//        KEJI_NEW_ENERGY.put("561700", "科技-新能源           ");//电力ETF基金           市值：1.59      累涨：22.75     4.81      10.44     7.50      10日：3.13      1.85      46        累涨修正：49.36     33
//        KEJI_NEW_ENERGY.put("561560", "科技-新能源           ");//电力ETF               市值：6.42      累涨：21.99     4.72      9.79      7.48      10日：3.34      1.96      48        累涨修正：49.04     34
        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.62      累涨：29.62     10.65     7.10      11.87     10日：7.19      0.57      4         累涨修正：47.61     35
//        KEJI_NEW_ENERGY.put("562350", "科技-新能源           ");//电力指数ETF           市值：0.54      累涨：20.78     4.06      9.25      7.47      10日：3.32      2.04      49        累涨修正：47.13     36
//        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.26      累涨：29.44     10.56     8.17      10.71     10日：6.56      0.54      5         累涨修正：46.61     37
//        KEJI_NEW_ENERGY.put("159611", "科技-新能源           ");//电力ETF               市值：34.66     累涨：22.48     5.16      10.18     7.14      10日：2.98      1.84      47        累涨修正：46.51     38
//        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.61      累涨：29.46     10.23     7.55      11.68     10日：6.76      0.54      3         累涨修正：46.4      39
//        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.59      累涨：25.42     9.80      7.90      7.72      10日：3.67      1.22      44        累涨修正：45.55     40
//        KEJI_NEW_ENERGY.put("159368", "科技-新能源           ");//创业板新能源ETF华夏   市值：1.21      累涨：                              14.73     10日：6.38      1.52      36        累涨修正：44.21     41
//        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：90.45     累涨：30.06     11.68     7.83      10.55     10日：6.33      0.30      9         累涨修正：43.92     42
//        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：2.45      累涨：27.62     10.63     6.40      10.59     10日：6.07      0.48      21        累涨修正：43.36     43
//        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：19.92     累涨：28.83     10.98     7.16      10.69     10日：6.08      0.36      10        累涨修正：42.43     44
//        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.51      累涨：29.57     10.06     8.92      10.59     10日：5.33      0.44      14        累涨修正：41.99     45
//        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.46      累涨：28.60     10.89     7.15      10.56     10日：5.99      0.26      16        累涨修正：41.62     46
//        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：7.14      累涨：28.14     10.24     7.00      10.90     10日：5.92      0.36      19        累涨修正：41.42     47
//        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.35      累涨：27.81     10.54     7.36      9.91      10日：5.22      0.23      26        累涨修正：40.78     48
//        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.78      累涨：26.56     8.68      6.93      10.95     10日：4.61      0.43      39        累涨修正：39.04     49
//        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.35      累涨：26.57     8.13      7.27      11.17     10日：4.94      0.22      34        累涨修正：38.87     50
//        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：3.47      累涨：                                        10日：                    50        累涨修正：0         51
    }

    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车

    static {
        KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：5.13      累涨：66.02     24.94     17.84     23.24     10日：12.94     4.61      1         累涨修正：133.93    1
//        KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：1.29      累涨：64.63     24.63     17.65     22.35     10日：11.91     3.96      2         累涨修正：125.36    2
//        KEJI_NEW_CAR.put("159767", "科技-汽车             ");//电池龙头ETF           市值：1.18      累涨：38.27     13.10     7.64      17.53     10日：10.10     4.63      4         累涨修正：101.84    3
//        KEJI_NEW_CAR.put("159755", "科技-汽车             ");//电池ETF               市值：28.83     累涨：38.54     13.73     7.83      16.98     10日：9.84      4.64      3         累涨修正：101.07    4
//        KEJI_NEW_CAR.put("159757", "科技-汽车             ");//电池30ETF             市值：3.13      累涨：37.97     13.83     7.78      16.36     10日：9.04      4.20      5         累涨修正：96.09     5
//        KEJI_NEW_CAR.put("159775", "科技-汽车             ");//新能源车电池ETF       市值：0.57      累涨：37.14     13.41     7.94      15.79     10日：8.94      3.98      7         累涨修正：93.9      6
//        KEJI_NEW_CAR.put("159840", "科技-汽车             ");//锂电池ETF             市值：8.93      累涨：36.98     13.00     8.00      15.98     10日：8.80      4.15      6         累涨修正：93.86     7
//        KEJI_NEW_CAR.put("560000", "科技-汽车             ");//智慧电车ETF           市值：0.11      累涨：34.44     12.16     9.61      12.67     10日：7.04      4.02      17        累涨修正：88.54     8
//        KEJI_NEW_CAR.put("159512", "科技-汽车             ");//汽车ETF               市值：0.65      累涨：33.73     9.35      12.16     12.22     10日：6.24      4.57      21        累涨修正：85.35     9
//        KEJI_NEW_CAR.put("516660", "科技-汽车             ");//新能源车ETF基金       市值：3.18      累涨：35.47     12.73     6.97      15.77     10日：7.62      3.65      8         累涨修正：84.42     10
//        KEJI_NEW_CAR.put("159806", "科技-汽车             ");//新能源车ETF           市值：10.12     累涨：34.41     12.32     6.43      15.66     10日：7.44      3.69      18        累涨修正：83.37     11
//        KEJI_NEW_CAR.put("515700", "科技-汽车             ");//新能车ETF             市值：22.92     累涨：35.52     13.21     6.75      15.56     10日：7.58      3.45      12        累涨修正：83.1      12
//        KEJI_NEW_CAR.put("515030", "科技-汽车             ");//新能源车ETF           市值：43.37     累涨：35.35     12.82     6.74      15.79     10日：7.69      3.45      10        累涨修正：82.45     13
//        KEJI_NEW_CAR.put("159637", "科技-汽车             ");//新能源车龙头ETF       市值：8.22      累涨：34.36     12.35     6.40      15.61     10日：7.52      3.40      23        累涨修正：82.25     14
//        KEJI_NEW_CAR.put("159824", "科技-汽车             ");//新能车ETF             市值：1.63      累涨：35.00     13.28     6.70      15.02     10日：7.12      3.47      22        累涨修正：81.53     15
//        KEJI_NEW_CAR.put("516390", "科技-汽车             ");//新能源汽车ETF         市值：3.29      累涨：35.45     13.28     6.64      15.53     10日：7.18      3.41      19        累涨修正：81.02     16
//        KEJI_NEW_CAR.put("516590", "科技-汽车             ");//智能汽车ETF易方达     市值：0.93      累涨：33.63     10.18     8.43      15.02     10日：7.49      3.40      27        累涨修正：80.2      17
//        KEJI_NEW_CAR.put("159720", "科技-汽车             ");//智能车ETF泰康         市值：0.55      累涨：34.39     11.42     8.16      14.81     10日：7.30      3.23      33        累涨修正：80.18     18
//        KEJI_NEW_CAR.put("516110", "科技-汽车             ");//汽车ETF               市值：4.49      累涨：33.54     8.74      10.65     14.15     10日：6.37      4.04      24        累涨修正：78.33     19
//        KEJI_NEW_CAR.put("516380", "科技-汽车             ");//智能电动车ETF         市值：0.97      累涨：34.00     10.59     8.73      14.68     10日：7.30      2.96      31        累涨修正：76.61     20
//        KEJI_NEW_CAR.put("561910", "科技-汽车             ");//电池ETF               市值：5.76      累涨：34.57     12.29     6.91      15.37     10日：7.37      2.50      35        累涨修正：75.34     21
//        KEJI_NEW_CAR.put("561160", "科技-汽车             ");//锂电池ETF             市值：5.96      累涨：36.73     12.86     8.27      15.60     10日：7.60      2.51      13        累涨修正：75.13     22
//        KEJI_NEW_CAR.put("562880", "科技-汽车             ");//电池ETF基金           市值：3.34      累涨：34.99     11.33     8.05      15.61     10日：8.03      2.44      25        累涨修正：75.02     23
//        KEJI_NEW_CAR.put("159566", "科技-汽车             ");//储能电池ETF           市值：1.10      累涨：37.71     13.05     8.82      15.84     10日：7.22      2.17      11        累涨修正：73.85     24
//        KEJI_NEW_CAR.put("159872", "科技-汽车             ");//智能网联汽车ETF       市值：0.50      累涨：33.03     10.10     7.02      15.91     10日：6.66      3.20      32        累涨修正：72.94     25
//        KEJI_NEW_CAR.put("159889", "科技-汽车             ");//智能汽车ETF           市值：0.48      累涨：37.96     11.35     10.37     16.24     10日：5.67      2.95      14        累涨修正：72.51     26
//        KEJI_NEW_CAR.put("159796", "科技-汽车             ");//电池50ETF             市值：9.73      累涨：36.07     12.34     8.29      15.44     10日：7.51      2.12      28        累涨修正：71.96     27
//        KEJI_NEW_CAR.put("159305", "科技-汽车             ");//储能电池50ETF         市值：0.42      累涨：35.40     11.63     8.37      15.40     10日：6.77      2.00      36        累涨修正：69.75     28
//        KEJI_NEW_CAR.put("515250", "科技-汽车             ");//智能汽车ETF           市值：7.34      累涨：38.10     12.40     9.94      15.76     10日：5.53      2.51      16        累涨修正：68.65     29
//        KEJI_NEW_CAR.put("159888", "科技-汽车             ");//智能车ETF             市值：0.83      累涨：36.65     11.56     9.56      15.53     10日：5.35      2.54      30        累涨修正：67.31     30
//        KEJI_NEW_CAR.put("516520", "科技-汽车             ");//智能驾驶ETF           市值：3.39      累涨：37.83     12.50     9.80      15.53     10日：5.09      2.45      26        累涨修正：66.98     31
//        KEJI_NEW_CAR.put("159565", "科技-汽车             ");//汽车零部件ETF         市值：0.88      累涨：41.31     12.98     8.79      19.54     10日：5.78      2.36      9         累涨修正：65.67     32
//        KEJI_NEW_CAR.put("159795", "科技-汽车             ");//智能汽车ETF基金       市值：0.42      累涨：37.16     12.08     9.66      15.42     10日：5.06      2.43      34        累涨修正：65.47     33
//        KEJI_NEW_CAR.put("562700", "科技-汽车             ");//汽车零部件ETF         市值：0.36      累涨：39.85     12.94     8.37      18.54     10日：5.54      2.28      15        累涨修正：63.06     34
//        KEJI_NEW_CAR.put("159306", "科技-汽车             ");//汽车零件ETF           市值：0.23      累涨：39.35     12.32     8.75      18.28     10日：5.63      2.05      20        累涨修正：61.89     35
//        KEJI_NEW_CAR.put("562260", "科技-汽车             ");//汽车配件ETF           市值：0.12      累涨：38.91     12.03     8.39      18.49     10日：5.55      1.97      29        累涨修正：59.78     36
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_TONG_XIN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_NEW_CAR);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }

    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }

    /**
     * ETF涨幅数据：查询数据根据名称列表模糊查询
     */
    private static void findByTypeName(String date, List nameLikeList, List nameNoLikeList, String typeEn, String typeCn, Map<String, String> typeMap) {
//        String typeEn = "";
//        String typeCn = "";
        CondEtfAdrCount condition = new CondEtfAdrCount();
        condition.setDate(date);
        condition.setOrderBy(ADR_UP_SUM_1_60_DESC);

        // 科技
        {
            //        condition.setLikeNameList(ContEtfNameKey.ETF_NAME_NAME_LIST_LIKE_CN_HK);//港股指数
//        condition.setLikeNameList(ContEtfNameKey.ETF_NAME_NAME_LIST_LIKE_KEJI_XIN_PIAN);//科技-芯片
//        condition.setLikeNameList(ContEtfNameKey.ETF_NAME_NAME_LIST_LIKE_XIAO_FEI_HK);//
//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT_NSDK);
//        condition.setLikeNameList(ContEtfNameKey.KEJI_ELECTRICITY);

//            condition.setLikeNameList(ContEtfNameKey.KEJI_RUAN_JIAN);//科技-软件
//            typeEn = "KEJI_RUAN_JIAN";
//            typeCn = ContEtfTypeName.KEJI_RUAN_JIAN;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_GONG_YE);
//        condition.setNotLikeNameList(ContEtfNameKey.KEJI_GONG_YE_NOLIKE);
//        typeEn = "KEJI_GONG_YE";
//        typeCn = ContEtfTypeName.KEJI_GONG_YE;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_TONG_XIN);
//        condition.setNotLikeNameList(ContEtfNameKey.KEJI_GONG_YE_NOLIKE);
//        typeEn = "KEJI_TONG_XIN";
//        typeCn = ContEtfTypeName.KEJI_TONG_XIN;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_NEW_CAR);
//        typeEn = "KEJI_NEW_CAR";
//        typeCn = ContEtfTypeName.KEJI_NEW_CAR;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_NEW_ENERGY);
//        typeEn = "KEJI_NEW_ENERGY";
//        typeCn = ContEtfTypeName.KEJI_NEW_ENERGY;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_HK);
//        typeEn = "KEJI_HK";
//        typeCn = ContEtfTypeName.KEJI_HK;
        }
        // 消费
        {
            //        condition.setLikeNameList(XIAOFEI_HK);

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_WINE);
//        typeEn = "XIAOFEI_WINE";
//        typeCn = ContEtfTypeName.XIAOFEI_WINE;

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_COMMON);
//        condition.setNotLikeNameList(ContEtfNameKey.XIAOFEI_COMMON_NOLIKE);
//        typeEn = "XIAOFEI_COMMON";
//        typeCn = ContEtfTypeName.XIAOFEI_COMMON;

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_MEDIA);
//        typeEn = "XIAOFEI_MEDIA";
//        typeCn = ContEtfTypeName.XIAOFEI_MEDIA;
        }
        // 金融
        {
            //        condition.setNotLikeNameList(JINRONG);
//        condition.setLikeNameList(JINRONG_BANK);
//        condition.setLikeNameList(JINRONG_FANGDICHAN);
//        condition.setLikeNameList(ContEtfNameKey.JINRONG_ZHENGQUAN);
//        condition.setNotLikeNameList(ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE);
//        typeEn = "JINRONG_ZHENGQUAN";
//        typeCn = ContEtfTypeName.JINRONG_ZHENGQUAN;

//            condition.setLikeNameList(ContEtfNameKey.JINRONG_CASH);
//            typeEn = "JINRONG_CASH";
//            typeCn = ContEtfTypeName.JINRONG_CASH;

//        condition.setLikeNameList(JINRONG_COMMON);
//        condition.setLikeNameList(ContEtfNameKey.JINRONG_GOLD);
//        condition.setNotLikeNameList(ContEtfNameKey.JINRONG_GOLD_NOLIKE);

//        typeEn = "JINRONG_GOLD";
//        typeCn = ContEtfTypeName.JINRONG_GOLD;
//        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
        }
        // 医疗
        {
            //
//            condition.setLikeNameList(ContEtfNameKey.YILIAO_COMMON);
//            typeEn = "YILIAO_COMMON";
//            typeCn = ContEtfTypeName.YILIAO_COMMON;
        }


        //指数
        {
            //        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT_USA);
//        typeEn = "INDEX_CN_NOT_USA";
//        typeCn = ContEtfTypeName.INDEX_CN_NOT_USA;

//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT);
//        typeEn = "INDEX_CN_NOT";
//        typeCn = ContEtfTypeName.INDEX_CN_NOT;

//            condition.setLikeNameList(ContEtfNameKey.INDEX_CN_BIG);
//            condition.setNotLikeNameList(ContEtfNameKey.INDEX_CN_BIG_NOLIKE);
//            typeEn = "INDEX_CN_BIG";
//            typeCn = ContEtfTypeName.INDEX_CN_BIG;

//        condition.setLikeNameList(ContEtfNameKey.INDEX_HK);
//        typeEn = "INDEX_HK";
//        typeCn = ContEtfTypeName.INDEX_HK;

//        condition.setLikeNameList(INDEX_300);
//        condition.setNotLikeNameList(INDEX_300_NOLIKE);

//            condition.setLikeNameList(ContEtfNameKey.INDEX_688);
//            condition.setNotLikeNameList(ContEtfNameKey.INDEX_688_NOLIKE);
//            typeEn = "INDEX_688";
//            typeCn = ContEtfTypeName.INDEX_688;

//        condition.setLikeNameList(INDEX_CN_1000);
//        condition.setNotLikeNameList(INDEX_CN_NOT);

//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_CITY);
//        typeEn = "INDEX_CN_CITY";
//        typeCn = ContEtfTypeName.INDEX_CN_CITY;

//        condition.setLikeNameList(ZIYUAN_NONGYE);
//        condition.setLikeNameList(ZIYUAN_CAILIAO);
//        condition.setLikeNameList(ContEtfNameKey.ZIYUAN_XIYOU);
//        typeEn = "ZIYUAN_XIYOU";
//        typeCn = ContEtfTypeName.ZIYUAN_XIYOU;

//        condition.setLikeNameList(ContEtfNameKey.ZIYUAN_COMMON);
//        condition.setNotLikeNameList(ContEtfNameKey.ZIYUAN_COMMON_NOLIKE);
//        typeEn = "ZIYUAN_COMMON";
//        typeCn = ContEtfTypeName.ZIYUAN_COMMON;
        }

        //资源
        {

            condition.setLikeNameList(nameLikeList);
            condition.setNotLikeNameList(nameNoLikeList);
//        typeEn = "ZIYUAN_COMMON";
//        typeCn = ContEtfTypeName.ZIYUAN_COMMON;
        }

//
        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
//        EtfControl.saveOrUpdateListNetLastDay(condition, date, true);//保存或更新ETF涨幅次数-批量更新基础信息

        if (etfListLikeName == null) {
            System.out.println("数据为null");
        }
        int num = 0;//序号
//        //计算涨幅合计修正值：最近60日+最近5日乘12
//        for (EtfAdrCountVo vo : etfListLikeName) {
//            BigDecimal adr_up_sum_1_10 = vo.getADR_UP_SUM_1_10();
//            BigDecimal adr_up_sum_1_60 = vo.getADR_UP_SUM_1_60();
//            BigDecimal day10 = new BigDecimal("0");
//            BigDecimal day60 = new BigDecimal("0");
//            if (adr_up_sum_1_10 != null) {
//                day10 = adr_up_sum_1_10.setScale(2, BigDecimal.ROUND_HALF_UP);
//            }
//            if (adr_up_sum_1_60 != null) {
//                day60 = adr_up_sum_1_60.setScale(2, BigDecimal.ROUND_HALF_UP);
//            }
//            BigDecimal day60and10Cheng6 = day60.add(day10.multiply(new BigDecimal("6")));
//            vo.setAdrUpSum_60_and_10c6(day60and10Cheng6);
//        }
//        //排序
//        etfListLikeName = etfListLikeName.stream().filter(e -> e != null).sorted(Comparator.comparing(EtfAdrCountVo::getAdrUpSum_60_and_10c6, Comparator.nullsFirst(BigDecimal::compareTo)).reversed()).collect(Collectors.toList());

        etfListLikeName = etfListLikeName.stream().filter(e -> e != null).sorted(Comparator.comparing(EtfAdrCountVo::getADR_UP_SUM_TOTAL, Comparator.nullsFirst(BigDecimal::compareTo)).reversed()).collect(Collectors.toList());

        System.out.println("    static {");
        for (EtfAdrCountVo vo : etfListLikeName) {
            StringBuffer sb = new StringBuffer();

            sb.append(typeEn + ".put(\"").append(StockUtil.formatStName(vo.getF12(), SIZE_6)).append("\"");
            sb.append(", \"" + StockUtil.formatStName(typeCn, SIZE_22) + "\");");
//            sb.append(", \"" + StockUtil.formatStName(vo.getF14(), SIZE_22) + "\");");
            sb.append("//");
            sb.append(StockUtil.formatStName(vo.getF14(), SIZE_22));
            sb.append(StockUtil.formatStName("市值：", SIZE_6));
            BigDecimal marketValue = null;
            if (vo.getF20() != null) {
                marketValue = vo.getF20().divide(NUM_YI_1, 2, BigDecimal.ROUND_HALF_UP);
            }
            sb.append(StockUtil.formatDouble(marketValue, SIZE_10));
            sb.append(StockUtil.formatStName("累涨：", SIZE_6));
            if (vo.getADR_UP_SUM_1_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_40_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_40_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_20_40() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_20_40().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_20() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_20().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatStName("10日：", SIZE_6));
            if (vo.getADR_UP_SUM_1_10() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_10().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_5() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_5().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_ORDER_STAT(), SIZE_10));
            sb.append(StockUtil.formatStName("累涨修正：", SIZE_10));
//            sb.append(StockUtil.formatDouble(vo.getAdrUpSum_60_and_10c6(), SIZE_10));
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_TOTAL(), SIZE_10));

            sb.append(StockUtil.formatInt(++num, SIZE_6));


            System.out.println(sb);
        }
        System.out.println("    }");


    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
//        String date = "2025-05-22";
//        findByTypeName(date,ContEtfNameKey.ZIYUAN_OIL,null,"ZIYUAN_OIL",ContEtfTypeName.ZIYUAN_OIL, ContMapEtfSimple.ZIYUAN_OIL);//资源-石油
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_NONGYE, null, "ZIYUAN_NONGYE", ContEtfTypeName.ZIYUAN_NONGYE, ContMapEtfSimple.ZIYUAN_NONGYE);
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_XIYOU, null, "ZIYUAN_XIYOU", ContEtfTypeName.ZIYUAN_XIYOU, ContMapEtfSimple.ZIYUAN_XIYOU);
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_COMMON, ContEtfNameKey.ZIYUAN_COMMON_NOLIKE, "ZIYUAN_COMMON", ContEtfTypeName.ZIYUAN_COMMON, ContMapEtfSimple.ZIYUAN_COMMON);

//        findByTypeName(date, ContEtfNameKey.XIAOFEI_COMMON, ContEtfNameKey.XIAOFEI_COMMON_NOLIKE, "XIAOFEI_COMMON", ContEtfTypeName.XIAOFEI_COMMON, ContMapEtfSimple.XIAOFEI_COMMON);
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_HK, null, "XIAOFEI_HK", ContEtfTypeName.XIAOFEI_HK, ContMapEtfSimple.XIAOFEI_HK);
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_MEDIA, null, "XIAOFEI_MEDIA", ContEtfTypeName.XIAOFEI_MEDIA, ContMapEtfSimple.XIAOFEI_MEDIA);
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_WINE, null, "XIAOFEI_WINE", ContEtfTypeName.XIAOFEI_WINE, ContMapEtfSimple.XIAOFEI_WINE);

//        findByTypeName(date, ContEtfNameKey.YILIAO_COMMON, null, "YILIAO_COMMON", ContEtfTypeName.YILIAO_COMMON, ContMapEtfSimple.YILIAO_COMMON);

//        findByTypeName(date, ContEtfNameKey.KEJI_JUNGONG, null, "KEJI_JUNGONG", ContEtfTypeName.KEJI_JUNGONG, ContMapEtfSimple.KEJI_JUNGONG);
//        findByTypeName(date, ContEtfNameKey.KEJI_GONG_YE, ContEtfNameKey.KEJI_GONG_YE_NOLIKE, "KEJI_GONG_YE", ContEtfTypeName.KEJI_GONG_YE, ContMapEtfSimple.KEJI_GONG_YE);
//        findByTypeName(date, ContEtfNameKey.KEJI_RUAN_JIAN, null, "KEJI_RUAN_JIAN", ContEtfTypeName.KEJI_RUAN_JIAN, ContMapEtfSimple.KEJI_RUAN_JIAN);
//        findByTypeName(date, ContEtfNameKey.KEJI_XIN_PIAN, null, "KEJI_XIN_PIAN", ContEtfTypeName.KEJI_XIN_PIAN, ContMapEtfSimple.KEJI_XIN_PIAN);
//        findByTypeName(date, ContEtfNameKey.KEJI_TONG_XIN, null, "KEJI_TONG_XIN", ContEtfTypeName.KEJI_TONG_XIN, ContMapEtfSimple.KEJI_TONG_XIN);
//        findByTypeName(date, ContEtfNameKey.KEJI_HK, null, "KEJI_HK", ContEtfTypeName.KEJI_HK, ContMapEtfSimple.KEJI_HK);
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_ENERGY, null, "KEJI_NEW_ENERGY", ContEtfTypeName.KEJI_NEW_ENERGY, ContMapEtfSimple.KEJI_NEW_ENERGY);
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_CAR, null, "KEJI_NEW_CAR", ContEtfTypeName.KEJI_NEW_CAR, ContMapEtfSimple.KEJI_NEW_CAR);

//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT, null, "INDEX_CN_NOT", ContEtfTypeName.INDEX_CN_NOT, ContMapEtfSimple.INDEX_CN_NOT);
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT_USA, null, "INDEX_CN_NOT_USA", ContEtfTypeName.INDEX_CN_NOT_USA, ContMapEtfSimple.INDEX_CN_NOT_USA);
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_1000, null, "INDEX_CN_1000", ContEtfTypeName.INDEX_CN_1000, ContMapEtfSimple.INDEX_CN_1000);
//        findByTypeName(date, ContEtfNameKey.INDEX_300, ContEtfNameKey.INDEX_300_NOLIKE, "INDEX_300", ContEtfTypeName.INDEX_300, ContMapEtfSimple.INDEX_300);
//        findByTypeName(date, ContEtfNameKey.INDEX_688, ContEtfNameKey.INDEX_688_NOLIKE, "INDEX_688", ContEtfTypeName.INDEX_688, ContMapEtfSimple.INDEX_688);
//        findByTypeName(date, ContEtfNameKey.INDEX_HK,  ContEtfNameKey.INDEX_HK_NOLIKE, "INDEX_HK", ContEtfTypeName.INDEX_HK, ContMapEtfSimple.INDEX_HK);
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_BIG,  ContEtfNameKey.INDEX_CN_BIG_NOLIKE, "INDEX_CN_BIG", ContEtfTypeName.INDEX_CN_BIG, ContMapEtfSimple.INDEX_CN_BIG);
//        public static String INDEX_CN_CITY = "指数-国内城市";
//        findByTypeName(date, ContEtfNameKey.JINRONG_GOLD,  ContEtfNameKey.JINRONG_GOLD_NOLIKE, "JINRONG_GOLD", ContEtfTypeName.JINRONG_GOLD, ContMapEtfSimple.JINRONG_GOLD);
//        findByTypeName(date, ContEtfNameKey.JINRONG_BANK,  null, "JINRONG_BANK", ContEtfTypeName.JINRONG_BANK, ContMapEtfSimple.JINRONG_BANK);
//        findByTypeName(date, ContEtfNameKey.JINRONG_ZHENGQUAN,  ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE, "JINRONG_ZHENGQUAN", ContEtfTypeName.JINRONG_ZHENGQUAN, ContMapEtfSimple.JINRONG_ZHENGQUAN);
//        findByTypeName(date, ContEtfNameKey.JINRONG_FANGDICHAN,  null, "JINRONG_FANGDICHAN", ContEtfTypeName.JINRONG_FANGDICHAN, ContMapEtfSimple.JINRONG_FANGDICHAN);

        //  TODO etf集合简单头部数据
        List<String> zqdmList = new ArrayList<>(ContMapEtfSimple.BIZ_ALL.keySet());
        int count = 0;
        for (String zqdm : zqdmList) {
            System.out.println(++count + ":" + zqdm);
        }

    }
}
