package utils;

import ttjj.rank.stat.BizEtfStat;

import java.util.HashMap;
import java.util.Map;

/**
 * ETF
 *
 * @author Administrator
 * @date 2022-08-07 00:01
 */
public class ContMapEtf {
    /**
     * etf-市值-指数-A50
     */
    public static Map<String, String> ETF_MV_ZS_A50 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZZ100 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_HS300 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZZ500 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_KCB = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_CYB = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZS180 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_HG = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_MG = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_ZS1000 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_SZ100 = new HashMap<>();
    public static Map<String, String> ETF_MV_ZS_SC = new HashMap<>();

    static {
        ETF_MV_ZS_A50.put("510050", "上证50ETF");//上证50ETF
    }

    static {
        ETF_MV_ZS_ZZ100.put("562000", "华宝中证100ETF");//华宝中证100ETF
    }

    static {
        ETF_MV_ZS_ZS180.put("510180", "上证180ETF");//上证180ETF
    }

    static {
        ETF_MV_ZS_HS300.put("510300", "沪深300ETF");//沪深300ETF
//        ETF_MV_ZS_HS300.put("510330", "209.41");//300ETF基金
//        ETF_MV_ZS_HS300.put("159919", "181.46");//沪深300ETF
//        ETF_MV_ZS_HS300.put("510310", "107.57");//沪深300ETF易方达
//        ETF_MV_ZS_HS300.put("515330", "63.93");//300ETF天弘
//        ETF_MV_ZS_HS300.put("515380", "37.87");//泰康沪深300ETF
//        ETF_MV_ZS_HS300.put("510350", "28.41");//工银沪深300ETF
//        ETF_MV_ZS_HS300.put("517300", "22.03");//沪港深300ETF
//        ETF_MV_ZS_HS300.put("159925", "16.93");//沪深300ETF南方
//        ETF_MV_ZS_HS300.put("510360", "15.56");//沪深300ETF基金
//        ETF_MV_ZS_HS300.put("561300", "13.28");//300增强ETF
//        ETF_MV_ZS_HS300.put("510380", "12.34");//国寿300ETF
    }

    static {
        ETF_MV_ZS_ZZ500.put("510500", "中证500ETF");//中证500ETF
//        ETF_MV_ZS_ZZ500.put("512500", "38.78");//500ETF基金
//        ETF_MV_ZS_ZZ500.put("159922", "30.08");//中证500ETF嘉实
//        ETF_MV_ZS_ZZ500.put("510510", "26.55");//中证500ETF基金
//        ETF_MV_ZS_ZZ500.put("159820", "23.91");//中证500ETF天弘
//        ETF_MV_ZS_ZZ500.put("510580", "20.17");//中证500ETF易方达
    }

    static {
        ETF_MV_ZS_ZS1000.put("512100", "中证1000ETF");//中证1000ETF
//        ETF_MV_ZS_ZS1000.put("560010", "87.90");//中证1000ETF指数
//        ETF_MV_ZS_ZS1000.put("159629", "80.96");//1000ETF
//        ETF_MV_ZS_ZS1000.put("159633", "79.32");//中证1000指数ETF
//        ETF_MV_ZS_ZS1000.put("159845", "52.41");//中证1000ETF
//        ETF_MV_ZS_ZS1000.put("515800", "19.78");//800ETF
    }

    static {
        ETF_MV_ZS_KCB.put("588000", "科创50ETF");//科创50ETF
//        ETF_MV_ZS_KCB.put("588080", "134.19");//科创板50ETF
//        ETF_MV_ZS_KCB.put("588050", "47.76");//科创ETF
//        ETF_MV_ZS_KCB.put("588090", "32.56");//科创板ETF
//        ETF_MV_ZS_KCB.put("588180", "16.46");//科创50ETF基金
    }

    static {
        ETF_MV_ZS_CYB.put("159949", "创业板50ETF");//创业板50ETF
//        ETF_MV_ZS_CYB.put("159915", "149.28");//创业板ETF易方达
//        ETF_MV_ZS_CYB.put("159977", "46.14");//创业板ETF天弘
//        ETF_MV_ZS_CYB.put("159948", "22.07");//创业板ETF南方
//        ETF_MV_ZS_CYB.put("588380", "19.12");//创50ETF
//        ETF_MV.put("159952", "18.22");//创业板ETF广发
    }

    static {
        ETF_MV_ZS_SC.put("159781", "双创50ETF");//双创50ETF
//        ETF_MV_ZS_SC.put("159783", "45.56");//双创基金ETF
//        ETF_MV_ZS_SC.put("159780", "32.18");//双创ETF
//        ETF_MV_ZS_SC.put("588400", "18.82");//双创50ETF
//        ETF_MV_ZS_SC.put("588300", "15.63");//双创ETF
    }


    static {
        ETF_MV_ZS_HG.put("159920", "恒生ETF");//恒生ETF
//        ETF_MV_ZS_HG.put("510900", "89.48");//H股ETF
    }

    static {
        ETF_MV_ZS_MG.put("159941", "纳指ETF");//纳指ETF
//        ETF_MV_ZS_MG.put("513500", "74.38");//标普500ETF
//        ETF_MV_ZS_MG.put("513100", "52.02");//纳指ETF
//        ETF_MV_ZS_MG.put("513300", "12.09");//纳斯达克ETF
    }


    static {
        ETF_MV_ZS_SZ100.put("159901", "深证100ETF易方达");//深证100ETF易方达
    }

    /**
     * etf-市值-指数
     */
    public static Map<String, String> ETF_ZS = new HashMap<>();

    static {
        ETF_ZS.put("512100", "中证1000ETF");        //103.53	0.19
        ETF_ZS.put("510500", "中证500ETF");        //375.91	0.17
//        ETF_ZS.put("159901", "深证100ETF易方达");		//65.12	-0.12
        ETF_ZS.put("510300", "沪深300ETF");        //434.68	-0.24
        ETF_ZS.put("510050", "上证50ETF");        //492.63	-0.5
        ETF_ZS.put("159949", "创业板50ETF");        //89.61	-0.51
        ETF_ZS.put("159920", "恒生ETF");        //136.84	-0.54
        ETF_ZS.put("159941", "纳指ETF");        //120.13	-0.72
//        ETF_ZS.put("513500", "标普500ETF");		//74.86	-0.38
//        ETF_ZS.put("159781", "双创50ETF");		//63.51	-0.74
        ETF_ZS.put("588000", "科创50ETF");        //305.66	-1.23
//        ETF_ZS.put("562000", "华宝中证100ETF");		//5.05	-0.41
//        ETF_ZS.put("510180", "上证180ETF");		//199.61	-0.36

//        ETF_ZS.putAll(ETF_MV_ZS_A50);
//        ETF_ZS.putAll(ETF_MV_ZS_ZZ100);
//        ETF_ZS.putAll(ETF_MV_ZS_HS300);
//        ETF_ZS.putAll(ETF_MV_ZS_ZZ500);
//        ETF_ZS.putAll(ETF_MV_ZS_KCB);
//        ETF_ZS.putAll(ETF_MV_ZS_CYB);
//        ETF_ZS.putAll(ETF_MV_ZS_ZS180);
//        ETF_ZS.putAll(ETF_MV_ZS_HG);
//        ETF_ZS.putAll(ETF_MV_ZS_MG);
//        ETF_ZS.putAll(ETF_MV_ZS_ZS1000);
//        ETF_ZS.putAll(ETF_MV_ZS_SZ100);
//        ETF_ZS.putAll(ETF_MV_ZS_SC);
    }

    public static Map<String, String> INDEX_MORE_NOT_CN = new HashMap<>();//指数-较多-非中国

    static {


//        INDEX_MORE_NOT_CN.put("159561", "德国ETF               ");//    市值：6.01      累涨：83.97     9.65      57.41     17.00     8.81      2.98
        INDEX_MORE_NOT_CN.put("513030", "德国ETF               ");//    市值：12.26     累涨：57.09     9.56      30.59     18.21     11.96     3.20

        INDEX_MORE_NOT_CN.put("159660", "纳指100ETF            ");//    市值：22.78     累涨：31.80     18.72     9.58      3.50      1.09      0.24
//        INDEX_MORE_NOT_CN.put("159509", "纳指科技ETF           ");//    市值：94.34     累涨：31.37     16.64     10.25     5.64      3.20      0.78
//        INDEX_MORE_NOT_CN.put("159659", "纳斯达克100ETF        ");//    市值：48.54     累涨：30.68     16.52     11.28     3.84      0.98      0.18
//        INDEX_MORE_NOT_CN.put("513390", "纳指100ETF            ");//    市值：17.63     累涨：30.63     15.90     13.95     2.29      1.09
//        INDEX_MORE_NOT_CN.put("513110", "纳斯达克100ETF        ");//    市值：34.82     累涨：30.09     16.21     11.04     3.69      1.30      0.39
//        INDEX_MORE_NOT_CN.put("159632", "纳斯达克ETF           ");//    市值：98.74     累涨：29.84     18.24     10.03     3.03      1.08      0.06
//        INDEX_MORE_NOT_CN.put("513870", "纳指ETF富国           ");//    市值：16.11     累涨：29.64     15.47     10.93     4.15      1.25      0.34
//        INDEX_MORE_NOT_CN.put("159696", "纳指ETF易方达         ");//    市值：21.27     累涨：28.79     15.99     10.07     3.58      0.95      0.21
//        INDEX_MORE_NOT_CN.put("159513", "纳斯达克100指数ETF    ");//    市值：57.72     累涨：28.73     15.17     10.01     4.92      1.48      0.38
//        INDEX_MORE_NOT_CN.put("159941", "纳指ETF               ");//    市值：244.51    累涨：28.46     15.36     9.89      3.53      1.25      0.60
//        INDEX_MORE_NOT_CN.put("513300", "纳斯达克ETF           ");//    市值：59.29     累涨：28.45     16.76     8.51      3.37      1.27      0.45
//        INDEX_MORE_NOT_CN.put("513100", "纳指ETF               ");//    市值：146.48    累涨：27.45     15.39     8.63      3.91      1.50      0.64
//        INDEX_MORE_NOT_CN.put("159501", "纳斯达克指数ETF       ");//    市值：71.53     累涨：27.40     15.66     9.12      3.53      1.00      0.14
//        INDEX_MORE_NOT_CN.put("513290", "纳指生物科技ETF       ");//    市值：14.76     累涨：26.94     7.38      11.60     8.55      1.58

        INDEX_MORE_NOT_CN.put("159529", "标普消费ETF           ");//    市值：6.10      累涨：97.39     33.71     45.09     19.94     2.68
        INDEX_MORE_NOT_CN.put("513350", "标普油气ETF           ");//    市值：2.96      累涨：60.42     8.86      35.50     16.68     4.08
//        INDEX_MORE_NOT_CN.put("159518", "标普油气ETF           ");//    市值：5.59      累涨：49.11     10.04     29.67     9.51      1.74
        INDEX_MORE_NOT_CN.put("159612", "标普500ETF            ");//    市值：5.84      累涨：29.30     10.33     16.14     2.83      0.57
//        INDEX_MORE_NOT_CN.put("159502", "标普生物科技ETF       ");//    市值：10.99     累涨：28.10     10.46     13.25     5.98      1.41
//        INDEX_MORE_NOT_CN.put("159655", "标普ETF               ");//    市值：14.80     累涨：26.10     6.00      17.59     6.33      0.54
//        INDEX_MORE_NOT_CN.put("562060", "标普红利ETF           ");//    市值：15.04     累涨：17.46     6.33      6.59      5.39      2.08
//        INDEX_MORE_NOT_CN.put("513500", "标普500ETF            ");//    市值：168.57    累涨：16.74     8.48      7.39      1.42      0.69
//        INDEX_MORE_NOT_CN.put("513650", "标普500ETF南方        ");//    市值：40.53     累涨：16.66     7.69      7.49      1.97      0.62

        INDEX_MORE_NOT_CN.put("513400", "道琼斯ETF             ");//    市值：20.13     累涨：19.78     7.74      8.96      3.76      1.13      0.44

        INDEX_MORE_NOT_CN.put("159687", "亚太精选ETF           ");//    市值：5.40      累涨：65.67     7.64      41.95     16.47     7.91
//        INDEX_MORE_NOT_CN.put("513730", "东南亚科技ETF         ");//    市值：22.82     累涨：20.94     8.17      6.95      5.82      3.18
//        INDEX_MORE_NOT_CN.put("520580", "新兴亚洲ETF           ");//    市值：7.24      累涨：0.10                          0.10      0.10

        INDEX_MORE_NOT_CN.put("159329", "沙特ETF               ");//    市值：5.94      累涨：60.40     6.91      40.57     12.92     5.86
//        INDEX_MORE_NOT_CN.put("520830", "沙特ETF               ");//    市值：5.58      累涨：52.90     6.46      33.62     16.05     4.71

        INDEX_MORE_NOT_CN.put("513080", "法国CAC40ETF          ");//    市值：8.80      累涨：44.56     7.90      25.53     11.74     6.29

        INDEX_MORE_NOT_CN.put("159866", "日经ETF               ");//    市值：6.50      累涨：35.66     9.88      19.39     7.43      3.17
//        INDEX_MORE_NOT_CN.put("513000", "日经225ETF易方达      ");//    市值：10.73     累涨：29.20     9.71      16.69     3.86      1.80
//        INDEX_MORE_NOT_CN.put("513520", "日经ETF               ");//    市值：11.11     累涨：28.85     9.90      15.85     3.73      1.09
//        INDEX_MORE_NOT_CN.put("513800", "日本东证指数ETF       ");//    市值：8.21      累涨：23.33     8.47      9.81      6.08      2.78
//        INDEX_MORE_NOT_CN.put("513880", "日经225ETF            ");//    市值：14.04     累涨：22.23     9.00      10.19     3.49      1.49


    }

    public static Map<String, String> INDEX_MORE_CN = new HashMap<>();//指数-较多-中国

    static {
//        INDEX_MORE_CN.put("510900", "H股ETF          ");//24   510900  H股ETF          -20.95%   75.26         2022-07-25    2022-10-25
//        INDEX_MORE_CN.put("159920", "恒生ETF         ");//25   159920  恒生ETF         -21.45%   151.72        2022-07-25    2022-10-25
        INDEX_MORE_CN.put("513560", "香港科技ETF           ");//    市值：5.96      累涨：74.79     11.10     22.59     46.92     14.09     1

        INDEX_MORE_CN.put("159573", "创业板200ETF华夏      ");//    市值：2.46      累涨：56.30     16.12     15.51     24.67     10.29     1
        INDEX_MORE_CN.put("588110", "科创成长ETF           ");//    市值：2.33      累涨：51.92     15.96     15.07     20.89     12.11     1
        INDEX_MORE_CN.put("159555", "2000增强ETF           ");//    市值：0.49      累涨：49.47     17.33     14.03     19.00     7.25      1
        INDEX_MORE_CN.put("562520", "中证1000成长ETF       ");//    市值：0.57      累涨：44.33     15.75     12.91     15.67     8.69      1
        INDEX_MORE_CN.put("159922", "中证500ETF            ");//    市值：117.35    累涨：33.23     12.61     7.96      12.83     5.29      1
        INDEX_MORE_CN.put("159523", "沪深300成长ETF        ");//    市值：0.65      累涨：25.28     8.62      7.45      9.21      4.31      2
        INDEX_MORE_CN.put("563280", "A50增强ETF            ");//    市值：0.12      累涨：25.15     9.31      7.90      7.94      3.00      1
        INDEX_MORE_CN.put("510760", "上证综指ETF           ");//    市值：25.19     累涨：20.29     7.69      5.99      6.80      3.12      1

//        INDEX_MORE_CN.put("510760", "上证综指ETF           ");//    市值：25.19     累涨：20.29     7.69      5.99      6.80      3.12      1
//        INDEX_MORE_CN.put("510210", "上证指数ETF           ");//    市值：54.83     累涨：20.21     7.48      5.88      7.22      2.70      2
//        INDEX_MORE_CN.put("510980", "上证综合ETF           ");//    市值：3.74      累涨：19.41     7.93      5.96      6.05      2.29      3
//        INDEX_MORE_CN.put("510130", "上证中盘ETF易方达     ");//    市值：2.38      累涨：18.97     7.81      5.61      5.55      2.41      4

//        INDEX_MORE_CN.put("563280", "A50增强ETF            ");//    市值：0.12      累涨：25.15     9.31      7.90      7.94      3.00      1
//        INDEX_MORE_CN.put("563090", "上证50增强ETF易方达   ");//    市值：0.64      累涨：22.95     9.29      5.61      8.05      2.86      2
//        INDEX_MORE_CN.put("159602", "中国A50ETF            ");//    市值：11.70     累涨：22.81     9.09      5.50      8.22      3.06      3
//        INDEX_MORE_CN.put("563000", "中国A50ETF            ");//    市值：43.61     累涨：22.45     8.88      5.63      7.94      2.76      4
//        INDEX_MORE_CN.put("159601", "A50ETF                ");//    市值：36.39     累涨：22.07     9.25      5.13      7.69      2.76      5
//        INDEX_MORE_CN.put("560050", "MSCI中国A50ETF        ");//    市值：49.89     累涨：22.05     9.42      5.03      7.60      2.53      6
//        INDEX_MORE_CN.put("159595", "中证A50ETF基金        ");//    市值：70.09     累涨：21.82     8.26      5.70      7.86      3.05      7
//        INDEX_MORE_CN.put("159593", "中证A50指数ETF        ");//    市值：82.32     累涨：21.73     8.35      5.79      7.59      2.88      8
//        INDEX_MORE_CN.put("159596", "A50ETF华宝            ");//    市值：12.33     累涨：21.66     7.72      6.00      7.94      2.97      9
//        INDEX_MORE_CN.put("563080", "中证A50ETF易方达      ");//    市值：51.81     累涨：21.63     8.16      5.70      7.77      3.06      10
//        INDEX_MORE_CN.put("530000", "上证50ETF天弘         ");//    市值：19.89     累涨：21.58     8.46      5.17      8.04      3.69      11
//        INDEX_MORE_CN.put("562890", "中证A50指数ETF        ");//    市值：4.26      累涨：21.42     7.86      5.74      7.82      3.07      12
//        INDEX_MORE_CN.put("159591", "中证A50ETF            ");//    市值：13.67     累涨：21.36     7.60      5.94      7.82      3.07      13
//        INDEX_MORE_CN.put("159592", "A50ETF基金            ");//    市值：26.16     累涨：21.26     8.20      5.44      7.62      2.92      14
//        INDEX_MORE_CN.put("563350", "中证A50ETF            ");//    市值：10.58     累涨：21.24     8.02      5.76      7.46      2.86      15
//        INDEX_MORE_CN.put("512550", "A50ETF基金            ");//    市值：4.27      累涨：21.03     9.01      4.63      7.45      2.92      16
//        INDEX_MORE_CN.put("560350", "中证A50ETF指数基金    ");//    市值：35.17     累涨：20.95     7.74      5.59      7.62      2.87      17
//        INDEX_MORE_CN.put("561230", "中证A50ETF基金        ");//    市值：23.58     累涨：20.92     7.99      5.08      7.85      3.12      18
//        INDEX_MORE_CN.put("510600", "申万上证50ETF         ");//    市值：0.51      累涨：20.81     7.99      5.19      7.72      3.53      19
//        INDEX_MORE_CN.put("510850", "上证50ETF工银         ");//    市值：2.39      累涨：20.79     8.06      5.34      7.39      3.22      20
//        INDEX_MORE_CN.put("510710", "上证50ETF博时         ");//    市值：6.35      累涨：20.43     7.92      5.59      7.37      2.99      21
//        INDEX_MORE_CN.put("510050", "上证50ETF             ");//    市值：1421.17   累涨：20.33     8.31      4.82      7.39      3.02      22
//        INDEX_MORE_CN.put("510950", "上证50ETF指数         ");//    市值：1.01      累涨：20.17     7.67      5.33      7.64      3.09      23
//        INDEX_MORE_CN.put("510100", "上证50ETF易方达       ");//    市值：38.13     累涨：19.95     8.14      4.67      7.14      2.96      24
//        INDEX_MORE_CN.put("510680", "上证50ETF基金         ");//    市值：1.29      累涨：19.71     8.25      4.66      6.80      2.73      25
//        INDEX_MORE_CN.put("512150", "A50ETF                ");//    市值：1.45      累涨：19.67     8.65      4.51      6.51      2.16      26
//        INDEX_MORE_CN.put("510190", "上证50ETF指数基金     ");//    市值：2.02      累涨：18.66     7.63      4.16      6.95      3.19      27
//        INDEX_MORE_CN.put("530050", "上证50ETF东财         ");//    市值：1.94      累涨：18.49     6.46      5.31      7.03      2.88      28

//        INDEX_MORE_CN.put("510300", "沪深300ETF      ");//17   510300  沪深300ETF      -14.01%   497.17        2022-07-25    2022-10-25
//        INDEX_MORE_CN.put("159912", "深300ETF              ");//    市值：1.31      累涨：28.58     8.86      8.69      11.03     4.42      1
//        INDEX_MORE_CN.put("159523", "沪深300成长ETF        ");//    市值：0.65      累涨：25.28     8.62      7.45      9.21      4.31      2
//        INDEX_MORE_CN.put("159656", "300成长ETF            ");//    市值：1.59      累涨：24.83     8.52      6.54      9.77      3.51      3
//        INDEX_MORE_CN.put("562310", "沪深300成长ETF        ");//    市值：9.63      累涨：23.25     7.87      6.23      9.15      3.60      4
//        INDEX_MORE_CN.put("510380", "国寿300ETF            ");//    市值：17.03     累涨：22.82     8.80      5.60      8.42      3.19      5
//        INDEX_MORE_CN.put("561000", "沪深300ETF增强基金    ");//    市值：1.36      累涨：22.82     8.18      6.54      8.10      3.56      6
//        INDEX_MORE_CN.put("159791", "300ESGETF             ");//    市值：0.36      累涨：21.81     8.16      5.77      7.88      3.09      7
//        INDEX_MORE_CN.put("515130", "沪深300ETF博时        ");//    市值：3.44      累涨：21.58     7.52      6.13      7.93      3.07      8
//        INDEX_MORE_CN.put("515360", "方正沪深300ETF        ");//    市值：1.98      累涨：21.43     7.76      5.90      7.77      3.04      9
//        INDEX_MORE_CN.put("561990", "沪深300增强ETF        ");//    市值：8.04      累涨：21.40     7.48      6.40      7.52      2.91      10
//        INDEX_MORE_CN.put("516830", "300ESGETF             ");//    市值：1.64      累涨：21.35     7.90      5.56      7.89      3.30      11
//        INDEX_MORE_CN.put("159300", "300ETF                ");//    市值：34.07     累涨：21.04     7.71      5.90      7.43      2.99      12
//        INDEX_MORE_CN.put("510350", "沪深300ETF工银        ");//    市值：51.42     累涨：21.03     7.55      5.65      7.83      3.24      13
//        INDEX_MORE_CN.put("159919", "沪深300ETF            ");//    市值：1533.81   累涨：20.95     7.29      5.89      7.77      3.05      14
//        INDEX_MORE_CN.put("510330", "沪深300ETF华夏        ");//    市值：1621.57   累涨：20.84     7.43      5.80      7.61      3.04      15
//        INDEX_MORE_CN.put("510390", "沪深300ETF平安        ");//    市值：5.90      累涨：20.81     7.52      5.70      7.59      2.76      16
//        INDEX_MORE_CN.put("561900", "沪深300ESGETF         ");//    市值：0.52      累涨：20.77     7.81      4.98      7.98      2.98      17
//        INDEX_MORE_CN.put("515330", "300ETF天弘            ");//    市值：117.69    累涨：20.73     7.43      5.85      7.45      2.82      18
//        INDEX_MORE_CN.put("159925", "沪深300ETF南方        ");//    市值：45.49     累涨：20.71     7.50      5.72      7.49      3.02      19
//        INDEX_MORE_CN.put("515660", "沪深300ETF国联安      ");//    市值：44.83     累涨：20.69     7.49      5.81      7.39      3.09      20
//        INDEX_MORE_CN.put("510360", "沪深300ETF基金        ");//    市值：96.68     累涨：20.68     7.52      5.82      7.34      2.59      21
//        INDEX_MORE_CN.put("159673", "沪深300ETF鹏华        ");//    市值：47.07     累涨：20.66     7.24      6.02      7.40      2.94      22
//        INDEX_MORE_CN.put("510300", "沪深300ETF            ");//    市值：3465.14   累涨：20.59     7.19      5.84      7.56      3.00      23
//        INDEX_MORE_CN.put("510310", "沪深300ETF易方达      ");//    市值：2389.15   累涨：20.53     7.16      5.68      7.69      3.00      24
//        INDEX_MORE_CN.put("561930", "沪深300ETF招商        ");//    市值：8.07      累涨：20.46     7.26      5.89      7.31      3.22      25
//        INDEX_MORE_CN.put("515390", "沪深300ETF指数基金    ");//    市值：7.25      累涨：20.35     7.01      6.07      7.27      2.61      26
//        INDEX_MORE_CN.put("159653", "ESG300ETF             ");//    市值：0.57      累涨：20.33     6.88      6.02      7.73      3.05      27
//        INDEX_MORE_CN.put("561300", "300增强ETF            ");//    市值：18.89     累涨：20.33     7.54      5.93      6.86      2.79      28
//        INDEX_MORE_CN.put("515380", "沪深300ETF泰康        ");//    市值：43.27     累涨：20.30     7.23      5.58      7.49      2.98      29
//        INDEX_MORE_CN.put("560180", "沪深300ESGETF南方     ");//    市值：0.33      累涨：20.27     7.58      5.07      7.62      2.96      30
//        INDEX_MORE_CN.put("562320", "沪深300价值ETF        ");//    市值：2.14      累涨：20.16     8.92      7.08      5.32      1.67      31
//        INDEX_MORE_CN.put("515350", "民生加银300ETF        ");//    市值：1.23      累涨：20.14     7.39      5.29      7.46      3.13      32
//        INDEX_MORE_CN.put("560330", "沪深300价值ETF申万菱信");//    市值：2.70      累涨：20.03     8.63      6.87      5.42      1.86      33
//        INDEX_MORE_CN.put("159330", "沪深300ETF基金        ");//    市值：10.02     累涨：19.93     7.24      5.48      7.30      2.89      34
//        INDEX_MORE_CN.put("515310", "沪深300指数ETF        ");//    市值：2.90      累涨：19.82     7.15      5.44      7.23      2.97      35
//        INDEX_MORE_CN.put("563520", "沪深300ETF永赢        ");//    市值：14.25     累涨：19.56     7.07      5.34      7.25      2.77      36
//        INDEX_MORE_CN.put("512530", "沪深300红利ETF        ");//    市值：2.00      累涨：18.78     7.73      7.76      4.26      1.75      37
//        INDEX_MORE_CN.put("510370", "300指数ETF            ");//    市值：1.13      累涨：18.74     6.45      5.75      6.54      2.77      38
//        INDEX_MORE_CN.put("159510", "沪深300价值ETF        ");//    市值：1.49      累涨：18.68     7.36      5.31      6.47      2.16      39

//        INDEX_MORE_CN.put("588110", "科创成长ETF           ");//    市值：2.33      累涨：51.92     15.96     15.07     20.89     12.11     1
//        INDEX_MORE_CN.put("588020", "科创成长50ETF         ");//    市值：3.00      累涨：51.85     17.00     14.80     20.05     12.02     2
//        INDEX_MORE_CN.put("588500", "科创100增强ETF易方达  ");//    市值：1.54      累涨：51.07     16.01     15.26     19.80     10.08     3
//        INDEX_MORE_CN.put("588070", "科创板成长ETF         ");//    市值：0.43      累涨：50.05     15.90     13.85     20.30     11.82     4
//        INDEX_MORE_CN.put("588030", "科创100指数ETF        ");//    市值：72.70     累涨：49.87     15.30     13.00     21.57     10.68     5
//        INDEX_MORE_CN.put("588210", "科创100ETF易方达      ");//    市值：2.96      累涨：49.36     14.94     12.87     21.55     11.05     6
//        INDEX_MORE_CN.put("588800", "科创100ETF华夏        ");//    市值：38.52     累涨：49.20     15.01     13.08     21.11     10.62     7
//        INDEX_MORE_CN.put("588220", "科创100ETF基金        ");//    市值：57.86     累涨：49.14     15.02     12.98     21.14     10.68     8
//        INDEX_MORE_CN.put("588680", "科创100ETF增强指数基金");//    市值：0.43      累涨：49.14     14.92     13.95     20.27     10.35     9
//        INDEX_MORE_CN.put("588190", "科创100ETF            ");//    市值：44.17     累涨：49.11     14.67     13.41     21.03     10.73     10
//        INDEX_MORE_CN.put("588880", "科创100ETF华泰柏瑞    ");//    市值：2.88      累涨：48.96     14.61     13.26     21.09     10.83     11
//        INDEX_MORE_CN.put("588900", "科创100ETF南方        ");//    市值：3.04      累涨：48.86     15.18     12.67     21.01     10.91     12
//        INDEX_MORE_CN.put("588120", "科创板100ETF          ");//    市值：11.59     累涨：48.51     14.60     13.35     20.56     10.65     13
//        INDEX_MORE_CN.put("588460", "科创50增强ETF         ");//    市值：6.06      累涨：47.37     15.56     10.94     20.87     10.66     14
//        INDEX_MORE_CN.put("588370", "科创50增强ETF南方     ");//    市值：1.40      累涨：46.39     12.50     11.01     22.88     11.15     15
//        INDEX_MORE_CN.put("588050", "科创ETF               ");//    市值：130.13    累涨：45.29     13.03     9.19      23.07     11.25     16
//        INDEX_MORE_CN.put("588000", "科创50ETF             ");//    市值：820.62    累涨：45.23     13.29     9.14      22.80     11.00     17
//        INDEX_MORE_CN.put("588080", "科创板50ETF           ");//    市值：598.26    累涨：45.22     13.16     8.92      23.14     11.39     18
//        INDEX_MORE_CN.put("588060", "科创50ETF龙头         ");//    市值：58.92     累涨：44.73     13.25     8.89      22.59     11.10     19
//        INDEX_MORE_CN.put("588090", "科创板ETF             ");//    市值：45.89     累涨：44.48     12.99     8.57      22.92     11.03     20
//        INDEX_MORE_CN.put("588280", "科创50ETF指数基金     ");//    市值：4.41      累涨：44.46     12.83     8.70      22.93     11.40     21
//        INDEX_MORE_CN.put("588150", "科创50ETF南方         ");//    市值：2.94      累涨：44.14     12.19     9.28      22.67     11.33     22
//        INDEX_MORE_CN.put("588180", "科创50ETF基金         ");//    市值：33.57     累涨：43.43     12.32     8.63      22.48     11.26     23
//        INDEX_MORE_CN.put("588450", "科创50ETF增强         ");//    市值：1.04      累涨：43.09     13.50     8.68      20.91     10.44     24
//        INDEX_MORE_CN.put("588930", "科创板人工智能ETF     ");//    市值：5.75      累涨：42.76               13.17     29.59     12.89     25
//        INDEX_MORE_CN.put("588230", "科创200ETF            ");//    市值：2.74      累涨：41.14     2.93      16.26     21.95     10.20     26
//        INDEX_MORE_CN.put("588310", "双创ETF基金           ");//    市值：0.77      累涨：39.49     12.34     9.97      17.18     7.56      27
//        INDEX_MORE_CN.put("159781", "科创创业ETF           ");//    市值：91.27     累涨：39.05     12.50     8.88      17.67     8.23      28
//        INDEX_MORE_CN.put("588010", "科创新材料ETF         ");//    市值：3.04      累涨：39.01     10.28     9.89      18.84     12.08     29
//        INDEX_MORE_CN.put("588360", "科创创业ETF           ");//    市值：4.66      累涨：38.99     11.84     9.38      17.77     8.23      30
//        INDEX_MORE_CN.put("159780", "双创ETF               ");//    市值：42.84     累涨：38.92     11.86     9.53      17.53     7.99      31
//        INDEX_MORE_CN.put("159603", "双创龙头ETF           ");//    市值：24.28     累涨：38.83     11.88     9.18      17.77     8.61      32
//        INDEX_MORE_CN.put("588300", "双创ETF               ");//    市值：17.90     累涨：38.43     11.89     8.76      17.78     8.12      33
//        INDEX_MORE_CN.put("588160", "科创材料ETF           ");//    市值：1.58      累涨：38.39     9.17      9.76      19.46     12.61     34
//        INDEX_MORE_CN.put("588350", "双创50ETF基金         ");//    市值：15.61     累涨：37.91     11.97     8.77      17.17     7.92      35
//        INDEX_MORE_CN.put("588380", "双创50ETF             ");//    市值：24.60     累涨：37.76     11.61     9.14      17.01     7.66      36
//        INDEX_MORE_CN.put("588330", "双创龙头ETF           ");//    市值：12.09     累涨：37.52     11.52     9.04      16.96     7.72      37
//        INDEX_MORE_CN.put("588390", "科创创业50ETF         ");//    市值：2.59      累涨：37.28     12.12     8.73      16.43     7.83      38
//        INDEX_MORE_CN.put("588820", "科创200ETF基金        ");//    市值：0.37      累涨：37.20               14.73     22.47     10.33     39
//        INDEX_MORE_CN.put("588400", "科创创业指数ETF       ");//    市值：18.30     累涨：37.00     11.75     8.54      16.71     7.60      40
//        INDEX_MORE_CN.put("159783", "科创创业50ETF         ");//    市值：48.08     累涨：36.74     11.49     8.96      16.29     7.64      41
//        INDEX_MORE_CN.put("588320", "双创50ETF增强         ");//    市值：0.28      累涨：36.33     11.62     9.17      15.54     7.26      42
//        INDEX_MORE_CN.put("159782", "双创50ETF             ");//    市值：9.88      累涨：36.12     11.53     8.09      16.50     7.83      43
//        INDEX_MORE_CN.put("588830", "科创新能源ETF         ");//    市值：4.73      累涨：35.42     8.12      8.40      18.90     10.54     44
//        INDEX_MORE_CN.put("588860", "科创医药ETF           ");//    市值：5.35      累涨：35.13     7.89      8.65      19.31     10.63     45
//        INDEX_MORE_CN.put("588700", "科创医药指数ETF       ");//    市值：3.62      累涨：34.31     8.17      8.96      18.13     9.26      46
//        INDEX_MORE_CN.put("588760", "人工智能ETF科创       ");//    市值：10.53     累涨：33.71               2.54      31.17     14.21     47
//        INDEX_MORE_CN.put("588730", "科创人工智能ETF       ");//    市值：3.29      累涨：31.27               2.31      28.96     13.19     48
//        INDEX_MORE_CN.put("159335", "央企科创ETF           ");//    市值：2.61      累涨：27.43     8.09      6.85      12.57     5.50      49
//        INDEX_MORE_CN.put("588950", "科创50ETF景顺         ");//    市值：2.20      累涨：23.08               0.50      22.58     11.81     50
//        INDEX_MORE_CN.put("588870", "科创50指数ETF         ");//    市值：1.36      累涨：22.75                         22.75     11.59     51
//        INDEX_MORE_CN.put("588960", "科创板新能源ETF       ");//    市值：0.41      累涨：10.37                         10.37     10.37     52
//        INDEX_MORE_CN.put("588240", "科创200ETF指数        ");//    市值：1.90      累涨：1.55                          1.55      1.55      53
//        INDEX_MORE_CN.put("589500", "科创综指ETF工银       ");//    市值：12.46     累涨：                                                  54
//        INDEX_MORE_CN.put("589880", "科创综指ETF建信       ");//    市值：12.86     累涨：                                                  55
//        INDEX_MORE_CN.put("589800", "N科创综指ETF易方达    ");//    市值：19.76     累涨：                                                  56

//        INDEX_MORE_CN.put("159949", "创业板50ETF     ");//22   159949  创业板50ETF     -16.22%   93.80         2022-07-25    2022-10-25
//        INDEX_MORE_CN.put("159573", "创业板200ETF华夏      ");//    市值：2.46      累涨：56.30     16.12     15.51     24.67     10.29     1
//        INDEX_MORE_CN.put("159571", "创业板200ETF富国      ");//    市值：0.59      累涨：55.39     16.41     15.61     23.54     9.22      2
//        INDEX_MORE_CN.put("159575", "创业板200ETF银华      ");//    市值：0.12      累涨：54.34     16.56     15.98     21.97     9.33      3
//        INDEX_MORE_CN.put("159572", "创业板200ETF易方达    ");//    市值：7.99      累涨：53.63     15.73     14.65     23.59     9.04      4
//        INDEX_MORE_CN.put("159804", "创中盘88ETF           ");//    市值：1.31      累涨：52.41     13.92     14.33     24.16     9.78      5
//        INDEX_MORE_CN.put("159967", "创业板成长ETF         ");//    市值：42.48     累涨：47.28     14.80     15.34     17.14     6.91      6
//        INDEX_MORE_CN.put("159541", "创业板综ETF万家       ");//    市值：2.67      累涨：43.76     12.85     11.95     18.96     7.43      7
//        INDEX_MORE_CN.put("159597", "创业板成长ETF易方达   ");//    市值：0.95      累涨：42.58     12.24     13.01     17.33     7.14      8
//        INDEX_MORE_CN.put("159563", "创业板综ETF华夏       ");//    市值：0.47      累涨：42.33     12.89     12.68     16.99     7.16      9
//        INDEX_MORE_CN.put("159918", "中创400ETF            ");//    市值：0.77      累涨：42.11     14.09     10.33     17.96     6.96      10
//        INDEX_MORE_CN.put("159836", "创300ETF              ");//    市值：1.78      累涨：41.38     11.75     11.26     18.37     7.56      11
//        INDEX_MORE_CN.put("159773", "创业板科技ETF         ");//    市值：2.44      累涨：41.06     11.04     10.98     19.04     7.26      12
//        INDEX_MORE_CN.put("159949", "创业板50ETF           ");//    市值：259.92    累涨：39.79     11.34     11.45     17.00     6.96      13
//        INDEX_MORE_CN.put("159682", "创业50ETF             ");//    市值：51.12     累涨：39.43     11.05     11.71     16.67     6.75      14
//        INDEX_MORE_CN.put("159810", "创业板ETF浦银         ");//    市值：0.92      累涨：39.31     10.98     10.96     17.37     7.73      15
//        INDEX_MORE_CN.put("159991", "创大盘ETF             ");//    市值：1.47      累涨：39.21     11.05     11.10     17.06     7.30      16
//        INDEX_MORE_CN.put("159952", "创业板ETF广发         ");//    市值：121.06    累涨：38.55     10.42     10.97     17.16     7.19      17
//        INDEX_MORE_CN.put("159915", "创业板ETF             ");//    市值：850.97    累涨：38.35     10.56     11.08     16.71     7.02      18
//        INDEX_MORE_CN.put("159821", "BOCI创业板ETF         ");//    市值：0.31      累涨：38.06     10.46     10.33     17.27     8.45      19
//        INDEX_MORE_CN.put("159956", "创业板ETF建信         ");//    市值：1.21      累涨：37.91     11.29     10.72     15.97     6.37      20
//        INDEX_MORE_CN.put("159675", "创业板增强ETF         ");//    市值：1.62      累涨：37.88     10.31     10.94     16.63     7.17      21
//        INDEX_MORE_CN.put("159948", "创业板ETF南方         ");//    市值：47.67     累涨：37.68     10.56     10.74     16.38     6.90      22
//        INDEX_MORE_CN.put("159814", "创业大盘ETF           ");//    市值：6.42      累涨：37.60     11.24     10.46     15.90     7.08      23
//        INDEX_MORE_CN.put("159676", "创业板增强ETF富国     ");//    市值：2.41      累涨：37.43     11.45     9.86      16.12     7.01      24
//        INDEX_MORE_CN.put("159964", "创业板ETF平安         ");//    市值：5.38      累涨：37.42     10.57     10.49     16.36     6.77      25
//        INDEX_MORE_CN.put("159957", "创业板100ETF华夏      ");//    市值：20.53     累涨：37.24     10.48     10.52     16.24     6.65      26
//        INDEX_MORE_CN.put("159908", "创业板ETF博时         ");//    市值：20.84     累涨：37.19     10.53     10.47     16.19     6.70      27
//        INDEX_MORE_CN.put("159971", "创业板ETF富国         ");//    市值：25.15     累涨：37.07     10.44     10.35     16.28     6.58      28
//        INDEX_MORE_CN.put("159977", "创业板ETF天弘         ");//    市值：93.88     累涨：36.75     10.20     10.39     16.16     6.79      29
//        INDEX_MORE_CN.put("159958", "创业板ETF工银         ");//    市值：4.20      累涨：36.10     9.53      10.74     16.13     7.15      30
//        INDEX_MORE_CN.put("159966", "创业板价值ETF         ");//    市值：5.27      累涨：35.55     10.05     10.44     15.06     5.35      31
//        INDEX_MORE_CN.put("159375", "创业板50ETF国泰       ");//    市值：0.58      累涨：25.88               10.31     15.57     6.61      32
//        INDEX_MORE_CN.put("159373", "创业板50ETF嘉实       ");//    市值：1.11      累涨：10.21                         10.21     6.68      33
//        INDEX_MORE_CN.put("159367", "创业板50ETF华夏       ");//    市值：0.55      累涨：9.41                          9.41      7.14      34
//        INDEX_MORE_CN.put("159383", "创业板50ETF华泰柏瑞   ");//    市值：0.64      累涨：7.94                          7.94      6.34      35

//        INDEX_MORE_CN.put("515800", "800ETF          ");//15   515800  800ETF          -11.97%   17.88         2022-07-25    2022-10-25
//        INDEX_MORE_CN.put("159800", "中证800ETF            ");//    市值：0.58      累涨：23.89     7.33      6.80      9.76      3.44      1
//        INDEX_MORE_CN.put("515810", "中证800ETF            ");//    市值：2.79      累涨：23.62     8.29      6.40      8.93      3.68      2
//        INDEX_MORE_CN.put("515800", "800ETF                ");//    市值：53.43     累涨：21.37     6.77      5.87      8.73      3.04      3
//        INDEX_MORE_CN.put("159517", "800增强ETF            ");//    市值：0.16      累涨：19.56     7.06      5.49      7.10      2.68      4
//        INDEX_MORE_CN.put("560030", "800价值ETF            ");//    市值：0.38      累涨：18.79     7.89      7.19      4.56      1.29      5
//        INDEX_MORE_CN.put("159355", "800红利低波ETF        ");//    市值：1.23      累涨：16.44     7.51      6.31      4.11      1.41      6

//        INDEX_MORE_CN.put("510500", "中证500ETF      ");//7    510500  中证500ETF      -6.52%    413.40        2022-07-25    2022-10-25
//        INDEX_MORE_CN.put("515190", "中银证券500ETF        ");//    市值：0.95      累涨：31.59     11.73     8.90      10.96     4.43      2
//        INDEX_MORE_CN.put("510590", "中证500ETF平安        ");//    市值：7.17      累涨：31.45     10.49     8.95      12.44     5.03      3
//        INDEX_MORE_CN.put("159620", "500成长ETF            ");//    市值：0.36      累涨：31.30     10.05     10.92     10.55     6.08      5
//        INDEX_MORE_CN.put("159678", "中证500增强ETF        ");//    市值：0.72      累涨：31.18     11.92     8.93      10.72     4.64      6
//        INDEX_MORE_CN.put("510500", "中证500ETF            ");//    市值：972.86    累涨：30.70     10.56     8.14      12.24     4.93      7
//        INDEX_MORE_CN.put("510510", "中证500ETF基金        ");//    市值：20.61     累涨：30.67     10.78     8.04      12.12     4.81      8
//        INDEX_MORE_CN.put("159935", "中证500ETF景顺        ");//    市值：0.62      累涨：30.56     10.75     7.62      12.41     4.94      9
//        INDEX_MORE_CN.put("561950", "500指数增强ETF        ");//    市值：0.75      累涨：30.48     10.97     8.70      11.47     4.23      10
//        INDEX_MORE_CN.put("510550", "方正中证500ETF        ");//    市值：0.35      累涨：30.35     10.31     8.64      12.08     5.46      11
//        INDEX_MORE_CN.put("512500", "中证500ETF华夏        ");//    市值：142.52    累涨：30.12     10.35     8.11      11.94     4.56      12
//        INDEX_MORE_CN.put("561550", "500增强ETF            ");//    市值：7.28      累涨：30.12     10.22     8.90      11.11     5.55      13
//        INDEX_MORE_CN.put("159968", "中证500ETF博时        ");//    市值：7.11      累涨：30.09     10.70     7.75      11.97     5.00      14
//        INDEX_MORE_CN.put("159820", "中证500ETF天弘        ");//    市值：22.64     累涨：30.03     10.31     8.08      12.05     4.85      15
//        INDEX_MORE_CN.put("159982", "中证500ETF鹏华        ");//    市值：3.12      累涨：29.89     10.70     7.62      11.91     4.79      16
//        INDEX_MORE_CN.put("159337", "中证500ETF基金        ");//    市值：12.85     累涨：29.74     10.27     7.62      12.00     5.06      17
//        INDEX_MORE_CN.put("515550", "国联中证500ETF        ");//    市值：0.77      累涨：29.72     11.10     9.27      10.91     4.00      18
//        INDEX_MORE_CN.put("561350", "国泰中证500ETF        ");//    市值：1.21      累涨：29.60     10.09     8.18      11.66     4.64      19
//        INDEX_MORE_CN.put("510580", "中证500ETF易方达      ");//    市值：31.79     累涨：29.42     9.81      7.97      11.95     4.68      20
//        INDEX_MORE_CN.put("510530", "中证500ETF工银        ");//    市值：3.59      累涨：29.33     10.25     7.48      11.94     4.80      21
//        INDEX_MORE_CN.put("515530", "中证500ETF泰康        ");//    市值：0.79      累涨：29.31     10.56     7.20      11.68     4.64      22
//        INDEX_MORE_CN.put("510560", "国寿500ETF            ");//    市值：1.79      累涨：29.22     11.09     7.43      10.77     3.87      23
//        INDEX_MORE_CN.put("510570", "兴业中证500ETF        ");//    市值：0.24      累涨：29.10     10.16     7.43      12.06     4.24      24
//        INDEX_MORE_CN.put("512510", "中证500ETF华泰柏瑞    ");//    市值：11.36     累涨：28.97     9.69      8.07      11.63     4.72      25
//        INDEX_MORE_CN.put("563030", "中证500增强ETF易方达  ");//    市值：1.53      累涨：28.87     10.01     8.38      10.68     5.10      26
//        INDEX_MORE_CN.put("517010", "沪港深500ETF易方达    ");//    市值：0.70      累涨：28.85     9.11      6.97      13.55     5.28      27
//        INDEX_MORE_CN.put("517100", "AH500ETF              ");//    市值：3.04      累涨：28.24     8.19      6.27      14.03     5.44      28
//        INDEX_MORE_CN.put("515590", "500等权ETF            ");//    市值：0.56      累涨：28.22     10.77     6.84      11.02     4.99      29
//        INDEX_MORE_CN.put("560100", "中证500增强ETF        ");//    市值：0.95      累涨：27.78     10.46     7.60      10.23     4.70      30
//        INDEX_MORE_CN.put("560950", "500ETF增强            ");//    市值：0.46      累涨：27.72     10.82     6.90      10.19     4.78      31
//        INDEX_MORE_CN.put("517000", "沪港深500ETF          ");//    市值：3.76      累涨：27.72     8.71      5.91      13.10     5.22      32
//        INDEX_MORE_CN.put("517080", "沪港深500ETF基金      ");//    市值：4.20      累涨：27.42     8.21      6.67      13.04     5.13      33
//        INDEX_MORE_CN.put("562340", "中证500成长ETF        ");//    市值：0.20      累涨：26.98     10.82     8.51      7.94      4.22      34
//        INDEX_MORE_CN.put("159606", "中证500成长ETF        ");//    市值：4.62      累涨：26.43     9.63      9.42      7.60      3.57      35
//        INDEX_MORE_CN.put("560500", "500质量成长ETF        ");//    市值：5.86      累涨：26.15     10.09     9.12      7.05      3.41      36
//        INDEX_MORE_CN.put("512260", "中证500低波动ETF      ");//    市值：0.63      累涨：26.13     10.92     6.85      9.04      4.05      37
//        INDEX_MORE_CN.put("159610", "500ETF增强            ");//    市值：5.04      累涨：25.60     9.69      7.35      9.03      4.54      38
//        INDEX_MORE_CN.put("159338", "中证A500ETF           ");//    市值：264.74    累涨：22.99     7.31      6.44      9.24      3.63      39
//        INDEX_MORE_CN.put("159353", "中证A500ETF景顺       ");//    市值：150.99    累涨：22.88     7.89      6.54      8.45      3.05      40
//        INDEX_MORE_CN.put("159617", "500价值ETF            ");//    市值：0.44      累涨：22.46     10.21     6.40      6.99      2.90      41
//        INDEX_MORE_CN.put("159360", "中证A500ETF天弘       ");//    市值：41.50     累涨：22.33     7.59      6.09      8.65      3.14      42
//        INDEX_MORE_CN.put("159361", "A500ETF易方达         ");//    市值：155.05    累涨：22.29     7.28      6.44      8.57      3.26      43
//        INDEX_MORE_CN.put("563800", "中证A500ETF龙头       ");//    市值：206.31    累涨：22.11     7.11      6.13      8.87      3.44      44
//        INDEX_MORE_CN.put("563880", "中证A500指数ETF       ");//    市值：90.60     累涨：22.04     7.26      6.13      8.65      3.21      45
//        INDEX_MORE_CN.put("563360", "中证A500ETF基金       ");//    市值：165.44    累涨：22.04     7.20      6.39      8.45      3.13      46
//        INDEX_MORE_CN.put("512050", "A500ETF基金           ");//    市值：202.15    累涨：22.03     7.24      6.14      8.65      3.33      47
//        INDEX_MORE_CN.put("159358", "中证A500ETF基金       ");//    市值：29.83     累涨：22.01     7.34      6.17      8.50      3.02      48
//        INDEX_MORE_CN.put("159352", "中证A500ETF南方       ");//    市值：213.16    累涨：22.00     6.96      6.24      8.80      3.15      49
//        INDEX_MORE_CN.put("560610", "A500指数ETF           ");//    市值：120.51    累涨：21.96     7.30      6.35      8.31      3.01      50
//        INDEX_MORE_CN.put("159351", "A500指数ETF           ");//    市值：140.41    累涨：21.95     7.44      6.10      8.41      2.93      51
//        INDEX_MORE_CN.put("560530", "中证A500ETF摩根       ");//    市值：107.77    累涨：21.93     7.09      6.16      8.68      3.12      52
//        INDEX_MORE_CN.put("159357", "中证A500指数ETF       ");//    市值：53.30     累涨：21.68     7.25      6.22      8.21      2.86      53
//        INDEX_MORE_CN.put("563220", "中证A500ETF富国       ");//    市值：193.15    累涨：21.43     7.13      6.10      8.20      2.99      54
//        INDEX_MORE_CN.put("159359", "中证A500ETF华安       ");//    市值：39.64     累涨：20.89     6.14      6.04      8.71      3.25      55
//        INDEX_MORE_CN.put("563500", "中证A500ETF华宝       ");//    市值：19.86     累涨：20.87     6.17      6.28      8.42      3.03      56
//        INDEX_MORE_CN.put("159339", "A500ETF               ");//    市值：91.70     累涨：20.80     7.01      6.06      7.83      2.87      57
//        INDEX_MORE_CN.put("560510", "中证A500ETF           ");//    市值：75.69     累涨：20.73     6.70      6.02      8.01      2.80      58
//        INDEX_MORE_CN.put("562330", "中证500价值ETF        ");//    市值：0.18      累涨：20.70     9.21      7.15      5.54      2.88      59
//        INDEX_MORE_CN.put("512020", "A500ETF指数           ");//    市值：43.02     累涨：20.39     5.82      6.31      8.26      3.04      60
//        INDEX_MORE_CN.put("159362", "A500ETF工银           ");//    市值：34.79     累涨：19.97     5.77      5.85      8.35      3.07      61
//        INDEX_MORE_CN.put("159356", "A500ETF基金           ");//    市值：58.37     累涨：19.29     5.17      5.75      8.37      2.98      62
//        INDEX_MORE_CN.put("159380", "A500ETF东财           ");//    市值：4.55      累涨：14.19               5.32      8.87      3.51      65
//        INDEX_MORE_CN.put("159376", "A500ETF指数基金       ");//    市值：4.98      累涨：13.38               4.92      8.46      2.93      66
//        INDEX_MORE_CN.put("159379", "A500ETF融通           ");//    市值：6.03      累涨：11.18               1.31      9.87      4.54      67
//        INDEX_MORE_CN.put("512080", "A500ETF中金           ");//    市值：15.37     累涨：9.33                1.00      8.33      3.18      68
//        INDEX_MORE_CN.put("560750", "A500ETF申万菱信       ");//    市值：2.41      累涨：6.88                          6.88      3.17      69
//        INDEX_MORE_CN.put("563860", "A500ETF海富通         ");//    市值：12.34     累涨：5.24                          5.24      3.25      70
//        INDEX_MORE_CN.put("159386", "A500ETF永赢           ");//    市值：1.48      累涨：4.79                          4.79      2.88      71

//        INDEX_MORE_CN.put("562520", "中证1000成长ETF       ");//    市值：0.57      累涨：44.33     15.75     12.91     15.67     8.69      1
//        INDEX_MORE_CN.put("159680", "1000ETF增强           ");//    市值：3.24      累涨：41.43     14.59     10.91     16.19     5.75      2
//        INDEX_MORE_CN.put("159685", "1000增强ETF天弘       ");//    市值：0.20      累涨：40.27     15.60     10.54     14.33     7.17      3
//        INDEX_MORE_CN.put("561280", "中证1000ETF增强       ");//    市值：0.46      累涨：40.19     14.21     11.59     14.58     7.67      4
//        INDEX_MORE_CN.put("512100", "中证1000ETF           ");//    市值：544.36    累涨：39.44     13.52     11.13     14.95     6.50      5
//        INDEX_MORE_CN.put("159679", "中证1000增强ETF       ");//    市值：1.49      累涨：39.29     12.91     10.32     16.37     7.02      6
//        INDEX_MORE_CN.put("159845", "中证1000ETF           ");//    市值：301.45    累涨：38.93     13.12     10.78     15.15     6.61      7
//        INDEX_MORE_CN.put("560010", "中证1000ETF指数       ");//    市值：249.36    累涨：38.50     12.76     11.32     14.74     6.43      8
//        INDEX_MORE_CN.put("159633", "中证1000ETF易方达     ");//    市值：25.20     累涨：38.46     12.79     10.17     15.54     6.47      9
//        INDEX_MORE_CN.put("561780", "1000增强ETF           ");//    市值：0.15      累涨：38.39     14.27     10.08     14.23     6.54      10
//        INDEX_MORE_CN.put("561590", "中证1000增强ETF       ");//    市值：0.36      累涨：38.16     14.10     11.69     12.37     6.24      11
//        INDEX_MORE_CN.put("159629", "1000ETF               ");//    市值：98.85     累涨：37.84     12.98     10.36     14.74     6.22      12
//        INDEX_MORE_CN.put("516300", "中证1000ETF华泰柏瑞   ");//    市值：1.37      累涨：37.80     13.31     10.53     14.08     5.88      13
//        INDEX_MORE_CN.put("560110", "中证1000ETF基金       ");//    市值：2.43      累涨：37.52     12.30     10.97     14.25     6.20      14
//        INDEX_MORE_CN.put("560590", "1000ETF增强           ");//    市值：0.16      累涨：36.02     13.81     8.15      14.24     5.65      15
//        INDEX_MORE_CN.put("159677", "1000增强ETF           ");//    市值：0.48      累涨：33.99     13.11     9.43      12.41     4.71      16
//        INDEX_MORE_CN.put("562530", "中证1000价值ETF       ");//    市值：0.61      累涨：25.99     11.57     7.68      7.62      4.37      17

//        INDEX_MORE_CN.put("159555", "2000增强ETF           ");//    市值：0.49      累涨：49.47     17.33     14.03     19.00     7.25      1
//        INDEX_MORE_CN.put("159531", "中证2000ETF           ");//    市值：5.23      累涨：49.13     17.22     14.12     18.37     7.22      2
//        INDEX_MORE_CN.put("159532", "中证2000ETF易方达     ");//    市值：0.80      累涨：48.31     17.14     13.68     18.11     7.53      3
//        INDEX_MORE_CN.put("563300", "中证2000ETF           ");//    市值：29.07     累涨：47.27     15.78     12.85     18.92     7.67      4
//        INDEX_MORE_CN.put("159536", "中证2000指数ETF       ");//    市值：0.51      累涨：46.88     17.06     13.77     16.90     7.76      5
//        INDEX_MORE_CN.put("159552", "中证2000增强ETF       ");//    市值：0.16      累涨：46.76     15.85     15.67     15.92     7.45      6
//        INDEX_MORE_CN.put("563200", "中证2000ETF富国       ");//    市值：0.22      累涨：46.54     15.35     14.76     17.36     7.12      7
//        INDEX_MORE_CN.put("159533", "中证2000ETF基金       ");//    市值：0.14      累涨：46.40     16.43     13.32     17.65     7.53      8
//        INDEX_MORE_CN.put("561370", "2000ETF               ");//    市值：0.14      累涨：46.33     15.12     13.71     18.46     7.73      9
//        INDEX_MORE_CN.put("560220", "中证2000ETF基金       ");//    市值：0.57      累涨：46.18     16.44     13.68     16.97     7.28      10
//        INDEX_MORE_CN.put("159907", "2000ETF               ");//    市值：1.74      累涨：45.55     16.68     12.46     16.66     6.26      11
//        INDEX_MORE_CN.put("159535", "中证2000ETF指数       ");//    市值：0.19      累涨：44.00     16.14     12.63     15.97     6.60      12
//        INDEX_MORE_CN.put("562660", "中证2000ETF华夏       ");//    市值：1.49      累涨：43.91     15.72     12.62     16.69     6.58      13
//        INDEX_MORE_CN.put("159553", "2000ETF增强           ");//    市值：0.06      累涨：42.98     16.58     12.94     14.36     5.97      14
//        INDEX_MORE_CN.put("159628", "国证2000ETF           ");//    市值：7.01      累涨：42.91     14.67     11.78     16.94     6.99      15
//        INDEX_MORE_CN.put("159543", "国证2000ETF基金       ");//    市值：0.56      累涨：42.82     13.34     12.47     17.01     8.75      16
//        INDEX_MORE_CN.put("159556", "中证2000ETF增强       ");//    市值：0.43      累涨：42.36     15.55     11.49     15.42     7.34      17
//        INDEX_MORE_CN.put("159505", "国证2000指数ETF       ");//    市值：0.14      累涨：40.55     13.36     11.20     16.76     7.41      18
//        INDEX_MORE_CN.put("159521", "2000指数ETF           ");//    市值：0.22      累涨：40.09     15.69     11.45     13.36     6.23      19
    }

    public static Map<String, String> INDEX_MORE = new HashMap<>();//指数

    static {
        INDEX_MORE.putAll(INDEX_MORE_NOT_CN);
        INDEX_MORE.putAll(INDEX_MORE_CN);
    }

    public static Map<String, String> INDEX_ALL_NOT_CN = new HashMap<>();//指数-全部-etf-国外指数

    static {
        INDEX_ALL_NOT_CN.put("513300", "指数");//1    513300  纳斯达克ETF     -4.07%    11.72         2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("159941", "指数");//2    159941  纳指ETF         -4.22%    110.10        2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("513100", "指数");//3    513100  纳指ETF         -5.37%    48.75         2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("159632", "纳斯达克ETF   ");//3.24    	0.98%

        INDEX_ALL_NOT_CN.put("513080", "指数");//1    513080  法国CAC40ETF    0.45%     0.62          2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("513030", "指数");//16   513030  德国ETF         -3.34%    5.84          2022-07-21    2022-10-21


        INDEX_ALL_NOT_CN.put("159866", "指数");//3    159866  日经ETF         -1.44%    0.69          2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("513520", "指数");//10   513520  日经ETF         -2.69%    0.57          2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("513800", "指数");//11   513800  东京证券指数ETF -2.71%    0.54          2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("513880", "指数");//15   513880  日经225ETF      -3.18%    0.50          2022-07-21    2022-10-21
        INDEX_ALL_NOT_CN.put("513000", "指数");//17   513000  日经225ETF易方达-3.43%    0.60          2022-07-21    2022-10-21


        INDEX_ALL_NOT_CN.put("159529", "标普消费ETF           ");//    97.39     33.71     45.09     19.94     2.68      0.78
        INDEX_ALL_NOT_CN.put("513350", "标普油气ETF           ");//    60.42     8.86      35.50     16.68     4.08      1.73
        INDEX_ALL_NOT_CN.put("159518", "标普油气ETF           ");//    49.11     10.04     29.67     9.51      1.74
        INDEX_ALL_NOT_CN.put("159612", "标普500ETF            ");//    29.30     10.33     16.14     2.83      0.57
        INDEX_ALL_NOT_CN.put("159502", "标普生物科技ETF       ");//    28.10     10.46     13.25     5.98      1.41      0.21
        INDEX_ALL_NOT_CN.put("159655", "标普ETF               ");//    26.10     6.00      17.59     6.33      0.54
        INDEX_ALL_NOT_CN.put("562060", "标普红利ETF           ");//    17.46     6.33      6.59      5.39      2.08      1.80
        INDEX_ALL_NOT_CN.put("513500", "标普500ETF            ");//    16.74     8.48      7.39      1.42      0.69
        INDEX_ALL_NOT_CN.put("513650", "标普500ETF南方        ");//    16.66     7.69      7.49      1.97      0.62

    }

    public static Map<String, String> INDEX_ALL_CN_H = new HashMap<>();//指数-全部-香港指数

    static {
        INDEX_ALL_CN_H.put("513990", "指数");//1    513990  港股通ETF       -16.03%   0.58          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159954", "指数");//2    159954  H股ETF          -16.09%   2.15          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159712", "指数");//3    159712  港股通50ETF     -16.21%   0.61          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159788", "指数");//4    159788  港股通100ETF    -16.70%   0.34          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("510900", "指数");//5    510900  H股ETF          -17.11%   79.18         2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159823", "指数");//6    159823  H股ETF基金      -17.70%   0.37          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("513550", "指数");//7    513550  港股通50ETF     -17.82%   29.80         2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("513900", "指数");//8    513900  港股通100ETF    -19.35%   1.95          2022-07-21    2022-10-21

        INDEX_ALL_CN_H.put("513680", "指数");//1    513680  恒生国企ETF     -14.32%   0.26          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("513660", "指数");//2    513660  恒生ETF         -14.49%   19.21         2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159960", "指数");//3    159960  H股ETF港股通    -14.79%   3.51          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("513600", "指数");//6    513600  恒生指数ETF     -14.93%   6.19          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("517350", "指数");//14   517350  中概科技ETF     -15.50%   1.10          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159711", "指数");//15   159711  港股通ETF       -15.59%   0.55          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159850", "指数");//12   159850  恒生国企ETF     -17.45%   5.54          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("159920", "指数");//14   159920  恒生ETF         -17.58%   150.17        2022-07-21    2022-10-21

        INDEX_ALL_CN_H.put("517170", "指数");//1    517170  沪港深ETF       -14.27%   0.25          2022-07-21    2022-10-21
        INDEX_ALL_CN_H.put("517270", "指数");//2    517270  沪港深科技TOPETF-15.55%   0.28          2022-07-21    2022-10-21
    }

    public static Map<String, String> INDEX_ALL_CN = new HashMap<>();//指数-全部-etf-国内

    static {
        INDEX_ALL_CN.put("159721", "指数");//1    159721  深创龙头ETF     -12.72%   0.70          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159716", "指数");//7    159716  深创100ETF      -13.12%   1.34          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159961", "指数");//9    159961  深100ETF方正富邦-13.54%   5.27          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159975", "指数");//16   159975  深100ETF招商    -13.94%   0.99          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159969", "指数");//21   159969  深100ETF银华    -14.12%   0.31          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159970", "指数");//23   159970  深100ETF工银    -14.21%   0.22          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159906", "指数");//3    159906  深成长龙头ETF   -11.76%   1.00          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159903", "指数");//1    159903  深成ETF         -12.12%   2.32          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159943", "指数");//5    159943  深证成指ETF     -12.40%   0.90          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159706", "指数");//4    159706  深证100ETF华安  -14.23%   0.78          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159901", "指数");//5    159901  深证100ETF易方达-14.29%   58.75         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159916", "深F60ETF      ");//3.39    	1.1%

        INDEX_ALL_CN.put("159991", "指数");//2    159991  创大盘ETF       -12.82%   0.81          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510020", "指数");//4    510020  超大盘ETF       -12.87%   0.96          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("159815", "指数");//3    159815  浙江100ETF      -12.82%   0.27          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159962", "指数");//8    159962  四川ETF         -13.36%   0.34          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512650", "指数");//10   512650  长三角ETF       -13.58%   4.45          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159623", "成渝经济圈ETF ");//33.60   	0.33%
        INDEX_ALL_CN.put("512780", "京津冀ETF     ");//0.04    	null%

        INDEX_ALL_CN.put("159984", "指数");//1    159984  湾区100ETF      -12.74%   0.48          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159983", "指数");//2    159983  粤港澳大湾区ETF -14.05%   0.64          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159976", "指数");//3    159976  湾创ETF         -14.06%   1.00          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512870", "指数");//4    512870  杭州湾区ETF     -14.31%   0.46          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159978", "指数");//5    159978  大湾区ETF       -15.29%   0.29          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("515670", "指数");//1    515670  中银中证100ETF  -12.68%   1.64          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159923", "指数");//2    159923  中证100ETF      -12.81%   0.19          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512910", "指数");//3    512910  中证100ETF      -13.28%   3.84          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("562000", "中证100ETF基金");//8.38    	-0.34%
        INDEX_ALL_CN.put("159631", "中证100ETF招商");//4.69    	-0.56%
        INDEX_ALL_CN.put("159630", "中证100ETF基金");//4.64    	-0.78%

        INDEX_ALL_CN.put("159821", "指数");//1    159821  BOCI创业板ETF   -10.99%   0.22          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159956", "指数");//2    159956  创业板ETF建信   -11.43%   0.68          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159964", "指数");//3    159964  平安创业板ETF   -12.17%   3.25          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159810", "指数");//4    159810  浦银创业板ETF   -12.56%   0.29          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159971", "指数");//5    159971  创业板ETF富国   -12.72%   0.10          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159957", "指数");//6    159957  创业板ETF华夏   -13.01%   3.25          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159952", "指数");//7    159952  创业板ETF广发   -13.09%   18.41         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159958", "指数");//8    159958  创业板ETF工银   -13.15%   1.71          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159955", "指数");//9    159955  创业板ETF嘉实   -13.28%   0.29          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159908", "指数");//10   159908  创业板ETF博时   -13.38%   10.36         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159915", "指数");//11   159915  创业板ETF       -13.40%   171.65        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159977", "指数");//12   159977  创业板ETF天弘   -13.42%   46.84         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159948", "指数");//13   159948  创业板ETF南方   -13.45%   20.94         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159808", "指数");//14   159808  创业板ETF融通   -13.49%   0.75          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159814", "指数");//15   159814  创业大盘ETF     -13.62%   2.49          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159949", "指数");//16   159949  创业板50ETF     -13.84%   94.90         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159836", "指数");//10   159836  创300ETF        -11.43%   0.55          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159967", "指数");//14   159967  创成长ETF       -14.43%   30.56         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588380", "指数");//1    588380  创50ETF         -8.89%    18.00         2022-07-21    2022-10-21

        INDEX_ALL_CN.put("515810", "指数");//1    515810  中证800ETF      -10.50%   1.28          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515800", "指数");//2    515800  800ETF          -10.82%   18.32         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515820", "A800ETF       ");//0.08    	null%

        INDEX_ALL_CN.put("588060", "指数");//2    588060  科创50ETF龙头   -9.51%    3.90          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588180", "指数");//3    588180  科创50ETF基金   -9.78%    15.58         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588280", "指数");//4    588280  科创50ETF华安   -10.14%   1.50          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588000", "指数");//5    588000  科创50ETF       -10.28%   312.11        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588150", "指数");//7    588150  科创龙头ETF     -10.16%   1.02          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588050", "指数");//11   588050  科创ETF         -10.39%   44.35         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588080", "指数");//12   588080  科创板50ETF     -10.42%   128.81        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588090", "指数");//13   588090  科创板ETF       -10.43%   30.23         2022-07-21    2022-10-21


        INDEX_ALL_CN.put("510220", "指数");//1    510220  中小盘ETF       -8.14%    0.22          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510130", "指数");//8    510130  中盘ETF         -8.52%    2.08          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159902", "指数");//1    159902  中小100ETF      -13.66%   4.48          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159973", "指数");//2    159973  民企领先100ETF  -13.73%   5.15          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("588310", "指数");//1    588310  双创ETF基金     -8.04%    0.58          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588300", "指数");//2    588300  双创ETF         -8.60%    14.38         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588400", "指数");//3    588400  双创50ETF       -8.65%    17.78         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159782", "指数");//4    159782  双创50ETF基金   -8.93%    8.28          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159781", "指数");//5    159781  双创50ETF       -8.94%    60.30         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159783", "指数");//6    159783  双创基金ETF     -9.12%    40.67         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588330", "指数");//7    588330  双创龙头ETF     -9.12%    11.04         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159603", "指数");//8    159603  双创龙头ETF     -9.13%    9.56          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159780", "指数");//9    159780  双创ETF         -9.16%    30.16         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588360", "指数");//1    588360  科创创业ETF     -9.03%    5.28          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("588390", "指数");//2    588390  科创创业50ETF   -9.21%    2.96          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("159628", "指数");//1    159628  国证2000ETF     -6.58%    2.79          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("159966", "指数");//5    159966  创蓝筹ETF       -5.68%    5.21          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159773", "指数");//8    159773  创科技ETF       -6.13%    0.63          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159804", "指数");//20   159804  创中盘88ETF     -6.69%    1.18          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159918", "指数");//4    159918  中创400ETF      -8.38%    0.60          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("562520", "指数");//1    562520  1000成长ETF     -6.06%    0.49          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("516300", "指数");//2    516300  中证1000指数ETF -9.36%    1.76          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512100", "指数");//3    512100  中证1000ETF     -9.76%    93.30         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("560110", "中证1000ETF基金");//10.13   	0.21%
        INDEX_ALL_CN.put("159845", "中证1000ETF   ");//66.71   	0.2%
        INDEX_ALL_CN.put("159633", "中证1000指数ETF");//65.47   	0.2%
        INDEX_ALL_CN.put("159629", "1000ETF       ");//67.16   	0.11%
        INDEX_ALL_CN.put("560010", "中证1000ETF指数");//69.99   	0.07%
        INDEX_ALL_CN.put("562530", "1000价值ETF   ");//0.54    	0.83%

        INDEX_ALL_CN.put("510760", "指数");//1    510760  上证综指ETF     -5.03%    2.91          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510210", "指数");//4    510210  上证指数ETF     -8.16%    9.66          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("512750", "指数");//6    512750  基本面50ETF     -5.86%    1.23          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("560650", "指数");//3    560650  核心50ETF       -6.61%    0.38          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("561500", "指数");//7    561500  漂亮50ETF       -6.98%    1.01          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("512040", "指数");//10   512040  价值100ETF      -6.09%    2.84          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510290", "指数");//12   510290  上证380ETF      -6.24%    1.61          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510190", "指数");//5    510190  上证龙头ETF     -10.11%   0.56          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510180", "指数");//6    510180  上证180ETF      -11.29%   183.51        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510990", "指数");//1    510990  180ESGETF       -11.95%   0.48          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("516720", "指数");//3    516720  ESGETF          -12.05%   0.48          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510010", "指数");//3    510010  180治理ETF      -7.38%    2.11          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159910", "指数");//3    159910  基本面120ETF    -9.65%    3.34          2022-07-21    2022-10-21

        INDEX_ALL_CN.put("512150", "指数");//11   512150  A50ETF          -11.47%   0.79          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512550", "指数");//2    512550  A50ETF基金      -12.23%   2.67          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510800", "指数");//4    510800  50ETF基金       -12.39%   6.65          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510680", "指数");//7    510680  上证50ETF基金   -12.57%   0.31          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510100", "指数");//8    510100  上证50ETF易方达 -12.69%   10.87         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510710", "指数");//9    510710  上证50ETF博时   -12.69%   5.45          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510600", "指数");//10   510600  申万上证50ETF   -12.85%   0.44          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510850", "指数");//11   510850  工银上证50ETF   -12.96%   2.17          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510050", "指数");//12   510050  上证50ETF       -13.10%   612.71        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515450", "红利低波50ETF ");//1.95    	0.27%
        INDEX_ALL_CN.put("159602", "中国A50ETF    ");//16.43   	-0.52%
        INDEX_ALL_CN.put("563000", "中国A50ETF    ");//56.10   	-0.52%
        INDEX_ALL_CN.put("159601", "A50ETF        ");//48.09   	-0.64%
        INDEX_ALL_CN.put("560050", "MSCI中国A50ETF");//63.88   	-0.65%

        INDEX_ALL_CN.put("510370", "指数");//2    510370  兴业沪深300ETF  -10.61%   0.29          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510380", "指数");//2    510380  国寿300ETF      -10.93%   11.34         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515930", "指数");//3    515930  永赢沪深300ETF  -11.12%   0.58          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510390", "指数");//4    510390  平安沪深300ETF  -11.66%   5.08          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515390", "指数");//5    515390  华安沪深300ETF  -11.76%   3.31          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515360", "指数");//6    515360  方正沪深300ETF  -11.77%   1.50          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("561900", "指数");//7    561900  沪深300ESGETF   -11.78%   0.62          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510310", "指数");//8    510310  沪深300ETF易方达-11.87%   115.94        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510350", "指数");//9    510350  工银沪深300ETF  -11.88%   25.08         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515380", "指数");//10   515380  泰康沪深300ETF  -11.99%   34.07         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515660", "指数");//11   515660  国联安沪深300ETF-12.03%   21.32         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510360", "指数");//12   510360  沪深300ETF基金  -12.12%   14.68         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515310", "指数");//13   515310  沪深300添富ETF  -12.21%   0.29          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510300", "指数");//14   510300  沪深300ETF      -12.21%   512.95        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159919", "指数");//15   159919  沪深300ETF      -12.25%   182.59        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159925", "指数");//16   159925  沪深300ETF南方  -12.33%   15.13         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515130", "指数");//17   515130  沪深300ETF博时  -12.54%   0.59          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("561990", "指数");//18   561990  沪深300增强ETF  -12.58%   4.46          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159907", "指数");//1    159907  中小300ETF      -11.47%   0.94          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515350", "指数");//2    515350  民生加银300ETF  -11.72%   1.20          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("516830", "指数");//3    516830  300ESGETF       -12.05%   2.43          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515330", "指数");//4    515330  300ETF天弘      -12.19%   62.76         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159791", "指数");//5    159791  300ESGETF       -12.22%   0.16          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510330", "指数");//6    510330  300ETF基金      -12.26%   201.53        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("561300", "指数");//7    561300  300增强ETF      -12.56%   8.08          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517030", "指数");//8    517030  沪港深300ETF基金-12.76%   0.34          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517300", "指数");//9    517300  沪港深300ETF    -13.13%   19.67         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159912", "指数");//10   159912  深300ETF        -13.28%   0.77          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517780", "指数");//11   517780  红300ETF        -13.56%   0.20          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("562310", "沪深300成长ETF");//22.25   	-0.76%


        INDEX_ALL_CN.put("515190", "指数");//1    515190  中银证券500ETF  -3.71%    0.68          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512260", "指数");//2    512260  中证500低波ETF  -4.35%    1.11          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515550", "指数");//3    515550  中融中证500ETF  -4.54%    0.35          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510440", "指数");//4    510440  500沪市ETF      -5.13%    0.41          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159617", "指数");//5    159617  500价值ETF      -5.18%    2.92          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510570", "指数");//6    510570  兴业中证500ETF  -5.83%    0.10          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515590", "指数");//7    515590  500等权ETF      -6.01%    0.34          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510590", "指数");//8    510590  平安中证500ETF  -6.05%    5.62          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512510", "指数");//9    512510  中证500指数ETF  -6.06%    5.15          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510560", "指数");//10   510560  国寿500ETF      -6.16%    2.34          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("561550", "指数");//11   561550  500增强ETF      -6.24%    8.08          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("560100", "指数");//12   560100  中证500增强ETF  -6.30%    1.49          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159982", "指数");//13   159982  中证500ETF鹏华  -6.45%    3.80          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159968", "指数");//14   159968  中证500ETF博时  -6.46%    7.68          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159820", "指数");//15   159820  中证500ETF天弘  -6.46%    23.29         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510580", "指数");//16   510580  中证500ETF易方达-6.49%    19.97         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515530", "指数");//17   515530  泰康中证500ETF  -6.54%    0.66          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("515510", "指数");//18   515510  500成长ETF      -6.65%    0.13          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510550", "指数");//19   510550  方正中证500ETF  -6.67%    0.23          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510510", "指数");//20   510510  中证500ETF基金  -6.68%    25.30         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("512500", "指数");//21   512500  500ETF基金      -6.70%    38.14         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159922", "指数");//22   159922  中证500ETF      -6.70%    66.77         2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510500", "指数");//23   510500  中证500ETF      -6.71%    422.00        2022-07-21    2022-10-21
        INDEX_ALL_CN.put("561350", "指数");//24   561350  国泰中证500ETF  -6.75%    1.92          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("510530", "指数");//25   510530  工银中证500ETF  -6.84%    2.68          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159610", "指数");//26   159610  500ETF增强      -7.56%    6.64          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159606", "指数");//27   159606  中证500成长ETF  -8.75%    6.55          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159932", "指数");//28   159932  中证500深ETF    -8.92%    0.33          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("560500", "指数");//29   560500  500质量成长ETF  -9.00%    1.00          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517010", "指数");//30   517010  沪港深500ETF指数-12.63%   0.42          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517080", "指数");//31   517080  沪港深500ETF基金-13.14%   4.80          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517100", "指数");//32   517100  AH500ETF        -13.25%   3.34          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("517000", "指数");//33   517000  沪港深500ETF    -13.50%   4.87          2022-07-21    2022-10-21
        INDEX_ALL_CN.put("159999", "永赢中证500ETF");//0.45    	0.6%
        INDEX_ALL_CN.put("159620", "500成长ETF    ");//0.33    	0.51%
        INDEX_ALL_CN.put("561150", "500ESGETF     ");//0.10    	0.4%
        INDEX_ALL_CN.put("517060", "沪港深ETF500  ");//0.19    	null%
        INDEX_ALL_CN.put("159935", "景顺中证500ETF");//0.72    	null%

        INDEX_ALL_CN.put("517090", "共赢ETF       ");//0.59    	1.1%
        INDEX_ALL_CN.put("159719", "开放共赢ETF   ");//0.33    	0.7%
        INDEX_ALL_CN.put("517180", "开放共赢ETF   ");//0.39    	0.59%


        INDEX_ALL_CN.put("515160", "MSCI中国ETF招商");//6.17    	0.25%
        INDEX_ALL_CN.put("512280", "景顺MSCIA股ETF");//0.85    	0.21%
        INDEX_ALL_CN.put("515770", "上投摩根MSCIAETF");//1.12    	0.0%
        INDEX_ALL_CN.put("512390", "平安MSCI低波ETF");//2.72    	0.0%
        INDEX_ALL_CN.put("512990", "MSCIA股ETF    ");//2.94    	-0.07%
        INDEX_ALL_CN.put("512380", "MSCI中国ETF   ");//1.98    	-0.16%
        INDEX_ALL_CN.put("512160", "MSCI中国A股ETF");//4.02    	-0.22%
        INDEX_ALL_CN.put("512180", "MSCIA股ETF基金");//1.33    	-0.22%
        INDEX_ALL_CN.put("515780", "浦银MSCI中国ETF");//1.14    	-0.3%
        INDEX_ALL_CN.put("512090", "MSCIA股ETF易方达");//4.74    	-0.34%
        INDEX_ALL_CN.put("512520", "MSCIETF       ");//5.19    	-0.44%
        INDEX_ALL_CN.put("512320", "工银MSCI中国ETF");//0.31    	-0.46%
        INDEX_ALL_CN.put("515910", "质量ETF       ");//2.84    	-0.47%
        INDEX_ALL_CN.put("159621", "MSCIESGETF    ");//1.78    	-0.53%
        INDEX_ALL_CN.put("515520", "MSCI价值100ETF");//0.28    	null%
        INDEX_ALL_CN.put("512920", "MSCIETF新华   ");//0.11    	null%
        INDEX_ALL_CN.put("512360", "平安MSCI国际ETF");//0.83    	null%


    }

    public static Map<String, String> INDEX_ALL = new HashMap<>();//指数-全部-etf

    static {
        INDEX_ALL.putAll(INDEX_ALL_NOT_CN);
        INDEX_ALL.putAll(INDEX_ALL_CN);
        INDEX_ALL.putAll(INDEX_ALL_CN_H);
    }


    /**
     * 科技-最少元素
     */
    public static Map<String, String> KEJI = new HashMap<>();


    static {
//        KEJI.put("159967", "创成长ETF     ");//29.98   	0.15
        KEJI.put("515790", "光伏ETF       ");//147.52  	-0.18
        KEJI.put("515030", "新能源车ETF   ");//110.75  	-0.23
//        KEJI.put("515050", "5GETF         ");//99.94   	-0.42
        KEJI.put("516110", "汽车ETF       ");//9.23    	-0.81
        KEJI.put(" ", "芯片ETF       ");//205.39  	-0.94
        KEJI.put("513050", "中概互联网ETF ");//367.01  	-1.43
        KEJI.put("513330", "恒生互联网ETF ");//246.99  	-1.67

        KEJI.put("512660", "军工ETF       ");//139.20  	1.74
        //4     512670    国防ETF         2.69%     -0.20%    22.58         2022-08-25    2022-09-23


        KEJI.put("513360", "教育ETF");//513360  教育ETF         4.50%     1.95%     5.19          2022-07-21    2022-10-21

        KEJI.put("159546", "集成电路ETF           ");//    市值：1.50      累涨：68.66     20.35     20.70     31.14     16.66     1
        KEJI.put("515050", "5G通信ETF             ");//    市值：64.96     累涨：60.00     19.37     20.46     20.17     8.23      3
        KEJI.put("588890", "科创芯片ETF南方       ");//    市值：4.78      累涨：59.52     16.09     15.91     29.65     17.96     4

        KEJI.put("517390", "云计算沪港深ETF       ");//    市值：3.41      累涨：72.46     13.31     20.62     43.81     14.22     1
        KEJI.put("516000", "数据ETF               ");//    市值：5.18      累涨：71.21     14.74     23.63     40.37     13.13     2
//        KEJI.put("515400", "大数据ETF             ");//    市值：20.23     累涨：70.43     14.95     22.59     40.12     12.74     3
//        KEJI.put("562570", "信创ETF               ");//    市值：4.26      累涨：70.36     12.83     23.69     42.50     12.75     4

//        etf.put("515230", "软件ETF       ");//3.35    	3.02
//        etf.put("515400", "大数据ETF     ");//2.32    	3.02
//        etf.put("159899", "软件基金ETF   ");//1.12    	2.89
//        etf.put("516000", "大数据50ETF   ");//0.56    	2.84
//        etf.put("516700", "大数据产业ETF ");//0.24    	2.81
//        etf.put("159852", "软件ETF       ");//2.72    	2.76
//        etf.put("159739", "大数据ETF     ");//0.72    	2.75
//        etf.put("560660", "云50ETF       ");//1.30    	2.7
//        etf.put("516630", "云计算50ETF   ");//0.70    	2.7
//        etf.put("159890", "云计算ETF     ");//0.41    	2.61
//        etf.put("159998", "计算机ETF     ");//18.80   	2.56
//        etf.put("512720", "计算机ETF     ");//10.11   	2.56
//        etf.put("516510", "云计算ETF     ");//1.88    	2.37
//        etf.put("512930", "AIETF         ");//1.89    	2.06
//        etf.put("515070", "人工智能AIETF ");//6.33    	1.96
//        etf.put("159702", "AIETF         ");//0.20    	1.69
//        etf.put("159738", "沪港深云计算ETF");//0.75    	1.44
//        etf.put("517390", "云计算沪港深ETF");//0.55    	1.08

//        KEJI.put("513180", "118.13");//恒生科技指数ETF
//        KEJI.put("512760", "135.48");//芯片ETF
//        KEJI.put("512480", "124.78");//半导体ETF

//        KEJI.put("515700", "66.24");//新能车ETF
//        KEJI.put("513130", "65.51");//恒生科技ETF
//        KEJI.put("512710", "49.38");//军工龙头ETF
//        KEJI.put("512680", "37.29");//军工ETF基金
//        KEJI.put("159605", "36.09");//中概互联ETF
//        KEJI.put("515000", "35.76");//科技ETF
//        KEJI.put("562990", "33.72");//碳中和100ETF
//        KEJI.put("159790", "32.40");//碳中和ETF
//        KEJI.put("513010", "29.62");//恒生科技30ETF
//        KEJI.put("513550", "29.04");//港股通50ETF
//        KEJI.put("512670", "28.01");//国防ETF
//        KEJI.put("516160", "24.50");//新能源ETF
//        KEJI.put("159639", "23.64");//碳中和ETF南方
//        KEJI.put("159939", "23.07");//信息技术ETF
//        KEJI.put("512580", "22.92");//碳中和龙头ETF
//        KEJI.put("561190", "21.79");//双碳ETF
//        KEJI.put("159994", "21.75");//5GETF
//        KEJI.put("513660", "20.86");//恒生ETF
//        KEJI.put("159801", "20.52");//芯片龙头ETF
//        KEJI.put("159755", "20.51");//电池ETF
//        KEJI.put("159792", "20.10");//港股通互联网ETF
//        KEJI.put("517160", "18.81");//长江保护主题ETF
//        KEJI.put("159998", "18.65");//计算机ETF
//        KEJI.put("517330", "18.39");//长江保护ETF
//        KEJI.put("159813", "17.84");//半导体ETF
//        KEJI.put("159806", "17.15");//新能源车ETF
//        KEJI.put("513980", "16.39");//港股科技50ETF
//        KEJI.put("159819", "15.01");//人工智能ETF
//        KEJI.put("560550", "14.98");//碳中和ETF环交所
//        KEJI.put("515880", "13.86");//通信ETF
//        KEJI.put("159997", "12.91");//电子ETF
//        KEJI.put("159857", "12.49");//光伏ETF
//        KEJI.put("588330", "11.38");//双创龙头ETF
//        KEJI.put("159740", "10.19");//恒生科技ETF
    }

    public static Map<String, String> KEJI_ALL = new HashMap<>();

    static {
        KEJI_ALL.put("159852", "科技");//1    159852  软件ETF         -1.38%    3.11          2022-07-21    2022-10-21
        KEJI_ALL.put("159899", "科技");//2    159899  软件基金ETF     -2.46%    1.14          2022-07-21    2022-10-21
        KEJI_ALL.put("515230", "科技");//3    515230  软件ETF         -2.85%    4.31          2022-07-21    2022-10-21

        KEJI_ALL.put("560660", "科技");//1    560660  云50ETF         -2.82%    1.31          2022-07-21    2022-10-21
        KEJI_ALL.put("516630", "科技");//2    516630  云计算50ETF     -3.96%    0.71          2022-07-21    2022-10-21
        KEJI_ALL.put("159890", "科技");//3    159890  云计算ETF       -4.59%    0.44          2022-07-21    2022-10-21
        KEJI_ALL.put("516510", "科技");//4    516510  云计算ETF       -4.67%    1.92          2022-07-21    2022-10-21
        KEJI_ALL.put("159738", "科技");//5    159738  沪港深云计算ETF -10.05%   0.75          2022-07-21    2022-10-21
        KEJI_ALL.put("517390", "科技");//6    517390  云计算沪港深ETF -10.62%   0.55          2022-07-21    2022-10-21

        KEJI_ALL.put("512720", "科技");//1    512720  计算机ETF       -4.18%    10.59         2022-07-21    2022-10-21
        KEJI_ALL.put("159998", "科技");//2    159998  计算机ETF       -4.73%    19.05         2022-07-21    2022-10-21

        KEJI_ALL.put("159739", "科技");//1    159739  大数据ETF       -4.44%    0.73          2022-07-21    2022-10-21
        KEJI_ALL.put("515400", "科技");//2    515400  大数据ETF       -7.25%    2.61          2022-07-21    2022-10-21
        KEJI_ALL.put("516000", "科技");//3    516000  大数据50ETF     -7.45%    0.55          2022-07-21    2022-10-21
        KEJI_ALL.put("516700", "科技");//4    516700  大数据产业ETF   -7.64%    0.24          2022-07-21    2022-10-21

        KEJI_ALL.put("588260", "科技");//1    588260  科创信息ETF     -3.47%    1.80          2022-07-21    2022-10-21
        KEJI_ALL.put("588100", "科技");//2    588100  科创信息技术ETF -3.50%    3.88          2022-07-21    2022-10-21
        KEJI_ALL.put("512330", "科技");//1    512330  信息科技ETF     -4.56%    4.53          2022-07-21    2022-10-21
        KEJI_ALL.put("159613", "科技");//1    159613  信息安全ETF     -5.30%    1.36          2022-07-21    2022-10-21
        KEJI_ALL.put("510090", "科技");//2    510090  ESGETF基金      -5.35%    0.69          2022-07-21    2022-10-21
        KEJI_ALL.put("159717", "科技");//23   159717  ESGETF          -11.72%   0.48          2022-07-21    2022-10-21
        KEJI_ALL.put("159939", "科技");//3    159939  信息技术ETF     -8.10%    21.91         2022-07-21    2022-10-21

        KEJI_ALL.put("516100", "科技");//1    516100  互联网金融ETF   -4.15%    0.55          2022-07-21    2022-10-21
        KEJI_ALL.put("159851", "科技");//2    159851  金融科技ETF     -4.37%    2.07          2022-07-21    2022-10-21
        KEJI_ALL.put("516860", "科技");//3    516860  金融科技ETF     -4.96%    0.33          2022-07-21    2022-10-21

        KEJI_ALL.put("562350", "科技");//1    562350  电力指数ETF     -5.15%    0.50          2022-07-21    2022-10-21
        KEJI_ALL.put("561560", "科技");//2    561560  电力ETF         -5.18%    0.89          2022-07-21    2022-10-21
        KEJI_ALL.put("159611", "科技");//3    159611  电力ETF         -5.29%    16.73         2022-07-21    2022-10-21
        KEJI_ALL.put("561700", "科技");//4    561700  电力ETF基金     -5.29%    1.36          2022-07-21    2022-10-21
        KEJI_ALL.put("159625", "科技");//5    159625  绿色电力ETF     -8.66%    3.17          2022-07-21    2022-10-21

        KEJI_ALL.put("513360", "科技");//1    513360  教育ETF         4.50%     5.19          2022-07-21    2022-10-21

        KEJI_ALL.put("159777", "科技");//1    159777  创科技ETF基金   -6.42%    0.14          2022-07-21    2022-10-21

        KEJI_ALL.put("510160", "科技");//1    510160  产业升级ETF     -7.66%    2.33          2022-07-21    2022-10-21
        KEJI_ALL.put("516800", "科技");//2    516800  智能制造ETF     -7.96%    2.26          2022-07-21    2022-10-21

        KEJI_ALL.put("515880", "科技");//1    515880  通信ETF         -9.64%    13.66         2022-07-21    2022-10-21
        KEJI_ALL.put("159909", "科技");//2    159909  TMT50ETF        -9.80%    1.57          2022-07-21    2022-10-21
        KEJI_ALL.put("159811", "科技");//1    159811  5G50ETF         -12.62%   2.15          2022-07-21    2022-10-21
        KEJI_ALL.put("159994", "科技");//22   159994  5GETF           -15.71%   18.29         2022-07-21    2022-10-21
        KEJI_ALL.put("515050", "科技");//2    515050  5GETF           -15.99%   81.14         2022-07-21    2022-10-21

        KEJI_ALL.put("515750", "科技");//1    515750  科技50ETF       -8.03%    5.67          2022-07-21    2022-10-21
        KEJI_ALL.put("515860", "科技");//4    515860  科技ETF基金     -8.13%    2.02          2022-07-21    2022-10-21
        KEJI_ALL.put("515580", "科技");//1    515580  科技100ETF      -8.79%    6.00          2022-07-21    2022-10-21
        KEJI_ALL.put("512220", "科技");//2    512220  科技150ETF      -9.16%    2.53          2022-07-21    2022-10-21
        KEJI_ALL.put("516050", "科技");//3    516050  科技龙头ETF     -9.23%    5.11          2022-07-21    2022-10-21
        KEJI_ALL.put("515000", "科技");//4    515000  科技ETF         -9.41%    32.46         2022-07-21    2022-10-21
        KEJI_ALL.put("159853", "科技");//5    159853  科技100ETF      -9.74%    0.32          2022-07-21    2022-10-21
        KEJI_ALL.put("517960", "科技");//6    517960  科技AHETF       -9.87%    1.61          2022-07-21    2022-10-21
        KEJI_ALL.put("159987", "科技");//7    159987  科技创新ETF     -9.97%    0.53          2022-07-21    2022-10-21
        KEJI_ALL.put("515200", "科技");//1    515200  创新100ETF      -10.10%   2.04          2022-07-21    2022-10-21
        KEJI_ALL.put("517360", "科技");//8    517360  沪港深科技ETF   -10.26%   0.61          2022-07-21    2022-10-21
        KEJI_ALL.put("560990", "科技");//9    560990  中金科技先锋ETF -11.40%   0.73          2022-07-21    2022-10-21
        KEJI_ALL.put("159807", "科技");//10   159807  科技ETF         -11.47%   5.30          2022-07-21    2022-10-21


        KEJI_ALL.put("512670", "科技");//1    512670  国防ETF         -3.79%    22.96         2022-07-21    2022-10-21
        KEJI_ALL.put("512560", "科技");//2    512560  军工ETF易方达   -5.28%    6.26          2022-07-21    2022-10-21
        KEJI_ALL.put("512810", "科技");//3    512810  国防军工ETF     -5.38%    4.28          2022-07-21    2022-10-21
        KEJI_ALL.put("512680", "科技");//4    512680  军工ETF基金     -5.44%    32.91         2022-07-21    2022-10-21
        KEJI_ALL.put("512660", "科技");//5    512660  军工ETF         -5.50%    113.85        2022-07-21    2022-10-21
        KEJI_ALL.put("512710", "科技");//6    512710  军工龙头ETF     -5.94%    41.86         2022-07-21    2022-10-21

        KEJI_ALL.put("516580", "科技");//1    516580  新能源主题ETF   -17.48%   1.08          2022-07-21    2022-10-21
        KEJI_ALL.put("159875", "科技");//2    159875  新能源ETF       -17.72%   4.69          2022-07-21    2022-10-21
        KEJI_ALL.put("516850", "科技");//3    516850  新能源80ETF     -18.10%   0.62          2022-07-21    2022-10-21
        KEJI_ALL.put("516090", "科技");//4    516090  新能源ETF易方达 -18.20%   3.89          2022-07-21    2022-10-21
        KEJI_ALL.put("516160", "科技");//7    516160  新能源ETF       -18.50%   25.28         2022-07-21    2022-10-21
        KEJI_ALL.put("159752", "科技");//10   159752  新能源龙头ETF   -19.90%   2.04          2022-07-21    2022-10-21
        KEJI_ALL.put("512770", "科技");//1    512770  战略新兴ETF     -17.95%   2.87          2022-07-21    2022-10-21


        KEJI_ALL.put("561910", "科技");//5    561910  电池ETF         -18.43%   2.78          2022-07-21    2022-10-21
        KEJI_ALL.put("562880", "科技");//6    562880  电池ETF基金     -18.50%   1.99          2022-07-21    2022-10-21
        KEJI_ALL.put("561160", "科技");//8    561160  锂电池ETF       -18.65%   6.34          2022-07-21    2022-10-21
        KEJI_ALL.put("159796", "科技");//9    159796  电池50ETF       -18.77%   7.00          2022-07-21    2022-10-21
        KEJI_ALL.put("516270", "科技");//11   516270  新能源50ETF     -20.29%   1.46          2022-07-21    2022-10-21
        KEJI_ALL.put("159840", "科技");//12   159840  锂电池ETF       -22.53%   7.03          2022-07-21    2022-10-21
        KEJI_ALL.put("159757", "科技");//13   159757  电池30ETF       -22.60%   4.58          2022-07-21    2022-10-21
        KEJI_ALL.put("159767", "科技");//14   159767  电池龙头ETF     -22.61%   1.14          2022-07-21    2022-10-21
        KEJI_ALL.put("159775", "科技");//15   159775  新能源车电池ETF -23.58%   0.42          2022-07-21    2022-10-21
        KEJI_ALL.put("159755", "科技");//16   159755  电池ETF         -23.60%   20.73         2022-07-21    2022-10-21

        KEJI_ALL.put("513050", "科技");//5    513050  中概互联网ETF   -18.72%   324.44        2022-07-21    2022-10-21
        KEJI_ALL.put("517280", "科技");//3    517280  网购ETF         -20.41%   0.39          2022-07-21    2022-10-21
        KEJI_ALL.put("513330", "科技");//6    513330  恒生互联网ETF   -24.21%   200.79        2022-07-21    2022-10-21
        KEJI_ALL.put("159605", "科技");//7    159605  中概互联ETF     -24.67%   32.65         2022-07-21    2022-10-21
        KEJI_ALL.put("513220", "科技");//8    513220  全球互联ETF     -25.00%   1.07          2022-07-21    2022-10-21
        KEJI_ALL.put("159607", "科技");//9    159607  中概互联网ETF   -25.15%   12.26         2022-07-21    2022-10-21
        KEJI_ALL.put("159792", "科技");//10   159792  港股通互联网ETF -26.89%   18.75         2022-07-21    2022-10-21
        KEJI_ALL.put("513770", "科技");//11   513770  港股互联网ETF   -27.40%   3.62          2022-07-21    2022-10-21

        KEJI_ALL.put("159861", "科技");//1    159861  碳中和50ETF     -15.92%   3.54          2022-07-21    2022-10-21
        KEJI_ALL.put("159642", "科技");//2    159642  碳中和100ETF    -16.13%   2.35          2022-07-21    2022-10-21
        KEJI_ALL.put("512580", "科技");//3    512580  碳中和龙头ETF   -16.22%   16.89         2022-07-21    2022-10-21
        KEJI_ALL.put("159885", "科技");//4    159885  碳中和ETF基金   -16.31%   4.98          2022-07-21    2022-10-21
        KEJI_ALL.put("159639", "科技");//5    159639  碳中和ETF南方   -16.41%   17.88         2022-07-21    2022-10-21
        KEJI_ALL.put("560550", "科技");//6    560550  碳中和ETF环交所 -16.46%   11.69         2022-07-21    2022-10-21
        KEJI_ALL.put("562990", "科技");//7    562990  碳中和100ETF    -16.48%   25.99         2022-07-21    2022-10-21
        KEJI_ALL.put("516070", "科技");//8    516070  碳中和50ETF     -16.49%   3.78          2022-07-21    2022-10-21
        KEJI_ALL.put("561190", "科技");//9    561190  双碳ETF         -16.50%   16.45         2022-07-21    2022-10-21
        KEJI_ALL.put("159640", "科技");//10   159640  碳中和龙头ETF   -16.55%   5.39          2022-07-21    2022-10-21
        KEJI_ALL.put("562300", "科技");//11   562300  碳中和ETF基金   -16.60%   1.19          2022-07-21    2022-10-21
        KEJI_ALL.put("560060", "科技");//12   560060  碳中和ETF       -16.68%   5.25          2022-07-21    2022-10-21
        KEJI_ALL.put("159790", "科技");//13   159790  碳中和ETF       -16.90%   28.43         2022-07-21    2022-10-21
        KEJI_ALL.put("560560", "科技");//14   560560  泰康碳中和ETF   -16.95%   1.18          2022-07-21    2022-10-21
        KEJI_ALL.put("159641", "双碳ETF       ");//6.01    	-0.7%

        KEJI_ALL.put("159729", "科技");//1    159729  互联网ETF       -16.23%   1.16          2022-07-21    2022-10-21
        KEJI_ALL.put("517050", "科技");//2    517050  互联网50ETF     -16.53%   5.29          2022-07-21    2022-10-21
        KEJI_ALL.put("159856", "科技");//3    159856  互联网龙头ETF   -16.79%   4.03          2022-07-21    2022-10-21
        KEJI_ALL.put("517200", "科技");//4    517200  互联网ETF       -16.93%   1.46          2022-07-21    2022-10-21

        KEJI_ALL.put("516520", "科技");//3    516520  智能驾驶ETF     -18.18%   1.54          2022-07-21    2022-10-21
        KEJI_ALL.put("516110", "科技");//6    516110  汽车ETF         -21.08%   5.57          2022-07-21    2022-10-21
        KEJI_ALL.put("159720", "科技");//7    159720  智能电动车ETF   -21.64%   0.82          2022-07-21    2022-10-21
        KEJI_ALL.put("516380", "科技");//8    516380  智能电动车ETF   -21.73%   1.36          2022-07-21    2022-10-21
        KEJI_ALL.put("516590", "科技");//9    516590  智能汽车50ETF   -21.83%   1.57          2022-07-21    2022-10-21
        KEJI_ALL.put("560000", "科技");//10   560000  智慧电车ETF     -21.88%   0.19          2022-07-21    2022-10-21
        KEJI_ALL.put("515700", "科技");//11   515700  新能车ETF       -21.93%   56.81         2022-07-21    2022-10-21
        KEJI_ALL.put("159824", "科技");//12   159824  新能车ETF       -21.96%   2.56          2022-07-21    2022-10-21
        KEJI_ALL.put("516660", "科技");//13   516660  新能汽车ETF     -22.03%   4.39          2022-07-21    2022-10-21
        KEJI_ALL.put("516390", "科技");//14   516390  新能源汽车ETF   -22.05%   3.84          2022-07-21    2022-10-21
        KEJI_ALL.put("159710", "科技");//15   159710  智能电车ETF     -22.37%   0.50          2022-07-21    2022-10-21
        KEJI_ALL.put("515030", "科技");//16   515030  新能源车ETF     -22.50%   96.49         2022-07-21    2022-10-21
        KEJI_ALL.put("159806", "科技");//17   159806  新能源车ETF     -22.67%   15.30         2022-07-21    2022-10-21
        KEJI_ALL.put("159637", "新能源车龙头ETF");//6.85    	-0.64%

        KEJI_ALL.put("159872", "科技");//1    159872  智能网联汽车ETF -15.25%   0.50          2022-07-21    2022-10-21
        KEJI_ALL.put("159889", "科技");//2    159889  智能汽车ETF     -18.33%   1.04          2022-07-21    2022-10-21
        KEJI_ALL.put("159888", "科技");//3    159888  智能车ETF       -18.92%   1.08          2022-07-21    2022-10-21
        KEJI_ALL.put("159795", "科技");//4    159795  智能车ETF基金   -19.07%   0.70          2022-07-21    2022-10-21
        KEJI_ALL.put("515250", "科技");//5    515250  智能汽车ETF     -19.07%   6.32          2022-07-21    2022-10-21

        KEJI_ALL.put("159723", "科技");//24   159723  科技龙头ETF     -15.77%   0.48          2022-07-21    2022-10-21

        KEJI_ALL.put("159778", "科技");//13   159778  工业互联ETF     -13.62%   0.51          2022-07-21    2022-10-21
        KEJI_ALL.put("516320", "科技");//3    516320  高端装备ETF     -14.27%   0.51          2022-07-21    2022-10-21
        KEJI_ALL.put("562910", "科技");//5    562910  高端制造ETF     -14.32%   0.51          2022-07-21    2022-10-21
        KEJI_ALL.put("516960", "科技");//10   516960  机械ETF         -14.93%   1.09          2022-07-21    2022-10-21
        KEJI_ALL.put("159886", "科技");//25   159886  机械ETF         -15.89%   0.54          2022-07-21    2022-10-21
        KEJI_ALL.put("159667", "工业母机ETF   ");//3.12    	0.99%
        KEJI_ALL.put("159663", "机床ETF       ");//1.14    	0.58%
        KEJI_ALL.put("159638", "高端装备ETF   ");//19.62   	0.21%

        KEJI_ALL.put("510120", "科技");//9    510120  非周期ETF       -13.25%   0.13          2022-07-21    2022-10-21

        KEJI_ALL.put("516330", "科技");//1    516330  物联网ETF       -12.38%   0.50          2022-07-21    2022-10-21
        KEJI_ALL.put("516260", "科技");//2    516260  物联网50ETF     -12.56%   1.04          2022-07-21    2022-10-21
        KEJI_ALL.put("159701", "科技");//3    159701  物联网ETF招商   -12.73%   0.27          2022-07-21    2022-10-21
        KEJI_ALL.put("159709", "科技");//4    159709  物联网ETF工银   -12.88%   1.02          2022-07-21    2022-10-21
        KEJI_ALL.put("159896", "科技");//5    159896  物联网龙头ETF   -13.00%   0.68          2022-07-21    2022-10-21
        KEJI_ALL.put("159895", "科技");//6    159895  物联网50ETF     -13.07%   0.38          2022-07-21    2022-10-21
        KEJI_ALL.put("517660", "科技");//11   517660  物联网沪港深ETF -20.15%   0.35          2022-07-21    2022-10-21

        KEJI_ALL.put("159819", "科技");//7    159819  人工智能ETF     -13.33%   13.74         2022-07-21    2022-10-21
        KEJI_ALL.put("515980", "科技");//8    515980  人工智能ETF     -13.48%   3.02          2022-07-21    2022-10-21
        KEJI_ALL.put("515070", "科技");//9    515070  人工智能AIETF   -13.54%   6.32          2022-07-21    2022-10-21
        KEJI_ALL.put("517800", "科技");//10   517800  人工智能50ETF   -16.06%   0.43          2022-07-21    2022-10-21
        KEJI_ALL.put("562500", "科技");//1    562500  机器人ETF       -12.89%   1.71          2022-07-21    2022-10-21
        KEJI_ALL.put("512930", "科技");//2    512930  AIETF           -12.99%   1.88          2022-07-21    2022-10-21
        KEJI_ALL.put("159702", "科技");//3    159702  AIETF           -14.01%   0.19          2022-07-21    2022-10-21

        KEJI_ALL.put("159863", "科技");//1    159863  光伏ETF基金     -12.00%   2.76          2022-07-21    2022-10-21
        KEJI_ALL.put("159609", "科技");//2    159609  光伏龙头ETF     -12.30%   1.97          2022-07-21    2022-10-21
        KEJI_ALL.put("159864", "科技");//3    159864  光伏50ETF       -12.37%   4.23          2022-07-21    2022-10-21
        KEJI_ALL.put("515790", "科技");//4    515790  光伏ETF         -12.40%   139.43        2022-07-21    2022-10-21
        KEJI_ALL.put("516180", "科技");//5    516180  光伏ETF平安     -12.50%   1.07          2022-07-21    2022-10-21
        KEJI_ALL.put("516880", "科技");//6    516880  光伏50ETF       -12.61%   9.21          2022-07-21    2022-10-21
        KEJI_ALL.put("159618", "科技");//7    159618  光伏ETF华安     -12.70%   2.01          2022-07-21    2022-10-21
        KEJI_ALL.put("516290", "科技");//8    516290  光伏ETF基金     -12.75%   2.69          2022-07-21    2022-10-21
        KEJI_ALL.put("159857", "科技");//9    159857  光伏ETF         -12.93%   12.50         2022-07-21    2022-10-21

        KEJI_ALL.put("159997", "科技");//1    159997  电子ETF         -12.10%   11.25         2022-07-21    2022-10-21
        KEJI_ALL.put("515260", "科技");//2    515260  电子ETF         -12.12%   4.77          2022-07-21    2022-10-21
        KEJI_ALL.put("515320", "科技");//3    515320  电子50ETF       -12.62%   1.96          2022-07-21    2022-10-21
        KEJI_ALL.put("561310", "科技");//4    561310  消电ETF         -13.99%   1.10          2022-07-21    2022-10-21

        KEJI_ALL.put("512480", "科技");//1    512480  半导体ETF       -11.87%   126.38        2022-07-21    2022-10-21
        KEJI_ALL.put("516640", "科技");//2    516640  芯片龙头ETF     -12.55%   7.47          2022-07-21    2022-10-21
        KEJI_ALL.put("512760", "科技");//3    512760  芯片ETF         -12.64%   114.18        2022-07-21    2022-10-21
        KEJI_ALL.put("516920", "科技");//4    516920  芯片ETF基金     -12.82%   3.49          2022-07-21    2022-10-21
        KEJI_ALL.put("516350", "科技");//5    516350  芯片50ETF       -12.97%   1.45          2022-07-21    2022-10-21
        KEJI_ALL.put("159813", "科技");//6    159813  半导体ETF       -14.78%   18.13         2022-07-21    2022-10-21
        KEJI_ALL.put("159801", "科技");//7    159801  芯片龙头ETF     -15.00%   17.82         2022-07-21    2022-10-21
        KEJI_ALL.put("159995", "科技");//8    159995  芯片ETF         -15.24%   180.29        2022-07-21    2022-10-21
        KEJI_ALL.put("588290", "科创板芯片ETF ");//0.89    	0.64%
        KEJI_ALL.put("588200", "科创芯片ETF   ");//1.99    	0.63%

        KEJI_ALL.put("515870", "科技");//1    515870  先进制造ETF     -11.41%   0.37          2022-07-21    2022-10-21
        KEJI_ALL.put("562360", "科技");//2    562360  机器人50ETF     -11.76%   0.85          2022-07-21    2022-10-21
        KEJI_ALL.put("159770", "科技");//11   159770  机器人ETF       -12.22%   1.14          2022-07-21    2022-10-21

        KEJI_ALL.put("517330", "科技");//1    517330  长江保护ETF     -11.31%   16.71         2022-07-21    2022-10-21
        KEJI_ALL.put("517160", "科技");//2    517160  长江保护主题ETF -11.36%   17.16         2022-07-21    2022-10-21
        KEJI_ALL.put("517850", "科技");//1    517850  张江ETF         -16.00%   2.31          2022-07-21    2022-10-21

        KEJI_ALL.put("560800", "科技");//1    560800  数字经济ETF     -10.58%   5.47          2022-07-21    2022-10-21
        KEJI_ALL.put("159658", "数字经济ETF   ");//1.24    	-0.09%


        KEJI_ALL.put("159822", "科技");//4    159822  新经济ETF       -19.88%   1.96          2022-07-21    2022-10-21
        KEJI_ALL.put("516710", "科技");//6    516710  新材料50ETF     -20.48%   1.23          2022-07-21    2022-10-21
        KEJI_ALL.put("516480", "科技");//7    516480  新材料ETF基金   -20.50%   0.19          2022-07-21    2022-10-21
        KEJI_ALL.put("516360", "科技");//8    516360  新材料ETF       -20.50%   1.21          2022-07-21    2022-10-21
        KEJI_ALL.put("159761", "科技");//9    159761  新材料50ETF     -20.59%   2.18          2022-07-21    2022-10-21
        KEJI_ALL.put("516890", "科技");//10   516890  新材料ETF平安   -20.65%   0.47          2022-07-21    2022-10-21
        KEJI_ALL.put("159703", "科技");//11   159703  新材料ETF       -20.75%   0.48          2022-07-21    2022-10-21
        KEJI_ALL.put("159763", "科技");//3    159763  新材料ETF基金   -21.21%   0.94          2022-07-21    2022-10-21
        KEJI_ALL.put("588160", "科创板新材料ETF");//1.36    	0.19%
        KEJI_ALL.put("588010", "科创新材料ETF ");//1.07    	0.1%

        KEJI_ALL.put("513160", "科技");//1    513160  港股科技30ETF   -21.69%   0.42          2022-07-21    2022-10-21
        KEJI_ALL.put("513320", "科技");//2    513320  恒生新经济ETF   -24.82%   0.48          2022-07-21    2022-10-21
        KEJI_ALL.put("513890", "科技");//3    513890  恒生科技HKETF   -25.15%   1.68          2022-07-21    2022-10-21
        KEJI_ALL.put("159636", "科技");//4    159636  港股通科技30ETF -25.59%   8.41          2022-07-21    2022-10-21
        KEJI_ALL.put("513010", "科技");//5    513010  恒生科技30ETF   -26.85%   32.55         2022-07-21    2022-10-21
        KEJI_ALL.put("513180", "科技");//6    513180  恒生科技指数ETF -26.86%   124.78        2022-07-21    2022-10-21
        KEJI_ALL.put("159751", "科技");//7    159751  港股科技ETF     -26.92%   0.77          2022-07-21    2022-10-21
        KEJI_ALL.put("159741", "科技");//8    159741  恒生科技ETF基金 -26.96%   3.63          2022-07-21    2022-10-21
        KEJI_ALL.put("513860", "科技");//9    513860  港股通科技ETF   -27.26%   3.94          2022-07-21    2022-10-21
        KEJI_ALL.put("513020", "科技");//10   513020  港股科技ETF     -27.32%   1.94          2022-07-21    2022-10-21
        KEJI_ALL.put("513580", "科技");//11   513580  恒生科技ETF基金 -27.68%   6.17          2022-07-21    2022-10-21
        KEJI_ALL.put("159742", "科技");//12   159742  恒生科技指数ETF -27.81%   6.69          2022-07-21    2022-10-21
        KEJI_ALL.put("513130", "科技");//13   513130  恒生科技ETF     -27.82%   62.83         2022-07-21    2022-10-21
        KEJI_ALL.put("159740", "科技");//14   159740  恒生科技ETF     -27.95%   12.75         2022-07-21    2022-10-21
        KEJI_ALL.put("513980", "科技");//15   513980  港股科技50ETF   -28.01%   13.44         2022-07-21    2022-10-21
        KEJI_ALL.put("513150", "科技");//16   513150  港股通科技50ETF -29.06%   1.90          2022-07-21    2022-10-21
        KEJI_ALL.put("513380", "科技");//17   513380  恒生科技基金ETF -29.76%   0.97          2022-07-21    2022-10-21
        KEJI_ALL.put("159750", "科技");//18   159750  香港科技50ETF   -29.88%   0.75          2022-07-21    2022-10-21
        KEJI_ALL.put("159747", "科技");//19   159747  香港科技ETF     -29.90%   2.84          2022-07-21    2022-10-21
        KEJI_ALL.put("513260", "恒生科技ETFQD ");//1.64    	-0.69%


    }

    public static Map<String, String> KEJI_MORE = new HashMap<>();

    static {
//        KEJI_MORE.put("512660", "军工ETF         ");//7    512660  军工ETF         -3.60%    114.18        2022-07-22    2022-10-24
        KEJI_MORE.put("512670", "国防ETF               ");//国防ETF               市值：32.35     累涨：40.87     9.22      15.14     16.51     10.53     8.19      1

        KEJI_MORE.put("513360", "教育ETF         ");//1    513360  教育ETF         5.26%     5.10          2022-07-22    2022-10-24
        KEJI_MORE.put("159852", "软件ETF         ");//2    159852  软件ETF         -0.76%    3.15          2022-07-22    2022-10-24


        KEJI_MORE.put("159998", "计算机ETF       ");//5    159998  计算机ETF       -3.02%    19.23         2022-07-22    2022-10-24
        KEJI_MORE.put("159851", "金融科技ETF     ");//6    159851  金融科技ETF     -3.56%    2.07          2022-07-22    2022-10-24
//        KEJI_MORE.put("510160", "产业升级ETF     ");//8    510160  产业升级ETF     -6.36%    2.33          2022-07-22    2022-10-24
//        KEJI_MORE.put("515400", "大数据ETF       ");//9    515400  大数据ETF       -7.97%    2.58          2022-07-22    2022-10-24
//        KEJI_MORE.put("159939", "信息技术ETF     ");//11   159939  信息技术ETF     -8.93%    22.11         2022-07-22    2022-10-24
//        KEJI_MORE.put("515000", "科技ETF         ");//12   515000  科技ETF         -9.91%    32.49         2022-07-22    2022-10-24
        KEJI_MORE.put("515790", "光伏ETF         ");//13   515790  光伏ETF         -10.86%   140.24        2022-07-22    2022-10-24
        KEJI_MORE.put("560800", "数字经济ETF     ");//14   560800  数字经济ETF     -11.07%   5.49          2022-07-22    2022-10-24
//        KEJI_MORE.put("159819", "人工智能ETF     ");//15   159819  人工智能ETF     -13.55%   13.76         2022-07-22    2022-10-24
//        KEJI_MORE.put("159790", "碳中和ETF       ");//17   159790  碳中和ETF       -15.59%   28.58         2022-07-22    2022-10-24
//        KEJI_MORE.put("516160", "新能源ETF       ");//21   516160  新能源ETF       -16.73%   25.44         2022-07-22    2022-10-24
//        KEJI_MORE.put("515250", "智能汽车ETF     ");//23   515250  智能汽车ETF     -19.31%   6.25          2022-07-22    2022-10-24
        KEJI_MORE.put("515030", "新能源车ETF     ");//24   515030  新能源车ETF     -20.90%   96.47         2022-07-22    2022-10-24
        KEJI_MORE.put("516110", "汽车ETF");//6    516110  汽车ETF         -21.08%   5.57          2022-07-21    2022-10-21
//        KEJI_MORE.put("159755", "电池ETF         ");//25   159755  电池ETF         -21.52%   20.88         2022-07-22    2022-10-24

        KEJI_MORE.put("159546", "集成电路ETF           ");//    市值：1.50      累涨：68.66     20.35     20.70     31.14     16.66     1
        KEJI_MORE.put("515050", "5G通信ETF             ");//    市值：64.96     累涨：60.00     19.37     20.46     20.17     8.23      3
        KEJI_MORE.put("588890", "科创芯片ETF南方       ");//    市值：4.78      累涨：59.52     16.09     15.91     29.65     17.96     4

        KEJI_MORE.put("513560", "香港科技ETF           ");//    市值：5.96      累涨：74.79     11.10     22.59     46.92     14.09     1
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();//资源

    static {
        ZIYUAN.put("515220", "煤炭ETF       ");//51.65   	1.62
        ZIYUAN.put("159930", "能源ETF       ");//2.67    	1.41
//        ZIYUAN.put("515210", "钢铁ETF       ");//17.02   	1.1
        ZIYUAN.put("516150", "稀土ETF基金   ");//24.14   	0.36
        ZIYUAN.put("159870", "化工ETF       ");//7.80    	0.34
        ZIYUAN.put("512400", "有色金属ETF   ");//30.77   	-0.08
        ZIYUAN.put("159865", "养殖ETF       ");//41.80   	0.59
//        ZIYUAN.put("159825", "农业ETF       ");//17.63   	0.41
        ZIYUAN.put("159985", "豆粕ETF");//豆粕ETF	159985	2.43
    }

    public static Map<String, String> ZIYUAN_MORE = new HashMap<>();//资源

    static {
        ZIYUAN_MORE.put("159985", "豆粕ETF         ");//1    159985  豆粕ETF         16.30%    2.90          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159930", "能源ETF         ");//2    159930  能源ETF         9.85%     4.47          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("515220", "煤炭ETF         ");//3    515220  煤炭ETF         5.19%     49.32         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159865", "养殖ETF         ");//4    159865  养殖ETF         -4.04%    36.40         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159825", "农业ETF         ");//5    159825  农业ETF         -10.63%   19.37         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("515210", "钢铁ETF         ");//6    515210  钢铁ETF         -12.25%   14.25         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("512400", "有色金属ETF     ");//7    512400  有色金属ETF     -13.78%   26.69         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("159870", "化工ETF         ");//8    159870  化工ETF         -14.19%   9.56          2022-07-22    2022-10-24
        ZIYUAN_MORE.put("516150", "稀土ETF基金     ");//10   516150  稀土ETF基金     -16.42%   20.58         2022-07-22    2022-10-24
        ZIYUAN_MORE.put("562800", "稀有金属ETF     ");//11   562800  稀有金属ETF     -18.40%   6.70          2022-07-22    2022-10-24
    }

    public static Map<String, String> ZIYUAN_ALL = new HashMap<>();//资源

    static {
        ZIYUAN_ALL.put("561800", "资源");//1    561800  稀有金属ETF基金 -20.92%   0.81          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159608", "资源");//2    159608  稀有金属ETF     -21.54%   1.28          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("562800", "资源");//3    562800  稀有金属ETF     -21.74%   6.53          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("516750", "资源");//5    516750  建材ETF         -17.26%   0.82          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159787", "资源");//6    159787  建材ETF易方达   -17.33%   0.18          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159745", "资源");//7    159745  建材ETF         -17.33%   7.56          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("159715", "资源");//1    159715  稀土ETF易方达   -16.49%   2.59          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159713", "资源");//2    159713  稀土ETF         -16.91%   2.31          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516780", "资源");//3    516780  稀土ETF         -17.03%   8.24          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516150", "资源");//4    516150  稀土ETF基金     -17.10%   20.60         2022-07-21    2022-10-21

        ZIYUAN_ALL.put("516570", "资源");//1    516570  化工行业ETF     -13.83%   0.37          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159870", "资源");//1    159870  化工ETF         -16.21%   9.48          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516120", "资源");//2    516120  化工50ETF       -16.37%   2.03          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516690", "资源");//3    516690  化工产业ETF     -16.46%   0.62          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516220", "资源");//4    516220  化工龙头ETF     -16.46%   1.85          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516020", "资源");//5    516020  化工ETF         -16.79%   3.24          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("159731", "资源");//8    159731  石化ETF         -13.95%   0.27          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("159944", "资源");//4    159944  材料ETF         -13.81%   0.20          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("515090", "资源");//1    515090  可持续发展ETF   -13.07%   1.33          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("515210", "资源");//1    515210  钢铁ETF         -13.25%   14.22         2022-07-21    2022-10-21

        ZIYUAN_ALL.put("562900", "资源");//1    562900  现代农业ETF     -10.30%   0.64          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159827", "资源");//2    159827  农业50ETF       -10.83%   1.10          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516810", "资源");//3    516810  农业50ETF       -10.87%   1.86          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159825", "资源");//4    159825  农业ETF         -11.43%   19.41         2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516550", "资源");//5    516550  农业ETF         -13.06%   1.10          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159616", "农牧ETF       ");//0.94    	-0.22%

        ZIYUAN_ALL.put("510170", "资源");//1    510170  大宗商品ETF     -8.43%    1.83          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("510110", "资源");//1    510110  周期ETF         -7.39%    0.20          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("159865", "资源");//1    159865  养殖ETF         -4.38%    36.39         2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159867", "资源");//2    159867  畜牧ETF         -4.51%    6.07          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516670", "资源");//3    516670  畜牧养殖ETF     -4.55%    4.15          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516760", "资源");//4    516760  养殖ETF         -4.82%    1.69          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("159985", "资源");//1    159985  豆粕ETF         15.76%    2.87          2022-07-21    2022-10-21

        ZIYUAN_ALL.put("159980", "资源");//1    159980  有色ETF         9.69%     2.52          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516650", "资源");//3    516650  有色50ETF       -14.49%   0.34          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159881", "资源");//4    159881  有色60ETF       -14.60%   1.15          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159876", "资源");//5    159876  有色龙头ETF     -14.79%   0.30          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159871", "资源");//6    159871  有色金属ETF     -14.97%   0.51          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("512400", "资源");//7    512400  有色金属ETF     -15.88%   26.48         2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159880", "资源");//8    159880  有色ETF基金     -16.27%   0.50          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("516680", "有色ETF基金   ");//0.18    	null%

        ZIYUAN_ALL.put("159930", "资源");//1    159930  能源ETF         6.54%     4.48          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159945", "资源");//2    159945  能源ETF基金     3.13%     0.58          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("159981", "资源");//3    159981  能源化工ETF     2.71%     3.22          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("510410", "资源");//4    510410  资源ETF         -5.16%    4.41          2022-07-21    2022-10-21
        ZIYUAN_ALL.put("561330", "矿业ETF       ");//0.92    	1.08%

        ZIYUAN_ALL.put("515220", "资源");//1    515220  煤炭ETF         1.60%     49.25         2022-07-21    2022-10-21


    }

    //金融
    public static Map<String, String> JINRONG = new HashMap<>();


    static {
//        JINRONG.put("510880", "红利ETF       ");//166.99  	0.6
        JINRONG.put("512200", "房地产ETF     ");//52.10   	-0.14
        JINRONG.put("512880", "证券ETF       ");//316.81  	-0.22
        JINRONG.put("516970", "基建50ETF     ");//98.25   	-0.27
        JINRONG.put("159611", "电力ETF       ");//12.86   	0.68
        JINRONG.put("512800", "银行ETF       ");//97.45   	-0.47
        JINRONG.put("518880", "黄金ETF       ");//112.54  	-0.55

        //        JINRONG.put("511990", "1532.55");//华宝添益ETF
//        JINRONG.put("511880", "1355.05");//银华日利ETF
//        JINRONG.put("511660", "228.88");//货币ETF建信添益
//        JINRONG.put("512000", "228.39");//券商ETF
//        JINRONG.put("511360", "174.73");//短融ETF
//        JINRONG.put("511850", "92.60");//财富宝ETF
//        JINRONG.put("512900", "82.71");//证券ETF基金
//        JINRONG.put("159937", "74.00");//黄金ETF基金
//        JINRONG.put("515290", "71.88");//银行ETF天弘
//        JINRONG.put("510810", "65.61");//上海国企ETF
//        JINRONG.put("512960", "54.75");//央调ETF
//        JINRONG.put("511030", "52.74");//公司债ETF
//        JINRONG.put("512950", "50.97");//央企改革ETF
//        JINRONG.put("159934", "45.00");//黄金ETF
//        JINRONG.put("159841", "42.78");//证券ETF
//        JINRONG.put("515900", "39.23");//央创ETF
//        JINRONG.put("159972", "39.05");//5年地债ETF
//        JINRONG.put("510230", "33.40");//金融ETF
//        JINRONG.put("512070", "32.99");//证券保险ETF
//        JINRONG.put("159905", "28.74");//深红利ETF
//        JINRONG.put("511810", "25.85");//理财金货币ETF
//        JINRONG.put("512700", "25.62");//银行ETF基金
//        JINRONG.put("159001", "23.99");//货币ETF
//        JINRONG.put("159959", "23.80");//央企ETF
//        JINRONG.put("159940", "19.83");//金融地产ETF
//        JINRONG.put("515180", "18.13");//红利ETF易方达
//        JINRONG.put("159816", "16.92");//0-4地债ETF
//        JINRONG.put("511690", "16.09");//交易货币ETF
//        JINRONG.put("515600", "15.83");//央企创新ETF
//        JINRONG.put("511900", "15.80");//富国货币ETF
//        JINRONG.put("515680", "15.66");//嘉实央企创新ETF
//        JINRONG.put("511700", "15.57");//场内货币ETF
//        JINRONG.put("516950", "14.75");//基建ETF
//        JINRONG.put("159993", "14.65");//龙头券商ETF
//        JINRONG.put("511220", "13.29");//城投债ETF
//        JINRONG.put("511020", "11.94");//活跃国债ETF
//        JINRONG.put("513090", "11.86");//香港证券ETF
    }

    public static Map<String, String> JINRONG_MORE = new HashMap<>();//金融

    static {
        JINRONG_MORE.put("518880", "黄金ETF         ");//1    518880  黄金ETF         5.33%     87.56         2022-07-22    2022-10-24
//        JINRONG_MORE.put("510880", "红利ETF         ");//2    510880  红利ETF         2.19%     140.50        2022-07-22    2022-10-24
//        JINRONG_MORE.put("511880", "银华日利ETF     ");//4    511880  银华日利ETF     0.38%     1364.23       2022-07-22    2022-10-24
//        JINRONG_MORE.put("511030", "公司债ETF       ");//5    511030  公司债ETF       -0.91%    52.42         2022-07-22    2022-10-24
//        JINRONG_MORE.put("511380", "可转债ETF       ");//6    511380  可转债ETF       -3.04%    13.42         2022-07-22    2022-10-24
        JINRONG_MORE.put("512200", "房地产ETF       ");//7    512200  房地产ETF       -3.32%    44.38         2022-07-22    2022-10-24
        JINRONG_MORE.put("159745", "建材ETF         ");//9    159745  建材ETF         -16.28%   7.47          2022-07-22    2022-10-24
        JINRONG_MORE.put("516970", "基建50ETF       ");//11   516970  基建50ETF       -7.90%    90.14         2022-07-22    2022-10-24
        JINRONG_MORE.put("159611", "电力ETF         ");//4    159611  电力ETF         -2.93%    16.67         2022-07-22    2022-10-24
//        JINRONG_MORE.put("510230", "金融ETF         ");//8    510230  金融ETF         -5.72%    31.93         2022-07-22    2022-10-24
        JINRONG_MORE.put("512800", "银行ETF         ");//9    512800  银行ETF         -6.07%    86.00         2022-07-22    2022-10-24
        JINRONG_MORE.put("512880", "证券ETF         ");//10   512880  证券ETF         -7.77%    294.07        2022-07-22    2022-10-24
    }

    public static Map<String, String> JINRONG_ALL = new HashMap<>();

    static {
        JINRONG_ALL.put("516970", "金融");//1    516970  基建50ETF       -9.52%    89.71         2022-07-21    2022-10-21
        JINRONG_ALL.put("159619", "金融");//2    159619  基建ETF         -9.70%    3.55          2022-07-21    2022-10-21
        JINRONG_ALL.put("159635", "金融");//3    159635  基建100ETF      -10.17%   3.45          2022-07-21    2022-10-21
        JINRONG_ALL.put("516950", "金融");//4    516950  基建ETF         -10.37%   11.37         2022-07-21    2022-10-21

        JINRONG_ALL.put("512730", "金融");//1    512730  中证银行ETF     -6.89%    1.72          2022-07-21    2022-10-21
        JINRONG_ALL.put("517900", "金融");//2    517900  银行ETF优选     -7.04%    0.29          2022-07-21    2022-10-21
        JINRONG_ALL.put("516310", "金融");//3    516310  银行ETF易方达   -7.18%    1.54          2022-07-21    2022-10-21
        JINRONG_ALL.put("159887", "金融");//4    159887  银行ETF         -7.25%    3.67          2022-07-21    2022-10-21
        JINRONG_ALL.put("512800", "金融");//5    512800  银行ETF         -7.30%    86.04         2022-07-21    2022-10-21
        JINRONG_ALL.put("515020", "金融");//6    515020  银行ETF华夏     -7.30%    6.26          2022-07-21    2022-10-21
        JINRONG_ALL.put("512700", "金融");//7    512700  银行ETF基金     -7.42%    22.54         2022-07-21    2022-10-21
        JINRONG_ALL.put("515290", "金融");//8    515290  银行ETF天弘     -7.49%    66.95         2022-07-21    2022-10-21
        JINRONG_ALL.put("512820", "金融");//9    512820  银行业ETF       -7.55%    4.79          2022-07-21    2022-10-21
        JINRONG_ALL.put("516210", "金融");//10   516210  银行股ETF       -7.63%    0.43          2022-07-21    2022-10-21
        JINRONG_ALL.put("515280", "金融");//11   515280  银行龙头ETF     -7.76%    0.62          2022-07-21    2022-10-21

        JINRONG_ALL.put("510230", "金融");//1    510230  金融ETF         -7.15%    31.93         2022-07-21    2022-10-21
        JINRONG_ALL.put("512590", "金融");//2    512590  高股息ETF       -7.37%    0.31          2022-07-21    2022-10-21
        JINRONG_ALL.put("513690", "金融");//5    513690  恒生高股息ETF   -7.48%    3.03          2022-07-21    2022-10-21

        JINRONG_ALL.put("159990", "金融");//2    159990  小盘价值ETF     -6.47%    0.81          2022-07-21    2022-10-21
        JINRONG_ALL.put("510030", "金融");//9    510030  价值ETF         -6.79%    1.04          2022-07-21    2022-10-21
        JINRONG_ALL.put("159931", "金融");//13   159931  金融ETF         -7.02%    0.58          2022-07-21    2022-10-21
        JINRONG_ALL.put("159913", "金融");//1    159913  深价值ETF       -10.61%   0.40          2022-07-21    2022-10-21
        JINRONG_ALL.put("159979", "金融");//2    159979  湾创100ETF      -10.95%   0.09          2022-07-21    2022-10-21

        JINRONG_ALL.put("159974", "金融");//1    159974  央企创新ETF     -6.03%    5.10          2022-07-21    2022-10-21
        JINRONG_ALL.put("515900", "金融");//2    515900  央创ETF         -6.33%    38.07         2022-07-21    2022-10-21
        JINRONG_ALL.put("515680", "金融");//3    515680  嘉实央企创新ETF -6.49%    15.15         2022-07-21    2022-10-21
        JINRONG_ALL.put("510810", "金融");//3    510810  上海国企ETF     -6.48%    63.89         2022-07-21    2022-10-21
        JINRONG_ALL.put("515600", "金融");//4    515600  央企创新ETF     -6.49%    15.45         2022-07-21    2022-10-21
        JINRONG_ALL.put("510060", "金融");//5    510060  央企ETF         -6.50%    0.75          2022-07-21    2022-10-21
        JINRONG_ALL.put("510270", "金融");//6    510270  国企ETF         -6.60%    0.10          2022-07-21    2022-10-21
        JINRONG_ALL.put("159959", "金融");//6    159959  央企ETF         -7.98%    22.22         2022-07-21    2022-10-21
        JINRONG_ALL.put("512960", "金融");//7    512960  央调ETF         -8.10%    51.96         2022-07-21    2022-10-21
        JINRONG_ALL.put("512950", "金融");//8    512950  央企改革ETF     -8.33%    48.15         2022-07-21    2022-10-21
        JINRONG_ALL.put("159965", "金融");//9    159965  央视50ETF       -8.39%    0.97          2022-07-21    2022-10-21
        JINRONG_ALL.put("515110", "金融");//15   515110  一带一路国企ETF -9.32%    3.62          2022-07-21    2022-10-21
        JINRONG_ALL.put("515990", "金融");//21   515990  国企一带一路ETF -9.55%    0.96          2022-07-21    2022-10-21
        JINRONG_ALL.put("515150", "金融");//24   515150  一带一路ETF     -9.69%    5.92          2022-07-21    2022-10-21

        JINRONG_ALL.put("515760", "金融");//1    515760  浙江国资ETF     -8.24%    2.12          2022-07-21    2022-10-21
        JINRONG_ALL.put("515500", "金融");//2    515500  中证长三角领先  -8.42%    0.29          2022-07-21    2022-10-21
        JINRONG_ALL.put("159743", "金融");//4    159743  湖北ETF         -8.55%    3.50          2022-07-21    2022-10-21
        JINRONG_ALL.put("512970", "金融");//7    512970  大湾区ETF       -8.97%    1.28          2022-07-21    2022-10-21

        JINRONG_ALL.put("510200", "金融");//1    510200  上证券商ETF     -5.89%    0.69          2022-07-21    2022-10-21
        JINRONG_ALL.put("515630", "金融");//2    515630  保险证券ETF     -7.29%    1.07          2022-07-21    2022-10-21
        JINRONG_ALL.put("159848", "金融");//3    159848  证券ETF基金     -8.08%    0.96          2022-07-21    2022-10-21
        JINRONG_ALL.put("159842", "金融");//4    159842  券商ETF         -8.09%    5.13          2022-07-21    2022-10-21
        JINRONG_ALL.put("512570", "金融");//5    512570  证券ETF易方达   -8.11%    2.02          2022-07-21    2022-10-21
        JINRONG_ALL.put("516200", "金融");//6    516200  证券行业ETF     -8.26%    0.33          2022-07-21    2022-10-21
        JINRONG_ALL.put("512070", "金融");//7    512070  证券保险ETF     -8.39%    39.18         2022-07-21    2022-10-21
        JINRONG_ALL.put("515850", "金融");//8    515850  证券龙头ETF     -8.42%    1.72          2022-07-21    2022-10-21
        JINRONG_ALL.put("515010", "金融");//9    515010  券商ETF基金     -8.44%    8.76          2022-07-21    2022-10-21
        JINRONG_ALL.put("516980", "金融");//10   516980  证券ETF先锋     -8.45%    0.30          2022-07-21    2022-10-21
        JINRONG_ALL.put("512000", "金融");//11   512000  券商ETF         -8.49%    221.81        2022-07-21    2022-10-21
        JINRONG_ALL.put("516730", "金融");//12   516730  证券公司ETF     -8.51%    0.61          2022-07-21    2022-10-21
        JINRONG_ALL.put("512880", "金融");//13   512880  证券ETF         -8.56%    294.12        2022-07-21    2022-10-21
        JINRONG_ALL.put("159841", "金融");//14   159841  证券ETF         -8.57%    45.64         2022-07-21    2022-10-21
        JINRONG_ALL.put("512900", "金融");//15   512900  证券ETF基金     -8.62%    80.16         2022-07-21    2022-10-21
        JINRONG_ALL.put("515560", "金融");//16   515560  证券ETF建信     -8.73%    4.09          2022-07-21    2022-10-21
        JINRONG_ALL.put("159993", "金融");//17   159993  龙头券商ETF     -9.16%    13.80         2022-07-21    2022-10-21
        JINRONG_ALL.put("513090", "金融");//18   513090  香港证券ETF     -12.56%   12.17         2022-07-21    2022-10-21

        JINRONG_ALL.put("159812", "金融");//1    159812  黄金基金ETF     -0.88%    4.57
        JINRONG_ALL.put("518800", "金融");//2    518800  黄金基金ETF     -0.89%    100.38
        JINRONG_ALL.put("159937", "金融");//3    159937  黄金ETF基金     -0.89%    178.50
        JINRONG_ALL.put("159934", "金融");//4    159934  黄金ETF         -0.9%     153.83
        JINRONG_ALL.put("518880", "金融");//5    518880  黄金ETF         -0.91%    346.32
        JINRONG_ALL.put("518850", "金融");//6    518850  黄金ETF华夏     -0.96%    20.86
        JINRONG_ALL.put("159562", "金融");//7    159562  黄金股ETF       -1.0%     3.36
        JINRONG_ALL.put("518860", "金融");//8    518860  黄金ETFAU       -1.02%    9.14
        JINRONG_ALL.put("159315", "金融");//9    159315  黄金股ETF基金   -1.12%    0.40
        JINRONG_ALL.put("159321", "金融");//10   159321  黄金股票ETF     -1.4%     0.61
        JINRONG_ALL.put("159322", "金融");//11   159322  黄金产业ETF     -1.43%    0.27
        JINRONG_ALL.put("517400", "金融");//12   517400  黄金股票ETF     -1.68%    3.32
        JINRONG_ALL.put("517520", "金融");//13   517520  黄金股ETF       -1.92%    21.27

        JINRONG_ALL.put("518680", "金融");//1    518680  金ETF           3.84%     1.47          2022-07-21    2022-10-21
        JINRONG_ALL.put("518890", "金融");//1    518890  中银上海金ETF   3.83%     0.78          2022-07-21    2022-10-21
        JINRONG_ALL.put("518600", "金融");//2    518600  上海金ETF       2.69%     1.06          2022-07-21    2022-10-21

        JINRONG_ALL.put("511270", "金融");//1    511270  10年地方债ETF   1.59%     7.10          2022-07-21    2022-10-21
        JINRONG_ALL.put("159972", "金融");//2    159972  5年地债ETF      1.55%     38.88         2022-07-21    2022-10-21
        JINRONG_ALL.put("511060", "金融");//3    511060  5年地方债ETF    1.39%     5.63          2022-07-21    2022-10-21
        JINRONG_ALL.put("511260", "金融");//4    511260  十年国债ETF     1.37%     6.13          2022-07-21    2022-10-21
        JINRONG_ALL.put("511310", "金融");//5    511310  10年国债ETF     1.13%     0.12          2022-07-21    2022-10-21
        JINRONG_ALL.put("511010", "金融");//6    511010  国债ETF         1.03%     7.49          2022-07-21    2022-10-21
        JINRONG_ALL.put("511020", "金融");//7    511020  活跃国债ETF     0.86%     11.42         2022-07-21    2022-10-21
        JINRONG_ALL.put("159816", "金融");//8    159816  0-4地债ETF      0.54%     16.37         2022-07-21    2022-10-21
        JINRONG_ALL.put("511220", "金融");//9    511220  城投债ETF       0.12%     14.07         2022-07-21    2022-10-21
        JINRONG_ALL.put("511030", "金融");//10   511030  公司债ETF       -0.86%    52.43         2022-07-21    2022-10-21
        JINRONG_ALL.put("511180", "金融");//11   511180  上证可转债ETF   -2.51%    1.05          2022-07-21    2022-10-21
        JINRONG_ALL.put("511380", "金融");//12   511380  可转债ETF       -3.48%    13.37         2022-07-21    2022-10-21

        JINRONG_ALL.put("510880", "金融");//1    510880  红利ETF         0.68%     140.91        2022-07-21    2022-10-21
        JINRONG_ALL.put("511360", "金融");//2    511360  短融ETF         0.45%     161.70        2022-07-21    2022-10-21
        JINRONG_ALL.put("512890", "金融");//3    512890  红利低波ETF     0.24%     2.70          2022-07-21    2022-10-21
        JINRONG_ALL.put("515300", "金融");//1    515300  红利低波ETF基金 -4.15%    0.92          2022-07-21    2022-10-21
        JINRONG_ALL.put("515570", "金融");//2    515570  山证红利ETF     -8.24%    0.42          2022-07-21    2022-10-21
        JINRONG_ALL.put("513530", "金融");//3    513530  港股通红利ETF   -10.41%   0.77          2022-07-21    2022-10-21
        JINRONG_ALL.put("159726", "金融");//4    159726  恒生红利ETF     -11.34%   0.84          2022-07-21    2022-10-21
        JINRONG_ALL.put("159708", "金融");//5    159708  红利ETF         -12.64%   1.94          2022-07-21    2022-10-21
        JINRONG_ALL.put("159905", "金融");//6    159905  深红利ETF       -13.05%   23.34         2022-07-21    2022-10-21

        JINRONG_ALL.put("511880", "金融");//1    511880  银华日利ETF     0.38%     1364.22       2022-07-21    2022-10-21
        JINRONG_ALL.put("511970", "金融");//1    511970  国寿货币ETF     0.05%     0.07          2022-07-21    2022-10-21
        JINRONG_ALL.put("511910", "金融");//2    511910  融通货币ETF     0.03%     0.03          2022-07-21    2022-10-21
        JINRONG_ALL.put("511600", "金融");//3    511600  货币ETF         0.02%     0.19          2022-07-21    2022-10-21
        JINRONG_ALL.put("511660", "金融");//4    511660  货币ETF建信添益 0.01%     232.50        2022-07-21    2022-10-21
        JINRONG_ALL.put("511770", "金融");//5    511770  金鹰增益货币ETF 0.01%     0.03          2022-07-21    2022-10-21
        JINRONG_ALL.put("511690", "金融");//6    511690  交易货币ETF     0.01%     15.78         2022-07-21    2022-10-21
        JINRONG_ALL.put("511810", "金融");//7    511810  理财金货币ETF   0.01%     22.97         2022-07-21    2022-10-21
        JINRONG_ALL.put("511920", "金融");//8    511920  广发货币ETF     0.01%     0.09          2022-07-21    2022-10-21
        JINRONG_ALL.put("511830", "金融");//9    511830  华泰货币ETF     0.01%     0.20          2022-07-21    2022-10-21
        JINRONG_ALL.put("511700", "金融");//10   511700  场内货币ETF     0.01%     9.51          2022-07-21    2022-10-21
        JINRONG_ALL.put("511620", "金融");//11   511620  货币基金ETF     0.01%     0.19          2022-07-21    2022-10-21
        JINRONG_ALL.put("511900", "金融");//12   511900  富国货币ETF     0.01%     21.99         2022-07-21    2022-10-21
        JINRONG_ALL.put("159001", "金融");//13   159001  货币ETF         0.00%     34.29         2022-07-21    2022-10-21
        JINRONG_ALL.put("511800", "金融");//14   511800  易方达货币ETF   0.00%     2.37          2022-07-21    2022-10-21
        JINRONG_ALL.put("511860", "金融");//15   511860  保证金货币ETF   0.00%     0.48          2022-07-21    2022-10-21
        JINRONG_ALL.put("511950", "金融");//16   511950  添利货币ETF     -0.01%    0.12          2022-07-21    2022-10-21
        JINRONG_ALL.put("511930", "金融");//17   511930  中融日盈货币ETF -0.09%    0.02          2022-07-21    2022-10-21
        JINRONG_ALL.put("511650", "金融");//2    511650  华夏快线ETF     0.01%     1.35          2022-07-21    2022-10-21
        JINRONG_ALL.put("511670", "金融");//3    511670  华泰天天金ETF   0.01%     0.09          2022-07-21    2022-10-21
        JINRONG_ALL.put("511960", "金融");//4    511960  嘉实快线ETF     0.01%     0.10          2022-07-21    2022-10-21
        JINRONG_ALL.put("511850", "金融");//5    511850  财富宝ETF       0.01%     129.59        2022-07-21    2022-10-21
        JINRONG_ALL.put("511990", "金融");//6    511990  华宝添益ETF     0.01%     1636.43       2022-07-21    2022-10-21
        JINRONG_ALL.put("159005", "金融");//8    159005  汇添富快钱ETF   0.00%     0.53          2022-07-21    2022-10-21
        JINRONG_ALL.put("159003", "金融");//9    159003  招商快线ETF     0.00%     3.46          2022-07-21    2022-10-21
        JINRONG_ALL.put("511820", "金融");//10   511820  鹏华添利ETF     -0.02%    1.67          2022-07-21    2022-10-21
        JINRONG_ALL.put("511980", "金融");//11   511980  现金添富ETF     -0.03%    0.28          2022-07-21    2022-10-21
        JINRONG_ALL.put("515890", "金融");//3    515890  红利ETF博时     -0.55%    2.88          2022-07-21    2022-10-21
        JINRONG_ALL.put("515180", "金融");//6    515180  红利ETF易方达   -0.79%    16.94         2022-07-21    2022-10-21
        JINRONG_ALL.put("515080", "金融");//7    515080  中证红利ETF     -0.98%    8.39          2022-07-21    2022-10-21
        JINRONG_ALL.put("515100", "金融");//2    515100  红利100ETF      -3.15%    1.67          2022-07-21    2022-10-21
        JINRONG_ALL.put("159758", "金融");//14   159758  红利50ETF       -4.31%    1.75          2022-07-21    2022-10-21
        JINRONG_ALL.put("512530", "金融");//1    512530  沪深300红利ETF  -4.68%    0.48          2022-07-21    2022-10-21

        JINRONG_ALL.put("159707", "金融");//1    159707  地产ETF         -1.60%    1.67          2022-07-21    2022-10-21
        JINRONG_ALL.put("159768", "金融");//2    159768  房地产ETF       -1.71%    1.90          2022-07-21    2022-10-21
        JINRONG_ALL.put("515060", "金融");//3    515060  房地产ETF基金   -3.77%    4.26          2022-07-21    2022-10-21
        JINRONG_ALL.put("512200", "金融");//4    512200  房地产ETF       -4.51%    44.22         2022-07-21    2022-10-21
        JINRONG_ALL.put("159933", "金融");//5    159933  国投金融地产ETF -6.20%    1.46          2022-07-21    2022-10-21
        JINRONG_ALL.put("510650", "金融");//6    510650  金融地产ETF     -6.72%    0.49          2022-07-21    2022-10-21
        JINRONG_ALL.put("512640", "金融");//7    512640  金融地产ETF基金 -7.01%    0.68          2022-07-21    2022-10-21
        JINRONG_ALL.put("159940", "金融");//8    159940  金融地产ETF     -7.38%    18.58         2022-07-21    2022-10-21

        JINRONG_ALL.put("512190", "金融");//1    512190  浙商之江凤凰ETF -4.23%    0.51          2022-07-21    2022-10-21
    }

    //医疗
    public static Map<String, String> YILIAO = new HashMap<>();

    static {
//        YILIAO.put("513060", "恒生医疗ETF   ");//55.08   	-0.18
        YILIAO.put("512170", "医疗ETF       ");//148.20  	-0.37
        YILIAO.put("159992", "创新药ETF     ");//43.44   	-0.89
//        YILIAO.put("159883", "医疗器械ETF");//159883  医疗器械ETF     2.19%     0.57%     17.75         2022-07-21    2022-10-21

//        YILIAO.put("512010", "101.39");//医药ETF
//        YILIAO.put("512290", "40.51");//生物医药ETF
//        YILIAO.put("159938", "29.27");//医药卫生ETF
//        YILIAO.put("159837", "16.75");//生物科技ETF
//        YILIAO.put("515120", "15.19");//创新药ETF
//        YILIAO.put("159828", "14.97");//医疗ETF
//        YILIAO.put("159859", "12.95");//生物医药ETF
//        YILIAO.put("159929", "10.15");//医药ETF
    }

    public static Map<String, String> YILIAO_MORE = new HashMap<>();//医疗

    static {
//        YILIAO_MORE.put("159883", "医疗器械ETF");//1    159883  医疗器械ETF     2.13%     19.75         2022-08-01    2022-11-01
//        YILIAO_MORE.put("159938", "医药卫生ETF");//2    159938  医药卫生ETF     -1.01%    34.76         2022-08-01    2022-11-01
        YILIAO_MORE.put("159992", "创新药ETF");//3    159992  创新药ETF       -2.87%    46.79         2022-08-01    2022-11-01
//        YILIAO_MORE.put("512010", "医药ETF");//4    512010  医药ETF         -5.50%    130.82        2022-08-01    2022-11-01
        YILIAO_MORE.put("512170", "医疗ETF");//5    512170  医疗ETF         -5.70%    175.00        2022-08-01    2022-11-01
        YILIAO_MORE.put("513060", "恒生医疗ETF");//6    513060  恒生医疗ETF     -10.56%   55.50         2022-08-01    2022-11-01
        YILIAO_MORE.put("159647", "中药ETF");//5.25    	2.45%
//        YILIAO_MORE.put("159643", "疫苗ETF");//1.52    	0.31%
    }

    public static Map<String, String> YILIAO_ALL = new HashMap<>();//医疗

    static {
        YILIAO_ALL.put("513280", "医疗");//1    513280  港股生物科技ETF -15.33%   1.63          2022-07-21    2022-10-21
        YILIAO_ALL.put("159615", "医疗");//2    159615  生物科技ETF港股 -16.27%   3.33          2022-07-21    2022-10-21
        YILIAO_ALL.put("159839", "医疗");//3    159839  生物药ETF       -16.31%   3.74          2022-07-21    2022-10-21
        YILIAO_ALL.put("513060", "医疗");//1    513060  恒生医疗ETF     -17.74%   53.02         2022-07-21    2022-10-21
        YILIAO_ALL.put("513290", "美股生物科技ETF");//0.65    	0.36%

        YILIAO_ALL.put("560900", "医疗");//1    560900  创新药企ETF     -11.06%   2.09          2022-07-21    2022-10-21
        YILIAO_ALL.put("159858", "医疗");//2    159858  创新药指ETF     -11.32%   0.88          2022-07-21    2022-10-21
        YILIAO_ALL.put("516080", "医疗");//3    516080  创新药ETF易方达 -11.41%   2.63          2022-07-21    2022-10-21
        YILIAO_ALL.put("516060", "医疗");//4    516060  创新药产业ETF   -12.04%   1.04          2022-07-21    2022-10-21
        YILIAO_ALL.put("159835", "医疗");//5    159835  创新药50ETF     -12.07%   0.62          2022-07-21    2022-10-21
        YILIAO_ALL.put("515120", "医疗");//6    515120  创新药ETF       -12.10%   16.65         2022-07-21    2022-10-21
        YILIAO_ALL.put("159992", "医疗");//7    159992  创新药ETF       -12.42%   43.95         2022-07-21    2022-10-21
        YILIAO_ALL.put("516820", "医疗");//1    516820  医疗创新ETF     -12.95%   8.48          2022-07-21    2022-10-21
        YILIAO_ALL.put("517120", "医疗");//8    517120  沪港深创新药ETF -13.72%   3.14          2022-07-21    2022-10-21
        YILIAO_ALL.put("517110", "医疗");//9    517110  创新药沪深港ETF -14.57%   1.52          2022-07-21    2022-10-21
        YILIAO_ALL.put("159748", "医疗");//10   159748  沪港深创新药ETF -14.74%   1.75          2022-07-21    2022-10-21
        YILIAO_ALL.put("513120", "医疗");//11   513120  港股创新药ETF   -15.42%   1.20          2022-07-21    2022-10-21
        YILIAO_ALL.put("517380", "医疗");//12   517380  创新药沪港深ETF -16.85%   1.97          2022-07-21    2022-10-21
        YILIAO_ALL.put("510770", "医疗");//17   510770  G60创新ETF      -12.14%   0.21          2022-07-21    2022-10-21

        YILIAO_ALL.put("515960", "医疗");//1    515960  医药健康ETF     -5.21%    3.06          2022-07-21    2022-10-21
        YILIAO_ALL.put("512290", "医疗");//4    512290  生物医药ETF     -5.67%    41.48         2022-07-21    2022-10-21
        YILIAO_ALL.put("159938", "医疗");//1    159938  医药卫生ETF     -6.59%    34.47         2022-07-21    2022-10-21
        YILIAO_ALL.put("512610", "医疗");//1    512610  医药卫生ETF基金 -7.57%    0.11          2022-07-21    2022-10-21
        YILIAO_ALL.put("515950", "医疗");//2    515950  医药龙头ETF     -7.79%    5.25          2022-07-21    2022-10-21
        YILIAO_ALL.put("159929", "医疗");//3    159929  医药ETF         -7.88%    12.02         2022-07-21    2022-10-21
        YILIAO_ALL.put("510660", "医疗");//4    510660  医药卫生ETF     -8.11%    1.02          2022-07-21    2022-10-21
        YILIAO_ALL.put("159838", "医疗");//5    159838  医药ETF基金     -8.36%    1.59          2022-07-21    2022-10-21
        YILIAO_ALL.put("159760", "医疗");//1    159760  公共卫生健康ETF -8.40%    1.50          2022-07-21    2022-10-21
        YILIAO_ALL.put("159847", "医疗");//6    159847  医疗50ETF       -9.05%    3.29          2022-07-21    2022-10-21
        YILIAO_ALL.put("516500", "医疗");//7    516500  生物科技ETF     -9.13%    0.90          2022-07-21    2022-10-21
        YILIAO_ALL.put("516560", "医疗");//9    516560  养老ETF         -9.18%    0.77          2022-07-21    2022-10-21
        YILIAO_ALL.put("516930", "医疗");//13   516930  生物科技ETF基金 -9.46%    0.57          2022-07-21    2022-10-21
        YILIAO_ALL.put("159849", "医疗");//14   159849  生物科技ETF招商 -9.48%    1.05          2022-07-21    2022-10-21
        YILIAO_ALL.put("512170", "医疗");//21   512170  医疗ETF         -9.75%    169.62        2022-07-21    2022-10-21
        YILIAO_ALL.put("159837", "医疗");//25   159837  生物科技ETF     -9.88%    16.27         2022-07-21    2022-10-21
        YILIAO_ALL.put("512010", "医疗");//6    512010  医药ETF         -10.42%   124.26        2022-07-21    2022-10-21
        YILIAO_ALL.put("159828", "医疗");//41   159828  医疗ETF         -10.62%   16.99         2022-07-21    2022-10-21
        YILIAO_ALL.put("512120", "医疗");//7    512120  医药50ETF       -11.01%   2.97          2022-07-21    2022-10-21
        YILIAO_ALL.put("159776", "医疗");//8    159776  港股通医药ETF   -13.40%   0.59          2022-07-21    2022-10-21
        YILIAO_ALL.put("517990", "医疗");//9    517990  医药ETF沪港深   -13.81%   0.11          2022-07-21    2022-10-21
        YILIAO_ALL.put("560600", "医疗");//10   560600  医药创新ETF     -13.98%   0.07          2022-07-21    2022-10-21
        YILIAO_ALL.put("513200", "医疗");//11   513200  港股通医药ETF   -14.94%   0.85          2022-07-21    2022-10-21
        YILIAO_ALL.put("159718", "医疗");//12   159718  港股医药ETF     -15.54%   0.58          2022-07-21    2022-10-21
        YILIAO_ALL.put("513700", "医疗");//13   513700  香港医药ETF     -15.75%   3.15          2022-07-21    2022-10-21
        YILIAO_ALL.put("159859", "医疗");//14   159859  生物医药ETF     -15.89%   13.75         2022-07-21    2022-10-21
        YILIAO_ALL.put("159892", "医疗");//15   159892  恒生医药ETF     -16.11%   1.94          2022-07-21    2022-10-21

        YILIAO_ALL.put("159898", "医疗");//1    159898  器械ETF         2.92%     1.63          2022-07-21    2022-10-21
        YILIAO_ALL.put("159797", "医疗");//2    159797  医疗器械ETF基金 2.39%     0.51          2022-07-21    2022-10-21
        YILIAO_ALL.put("159883", "医疗");//3    159883  医疗器械ETF     2.19%     17.75         2022-07-21    2022-10-21

        YILIAO_ALL.put("516790", "医疗");//1    516790  医疗保健ETF     0.12%     1.74          2022-07-21    2022-10-21
        YILIAO_ALL.put("159873", "医疗");//7    159873  医疗设备ETF     0.00%     2.17          2022-07-21    2022-10-21
        YILIAO_ALL.put("159891", "医疗");//1    159891  医疗ETF基金     -0.15%    1.43          2022-07-21    2022-10-21
        YILIAO_ALL.put("159877", "医疗");//2    159877  医疗产业ETF     -0.35%    1.34          2022-07-21    2022-10-21
        YILIAO_ALL.put("516610", "医疗");//3    516610  医疗服务ETF     -0.70%    0.83          2022-07-21    2022-10-21

        YILIAO_ALL.put("561510", "中医药ETF     ");//1.36    	2.79%
        YILIAO_ALL.put("562390", "中药50ETF     ");//1.11    	2.75%
        YILIAO_ALL.put("560080", "中药ETF       ");//0.79    	2.57%
        YILIAO_ALL.put("159647", "中药ETF       ");//5.25    	2.45%

        YILIAO_ALL.put("159646", "疫苗ETF基金   ");//1.16    	0.31%
        YILIAO_ALL.put("159643", "疫苗ETF       ");//1.52    	0.31%
        YILIAO_ALL.put("159645", "疫苗龙头ETF   ");//0.46    	0.27%


    }

    public static Map<String, String> YILIAO_ALL_TO_MORE = new HashMap<>();

    static {
//        YILIAO_ALL_TO_MORE.put("517120", "医疗");//8    517120  沪港深创新药ETF -13.72%   3.14          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("517110", "医疗");//9    517110  创新药沪深港ETF -14.57%   1.52          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159748", "医疗");//10   159748  沪港深创新药ETF -14.74%   1.75          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("513120", "医疗");//11   513120  港股创新药ETF   -15.42%   1.20          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("517380", "医疗");//12   517380  创新药沪港深ETF -16.85%   1.97          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("513280", "医疗");//1    513280  港股生物科技ETF -15.33%   1.63          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159615", "医疗");//2    159615  生物科技ETF港股 -16.27%   3.33          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159839", "医疗");//3    159839  生物药ETF       -16.31%   3.74          2022-07-21    2022-10-21
        YILIAO_ALL_TO_MORE.put("513060", "医疗");//1    513060  恒生医疗ETF     -17.74%   53.02         2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("513290", "美股生物科技ETF");//0.65    	0.36%


//        YILIAO_ALL_TO_MORE.put("560900", "医疗");//1    560900  创新药企ETF     -11.06%   2.09          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159858", "医疗");//2    159858  创新药指ETF     -11.32%   0.88          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516080", "医疗");//3    516080  创新药ETF易方达 -11.41%   2.63          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516060", "医疗");//4    516060  创新药产业ETF   -12.04%   1.04          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159835", "医疗");//5    159835  创新药50ETF     -12.07%   0.62          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("515120", "医疗");//6    515120  创新药ETF       -12.10%   16.65         2022-07-21    2022-10-21
        YILIAO_ALL_TO_MORE.put("159992", "医疗");//7    159992  创新药ETF       -12.42%   43.95         2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516820", "医疗");//1    516820  医疗创新ETF     -12.95%   8.48          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("510770", "医疗");//17   510770  G60创新ETF      -12.14%   0.21          2022-07-21    2022-10-21

//        YILIAO_ALL_TO_MORE.put("515960", "医疗");//1    515960  医药健康ETF     -5.21%    3.06          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("512290", "医疗");//4    512290  生物医药ETF     -5.67%    41.48         2022-07-21    2022-10-21
        YILIAO_ALL_TO_MORE.put("159938", "医疗");//1    159938  医药卫生ETF     -6.59%    34.47         2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("512610", "医疗");//1    512610  医药卫生ETF基金 -7.57%    0.11          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("515950", "医疗");//2    515950  医药龙头ETF     -7.79%    5.25          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159929", "医疗");//3    159929  医药ETF         -7.88%    12.02         2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("510660", "医疗");//4    510660  医药卫生ETF     -8.11%    1.02          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159838", "医疗");//5    159838  医药ETF基金     -8.36%    1.59          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159760", "医疗");//1    159760  公共卫生健康ETF -8.40%    1.50          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159847", "医疗");//6    159847  医疗50ETF       -9.05%    3.29          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516500", "医疗");//7    516500  生物科技ETF     -9.13%    0.90          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516560", "医疗");//9    516560  养老ETF         -9.18%    0.77          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516930", "医疗");//13   516930  生物科技ETF基金 -9.46%    0.57          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159849", "医疗");//14   159849  生物科技ETF招商 -9.48%    1.05          2022-07-21    2022-10-21
        YILIAO_ALL_TO_MORE.put("512170", "医疗");//21   512170  医疗ETF         -9.75%    169.62        2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159837", "医疗");//25   159837  生物科技ETF     -9.88%    16.27         2022-07-21    2022-10-21
        YILIAO_ALL_TO_MORE.put("512010", "医疗");//6    512010  医药ETF         -10.42%   124.26        2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159828", "医疗");//41   159828  医疗ETF         -10.62%   16.99         2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("512120", "医疗");//7    512120  医药50ETF       -11.01%   2.97          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159776", "医疗");//8    159776  港股通医药ETF   -13.40%   0.59          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("517990", "医疗");//9    517990  医药ETF沪港深   -13.81%   0.11          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("560600", "医疗");//10   560600  医药创新ETF     -13.98%   0.07          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("513200", "医疗");//11   513200  港股通医药ETF   -14.94%   0.85          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159718", "医疗");//12   159718  港股医药ETF     -15.54%   0.58          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("513700", "医疗");//13   513700  香港医药ETF     -15.75%   3.15          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159859", "医疗");//14   159859  生物医药ETF     -15.89%   13.75         2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159892", "医疗");//15   159892  恒生医药ETF     -16.11%   1.94          2022-07-21    2022-10-21


//        YILIAO_ALL_TO_MORE.put("159898", "医疗");//1    159898  器械ETF         2.92%     1.63          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159797", "医疗");//2    159797  医疗器械ETF基金 2.39%     0.51          2022-07-21    2022-10-21
        YILIAO_ALL_TO_MORE.put("159883", "医疗");//3    159883  医疗器械ETF     2.19%     17.75         2022-07-21    2022-10-21

//        YILIAO_ALL_TO_MORE.put("516790", "医疗");//1    516790  医疗保健ETF     0.12%     1.74          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159873", "医疗");//7    159873  医疗设备ETF     0.00%     2.17          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159891", "医疗");//1    159891  医疗ETF基金     -0.15%    1.43          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("159877", "医疗");//2    159877  医疗产业ETF     -0.35%    1.34          2022-07-21    2022-10-21
//        YILIAO_ALL_TO_MORE.put("516610", "医疗");//3    516610  医疗服务ETF     -0.70%    0.83          2022-07-21    2022-10-21

//        YILIAO_ALL_TO_MORE.put("561510", "中医药ETF     ");//1.36    	2.79%
//        YILIAO_ALL_TO_MORE.put("562390", "中药50ETF     ");//1.11    	2.75%
//        YILIAO_ALL_TO_MORE.put("560080", "中药ETF       ");//0.79    	2.57%
        YILIAO_ALL_TO_MORE.put("159647", "中药ETF       ");//5.25    	2.45%


//        YILIAO_ALL_TO_MORE.put("159646", "疫苗ETF基金   ");//1.16    	0.31%
        YILIAO_ALL_TO_MORE.put("159643", "疫苗ETF       ");//1.52    	0.31%
//        YILIAO_ALL_TO_MORE.put("159645", "疫苗龙头ETF   ");//0.46    	0.27%

    }

    //消费
    public static Map<String, String> XIAOFEI = new HashMap<>();

    static {
        XIAOFEI.put("159996", "家电ETF       ");//27.23   	0.65
//        XIAOFEI.put("515170", "食品饮料ETF   ");//39.01   	-0.26
//        XIAOFEI.put("159928", "消费ETF       ");//107.11  	-0.37
        XIAOFEI.put("512690", "酒ETF         ");//92.62   	-0.47
        XIAOFEI.put("512980", "传媒ETF       ");//47.02   	-0.67
        XIAOFEI.put("159766", "旅游ETF       ");//19.72   	-1.86
        XIAOFEI.put("516530", "物流快递ETF");//物流快递ETF	516530	0.94

//        XIAOFEI.put("515650", "17.31");//消费50ETF
//        XIAOFEI.put("510150", "11.36");//消费ETF

//        XIAOFEI.put("159736", "71.57");//饮食ETF
//        XIAOFEI.put("515710", "11.25");//食品ETF

//        XIAOFEI.put("560880", "11.53");//家电ETF基金
    }

    public static Map<String, String> XIAOFEI_MORE = new HashMap<>();//消费

    static {

        XIAOFEI_MORE.put("159529", "标普消费ETF           ");//    市值：5.75      累涨：97.75     32.50     43.74     21.51     2.35      1
        XIAOFEI_MORE.put("159869", "游戏ETF               ");//    市值：48.87     累涨：62.94     13.99     20.25     35.67     7.45      2
        XIAOFEI_MORE.put("516620", "影视ETF               ");//    市值：0.63      累涨：61.60     16.99     15.44     30.90     6.34      5
        XIAOFEI_MORE.put("513590", "香港消费ETF           ");//    市值：5.84      累涨：58.72     11.64     14.74     35.41     16.24     7
        XIAOFEI_MORE.put("512690", "酒ETF                 ");//    市值：125.22    累涨：28.40     8.45      6.78      13.17     5.96      28
        XIAOFEI_MORE.put("159996", "家电ETF               ");//    市值：16.64     累涨：35.10     12.38     11.98     10.74     5.74      25
        XIAOFEI_MORE.put("159766", "旅游ETF               ");//    市值：24.04     累涨：28.38     12.82     7.34      8.22      4.44      29
        XIAOFEI_MORE.put("159736", "饮食ETF               ");//    市值：48.53     累涨：24.24     10.02     4.39      9.83      4.94      34
        XIAOFEI_MORE.put("516530", "物流快递ETF           ");//    市值：0.71      累涨：19.35     8.53      5.85      5.30      1.85      52
    }

    public static Map<String, String> XIAOFEI_ALL = new HashMap<>();//消费

    static {
        XIAOFEI_ALL.put("159736", "消费");//1    159736  饮食ETF         -14.88%   67.30         2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159789", "消费");//2    159789  饮料ETF         -14.92%   0.56          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516900", "消费");//3    516900  食品50ETF       -15.12%   0.34          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159862", "消费");//4    159862  食品ETF         -15.24%   0.58          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159843", "消费");//5    159843  食品饮料ETF     -15.26%   2.41          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("515710", "消费");//6    515710  食品ETF         -15.41%   9.35          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("515170", "消费");//7    515170  食品饮料ETF     -15.74%   38.43         2022-07-21    2022-10-21

        XIAOFEI_ALL.put("512690", "消费");//1    512690  酒ETF           -15.09%   97.03         2022-07-21    2022-10-21

        XIAOFEI_ALL.put("561130", "消费");//2    561130  国货ETF         -13.94%   2.15          2022-07-21    2022-10-21

        XIAOFEI_ALL.put("159805", "消费");//1    159805  传媒ETF         -13.83%   1.68          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516770", "消费");//2    516770  游戏动漫ETF     -14.02%   1.02          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516010", "消费");//3    516010  游戏ETF         -14.30%   3.82          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("512980", "消费");//4    512980  传媒ETF         -14.47%   44.11         2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159869", "消费");//5    159869  游戏ETF         -14.66%   6.25          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516190", "消费");//6    516190  文娱传媒ETF     -14.75%   0.13          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("517500", "消费");//7    517500  游戏沪港深ETF   -15.44%   0.51          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("517770", "消费");//8    517770  游戏传媒ETF     -19.13%   0.28          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159786", "消费");//4    159786  VRETF           -14.21%   2.47          2022-07-21    2022-10-21

        XIAOFEI_ALL.put("159855", "消费");//44   159855  影视ETF         -13.05%   0.83          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516620", "消费");//3    516620  影视ETF         -14.08%   0.96          2022-07-21    2022-10-21

        XIAOFEI_ALL.put("516600", "消费");//1    516600  消费服务ETF     -11.57%   1.07          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159725", "消费");//2    159725  线上消费ETF     -11.85%   0.59          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("512600", "消费");//3    512600  必选消费ETF     -11.89%   5.98          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159728", "消费");//4    159728  在线消费ETF     -12.20%   0.33          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159928", "消费");//5    159928  消费ETF         -12.33%   95.06         2022-07-21    2022-10-21
        XIAOFEI_ALL.put("510150", "消费");//8    510150  消费ETF         -13.49%   11.64         2022-07-21    2022-10-21
        XIAOFEI_ALL.put("510630", "消费");//10   510630  消费30ETF       -13.64%   3.96          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159798", "消费");//16   159798  消费50ETF       -15.25%   0.61          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159936", "消费");//17   159936  可选消费ETF     -15.42%   1.82          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("515650", "消费");//18   515650  消费50ETF       -15.72%   15.68         2022-07-21    2022-10-21
        XIAOFEI_ALL.put("517760", "消费");//19   517760  消费TOPETF      -16.21%   0.07          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516130", "消费");//20   516130  消费龙头ETF     -16.41%   0.87          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("560680", "消费ETF龙头   ");//0.42    	-1.07%

        XIAOFEI_ALL.put("515920", "消费");//6    515920  智能消费ETF     -12.57%   2.12          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("562950", "消费");//7    562950  消费电子50ETF   -13.37%   0.70          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159769", "消费");//9    159769  消费电子龙头ETF -13.63%   0.46          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("561100", "消费");//11   561100  消费电子龙头ETF -13.76%   1.98          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159733", "消费");//12   159733  消费电子50ETF   -13.79%   0.35          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("561600", "消费");//13   561600  消费电子ETF     -13.88%   0.52          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159779", "消费");//14   159779  消费电子ETF基金 -13.92%   0.64          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159732", "消费");//15   159732  消费电子ETF     -14.09%   1.13          2022-07-21    2022-10-21

        XIAOFEI_ALL.put("517550", "消费");//21   517550  消费ETF沪港深   -16.82%   0.16          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("517880", "消费");//22   517880  品牌消费ETF     -18.16%   0.43          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159793", "消费");//23   159793  线上消费ETF平安 -19.29%   0.44          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("513590", "消费");//24   513590  香港消费ETF     -21.94%   0.31          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159735", "消费");//25   159735  港股消费ETF     -22.68%   0.69          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("513230", "消费");//26   513230  港股消费ETF     -22.93%   0.46          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("513070", "消费");//27   513070  港股消费50ETF   -23.64%   0.44          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("513960", "消费");//28   513960  港股通消费ETF   -24.03%   0.65          2022-07-21    2022-10-21


        XIAOFEI_ALL.put("159730", "消费");//1    159730  龙头家电ETF     -11.30%   0.45          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("560880", "消费");//2    560880  家电ETF基金     -13.12%   8.72          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("561120", "消费");//3    561120  家电ETF         -13.49%   1.21          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("159996", "消费");//4    159996  家电ETF         -14.04%   20.14         2022-07-21    2022-10-21

        XIAOFEI_ALL.put("159766", "消费");//1    159766  旅游ETF         -6.77%    19.57         2022-07-21    2022-10-21
        XIAOFEI_ALL.put("562510", "消费");//2    562510  旅游ETF         -6.84%    4.30          2022-07-21    2022-10-21

        XIAOFEI_ALL.put("516530", "消费");//1    516530  物流快递ETF     -2.12%    0.94          2022-07-21    2022-10-21
        XIAOFEI_ALL.put("516910", "消费");//2    516910  物流ETF         -2.38%    0.82          2022-07-21    2022-10-21


    }

    public static Map<String, String> XIAOFEI_ALL_TO_MORE = new HashMap<>();//消费

    static {
        XIAOFEI_ALL_TO_MORE.put("159736", "消费");//1    159736  饮食ETF         -14.88%   67.30         2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159789", "消费");//2    159789  饮料ETF         -14.92%   0.56          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("516900", "消费");//3    516900  食品50ETF       -15.12%   0.34          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159862", "消费");//4    159862  食品ETF         -15.24%   0.58          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159843", "消费");//5    159843  食品饮料ETF     -15.26%   2.41          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("515710", "消费");//6    515710  食品ETF         -15.41%   9.35          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("515170", "消费");//7    515170  食品饮料ETF     -15.74%   38.43         2022-07-21    2022-10-21

        XIAOFEI_ALL_TO_MORE.put("512690", "消费");//1    512690  酒ETF           -15.09%   97.03         2022-07-21    2022-10-21

//        XIAOFEI_ALL_TO_MORE.put("561130", "消费");//2    561130  国货ETF         -13.94%   2.15          2022-07-21    2022-10-21

//        XIAOFEI_ALL_TO_MORE.put("159805", "消费");//1    159805  传媒ETF         -13.83%   1.68          2022-07-21    2022-10-21
        XIAOFEI_ALL_TO_MORE.put("512980", "消费");//4    512980  传媒ETF         -14.47%   44.11         2022-07-21    2022-10-21

//        XIAOFEI_ALL_TO_MORE.put("516770", "消费");//2    516770  游戏动漫ETF     -14.02%   1.02          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159786", "消费");//4    159786  VRETF           -14.21%   2.47          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("516010", "消费");//3    516010  游戏ETF         -14.30%   3.82          2022-07-21    2022-10-21
        XIAOFEI_ALL_TO_MORE.put("159869", "消费");//5    159869  游戏ETF         -14.66%   6.25          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("516190", "消费");//6    516190  文娱传媒ETF     -14.75%   0.13          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("517500", "消费");//7    517500  游戏沪港深ETF   -15.44%   0.51          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("517770", "消费");//8    517770  游戏传媒ETF     -19.13%   0.28          2022-07-21    2022-10-21

        XIAOFEI_ALL_TO_MORE.put("159855", "消费");//44   159855  影视ETF         -13.05%   0.83          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("516620", "消费");//3    516620  影视ETF         -14.08%   0.96          2022-07-21    2022-10-21
//
//        XIAOFEI_ALL_TO_MORE.put("516600", "消费");//1    516600  消费服务ETF     -11.57%   1.07          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159725", "消费");//2    159725  线上消费ETF     -11.85%   0.59          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("512600", "消费");//3    512600  必选消费ETF     -11.89%   5.98          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159728", "消费");//4    159728  在线消费ETF     -12.20%   0.33          2022-07-21    2022-10-21
        XIAOFEI_ALL_TO_MORE.put("159928", "消费");//5    159928  消费ETF         -12.33%   95.06         2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("510150", "消费");//8    510150  消费ETF         -13.49%   11.64         2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("510630", "消费");//10   510630  消费30ETF       -13.64%   3.96          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159798", "消费");//16   159798  消费50ETF       -15.25%   0.61          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159936", "消费");//17   159936  可选消费ETF     -15.42%   1.82          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("515650", "消费");//18   515650  消费50ETF       -15.72%   15.68         2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("517760", "消费");//19   517760  消费TOPETF      -16.21%   0.07          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("516130", "消费");//20   516130  消费龙头ETF     -16.41%   0.87          2022-07-21    2022-10-21

//        XIAOFEI_ALL_TO_MORE.put("515920", "消费");//6    515920  智能消费ETF     -12.57%   2.12          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("562950", "消费");//7    562950  消费电子50ETF   -13.37%   0.70          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159769", "消费");//9    159769  消费电子龙头ETF -13.63%   0.46          2022-07-21    2022-10-21
        XIAOFEI_ALL_TO_MORE.put("561100", "消费");//11   561100  消费电子龙头ETF -13.76%   1.98          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159733", "消费");//12   159733  消费电子50ETF   -13.79%   0.35          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("561600", "消费");//13   561600  消费电子ETF     -13.88%   0.52          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159779", "消费");//14   159779  消费电子ETF基金 -13.92%   0.64          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159732", "消费");//15   159732  消费电子ETF     -14.09%   1.13          2022-07-21    2022-10-21

//        XIAOFEI_ALL_TO_MORE.put("517550", "消费");//21   517550  消费ETF沪港深   -16.82%   0.16          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("517880", "消费");//22   517880  品牌消费ETF     -18.16%   0.43          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159793", "消费");//23   159793  线上消费ETF平安 -19.29%   0.44          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("513590", "消费");//24   513590  香港消费ETF     -21.94%   0.31          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("159735", "消费");//25   159735  港股消费ETF     -22.68%   0.69          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("513230", "消费");//26   513230  港股消费ETF     -22.93%   0.46          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("513070", "消费");//27   513070  港股消费50ETF   -23.64%   0.44          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("513960", "消费");//28   513960  港股通消费ETF   -24.03%   0.65          2022-07-21    2022-10-21

//        XIAOFEI_ALL_TO_MORE.put("159730", "消费");//1    159730  龙头家电ETF     -11.30%   0.45          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("560880", "消费");//2    560880  家电ETF基金     -13.12%   8.72          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("561120", "消费");//3    561120  家电ETF         -13.49%   1.21          2022-07-21    2022-10-21
        XIAOFEI_ALL_TO_MORE.put("159996", "消费");//4    159996  家电ETF         -14.04%   20.14         2022-07-21    2022-10-21

        XIAOFEI_ALL_TO_MORE.put("159766", "消费");//1    159766  旅游ETF         -6.77%    19.57         2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("562510", "消费");//2    562510  旅游ETF         -6.84%    4.30          2022-07-21    2022-10-21

        XIAOFEI_ALL_TO_MORE.put("516530", "消费");//1    516530  物流快递ETF     -2.12%    0.94          2022-07-21    2022-10-21
//        XIAOFEI_ALL_TO_MORE.put("516910", "消费");//2    516910  物流ETF         -2.38%    0.82          2022-07-21    2022-10-21

    }


    /**
     * etf-市值-行业板块
     */
    public static Map<String, String> ETF_BK = new HashMap<>();
    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(KEJI_ALL);
        BIZ_ALL.putAll(YILIAO_ALL);
        BIZ_ALL.putAll(JINRONG_ALL);
        BIZ_ALL.putAll(XIAOFEI_ALL);
        BIZ_ALL.putAll(ZIYUAN_ALL);
    }

    /**
     * ETF_BIZ_MORE
     */
    public static Map<String, String> ETF_BIZ_MORE = new HashMap<>();

    static {
        ETF_BIZ_MORE.putAll(KEJI_MORE);
        ETF_BIZ_MORE.putAll(YILIAO_MORE);
        ETF_BIZ_MORE.putAll(JINRONG_MORE);
        ETF_BIZ_MORE.putAll(XIAOFEI_MORE);
        ETF_BIZ_MORE.putAll(ZIYUAN_MORE);
    }

    public static Map<String, String> ETF_MORE = new HashMap<>();

    static {
        ETF_MORE.putAll(ETF_BIZ_MORE);
        ETF_MORE.putAll(INDEX_MORE);
    }

    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX_ALL);
        ETF_All.putAll(BIZ_ALL);
    }

    public static void main(String[] args) {
        BizEtfStat.showEtfMv();//显示etf市值
    }
}
