package utils;

import java.util.HashMap;
import java.util.Map;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {

    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_ALL_CN_HK = new HashMap<>();
    static {
        INDEX_ALL_CN_HK.put("513560", "香港科技ETF           ");//    市值：5.96      累涨：74.79     11.10     22.59     46.92     14.09     1
        INDEX_ALL_CN_HK.put("517390", "云计算沪港深ETF       ");//    市值：3.39      累涨：72.46     13.31     20.62     43.81     14.22     2
        INDEX_ALL_CN_HK.put("513160", "港股科技30ETF         ");//    市值：9.15      累涨：68.62     14.11     26.09     38.46     14.66     3
        INDEX_ALL_CN_HK.put("159568", "港股互联网ETF         ");//    市值：3.54      累涨：66.15     13.14     20.11     39.36     12.48     4
        INDEX_ALL_CN_HK.put("159792", "港股通互联网ETF       ");//    市值：348.85    累涨：65.78     12.54     19.23     39.18     13.93     5
        INDEX_ALL_CN_HK.put("513770", "港股互联网ETF         ");//    市值：40.35     累涨：65.40     11.65     20.89     38.97     12.17     6
        INDEX_ALL_CN_HK.put("513040", "港股通互联网ETF       ");//    市值：4.61      累涨：65.36     12.11     20.86     38.80     13.18     7
        INDEX_ALL_CN_HK.put("513150", "港股通科技ETF华泰柏瑞 ");//    市值：1.65      累涨：65.03     13.89     21.37     35.82     12.83     8
        INDEX_ALL_CN_HK.put("513980", "港股科技50ETF         ");//    市值：88.36     累涨：64.47     12.42     20.55     36.96     13.40     9
        INDEX_ALL_CN_HK.put("513020", "港股科技ETF           ");//    市值：5.30      累涨：63.29     12.00     20.68     36.53     12.25     10
        INDEX_ALL_CN_HK.put("159636", "港股通科技30ETF       ");//    市值：145.33    累涨：63.10     13.19     20.11     36.41     14.22     11
        INDEX_ALL_CN_HK.put("513860", "港股通科技ETF         ");//    市值：12.24     累涨：62.86     12.40     19.99     35.72     12.28     12
        INDEX_ALL_CN_HK.put("159750", "港股科技50ETF         ");//    市值：5.04      累涨：62.17     11.36     20.02     35.55     14.57     13
        INDEX_ALL_CN_HK.put("513580", "恒生科技ETF指数基金   ");//    市值：20.53     累涨：61.94     13.01     20.33     33.12     13.80     14
        INDEX_ALL_CN_HK.put("513180", "恒生科技指数ETF       ");//    市值：249.73    累涨：61.94     12.97     20.40     33.55     13.40     15
        INDEX_ALL_CN_HK.put("513380", "恒生科技ETF龙头       ");//    市值：33.77     累涨：61.92     12.39     20.83     33.69     13.44     16
        INDEX_ALL_CN_HK.put("513260", "恒生科技ETF基金       ");//    市值：25.20     累涨：61.61     13.05     20.50     32.77     13.23     17
        INDEX_ALL_CN_HK.put("159751", "港股科技ETF           ");//    市值：4.67      累涨：61.55     12.04     19.28     34.80     11.70     18
        INDEX_ALL_CN_HK.put("513130", "恒生科技ETF           ");//    市值：230.60    累涨：61.51     12.37     20.60     33.15     13.43     19
        INDEX_ALL_CN_HK.put("159741", "恒生科技ETF基金       ");//    市值：6.04      累涨：61.29     12.21     20.23     33.45     13.77     20
        INDEX_ALL_CN_HK.put("513010", "恒生科技ETF易方达     ");//    市值：98.23     累涨：60.74     12.50     20.08     32.87     13.07     21
        INDEX_ALL_CN_HK.put("159742", "恒生科技指数ETF       ");//    市值：15.03     累涨：60.70     12.66     20.09     32.58     13.30     22
        INDEX_ALL_CN_HK.put("513890", "恒生科技HKETF         ");//    市值：3.54      累涨：60.22     12.05     19.67     33.08     12.65     23
        INDEX_ALL_CN_HK.put("159740", "恒生科技ETF           ");//    市值：52.91     累涨：59.71     11.39     19.73     33.20     13.65     24
        INDEX_ALL_CN_HK.put("513320", "恒生新经济ETF         ");//    市值：2.56      累涨：59.36     12.00     19.85     34.26     11.79     25
        INDEX_ALL_CN_HK.put("159747", "香港科技ETF           ");//    市值：3.79      累涨：58.58     11.84     19.25     31.55     11.79     27
        INDEX_ALL_CN_HK.put("159735", "港股消费ETF           ");//    市值：5.05      累涨：58.53     13.10     14.96     32.51     12.44     28
        INDEX_ALL_CN_HK.put("159688", "恒生互联网ETF         ");//    市值：5.45      累涨：57.50     11.63     18.44     32.04     11.73     29
        INDEX_ALL_CN_HK.put("513330", "恒生互联网ETF         ");//    市值：234.94    累涨：57.10     10.70     18.57     32.45     11.63     30
        INDEX_ALL_CN_HK.put("513070", "港股消费ETF易方达     ");//    市值：2.53      累涨：56.29     13.67     15.06     30.62     11.67     31
        INDEX_ALL_CN_HK.put("513230", "港股消费ETF           ");//    市值：2.58      累涨：56.02     12.52     14.99     32.03     11.80     32
        INDEX_ALL_CN_HK.put("520600", "港股汽车ETF           ");//    市值：6.53      累涨：52.63               16.43     38.42     15.03     33
        INDEX_ALL_CN_HK.put("517660", "物联网沪港深ETF       ");//    市值：0.45      累涨：48.00     12.27     14.64     24.14     11.13     34
        INDEX_ALL_CN_HK.put("517360", "沪港深科技ETF         ");//    市值：0.54      累涨：47.80     9.61      15.51     26.12     9.12      35
        INDEX_ALL_CN_HK.put("159850", "恒生国企ETF           ");//    市值：10.35     累涨：46.08     13.32     12.77     22.50     8.92      36
        INDEX_ALL_CN_HK.put("159570", "港股通创新药ETF       ");//    市值：13.94     累涨：45.94     8.66      11.75     26.78     14.61     37
        INDEX_ALL_CN_HK.put("159712", "港股通50ETF           ");//    市值：0.62      累涨：45.09     10.28     9.22      27.47     8.21      38
        INDEX_ALL_CN_HK.put("159788", "港股通100ETF          ");//    市值：1.00      累涨：44.26     10.49     11.38     24.98     10.24     39
        INDEX_ALL_CN_HK.put("513780", "港股创新药50ETF       ");//    市值：1.72      累涨：44.08     8.68      11.77     25.56     12.78     40
        INDEX_ALL_CN_HK.put("513090", "香港证券ETF           ");//    市值：76.97     累涨：43.75     10.98     11.69     21.08     13.16     41
        INDEX_ALL_CN_HK.put("159506", "恒生医疗ETF           ");//    市值：8.22      累涨：43.51     7.22      11.23     26.29     12.02     42
        INDEX_ALL_CN_HK.put("513900", "港股通100ETF          ");//    市值：1.56      累涨：43.50     9.14      11.34     25.31     10.79     43
        INDEX_ALL_CN_HK.put("513120", "港股创新药ETF         ");//    市值：132.00    累涨：43.34     8.74      11.04     25.22     12.54     44
        INDEX_ALL_CN_HK.put("520700", "港股创新药ETF基金     ");//    市值：0.88      累涨：43.18     7.25      10.20     27.31     13.44     45
        INDEX_ALL_CN_HK.put("513750", "港股非银ETF           ");//    市值：9.89      累涨：42.96     13.54     10.34     19.08     10.48     46
        INDEX_ALL_CN_HK.put("513200", "港股通医药ETF         ");//    市值：31.52     累涨：42.83     7.36      11.06     25.90     11.76     47
        INDEX_ALL_CN_HK.put("159303", "恒生医疗ETF基金       ");//    市值：0.89      累涨：42.77     6.78      10.47     26.46     10.65     48
        INDEX_ALL_CN_HK.put("513280", "恒生生物科技ETF       ");//    市值：2.12      累涨：42.64     8.21      11.25     25.09     11.72     49
        INDEX_ALL_CN_HK.put("513550", "港股通50ETF           ");//    市值：27.77     累涨：42.59     10.37     11.50     22.80     9.44      50
        INDEX_ALL_CN_HK.put("159567", "港股创新药ETF         ");//    市值：4.80      累涨：42.59     8.05      9.73      25.97     13.78     51
        INDEX_ALL_CN_HK.put("159323", "港股通汽车ETF         ");//    市值：2.06      累涨：42.23               13.43     30.46     13.77     52
        INDEX_ALL_CN_HK.put("513990", "港股通ETF             ");//    市值：0.88      累涨：42.06     9.14      11.58     23.20     9.38      53
        INDEX_ALL_CN_HK.put("513600", "恒生指数ETF           ");//    市值：13.93     累涨：41.90     10.83     11.02     22.21     8.80      54
        INDEX_ALL_CN_HK.put("159892", "恒生医药ETF           ");//    市值：44.82     累涨：41.71     7.33      10.32     25.73     13.09     55
        INDEX_ALL_CN_HK.put("159318", "恒生港股通ETF         ");//    市值：0.59      累涨：41.64     10.19     10.46     22.60     9.16      56
        INDEX_ALL_CN_HK.put("159557", "恒生医疗指数ETF       ");//    市值：2.41      累涨：41.53     9.19      10.23     23.13     9.55      57
        INDEX_ALL_CN_HK.put("513700", "香港医药ETF           ");//    市值：9.23      累涨：41.36     6.48      10.94     25.17     11.52     58
        INDEX_ALL_CN_HK.put("513660", "恒生ETF               ");//    市值：42.47     累涨：41.19     10.83     10.85     21.72     9.09      59
        INDEX_ALL_CN_HK.put("513210", "恒生ETF易方达         ");//    市值：0.56      累涨：41.10     10.80     10.70     21.42     8.74      60
        INDEX_ALL_CN_HK.put("159711", "港股通ETF             ");//    市值：0.62      累涨：41.03     10.66     10.63     22.15     8.09      61
        INDEX_ALL_CN_HK.put("159615", "恒生生物科技ETF       ");//    市值：3.58      累涨：40.88     7.63      9.57      24.98     11.40     62
        INDEX_ALL_CN_HK.put("159960", "恒生中国企业ETF       ");//    市值：5.90      累涨：40.83     11.27     10.56     20.29     8.85      63
        INDEX_ALL_CN_HK.put("159333", "港股央企红利ETF       ");//    市值：4.85      累涨：40.77     27.03     5.47      8.27      3.16      64
        INDEX_ALL_CN_HK.put("159920", "恒生ETF               ");//    市值：184.42    累涨：40.62     10.79     10.10     21.57     8.79      65
        INDEX_ALL_CN_HK.put("159312", "恒生ETF港股通         ");//    市值：0.60      累涨：40.47     10.81     9.82      21.64     9.20      66
        INDEX_ALL_CN_HK.put("159776", "港股通医药ETF         ");//    市值：1.24      累涨：40.23     6.76      10.03     24.48     11.13     67
        INDEX_ALL_CN_HK.put("513060", "恒生医疗ETF           ");//    市值：152.36    累涨：40.22     7.11      9.66      24.49     11.04     68
        INDEX_ALL_CN_HK.put("159718", "港股医药ETF           ");//    市值：2.33      累涨：39.79     6.73      10.23     23.86     10.45     69
        INDEX_ALL_CN_HK.put("517550", "消费ETF沪港深         ");//    市值：0.40      累涨：39.24     13.03     9.43      17.19     7.83      70
        INDEX_ALL_CN_HK.put("520890", "港股通红利低波ETF     ");//    市值：0.71      累涨：39.21     24.60     6.32      8.29      4.57      71
        INDEX_ALL_CN_HK.put("520500", "恒生创新药ETF         ");//    市值：1.64      累涨：39.12     0.71      11.48     27.84     14.45     72
        INDEX_ALL_CN_HK.put("520520", "恒生消费ETF华泰柏瑞   ");//    市值：0.68      累涨：38.45     14.30     8.37      15.78     9.94      73
        INDEX_ALL_CN_HK.put("513190", "港股通金融ETF         ");//    市值：4.97      累涨：37.09     15.38     11.07     11.30     5.34      74
        INDEX_ALL_CN_HK.put("159622", "创新药ETF沪港深       ");//    市值：2.01      累涨：36.13     7.80      11.66     18.61     9.34      75
        INDEX_ALL_CN_HK.put("159699", "恒生消费ETF           ");//    市值：7.90      累涨：35.93     13.18     9.32      13.43     8.03      76
        INDEX_ALL_CN_HK.put("513970", "恒生消费ETF           ");//    市值：6.06      累涨：35.86     12.76     9.24      13.86     9.10      77
        INDEX_ALL_CN_HK.put("513140", "港股金融ETF           ");//    市值：0.94      累涨：33.98     12.15     8.17      14.00     7.14      78
        INDEX_ALL_CN_HK.put("159331", "红利港股ETF           ");//    市值：0.92      累涨：33.92     24.22     4.37      5.33      2.25      79
        INDEX_ALL_CN_HK.put("517110", "创新药沪深港ETF       ");//    市值：2.80      累涨：33.06     5.88      10.54     17.22     9.21      80
        INDEX_ALL_CN_HK.put("517380", "创新药沪港深ETF       ");//    市值：2.35      累涨：32.15     6.56      9.79      17.15     9.00      81
        INDEX_ALL_CN_HK.put("513170", "恒生央企ETF           ");//    市值：4.38      累涨：31.75     12.44     6.64      13.41     6.77      82
        INDEX_ALL_CN_HK.put("513910", "港股央企红利ETF       ");//    市值：25.83     累涨：31.41     16.81     7.42      8.46      4.04      83
        INDEX_ALL_CN_HK.put("513920", "港股通央企红利ETF     ");//    市值：32.92     累涨：31.11     14.01     7.28      10.72     4.94      84
        INDEX_ALL_CN_HK.put("513810", "港股国企ETF           ");//    市值：0.48      累涨：31.04     13.77     7.44      11.02     4.49      85
        INDEX_ALL_CN_HK.put("159519", "港股国企ETF           ");//    市值：2.01      累涨：30.99     14.25     6.75      9.99      4.41      86
        INDEX_ALL_CN_HK.put("517010", "沪港深500ETF易方达    ");//    市值：0.70      累涨：28.50     8.99      7.20      12.98     5.07      87
        INDEX_ALL_CN_HK.put("520990", "港股央企红利50ETF     ");//    市值：47.90     累涨：28.39     14.77     6.52      7.63      2.18      88
        INDEX_ALL_CN_HK.put("517170", "沪港深ETF             ");//    市值：0.45      累涨：28.23     8.76      7.06      13.02     5.15      89
        INDEX_ALL_CN_HK.put("159726", "恒生红利ETF           ");//    市值：5.65      累涨：28.16     11.66     5.75      11.03     5.67      90
        INDEX_ALL_CN_HK.put("159569", "港股红利低波ETF       ");//    市值：1.49      累涨：27.62     16.98     5.66      5.95      2.61      91
        INDEX_ALL_CN_HK.put("520900", "红利ETF港股           ");//    市值：28.46     累涨：27.57     13.82     6.60      7.90      2.51      92
        INDEX_ALL_CN_HK.put("513690", "港股红利ETF博时       ");//    市值：36.17     累涨：27.20     12.38     5.54      9.50      5.18      93
        INDEX_ALL_CN_HK.put("517000", "沪港深500ETF          ");//    市值：3.81      累涨：26.96     8.20      6.54      13.10     5.22      94
        INDEX_ALL_CN_HK.put("517080", "沪港深500ETF基金      ");//    市值：4.24      累涨：26.79     8.07      7.05      12.54     5.13      95
        INDEX_ALL_CN_HK.put("513950", "XD恒生红利ETF         ");//    市值：10.57     累涨：26.78     11.59     7.31      8.47      4.57      96
        INDEX_ALL_CN_HK.put("517990", "医药ETF沪港深         ");//    市值：0.38      累涨：26.77     4.63      7.57      15.40     7.23      97
        INDEX_ALL_CN_HK.put("513530", "港股通红利ETF         ");//    市值：14.56     累涨：26.64     14.85     5.67      7.02      2.91      98
        INDEX_ALL_CN_HK.put("159545", "恒生红利低波ETF       ");//    市值：8.67      累涨：25.88     11.51     6.82      7.88      3.95      99
        INDEX_ALL_CN_HK.put("520660", "港股通央企红利ETF南方 ");//    市值：10.93     累涨：25.69     14.03     6.27      6.03      1.31      100
        INDEX_ALL_CN_HK.put("513630", "港股红利指数ETF       ");//    市值：91.27     累涨：25.68     11.96     6.35      7.83      3.30      101
        INDEX_ALL_CN_HK.put("517300", "沪港深300ETF          ");//    市值：26.60     累涨：24.48     7.88      5.54      11.71     4.78      102
        INDEX_ALL_CN_HK.put("159302", "港股高股息ETF         ");//    市值：1.15      累涨：24.34     12.42     5.74      6.72      2.71      103
        INDEX_ALL_CN_HK.put("513820", "港股红利ETF基金       ");//    市值：19.92     累涨：23.29     12.74     5.54      6.02      1.83      104
        INDEX_ALL_CN_HK.put("517030", "沪港深300ETF易方达    ");//    市值：0.67      累涨：22.13     7.50      5.06      9.79      3.54      105
        INDEX_ALL_CN_HK.put("159691", "港股红利ETF           ");//    市值：58.88     累涨：21.85     12.00     4.11      5.92      1.94      106
        INDEX_ALL_CN_HK.put("520550", "港股红利低波ETF       ");//    市值：1.84      累涨：10.88               2.23      8.65      4.68      107
    }

    /**
     * 消费-香港消费
     */
    public static Map<String, String> XIAOFEI_HK = new HashMap<>();
    static {
        XIAOFEI_HK.put("513590", "消费-香港消费         ");//香港消费ETF           市值：5.67      累涨：63.16     9.68      19.40     36.63     22.32     6.93      1
        XIAOFEI_HK.put("159735", "消费-香港消费         ");//港股消费ETF           市值：5.31      累涨：63.13     11.15     20.18     34.59     18.26     7.77      2
        XIAOFEI_HK.put("513230", "消费-香港消费         ");//港股消费ETF           市值：2.72      累涨：60.27     10.31     19.88     33.10     17.69     7.02      3
        XIAOFEI_HK.put("513070", "消费-香港消费         ");//港股消费ETF易方达     市值：3.16      累涨：60.45     11.54     19.98     32.02     17.21     6.66      4
        XIAOFEI_HK.put("159793", "消费-香港消费         ");//线上消费ETF平安       市值：0.40      累涨：60.93     10.15     19.31     32.99     16.12     9.44      5
        XIAOFEI_HK.put("517550", "消费-香港消费         ");//消费ETF沪港深         市值：0.42      累涨：42.75     11.64     12.28     21.27     12.73     4.90      6
        XIAOFEI_HK.put("159728", "消费-香港消费         ");//在线消费ETF           市值：0.63      累涨：61.11     13.29     23.39     26.07     11.46     7.74      7
        XIAOFEI_HK.put("520520", "消费-香港消费         ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：37.62     11.39     10.66     16.86     11.44     4.71      8
        XIAOFEI_HK.put("159725", "消费-香港消费         ");//线上消费ETF           市值：0.51      累涨：59.73     10.91     23.06     27.58     11.21     7.41      9
        XIAOFEI_HK.put("513970", "消费-香港消费         ");//恒生消费ETF           市值：6.26      累涨：35.38     10.17     11.23     14.68     10.76     4.60      10
        XIAOFEI_HK.put("159699", "消费-香港消费         ");//恒生消费ETF           市值：8.32      累涨：35.28     10.70     11.56     13.97     9.03      2.76      11
    }
    /**
     * 消费-游戏
     */
    public static Map<String, String> XIAOFEI_GAME = new HashMap<>();
    static {
        XIAOFEI_GAME.put("517770", "消费-游戏             ");//游戏传媒ETF           市值：0.30      累涨：53.93     10.10     17.90     26.66     14.30     9.13      1
        XIAOFEI_GAME.put("516770", "消费-游戏             ");//游戏ETF华泰柏瑞       市值：1.13      累涨：67.08     12.02     25.66     30.79     11.37     7.33      2
        XIAOFEI_GAME.put("159869", "消费-游戏             ");//游戏ETF               市值：49.74     累涨：66.75     12.44     26.03     30.25     10.98     7.15      3
        XIAOFEI_GAME.put("516010", "消费-游戏             ");//游戏ETF               市值：13.38     累涨：66.58     12.56     26.03     29.61     10.77     6.67      4
    }
    /**
     * 消费-旅游
     */
    public static Map<String, String> XIAOFEI_TRAVEL = new HashMap<>();
    static {
        XIAOFEI_TRAVEL.put("159378", "消费-旅游             ");//通用航空ETF           市值：6.26      累涨：31.88               14.47     19.09     9.75      5.93      1
        XIAOFEI_TRAVEL.put("159766", "消费-旅游             ");//旅游ETF               市值：23.99     累涨：27.65     10.74     8.56      8.96      5.33      1.35      2
        XIAOFEI_TRAVEL.put("562510", "消费-旅游             ");//旅游ETF               市值：6.83      累涨：27.34     11.03     8.32      8.59      4.98      1.35      3
    }
    /**
     * 消费-影视
     */
    public static Map<String, String> XIAOFEI_FILM = new HashMap<>();
    static {
        XIAOFEI_FILM.put("159855", "消费-影视             ");//影视ETF               市值：0.65      累涨：64.86     15.92     19.39     30.92     8.60      5.77      1
        XIAOFEI_FILM.put("516620", "消费-影视             ");//影视ETF               市值：0.62      累涨：64.35     15.26     19.46     30.56     8.47      5.57      2
    }
    /**
     * 消费-食品
     */
    public static Map<String, String> XIAOFEI_FOOD = new HashMap<>();
    static {
        XIAOFEI_FOOD.put("516900", "消费-食品             ");//食品饮料ETF基金       市值：0.57      累涨：25.76     7.53      6.41      12.50     7.43      3.94      1
        XIAOFEI_FOOD.put("159862", "消费-食品             ");//食品ETF               市值：0.53      累涨：25.08     8.67      5.96      11.69     6.32      1.64      2
        XIAOFEI_FOOD.put("159843", "消费-食品             ");//食品饮料ETF           市值：3.01      累涨：24.46     7.94      6.01      11.79     6.07      1.55      3
        XIAOFEI_FOOD.put("515710", "消费-食品             ");//食品ETF               市值：9.22      累涨：23.55     7.74      6.26      10.75     5.49      1.82      4
        XIAOFEI_FOOD.put("515170", "消费-食品             ");//食品饮料ETF           市值：33.39     累涨：23.74     8.20      5.93      10.88     5.48      1.41      5
        XIAOFEI_FOOD.put("159736", "消费-食品             ");//饮食ETF               市值：48.95     累涨：24.17     8.80      6.03      10.38     5.21      1.15      6
        XIAOFEI_FOOD.put("159587", "消费-食品             ");//粮食50ETF             市值：0.30      累涨：22.74     7.24      9.11      7.02      4.32      1.91      7
        XIAOFEI_FOOD.put("159698", "消费-食品             ");//粮食ETF               市值：2.09      累涨：24.04     8.41      9.36      6.85      4.18      1.76      8
    }
    /**
     * 消费-酒
     */
    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();
    static {
        XIAOFEI_WINE.put("512690", "消费-酒               ");//酒ETF                 市值：127.91    累涨：29.62     7.98      8.74      14.32     6.79      1.69      1
    }
    /**
     * 消费-家电
     */
    public static Map<String, String> XIAOFEI_HOUSE = new HashMap<>();
    static {
        XIAOFEI_HOUSE.put("159996", "消费-家电             ");//家电ETF               市值：16.64     累涨：34.63     10.38     15.76     10.10     6.03      2.86      1
        XIAOFEI_HOUSE.put("561120", "消费-家电             ");//家电ETF               市值：1.12      累涨：34.03     10.10     15.84     9.57      5.48      2.81      2
        XIAOFEI_HOUSE.put("159328", "消费-家电             ");//家电ETF易方达         市值：1.28      累涨：30.95     9.93      14.13     8.98      4.74      2.60      3
        XIAOFEI_HOUSE.put("560880", "消费-家电             ");//家电ETF龙头           市值：4.52      累涨：32.26     10.43     15.21     9.04      4.68      2.54      4
        XIAOFEI_HOUSE.put("159730", "消费-家电             ");//龙头家电ETF           市值：0.51      累涨：25.56     6.86      13.02     7.77      4.10      1.81      5
    }
    /**
     * 消费-养老
     */
    public static Map<String, String> XIAOFEI_OLD = new HashMap<>();
    static {
        XIAOFEI_OLD.put("516560", "消费-养老             ");//养老ETF               市值：1.14      累涨：23.24     8.67      6.71      8.64      3.78      1.39      1
    }
    /**
     * 消费-物流
     */
    public static Map<String, String> XIAOFEI_EXPRESS = new HashMap<>();
    static {
        XIAOFEI_EXPRESS.put("516530", "消费-物流             ");//物流快递ETF           市值：0.71      累涨：18.50     6.53      7.61      5.63      2.43      1.27      1
        XIAOFEI_EXPRESS.put("516910", "消费-物流             ");//物流ETF               市值：0.56      累涨：17.85     6.39      7.37      5.19      2.30      1.10      2
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI = new HashMap<>();
    static {
        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_GAME);
        XIAOFEI.putAll(XIAOFEI_TRAVEL);
        XIAOFEI.putAll(XIAOFEI_FILM);
        XIAOFEI.putAll(XIAOFEI_FOOD);
        XIAOFEI.putAll(XIAOFEI_WINE);
        XIAOFEI.putAll(XIAOFEI_HOUSE);
        XIAOFEI.putAll(XIAOFEI_OLD);
        XIAOFEI.putAll(XIAOFEI_EXPRESS);
    }

    /**
     * 科技-软件
     */
    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();
    static {
        KEJI_RUAN_JIAN.put("517390", "云计算沪港深ETF       ");//    市值：3.41      累涨：72.46     13.31     20.62     43.81     14.22     1
        KEJI_RUAN_JIAN.put("516000", "数据ETF               ");//    市值：5.18      累涨：71.21     14.74     23.63     40.37     13.13     2
        KEJI_RUAN_JIAN.put("159526", "机器人指数ETF         ");//    市值：5.70      累涨：70.99     18.77     22.06     34.17     17.24     3
        KEJI_RUAN_JIAN.put("515400", "大数据ETF             ");//    市值：20.23     累涨：70.43     14.95     22.59     40.12     12.74     4
        KEJI_RUAN_JIAN.put("562570", "信创ETF               ");//    市值：4.26      累涨：70.36     12.83     23.69     42.50     12.75     5
        KEJI_RUAN_JIAN.put("560660", "云50ETF               ");//    市值：0.82      累涨：70.08     14.53     23.37     35.76     10.69     6
        KEJI_RUAN_JIAN.put("562030", "信创ETF基金           ");//    市值：0.61      累涨：68.91     13.18     22.22     40.15     12.39     7
        KEJI_RUAN_JIAN.put("516700", "大数据产业ETF         ");//    市值：1.23      累涨：68.60     13.77     23.43     39.22     12.15     8
        KEJI_RUAN_JIAN.put("159890", "云计算ETF             ");//    市值：4.69      累涨：68.24     13.25     23.97     37.56     11.98     9
        KEJI_RUAN_JIAN.put("562360", "机器人ETF基金         ");//    市值：4.15      累涨：68.23     18.76     22.13     31.39     16.47     10
        KEJI_RUAN_JIAN.put("560850", "信创50ETF             ");//    市值：2.99      累涨：68.19     12.83     23.58     40.34     12.35     11
        KEJI_RUAN_JIAN.put("159739", "大数据ETF             ");//    市值：5.57      累涨：67.64     13.33     23.17     36.97     11.71     12
        KEJI_RUAN_JIAN.put("516510", "云计算ETF             ");//    市值：35.78     累涨：67.58     13.63     22.86     37.16     11.59     13
        KEJI_RUAN_JIAN.put("562500", "机器人ETF             ");//    市值：108.77    累涨：66.87     17.44     22.63     31.08     16.39     14
        KEJI_RUAN_JIAN.put("159738", "云计算ETF华泰柏瑞     ");//    市值：6.67      累涨：66.72     12.70     20.09     38.80     11.43     15
        KEJI_RUAN_JIAN.put("159770", "机器人ETF             ");//    市值：42.83     累涨：66.63     17.44     22.26     31.19     16.21     16
        KEJI_RUAN_JIAN.put("516630", "云计算50ETF           ");//    市值：7.81      累涨：66.23     13.59     22.48     36.04     10.85     17
        KEJI_RUAN_JIAN.put("159551", "机器人产业ETF         ");//    市值：3.32      累涨：65.94     17.59     22.11     30.58     16.33     18
        KEJI_RUAN_JIAN.put("159527", "数据ETF               ");//    市值：1.65      累涨：64.53     13.27     21.81     34.86     10.83     19
        KEJI_RUAN_JIAN.put("561010", "软件ETF基金           ");//    市值：1.13      累涨：64.21     11.08     26.17     35.36     11.23     20
        KEJI_RUAN_JIAN.put("560360", "软件指数ETF           ");//    市值：1.85      累涨：63.94     9.74      25.77     38.26     10.72     21
        KEJI_RUAN_JIAN.put("515230", "软件ETF               ");//    市值：13.04     累涨：63.54     11.52     25.41     34.77     10.61     22
        KEJI_RUAN_JIAN.put("159851", "金融科技ETF           ");//    市值：46.29     累涨：63.43     13.39     23.53     31.49     9.97      23
        KEJI_RUAN_JIAN.put("159363", "创业板人工智能ETF华宝 ");//    市值：13.20     累涨：62.97     9.88      23.68     30.13     12.61     24
        KEJI_RUAN_JIAN.put("159852", "软件ETF               ");//    市值：29.74     累涨：62.95     10.12     24.35     37.44     10.44     25
        KEJI_RUAN_JIAN.put("516860", "金融科技ETF           ");//    市值：9.06      累涨：62.93     13.03     22.94     31.78     10.27     26
        KEJI_RUAN_JIAN.put("562930", "软件ETF易方达         ");//    市值：1.49      累涨：62.87     9.97      25.11     36.88     10.45     27
        KEJI_RUAN_JIAN.put("516100", "金融科技ETF华夏       ");//    市值：2.79      累涨：62.75     12.93     22.87     31.73     10.84     28
        KEJI_RUAN_JIAN.put("159530", "机器人ETF易方达       ");//    市值：6.17      累涨：62.46     16.11     20.88     28.76     15.90     29
        KEJI_RUAN_JIAN.put("159559", "机器人100ETF          ");//    市值：4.35      累涨：62.03     15.05     19.94     30.23     16.58     30
        KEJI_RUAN_JIAN.put("159590", "软件50ETF             ");//    市值：2.17      累涨：61.84     11.13     25.85     33.39     9.71      31
        KEJI_RUAN_JIAN.put("515980", "人工智能ETF           ");//    市值：27.83     累涨：60.86     15.21     18.93     29.71     11.52     32
        KEJI_RUAN_JIAN.put("159540", "信创ETF易方达         ");//    市值：1.61      累涨：60.75     14.70     20.25     32.08     12.48     33
        KEJI_RUAN_JIAN.put("159819", "人工智能ETF           ");//    市值：147.72    累涨：60.37     15.23     17.96     30.06     12.33     34
        KEJI_RUAN_JIAN.put("159537", "信创ETF               ");//    市值：0.82      累涨：60.24     14.37     20.21     31.97     12.09     35
        KEJI_RUAN_JIAN.put("512930", "AI人工智能ETF         ");//    市值：17.86     累涨：59.91     15.59     17.74     29.60     11.77     36
        KEJI_RUAN_JIAN.put("159899", "软件龙头ETF           ");//    市值：2.87      累涨：59.42     11.37     24.55     31.49     7.65      37
        KEJI_RUAN_JIAN.put("515070", "人工智能AIETF         ");//    市值：50.94     累涨：59.19     15.52     17.30     29.33     11.28     38
        KEJI_RUAN_JIAN.put("562920", "信息安全ETF           ");//    市值：0.67      累涨：58.96     12.44     20.56     32.04     10.53     39
        KEJI_RUAN_JIAN.put("159538", "信创ETF富国           ");//    市值：0.56      累涨：58.83     13.74     18.25     31.63     12.89     40
        KEJI_RUAN_JIAN.put("159613", "信息安全ETF           ");//    市值：0.73      累涨：58.45     12.47     19.11     33.72     11.15     41
        KEJI_RUAN_JIAN.put("159539", "信创50ETF             ");//    市值：0.82      累涨：58.28     14.35     18.50     31.64     11.71     42
        KEJI_RUAN_JIAN.put("512330", "信息科技ETF           ");//    市值：6.23      累涨：56.50     14.65     16.71     27.25     11.90     43
        KEJI_RUAN_JIAN.put("159939", "信息技术ETF           ");//    市值：16.83     累涨：54.09     14.37     18.18     24.75     10.06     44
        KEJI_RUAN_JIAN.put("517800", "人工智能50ETF         ");//    市值：2.68      累涨：53.68     11.93     18.26     27.37     9.85      45
        KEJI_RUAN_JIAN.put("588260", "科创信息ETF           ");//    市值：1.49      累涨：53.21     14.09     15.51     27.26     14.83     46
        KEJI_RUAN_JIAN.put("588100", "科创信息技术ETF       ");//    市值：3.15      累涨：52.90     13.58     16.07     27.21     14.26     47
        KEJI_RUAN_JIAN.put("562560", "信息技术ETF           ");//    市值：0.39      累涨：51.35     13.00     17.95     22.71     9.44      48
        KEJI_RUAN_JIAN.put("588930", "科创板人工智能ETF     ");//    市值：5.74      累涨：46.78               17.07     33.61     16.91     49
        KEJI_RUAN_JIAN.put("588760", "人工智能ETF科创       ");//    市值：10.43     累涨：37.98               6.61      35.44     18.48     50
        KEJI_RUAN_JIAN.put("588730", "科创人工智能ETF       ");//    市值：3.39      累涨：34.78               6.19      32.47     16.70     51
    }

    /**
     * 科技-芯片
     */
    public static Map<String, String> KEJI_XINPIAN = new HashMap<>();
    static {
        KEJI_XINPIAN.put("159546", "集成电路ETF           ");//    市值：1.50      累涨：68.66     20.35     20.70     31.14     16.66     1
        KEJI_XINPIAN.put("562820", "集成电路ETF           ");//    市值：0.72      累涨：66.91     20.09     20.35     29.80     16.02     2
        KEJI_XINPIAN.put("515050", "5G通信ETF             ");//    市值：64.96     累涨：60.00     19.37     20.46     20.17     8.23      3
        KEJI_XINPIAN.put("588890", "科创芯片ETF南方       ");//    市值：4.78      累涨：59.52     16.09     15.91     29.65     17.96     4
        KEJI_XINPIAN.put("159994", "5GETF                 ");//    市值：15.61     累涨：59.44     19.13     20.66     19.65     8.12      5
        KEJI_XINPIAN.put("515880", "通信ETF               ");//    市值：32.92     累涨：59.43     18.30     21.30     19.83     7.60      6
        KEJI_XINPIAN.put("588200", "科创芯片ETF           ");//    市值：216.90    累涨：59.41     16.32     15.90     29.65     17.35     7
        KEJI_XINPIAN.put("588290", "科创芯片ETF基金       ");//    市值：24.61     累涨：58.54     15.96     15.56     29.32     17.28     8
        KEJI_XINPIAN.put("588990", "科创芯片ETF博时       ");//    市值：2.31      累涨：58.18     16.13     15.06     29.00     17.77     9
        KEJI_XINPIAN.put("588780", "科创芯片设计ETF       ");//    市值：1.58      累涨：58.05     3.40      21.10     34.70     22.72     10
        KEJI_XINPIAN.put("159325", "半导体ETF南方         ");//    市值：1.14      累涨：57.43     16.00     15.00     28.53     14.80     11
        KEJI_XINPIAN.put("159583", "通信设备ETF           ");//    市值：0.76      累涨：56.70     17.59     18.55     20.56     9.08      12
        KEJI_XINPIAN.put("512480", "半导体ETF             ");//    市值：213.95    累涨：56.60     15.68     16.35     27.39     14.40     13
        KEJI_XINPIAN.put("516920", "芯片50ETF             ");//    市值：4.90      累涨：56.13     15.93     16.11     27.07     14.01     14
        KEJI_XINPIAN.put("516640", "芯片龙头ETF           ");//    市值：12.74     累涨：55.84     15.39     16.11     27.24     14.40     15
        KEJI_XINPIAN.put("159310", "芯片产业ETF           ");//    市值：9.45      累涨：55.26     15.30     15.44     27.60     14.84     16
        KEJI_XINPIAN.put("516350", "芯片ETF易方达         ");//    市值：10.11     累涨：55.14     16.18     15.47     26.70     14.08     17
        KEJI_XINPIAN.put("512760", "芯片ETF               ");//    市值：116.31    累涨：55.01     14.97     15.85     27.67     14.30     18
        KEJI_XINPIAN.put("159813", "半导体ETF             ");//    市值：49.48     累涨：54.84     15.33     16.12     27.43     13.94     19
        KEJI_XINPIAN.put("159811", "5G50ETF               ");//    市值：1.13      累涨：54.70     16.33     17.83     20.54     8.44      20
        KEJI_XINPIAN.put("159995", "芯片ETF               ");//    市值：254.14    累涨：54.44     15.06     15.87     27.20     13.69     21
        KEJI_XINPIAN.put("159732", "消费电子ETF           ");//    市值：23.75     累涨：54.01     16.63     20.24     19.06     8.01      22
        KEJI_XINPIAN.put("159665", "半导体龙头ETF         ");//    市值：3.02      累涨：53.49     15.46     14.95     26.52     13.62     23
        KEJI_XINPIAN.put("159801", "芯片ETF龙头           ");//    市值：32.15     累涨：53.24     14.77     15.16     26.84     13.52     24
        KEJI_XINPIAN.put("159599", "芯片ETF基金           ");//    市值：6.70      累涨：53.19     15.06     14.75     26.38     13.36     25
        KEJI_XINPIAN.put("159779", "消费电子50ETF         ");//    市值：1.13      累涨：52.90     15.72     18.88     20.34     9.52      26
        KEJI_XINPIAN.put("512220", "TMTETF                ");//    市值：4.22      累涨：52.84     15.23     17.02     21.47     9.65      27
        KEJI_XINPIAN.put("588810", "科创芯片ETF富国       ");//    市值：0.84      累涨：52.33               10.16     44.37     15.69     28
        KEJI_XINPIAN.put("562950", "消费电子ETF易方达     ");//    市值：2.85      累涨：52.19     16.38     18.35     19.48     8.96      29
        KEJI_XINPIAN.put("561100", "消费电子ETF富国       ");//    市值：5.18      累涨：52.03     16.61     17.57     20.10     8.42      30
        KEJI_XINPIAN.put("159560", "芯片50ETF             ");//    市值：1.39      累涨：51.89     14.79     14.81     24.85     12.81     31
        KEJI_XINPIAN.put("561600", "消费电子ETF           ");//    市值：1.78      累涨：51.48     16.25     18.19     19.43     8.93      32
        KEJI_XINPIAN.put("159511", "通信ETF南方           ");//    市值：0.96      累涨：50.64     13.95     13.25     23.44     11.34     33
        KEJI_XINPIAN.put("159997", "电子ETF               ");//    市值：15.70     累涨：50.00     14.02     15.89     21.81     9.91      34
        KEJI_XINPIAN.put("159695", "通信ETF               ");//    市值：1.12      累涨：49.44     13.27     15.98     20.19     7.82      35
        KEJI_XINPIAN.put("561310", "消电ETF               ");//    市值：0.76      累涨：49.04     16.03     16.96     17.02     7.43      36
        KEJI_XINPIAN.put("515320", "电子50ETF             ");//    市值：1.99      累涨：48.40     14.28     16.03     20.37     9.17      37
        KEJI_XINPIAN.put("515260", "电子ETF               ");//    市值：5.00      累涨：47.02     14.13     15.56     19.45     8.52      38
        KEJI_XINPIAN.put("561980", "半导体设备ETF         ");//    市值：8.11      累涨：46.38     11.09     13.11     24.65     11.94     39
        KEJI_XINPIAN.put("588750", "科创芯片50ETF         ");//    市值：12.71     累涨：45.29     1.67      16.86     28.54     17.13     40
        KEJI_XINPIAN.put("159909", "TMT50ETF              ");//    市值：4.19      累涨：44.35     13.40     14.57     16.67     6.68      41
        KEJI_XINPIAN.put("159582", "半导体产业ETF         ");//    市值：1.65      累涨：43.91     10.69     11.54     23.69     11.48     42
        KEJI_XINPIAN.put("515920", "智能消费ETF           ");//    市值：2.06      累涨：43.09     13.18     14.95     17.03     7.12      43
        KEJI_XINPIAN.put("159558", "半导体设备ETF易方达   ");//    市值：4.88      累涨：40.55     7.76      11.70     22.06     10.18     44
        KEJI_XINPIAN.put("159327", "半导体设备ETF基金     ");//    市值：1.20      累涨：39.68     8.49      10.61     21.01     11.08     45
        KEJI_XINPIAN.put("159516", "半导体设备ETF         ");//    市值：19.53     累涨：39.27     8.70      10.60     20.38     10.10     46
        KEJI_XINPIAN.put("513310", "中韩半导体ETF         ");//    市值：5.91      累涨：39.26     9.16      15.16     15.15     7.88      47
        KEJI_XINPIAN.put("560780", "芯片设备ETF           ");//    市值：1.89      累涨：38.79     8.34      11.48     19.91     9.91      48
        KEJI_XINPIAN.put("562590", "半导体材料ETF         ");//    市值：3.40      累涨：37.83     8.96      10.01     19.25     9.86      49  
    }




    public static Map<String, String> INDEX_ALL_NOT_CN = new HashMap<>();//指数-全部-etf-国外指数
    public static Map<String, String> INDEX_ALL_CN_H = new HashMap<>();//指数-全部-香港指数
    public static Map<String, String> INDEX_ALL_CN = new HashMap<>();//指数-全部-etf-国内
    public static Map<String, String> INDEX_ALL = new HashMap<>();//指数-全部-etf

    static {
        INDEX_ALL.putAll(INDEX_ALL_NOT_CN);
        INDEX_ALL.putAll(INDEX_ALL_CN);
        INDEX_ALL.putAll(INDEX_ALL_CN_H);
    }
    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
    }
    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     * 
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX_ALL);
        ETF_All.putAll(BIZ_ALL);
    }
}
