package utils;

import java.util.HashMap;
import java.util.Map;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {
    /**
     * 资源
     */
    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();
    static {
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：5.03      累涨：64.70     21.04     37.51     9.22      5.14      5.14      1
        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.33      累涨：16.29     3.30      8.59      4.40      2.93      1.46      2
        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：0.75      累涨：15.56     5.48      6.16      3.92      2.79      2.37      3
        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.08      累涨：16.11     4.84      7.03      4.24      2.75      1.79      4
        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.28      累涨：15.64     5.90      5.95      4.01      2.56      2.11      5
        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.25      累涨：16.23     6.31      5.82      4.10      2.55      1.88      6
        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：0.64      累涨：13.92     5.63      4.98      3.31      2.54      1.87      7
        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：0.62      累涨：16.37     6.10      6.69      3.58      2.39      1.84      8
        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：0.93      累涨：16.70     5.50      7.01      4.19      2.39      1.59      9
        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：9.85      累涨：50.63     22.16     26.67     3.94      2.20      1.46      10
    }
    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();
    static {
        ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.52      累涨：20.10     4.49      7.82      7.79      6.09      4.04      1
        ZIYUAN_NONGYE.put("159616", "资源-农业             ");//农牧ETF               市值：0.68      累涨：24.58     5.04      10.24     9.30      6.08      3.59      2
        ZIYUAN_NONGYE.put("159825", "资源-农业             ");//农业ETF               市值：18.79     累涨：23.18     5.05      9.11      9.32      5.79      3.02      3
        ZIYUAN_NONGYE.put("159867", "资源-农业             ");//畜牧ETF               市值：6.40      累涨：21.80     4.73      8.73      8.34      5.66      3.16      4
        ZIYUAN_NONGYE.put("516670", "资源-农业             ");//畜牧养殖ETF           市值：6.81      累涨：22.20     5.35      8.28      8.57      5.57      3.58      5
        ZIYUAN_NONGYE.put("516810", "资源-农业             ");//农业50ETF             市值：1.66      累涨：23.61     5.73      9.60      8.43      5.41      2.99      6
        ZIYUAN_NONGYE.put("159865", "资源-农业             ");//养殖ETF               市值：33.11     累涨：21.27     4.82      8.32      8.13      5.40      3.04      7
        ZIYUAN_NONGYE.put("516550", "资源-农业             ");//农业ETF               市值：2.14      累涨：20.02     4.20      7.73      8.09      5.32      3.37      8
        ZIYUAN_NONGYE.put("159827", "资源-农业             ");//农业50ETF             市值：1.12      累涨：23.98     5.30      9.68      9.43      5.28      2.69      9
        ZIYUAN_NONGYE.put("562900", "资源-农业             ");//农业ETF易方达         市值：0.82      累涨：21.51     5.21      8.44      8.57      5.00      2.70      10
        ZIYUAN_NONGYE.put("159587", "资源-农业             ");//粮食50ETF             市值：0.31      累涨：22.89     5.77      9.19      8.11      4.53      2.62      11
        ZIYUAN_NONGYE.put("159698", "资源-农业             ");//粮食ETF               市值：1.99      累涨：24.17     6.33      10.28     7.79      4.09      2.33      12
    }
    public static Map<String, String> ZIYUAN = new HashMap<>();
    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_NONGYE);
    }

    /**
     * 消费-香港消费
     */
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();
    static {
        XIAOFEI_COMMON.put("159793", "消费-通用             ");//线上消费ETF平安       市值：0.38      累涨：53.28     2.50      34.36     17.96     9.44                2
        XIAOFEI_COMMON.put("159725", "消费-通用             ");//线上消费ETF           市值：0.50      累涨：53.61     5.93      34.00     17.93     8.53      1.12      3
        XIAOFEI_COMMON.put("159728", "消费-通用             ");//在线消费ETF           市值：0.63      累涨：54.70     8.74      31.56     19.07     8.50      0.76      4
        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.39      累涨：26.62     7.28      10.68     9.71      5.32      2.57      5
        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：5.03      累涨：22.74     5.47      7.89      9.38      4.75      2.47      6
        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.88      累涨：22.44     5.02      8.50      8.92      4.61      3.15      7
        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.30      累涨：30.50     9.46      13.20     8.76      4.53      0.58      8
        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：5.17      累涨：21.23     4.63      7.95      8.65      4.43      3.08      9
        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.48      累涨：21.79     4.71      8.71      8.37      4.14      2.86      10
        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.89      累涨：23.03     4.90      9.33      8.80      4.09      2.62      11
        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：145.75    累涨：22.98     5.37      8.99      8.62      4.01      2.74      12
        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.97      累涨：41.57     13.15     18.54     11.13     3.71                13
        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：0.98      累涨：18.85     6.12      7.14      6.13      2.49      1.18      14
        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：24.35     累涨：18.77     6.23      6.94      6.47      2.46      1.22      15
        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.06      累涨：16.67     4.37      7.43      5.13      2.36      1.04      16
        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.90      累涨：18.19     6.01      7.34      5.58      2.24      1.06      17
        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.45      累涨：17.15     4.65      7.60      5.58      2.15      0.97      18
        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.03      累涨：27.33     8.00      14.20     6.76      2.01      0.05      19
        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：18.61     累涨：19.40     3.94      9.50      6.73      1.92      0.38      20
    }
    /**
     * 消费-香港消费
     */
    public static Map<String, String> XIAOFEI_HK = new HashMap<>();
    static {
        XIAOFEI_HK.put("159793", "消费-香港消费         ");//线上消费ETF平安       市值：0.38      累涨：53.28     2.50      34.36     17.96     9.44                1
        XIAOFEI_HK.put("159725", "消费-香港消费         ");//线上消费ETF           市值：0.50      累涨：53.61     5.93      34.00     17.93     8.53      1.12      2
        XIAOFEI_HK.put("159728", "消费-香港消费         ");//在线消费ETF           市值：0.63      累涨：54.70     8.74      31.56     19.07     8.50      0.76      3
        XIAOFEI_HK.put("159735", "消费-香港消费         ");//港股消费ETF           市值：5.49      累涨：58.19     7.60      28.19     24.79     7.88      0.11      4
        XIAOFEI_HK.put("513230", "消费-香港消费         ");//港股消费ETF           市值：2.79      累涨：55.43     6.11      28.83     22.93     7.20      0.18      5
        XIAOFEI_HK.put("513590", "消费-香港消费         ");//香港消费ETF           市值：5.65      累涨：58.00     5.60      27.11     27.97     7.03      0.10      6
        XIAOFEI_HK.put("513070", "消费-香港消费         ");//港股消费ETF易方达     市值：3.26      累涨：55.80     7.47      27.80     23.21     7.01      0.35      7
        XIAOFEI_HK.put("513970", "消费-香港消费         ");//恒生消费ETF           市值：9.10      累涨：32.70     5.79      14.00     13.50     6.78      2.18      8
        XIAOFEI_HK.put("520520", "消费-香港消费         ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：33.95     6.79      14.21     14.07     6.76      2.05      9
        XIAOFEI_HK.put("517550", "消费-香港消费         ");//消费ETF沪港深         市值：0.42      累涨：39.40     7.69      16.09     16.32     6.20      1.30      10
        XIAOFEI_HK.put("159699", "消费-香港消费         ");//恒生消费ETF           市值：11.70     累涨：33.04     6.63      14.72     12.56     5.36      2.60      11
        XIAOFEI_HK.put("517880", "消费-香港消费         ");//品牌消费ETF           市值：0.39      累涨：26.62     7.28      10.68     9.71      5.32      2.57      12
    }
    /**
     * 消费-游戏
     */
    public static Map<String, String> XIAOFEI_GAME = new HashMap<>();
    static {
        XIAOFEI_GAME.put("517770", "消费-游戏             ");//游戏传媒ETF           市值：0.30      累涨：53.93     10.10     17.90     26.66     14.30     9.13      1
        XIAOFEI_GAME.put("516770", "消费-游戏             ");//游戏ETF华泰柏瑞       市值：1.13      累涨：67.08     12.02     25.66     30.79     11.37     7.33      2
        XIAOFEI_GAME.put("159869", "消费-游戏             ");//游戏ETF               市值：49.74     累涨：66.75     12.44     26.03     30.25     10.98     7.15      3
        XIAOFEI_GAME.put("516010", "消费-游戏             ");//游戏ETF               市值：13.38     累涨：66.58     12.56     26.03     29.61     10.77     6.67      4
    }
    /**
     * 消费-旅游
     */
    public static Map<String, String> XIAOFEI_TRAVEL = new HashMap<>();
    static {
        XIAOFEI_TRAVEL.put("159378", "消费-旅游             ");//通用航空ETF           市值：6.26      累涨：31.88               14.47     19.09     9.75      5.93      1
        XIAOFEI_TRAVEL.put("159766", "消费-旅游             ");//旅游ETF               市值：23.99     累涨：27.65     10.74     8.56      8.96      5.33      1.35      2
        XIAOFEI_TRAVEL.put("562510", "消费-旅游             ");//旅游ETF               市值：6.83      累涨：27.34     11.03     8.32      8.59      4.98      1.35      3
    }
    /**
     * 消费-影视
     */
    public static Map<String, String> XIAOFEI_FILM = new HashMap<>();
    static {
        XIAOFEI_FILM.put("159855", "消费-影视             ");//影视ETF               市值：0.65      累涨：64.86     15.92     19.39     30.92     8.60      5.77      1
        XIAOFEI_FILM.put("516620", "消费-影视             ");//影视ETF               市值：0.62      累涨：64.35     15.26     19.46     30.56     8.47      5.57      2
    }
    /**
     * 消费-食品
     */
    public static Map<String, String> XIAOFEI_FOOD = new HashMap<>();
    static {
        XIAOFEI_FOOD.put("516900", "消费-食品             ");//食品饮料ETF基金       市值：0.56      累涨：25.91     4.59      9.63      11.86     7.37      3.43      1
        XIAOFEI_FOOD.put("515170", "消费-食品             ");//食品饮料ETF           市值：35.01     累涨：24.37     5.38      8.99      10.00     4.86      3.45      2
        XIAOFEI_FOOD.put("515710", "消费-食品             ");//食品ETF               市值：9.66      累涨：23.48     5.26      9.31      9.08      4.57      2.75      3
        XIAOFEI_FOOD.put("159843", "消费-食品             ");//食品饮料ETF           市值：3.04      累涨：24.12     5.02      9.36      9.90      4.44      2.89      4
        XIAOFEI_FOOD.put("159862", "消费-食品             ");//食品ETF               市值：0.51      累涨：24.31     5.57      8.88      9.86      4.27      2.63      5
        XIAOFEI_FOOD.put("159736", "消费-食品             ");//饮食ETF               市值：51.63     累涨：23.74     6.13      8.84      8.77      3.83      2.68      6
    }
    /**
     * 消费-酒
     */
    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();
    static {
        XIAOFEI_WINE.put("512690", "消费-酒               ");//酒ETF                 市值：127.91    累涨：29.62     7.98      8.74      14.32     6.79      1.69      1
    }
    /**
     * 消费-家电
     */
    public static Map<String, String> XIAOFEI_HOUSE = new HashMap<>();
    static {
        XIAOFEI_HOUSE.put("159996", "消费-家电             ");//家电ETF               市值：16.64     累涨：34.63     10.38     15.76     10.10     6.03      2.86      1
        XIAOFEI_HOUSE.put("561120", "消费-家电             ");//家电ETF               市值：1.12      累涨：34.03     10.10     15.84     9.57      5.48      2.81      2
        XIAOFEI_HOUSE.put("159328", "消费-家电             ");//家电ETF易方达         市值：1.28      累涨：30.95     9.93      14.13     8.98      4.74      2.60      3
        XIAOFEI_HOUSE.put("560880", "消费-家电             ");//家电ETF龙头           市值：4.52      累涨：32.26     10.43     15.21     9.04      4.68      2.54      4
        XIAOFEI_HOUSE.put("159730", "消费-家电             ");//龙头家电ETF           市值：0.51      累涨：25.56     6.86      13.02     7.77      4.10      1.81      5
    }
    /**
     * 消费-养老
     */
    public static Map<String, String> XIAOFEI_OLD = new HashMap<>();
    static {
        XIAOFEI_OLD.put("516560", "消费-养老             ");//养老ETF               市值：1.14      累涨：23.24     8.67      6.71      8.64      3.78      1.39      1
    }
    /**
     * 消费-物流
     */
    public static Map<String, String> XIAOFEI_EXPRESS = new HashMap<>();
    static {
        XIAOFEI_EXPRESS.put("516530", "消费-物流             ");//物流快递ETF           市值：0.71      累涨：18.50     6.53      7.61      5.63      2.43      1.27      1
        XIAOFEI_EXPRESS.put("516910", "消费-物流             ");//物流ETF               市值：0.56      累涨：17.85     6.39      7.37      5.19      2.30      1.10      2
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI = new HashMap<>();
    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_GAME);
        XIAOFEI.putAll(XIAOFEI_TRAVEL);
        XIAOFEI.putAll(XIAOFEI_FILM);
        XIAOFEI.putAll(XIAOFEI_FOOD);
        XIAOFEI.putAll(XIAOFEI_WINE);
        XIAOFEI.putAll(XIAOFEI_HOUSE);
        XIAOFEI.putAll(XIAOFEI_OLD);
        XIAOFEI.putAll(XIAOFEI_EXPRESS);
    }




    /**
     * 医疗-通用
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗
    static {
        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：17.76     累涨：36.42     2.52      20.75     18.92     5.59      0.81      1
        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.82      累涨：30.78     3.64      15.22     15.90     5.41      1.17      2
        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.23      累涨：31.57     3.72      17.00     14.87     5.29      1.53      3
        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.89      累涨：33.05     3.42      16.76     16.81     5.28      1.21      4
        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：9.43      累涨：34.56     2.28      19.66     17.53     5.23      0.99      5
        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.92      累涨：32.41     4.22      16.71     15.65     5.10      1.18      6
        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.74      累涨：30.34     4.71      16.62     13.68     4.99      1.17      7
        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：263.21    累涨：34.60     2.62      18.76     18.02     4.93      0.57      8
        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：23.97     累涨：35.19     2.40      20.00     17.64     4.92      0.93      9
        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.86      累涨：29.03     4.35      15.37     13.52     4.89      1.12      10
        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：10.79     累涨：43.38     4.22      21.58     22.43     4.67      0.73      11
        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：10.76     累涨：27.40     11.27     10.27     6.36      4.45      1.18      12
        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：4.87      累涨：32.91     2.51      15.71     17.52     4.21      0.81      13
        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：5.38      累涨：41.17     3.58      18.11     22.55     4.17      1.35      14
        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.66      累涨：28.14     3.87      15.33     12.84     4.17      1.03      15
        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.23      累涨：31.29     4.47      16.74     14.01     4.06      1.12      16
        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：17.43     累涨：29.10     4.83      15.48     12.90     4.03      1.00      17
        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：9.61      累涨：41.16     4.46      20.87     21.08     4.00      0.21      18
        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.72      累涨：40.19     4.04      18.93     21.56     3.93      1.22      19
        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：1.71      累涨：42.83     5.07      18.25     23.53     3.92      1.58      20
        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：2.25      累涨：41.01     4.31      20.14     20.84     3.89      1.12      21
        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：1.15      累涨：42.57     4.16      22.30     21.44     3.79      0.08      22
        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：34.35     累涨：41.97     4.15      21.16     21.51     3.79      0.38      23
        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：151.44    累涨：39.74     4.14      18.71     21.67     3.79      0.22      24
        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.57      累涨：40.27     5.51      19.79     19.50     3.77      0.53      25
        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：16.07     累涨：44.05     4.62      19.56     23.26     3.77      1.08      26
        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：2.26      累涨：39.39     4.15      20.24     19.70     3.57                27
        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.86      累涨：22.48     2.03      11.03     11.55     3.51      1.05      28
        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：14.67     累涨：26.46     8.98      12.43     6.23      3.47      0.25      29
        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.33      累涨：39.17     3.86      19.49     19.93     3.45                30
        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.45      累涨：24.91     2.12      12.31     12.89     3.44      0.79      31
        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.13      累涨：28.04     1.90      15.62     13.87     3.41                32
        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：2.23      累涨：23.05     3.66      11.08     10.74     3.35      1.11      33
        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：34.65     累涨：26.36     1.89      13.78     13.22     3.33      0.55      34
        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.26      累涨：24.40     3.36      12.17     11.25     3.30      0.47      35
        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：18.54     累涨：25.28     2.61      12.37     12.72     3.25      0.88      36
        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：122.62    累涨：40.65     4.44      18.69     21.44     3.22      1.31      37
        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：1.01      累涨：41.51     3.18      17.38     24.60     3.21      1.07      38
        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：46.17     累涨：40.69     4.59      17.97     22.19     3.20                39
        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：48.83     累涨：22.24     3.37      10.89     9.97      3.11      0.49      40
        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：3.75      累涨：30.91     2.25      16.17     15.18     3.11      0.21      41
        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：13.53     累涨：29.07     3.60      15.43     13.22     3.07                42
        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.33      累涨：22.49     3.94      10.41     10.24     3.05      1.24      43
        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.56      累涨：21.95     3.41      10.18     10.37     2.97      0.25      44
        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.79      累涨：28.51     2.35      16.11     13.31     2.94                45
        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.83      累涨：24.57     3.75      11.91     10.90     2.91      0.16      46
        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：1.21      累涨：25.29     2.31      12.33     12.34     2.86      0.41      47
        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：6.89      累涨：22.00     3.69      10.16     10.16     2.81      1.05      48
        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：232.94    累涨：24.03     2.70      12.16     11.72     2.81      0.56      49
        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.20      累涨：24.33     3.68      12.46     10.56     2.78      0.31      50
        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.59      累涨：22.08     2.51      11.97     10.01     2.73      0.34      51
        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：39.43     累涨：27.36     2.73      15.34     12.38     2.70                52
        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：5.95      累涨：23.66     1.43      12.86     12.07     2.66      0.29      53
        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：1.85      累涨：41.76     2.61      19.73     23.68     2.64      0.43      54
        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：22.82     累涨：22.91     3.65      11.45     10.05     2.55      0.32      55
        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：123.98    累涨：24.81     1.97      11.72     12.86     2.52      0.14      56
        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：39.10     累涨：24.76     2.11      11.53     12.67     2.44      0.38      57
        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.27      累涨：23.90     2.18      11.06     11.96     2.34      0.18      58
        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药沪深港ETF       市值：2.86      累涨：31.07     1.96      16.29     16.10     2.34      0.36      59
        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：2.31      累涨：25.13     3.44      11.51     12.22     2.32      0.18      60
        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.36      累涨：27.37     2.39      15.11     13.15     2.32                61
        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：3.20      累涨：32.39     3.77      15.73     16.60     2.28      0.38      62
        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.91      累涨：21.05     2.69      10.65     9.67      2.16      0.14      63
        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.40      累涨：23.63     2.38      11.44     11.56     2.08      0.13      64
        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.26      累涨：23.94     1.68      11.92     12.03     1.80                65
        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.39      累涨：25.29     2.03      14.25     12.27     1.69      0.26      66
        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.18      累涨：22.91     4.20      12.15     8.69      1.65      0.15      67
        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药沪港深ETF       市值：2.39      累涨：29.10     2.31      14.74     14.93     1.61      0.18      68
        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：2.50      累涨：31.09     2.64      16.26     15.86     1.54                69
        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：2.11      累涨：32.85     4.57      16.45     15.43     1.43                70
    }

    /**
     * 医疗-中药
     */
    public static Map<String, String> YILIAO_CN_MEDICINE = new HashMap<>();
    static {
        YILIAO_CN_MEDICINE.put("560080", "医疗-通用             ");//中药ETF               市值：20.87     累涨：19.48     8.44      6.73      5.16      2.94      1.27      1
        YILIAO_CN_MEDICINE.put("159647", "医疗-通用             ");//中药ETF               市值：7.94      累涨：19.27     8.09      6.75      5.35      2.85      1.26      2
        YILIAO_CN_MEDICINE.put("562390", "医疗-通用             ");//中药50ETF             市值：0.65      累涨：19.72     9.06      6.72      4.98      2.55      1.17      3
        YILIAO_CN_MEDICINE.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.89      累涨：18.97     8.56      6.50      4.88      2.40      1.00      4
    }
    /**
     * 医疗
     */
    public static Map<String, String> YILIAO = new HashMap<>();//医疗
    static {
        YILIAO.putAll(YILIAO_COMMON);
        YILIAO.putAll(YILIAO_CN_MEDICINE);
    }



    /**
     * 科技-工业
     */
    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();
    static {
        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：32.52     累涨：40.87     9.22      15.14     16.51     10.53     8.19      1
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：68.16     累涨：38.12     9.60      14.85     13.67     8.71      7.53      2
        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：116.81    累涨：38.59     9.36      15.61     13.62     8.02      6.56      3
        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：8.42      累涨：38.34     9.48      15.59     13.27     7.63      6.51      4
        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.80      累涨：37.57     9.36      15.72     12.49     7.63      6.11      5
        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：36.49     累涨：37.94     9.40      15.51     13.03     7.56      6.32      6
    }
    /**
     * 科技-工业
     */
    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();
    static {
        KEJI_GONG_YE.put("520600", "科技-工业             ");//港股汽车ETF           市值：6.77      累涨：57.45               31.08     36.38     17.60     5.33      1
        KEJI_GONG_YE.put("159323", "科技-工业             ");//港股通汽车ETF         市值：1.69      累涨：46.70               22.44     28.09     16.07     4.47      2
        KEJI_GONG_YE.put("159757", "科技-工业             ");//电池30ETF             市值：3.55      累涨：40.43     6.49      18.20     18.07     10.30     5.75      3
        KEJI_GONG_YE.put("561160", "科技-工业             ");//锂电池ETF             市值：6.80      累涨：37.42     5.31      17.80     16.31     10.16     5.17      4
        KEJI_GONG_YE.put("516390", "科技-工业             ");//新能源汽车ETF         市值：3.89      累涨：38.42     4.62      17.88     17.39     9.94      5.18      5
        KEJI_GONG_YE.put("159796", "科技-工业             ");//电池50ETF             市值：11.37     累涨：36.01     3.96      16.81     17.27     9.89      5.34      6
        KEJI_GONG_YE.put("159755", "科技-工业             ");//电池ETF               市值：36.73     累涨：41.81     6.23      18.92     18.72     9.86      5.28      7
        KEJI_GONG_YE.put("159767", "科技-工业             ");//电池龙头ETF           市值：1.27      累涨：40.28     6.55      18.01     17.89     9.70      4.94      8
        KEJI_GONG_YE.put("159566", "科技-工业             ");//储能电池ETF           市值：1.42      累涨：40.46     8.62      17.31     16.98     9.66      3.94      9
        KEJI_GONG_YE.put("159775", "科技-工业             ");//新能源车电池ETF       市值：0.65      累涨：38.13     5.31      17.71     17.05     9.61      5.30      10
        KEJI_GONG_YE.put("561910", "科技-工业             ");//电池ETF               市值：7.18      累涨：34.49     4.35      16.39     15.76     9.59      4.38      11
        KEJI_GONG_YE.put("159840", "科技-工业             ");//锂电池ETF             市值：11.32     累涨：39.58     5.95      17.96     17.89     9.36      5.02      12
        KEJI_GONG_YE.put("516660", "科技-工业             ");//新能源车ETF基金       市值：3.70      累涨：38.87     5.25      18.42     17.15     9.19      4.90      13
        KEJI_GONG_YE.put("159637", "科技-工业             ");//新能源车龙头ETF       市值：9.24      累涨：37.37     4.57      18.05     16.37     9.16      4.88      14
        KEJI_GONG_YE.put("515030", "科技-工业             ");//新能源车ETF           市值：50.45     累涨：39.29     5.50      18.59     16.71     9.14      4.68      15
        KEJI_GONG_YE.put("562880", "科技-工业             ");//电池ETF基金           市值：3.72      累涨：35.95     5.15      16.69     15.86     9.10      4.63      16
        KEJI_GONG_YE.put("159806", "科技-工业             ");//新能源车ETF           市值：11.20     累涨：37.97     4.29      17.95     17.38     9.04      4.51      17
        KEJI_GONG_YE.put("516520", "科技-工业             ");//智能驾驶ETF           市值：4.18      累涨：57.66     12.31     26.68     21.39     8.64      4.76      18
        KEJI_GONG_YE.put("515250", "科技-工业             ");//智能汽车ETF           市值：9.46      累涨：58.88     12.60     27.35     21.15     8.52      4.33      19
        KEJI_GONG_YE.put("159795", "科技-工业             ");//智能汽车ETF基金       市值：0.43      累涨：57.36     12.67     26.82     20.31     8.49      4.35      20
        KEJI_GONG_YE.put("560000", "科技-工业             ");//智慧电车ETF           市值：0.10      累涨：42.30     8.38      18.54     17.14     8.49      4.06      21
        KEJI_GONG_YE.put("159565", "科技-工业             ");//汽车零部件ETF         市值：0.88      累涨：46.76     8.44      22.89     15.82     8.34      4.15      22
        KEJI_GONG_YE.put("159305", "科技-工业             ");//储能电池50ETF         市值：0.50      累涨：37.34     7.56      16.36     15.63     8.24      2.62      23
        KEJI_GONG_YE.put("562700", "科技-工业             ");//汽车零部件ETF         市值：0.35      累涨：45.85     7.85      23.77     15.83     8.09      3.80      24
        KEJI_GONG_YE.put("159306", "科技-工业             ");//汽车零件ETF           市值：0.19      累涨：44.54     7.54      22.97     14.80     7.86      3.81      25
        KEJI_GONG_YE.put("159889", "科技-工业             ");//智能汽车ETF           市值：0.58      累涨：57.26     12.98     26.63     19.66     7.72      4.40      26
        KEJI_GONG_YE.put("562260", "科技-工业             ");//汽车配件ETF           市值：0.14      累涨：43.23     7.42      22.34     14.66     7.62      3.53      27
        KEJI_GONG_YE.put("516380", "科技-工业             ");//智能电动车ETF         市值：1.04      累涨：40.53     7.73      19.04     16.18     6.40      3.04      28
        KEJI_GONG_YE.put("516590", "科技-工业             ");//智能汽车ETF易方达     市值：1.03      累涨：39.31     7.55      18.94     14.86     6.26      3.01      29
        KEJI_GONG_YE.put("159872", "科技-工业             ");//智能网联汽车ETF       市值：0.55      累涨：47.94     11.00     23.22     15.72     6.18      3.97      30
        KEJI_GONG_YE.put("159512", "科技-工业             ");//汽车ETF               市值：0.87      累涨：34.49     9.31      17.71     9.93      4.13      3.15      31
        KEJI_GONG_YE.put("516110", "科技-工业             ");//汽车ETF               市值：6.68      累涨：34.12     8.75      18.00     9.63      3.93      2.45      32
    }
    /**
     * 科技-软件
     */
    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();
    static {
        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算沪港深ETF       市值：3.38      累涨：79.49     11.84     28.27     45.14     21.34     10.35     1
        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：10.82     累涨：43.02               13.05     31.75     19.45     9.31      2
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：6.99      累涨：74.04     11.31     27.13     40.68     19.38     10.54     3
        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：18.08     累涨：55.29               25.42     31.80     19.28     9.23      4
        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：5.97      累涨：52.01               23.18     30.11     18.76     9.25      5
        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：3.60      累涨：40.15               12.52     29.65     18.15     8.88      6
        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：4.65      累涨：77.46     11.90     30.13     38.56     17.22     10.85     7
        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：20.58     累涨：76.04     13.58     28.57     36.89     16.98     8.00      8
        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：5.19      累涨：76.70     13.56     29.80     36.43     16.97     7.81      9
        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：3.00      累涨：75.03     11.92     30.42     36.75     16.70     10.38     10
        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.81      累涨：76.46     13.07     30.89     37.01     16.48     8.74      11
        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：0.62      累涨：74.65     12.07     29.76     36.21     16.33     9.90      12
        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：4.92      累涨：73.58     11.95     30.10     35.19     16.26     8.28      13
        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.17      累涨：74.06     12.68     28.90     35.45     16.09     7.82      14
        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：37.37     累涨：73.06     12.32     29.61     35.10     16.07     8.38      15
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：13.43     累涨：69.01     9.88      30.39     32.09     15.83     7.99      16
        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.48      累涨：56.92     13.55     19.27     24.55     15.79     6.17      17
        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.75      累涨：73.05     12.14     29.67     35.39     15.65     8.00      18
        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.76      累涨：60.10     11.51     22.61     28.33     15.59     8.22      19
        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：3.10      累涨：57.23     13.35     19.79     24.38     15.56     6.47      20
        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：7.55      累涨：71.83     12.33     29.27     34.51     15.48     8.17      21
        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//数据ETF               市值：1.67      累涨：69.97     11.83     28.41     33.32     15.40     8.44      22
        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：14.43     累涨：69.89     10.35     30.53     31.54     15.19     10.21     23
        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：2.97      累涨：65.84     10.30     29.50     28.48     15.14     9.98      24
        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：149.80    累涨：64.63     14.13     23.80     29.74     14.93     7.06      25
        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：0.84      累涨：62.69     13.84     23.61     26.79     14.89     7.22      26
        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.20      累涨：69.88     10.36     30.37     31.60     14.88     9.55      27
        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：1.67      累涨：65.00     13.94     25.52     27.61     14.86     6.77      28
        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：0.58      累涨：63.38     13.49     25.91     27.82     14.80     7.20      29
        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：32.32     累涨：69.49     9.53      30.78     32.83     14.72     9.50      30
        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.91      累涨：70.99     9.67      32.61     33.75     14.53     9.41      31
        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.50      累涨：68.66     10.40     30.74     31.04     14.46     10.08     32
        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：0.86      累涨：65.00     14.03     24.92     27.59     14.43     7.21      33
        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：18.25     累涨：64.06     14.28     23.45     29.33     14.40     7.21      34
        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.50      累涨：69.25     9.50      31.21     31.90     14.25     9.19      35
        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：27.99     累涨：65.07     13.99     24.84     29.55     14.21     6.92      36
        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.76      累涨：62.69     11.70     24.86     28.91     13.96     7.64      37
        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：51.30     累涨：63.04     14.32     23.04     28.55     13.62     6.86      38
        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.70      累涨：63.64     11.72     26.84     27.90     13.57     8.28      39
        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：5.94      累涨：72.48     16.02     30.33     26.13     13.36     6.51      40
        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.61      累涨：67.38     12.16     29.56     29.43     12.91     6.62      41
        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：8.71      累涨：67.95     12.30     29.38     29.94     12.84     7.21      42
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：47.42     累涨：68.38     12.58     29.68     29.46     12.77     7.28      43
        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.34      累涨：69.55     15.49     28.19     25.87     12.54     6.66      44
        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.48      累涨：67.25     14.57     27.63     25.05     12.52     6.65      45
        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：114.85    累涨：67.94     14.27     28.26     25.41     12.38     6.60      46
        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：45.89     累涨：68.03     14.63     28.25     25.36     12.36     6.38      47
        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：6.82      累涨：64.37     13.92     25.81     24.64     12.15     6.66      48
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人100ETF          市值：4.49      累涨：63.47     12.90     25.77     24.80     12.05     6.59      49
        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：6.27      累涨：58.24     13.22     23.43     23.36     10.88     5.70      50
        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：17.10     累涨：56.58     13.10     22.68     22.01     10.41     5.54      51
        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.38      累涨：54.11     12.01     22.64     20.84     10.06     5.31      52
    }

    /**
     * 科技-芯片
     */
    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();
    static {
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：1.98      累涨：60.76     3.40      26.55     31.40     22.03     7.89      1
        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.25      累涨：62.59     16.13     19.31     27.53     18.54     7.05      2
        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：4.99      累涨：63.15     15.73     20.24     27.65     18.44     7.34      3
        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：24.86     累涨：62.47     15.61     19.83     27.50     17.80     6.98      4
        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：225.55    累涨：63.38     15.98     20.20     27.66     17.79     6.94      5
        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：12.78     累涨：49.28     1.67      21.07     26.74     17.52     6.42      6
        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.72      累涨：56.65               14.34     42.78     16.69     6.00      7
        KEJI_XIN_PIAN.put("159511", "科技-芯片             ");//通信ETF南方           市值：0.97      累涨：53.68     12.50     16.86     25.63     14.95     4.86      8
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.56      累涨：70.39     19.54     24.68     26.84     14.88     6.20      9
        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.12      累涨：60.38     15.32     19.67     26.05     14.27     6.47      10
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.72      累涨：68.33     19.17     24.74     25.02     14.26     6.17      11
        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片产业ETF           市值：9.59      累涨：57.35     14.31     19.79     23.58     13.83     5.99      12
        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：256.43    累涨：57.63     14.57     19.80     23.81     13.51     5.60      13
        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.47     累涨：56.19     14.11     18.95     23.77     13.50     5.77      14
        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：12.78     累涨：58.45     14.85     20.39     23.47     13.41     5.64      15
        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：46.34     累涨：57.45     14.56     19.70     23.81     13.39     5.17      16
        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.16      累涨：56.21     14.81     18.72     23.22     13.30     5.54      17
        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：117.03    累涨：57.51     14.35     20.03     23.56     13.23     5.68      18
        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.10     累涨：57.21     15.08     19.68     22.91     13.18     5.41      19
        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：215.10    累涨：58.81     14.78     20.68     23.54     13.05     5.85      20
        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：5.03      累涨：58.55     15.24     20.78     22.93     13.00     5.54      21
        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.78      累涨：55.43     14.29     19.44     22.50     12.43     5.40      22
        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.41      累涨：54.04     13.83     18.93     21.61     12.27     5.26      23
        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.10      累涨：50.57     10.56     18.09     22.07     11.50     5.75      24
        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.58      累涨：47.83     10.08     16.36     21.39     11.14     5.33      25
        KEJI_XIN_PIAN.put("159695", "科技-芯片             ");//通信ETF               市值：1.15      累涨：52.36     12.00     20.83     21.20     10.66     5.11      26
        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：4.30      累涨：54.64     13.34     21.83     20.77     10.25     5.02      27
        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.20      累涨：43.58     8.12      16.09     19.45     10.13     5.53      28
        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.85      累涨：44.68     7.61      18.25     18.82     10.00     5.24      29
        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：15.77     累涨：52.19     13.30     20.39     19.53     9.85      4.60      30
        KEJI_XIN_PIAN.put("159811", "科技-芯片             ");//5G50ETF               市值：1.14      累涨：56.42     14.70     22.28     21.48     9.72      4.12      31
        KEJI_XIN_PIAN.put("159583", "科技-芯片             ");//通信设备ETF           市值：0.77      累涨：57.12     15.00     23.72     20.20     9.58      4.59      32
        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：2.00      累涨：50.12     13.07     19.47     18.39     9.37      4.53      33
        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：5.08      累涨：49.14     13.11     19.18     18.03     9.12      4.41      34
        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.89      累涨：42.52     8.01      16.87     17.82     9.10      5.00      35
        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.33      累涨：41.16     8.45      15.50     17.49     8.95      4.81      36
        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：21.04     累涨：42.68     8.17      16.58     18.12     8.85      4.96      37
        KEJI_XIN_PIAN.put("515880", "科技-芯片             ");//通信ETF               市值：33.58     累涨：60.41     16.05     27.24     19.93     8.82      4.38      38
        KEJI_XIN_PIAN.put("515050", "科技-芯片             ");//5G通信ETF             市值：65.17     累涨：60.51     16.88     26.32     19.36     8.42      4.05      39
        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.77      累涨：52.32     14.64     21.51     17.09     8.31      3.58      40
        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.13      累涨：53.42     14.00     24.03     17.98     8.24      3.69      41
        KEJI_XIN_PIAN.put("159994", "科技-芯片             ");//5GETF                 市值：15.24     累涨：60.01     16.77     26.41     18.59     8.23      3.99      42
        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.90      累涨：52.67     14.77     21.76     16.94     7.78      3.32      43
        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：4.27      累涨：45.83     11.60     18.65     16.72     7.73      4.44      44
        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：5.20      累涨：52.21     14.50     21.35     17.55     7.71      3.35      45
        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：2.07      累涨：44.42     12.23     18.44     14.97     7.33      3.71      46
        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.76      累涨：49.83     14.75     20.27     16.13     6.43      2.42      47
        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：5.94      累涨：41.00     8.95      17.76     14.75     5.90      1.95      48
        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：23.86     累涨：53.79     14.83     24.60     14.93     5.27      3.07      49
    }
    /**
     * 科技-香港科技
     */
    public static Map<String, String> KEJI_HK = new HashMap<>();
    static {
        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：388.73    累涨：72.87     10.36     23.70     41.42     22.65     11.10     1
        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.74      累涨：74.28     11.36     23.39     41.80     22.22     11.44     2
        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：59.53     累涨：66.99     10.61     21.14     36.99     22.20     10.48     3
        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：5.89      累涨：66.05     9.77      21.96     36.55     22.14     11.87     4
        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：246.47    累涨：65.95     9.04      21.85     37.02     22.14     11.71     5
        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：15.97     累涨：66.60     10.47     21.22     36.87     22.02     10.34     6
        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：4.89      累涨：72.96     10.32     24.65     40.48     21.95     11.16     7
        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：394.14    累涨：67.89     10.78     20.78     38.56     21.85     10.24     8
        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：10.13     累涨：76.30     11.73     28.61     37.07     21.62     11.26     9
        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：4.88      累涨：68.01     9.45      24.85     35.81     21.34     7.75      10
        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：43.02     累涨：72.90     9.75      24.98     40.74     21.21     11.27     11
        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.96      累涨：64.72     11.05     20.75     34.99     20.56     9.23      12
        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：6.38      累涨：67.91     10.33     25.03     34.62     20.41     9.31      13
        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：242.05    累涨：68.21     10.66     25.25     34.37     20.24     9.36      14
        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.48      累涨：65.62     9.70      22.94     35.74     20.04     11.57     15
        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：56.29     累涨：66.29     9.85      24.68     34.28     20.04     9.06      16
        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：35.84     累涨：68.23     10.54     25.85     34.48     19.95     9.03      17
        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：21.59     累涨：68.06     11.15     25.33     33.90     19.82     9.04      18
        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：156.13    累涨：68.76     11.50     23.98     35.71     19.74     8.64      19
        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：262.81    累涨：68.06     11.12     25.38     33.87     19.54     8.76      20
        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：102.71    累涨：66.65     10.37     25.09     33.59     19.45     8.94      21
        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：15.54     累涨：66.41     10.33     25.18     33.34     19.39     8.83      22
        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：27.00     累涨：67.84     11.29     25.48     33.49     19.38     8.96      23
        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：3.73      累涨：66.33     10.37     24.98     33.80     19.05     8.49      24
        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：5.05      累涨：61.32     9.21      21.98     33.14     18.88     9.86      25
        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：5.53      累涨：80.10     9.28      40.86     38.23     18.72     7.13      26
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：102.16    累涨：69.55     10.37     26.64     35.12     18.68     7.13      27
        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：3.39      累涨：64.47     9.86      23.82     33.44     18.65     9.65      28
        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：12.63     累涨：68.27     10.36     26.06     34.92     18.03     7.45      29
        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.72      累涨：69.95     11.65     27.19     33.93     17.94     7.16      30
        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.92      累涨：64.74     11.59     22.98     33.02     17.78     9.66      31
        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：3.95      累涨：63.64     9.63      24.74     31.77     17.69     7.27      32
        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：5.46      累涨：68.69     10.31     26.92     34.26     17.15     7.09      33
        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：4.91      累涨：65.71     9.62      25.73     33.25     16.82     6.58      34
        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：2.66      累涨：64.04     10.25     24.66     32.73     16.41     6.43      35
        KEJI_HK.put("517350", "科技-香港             ");//中概科技ETF           市值：1.02      累涨：54.35     10.30     20.59     25.09     13.87     5.52      36
        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.56      累涨：52.37     11.71     21.80     20.13     9.52      5.09      37
    }
    /**
     * 科技-新能源
     */
    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();
    static {
        KEJI_NEW_ENERGY.put("159775", "科技-新能源           ");//新能源车电池ETF       市值：0.63      累涨：39.39     6.09      18.50     14.80     8.29      2.99      1
        KEJI_NEW_ENERGY.put("516390", "科技-新能源           ");//新能源汽车ETF         市值：3.75      累涨：39.59     5.30      18.82     15.47     8.11      2.93      2
        KEJI_NEW_ENERGY.put("515030", "科技-新能源           ");//新能源车ETF           市值：50.10     累涨：40.48     6.30      19.53     14.65     7.62      2.94      3
        KEJI_NEW_ENERGY.put("516660", "科技-新能源           ");//新能源车ETF基金       市值：3.66      累涨：40.02     6.26      19.34     14.42     7.60      2.70      4
        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.96      累涨：36.17     3.22      16.12     16.83     7.56      3.96      5
        KEJI_NEW_ENERGY.put("159637", "科技-新能源           ");//新能源车龙头ETF       市值：9.13      累涨：38.35     5.28      18.79     14.28     7.47      2.59      6
        KEJI_NEW_ENERGY.put("159806", "科技-新能源           ");//新能源车ETF           市值：11.11     累涨：39.28     5.46      19.15     14.67     7.28      2.77      7
        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.28      累涨：16.52                         16.52     7.19      3.55      8
        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：1.08      累涨：26.93     2.91      13.02     11.00     6.23      2.36      9
        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：49.66     累涨：27.54     2.92      13.82     10.90     6.04      2.08      10
        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：10.08     累涨：26.53     2.07      13.47     10.99     6.00      2.36      11
        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.31      累涨：27.68     3.67      13.40     10.61     5.84      2.09      12
        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：7.11      累涨：28.39     2.53      15.09     10.77     5.76      2.36      13
        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：2.19      累涨：25.01     3.80      11.43     10.00     5.64      1.96      14
        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：114.36    累涨：31.49     3.12      16.37     12.95     5.52      2.82      15
        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.72      累涨：30.36     6.08      14.27     10.38     5.51      3.33      16
        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.18      累涨：28.15     3.82      14.41     9.92      5.44      2.73      17
        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：4.02      累涨：30.39     3.27      15.77     12.19     5.25      2.72      18
        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.86      累涨：29.30     5.30      15.93     9.09      5.10      2.48      19
        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：12.54     累涨：22.01     2.08      11.12     9.12      5.08      2.18      20
        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：3.31      累涨：25.83     3.89      12.86     9.08      5.05      1.68      21
        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.38      累涨：29.34     4.97      16.43     9.07      4.98      2.68      22
        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.61      累涨：28.40     2.73      15.29     10.79     4.88      3.05      23
        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.55      累涨：21.33     3.00      10.25     8.08      4.81      2.46      24
        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：21.58     累涨：30.13     3.54      15.41     11.98     4.79      2.55      25
        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.62      累涨：26.95     4.05      12.59     10.72     4.72      2.65      26
        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.44      累涨：28.75     2.37      15.66     11.33     4.69      2.64      27
        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.80      累涨：28.44     3.18      14.10     11.86     4.64      2.31      28
        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.96      累涨：21.32     3.12      10.70     7.50      4.64      2.44      29
        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.45      累涨：21.41     3.59      10.15     7.67      4.62      2.23      30
        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：11.55     累涨：21.23     3.79      9.74      7.70      4.56      2.20      31
        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：3.02      累涨：21.59     3.76      10.35     7.48      4.48      2.35      32
        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.73      累涨：22.87     2.42      12.01     9.17      4.45      2.05      33
        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.67      累涨：29.33     3.59      14.87     11.55     4.42      2.71      34
        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：23.26     累涨：20.83     2.51      10.41     8.26      4.40      1.95      35
        KEJI_NEW_ENERGY.put("560960", "科技-新能源           ");//碳中和60指数ETF       市值：0.26      累涨：23.06     3.05      12.13     7.88      4.25      2.13      36
        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF平安           市值：0.68      累涨：29.53     3.98      15.44     10.93     4.23      2.28      37
        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：2.01      累涨：20.87     3.32      10.28     7.27      4.22      2.36      38
        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：7.92      累涨：28.77     3.10      15.06     11.09     4.17      2.24      39
        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.72      累涨：20.44     2.75      10.47     7.40      4.16      1.82      40
        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：7.64      累涨：20.57     3.27      10.14     7.16      4.16      1.94      41
        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.72      累涨：20.04     3.05      9.69      7.47      4.08      1.88      42
        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：7.05      累涨：20.32     3.41      9.87      7.04      4.03      2.20      43
        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.71      累涨：20.33     3.41      10.01     7.13      4.01      1.79      44
        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：2.44      累涨：28.39     3.39      14.99     10.67     3.92      2.17      45
        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.65      累涨：19.18     3.08      9.66      6.44      3.76      1.62      46
        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.05      累涨：15.73     6.12      5.75      4.84      2.88      2.58      47
        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：0.66      累涨：15.73     6.19      6.03      4.60      2.31      1.81      48
    }
    /**
     * 科技-新能源
     */
    public static Map<String, String> KEJI_ELECTRICITY = new HashMap<>();
    static {
        KEJI_ELECTRICITY.put("562550", "科技-电力             ");//绿电ETF               市值：1.09      累涨：15.64     7.63      5.94      3.67      2.88      2.58      1
        KEJI_ELECTRICITY.put("561170", "科技-电力             ");//绿色电力ETF           市值：1.33      累涨：16.12     8.00      6.25      3.57      2.68      2.08      2
        KEJI_ELECTRICITY.put("561700", "科技-电力             ");//电力ETF基金           市值：1.35      累涨：16.74     8.46      6.35      3.59      2.67      2.15      3
        KEJI_ELECTRICITY.put("560580", "科技-电力             ");//电力ETF南方           市值：0.45      累涨：15.37     7.39      6.15      3.49      2.57      2.15      4
        KEJI_ELECTRICITY.put("561560", "科技-电力             ");//电力ETF               市值：5.68      累涨：15.68     7.74      6.27      3.39      2.50      2.05      5
        KEJI_ELECTRICITY.put("159611", "科技-电力             ");//电力ETF               市值：32.70     累涨：17.15     8.10      7.03      3.77      2.48      2.16      6
        KEJI_ELECTRICITY.put("159669", "科技-电力             ");//绿电ETF               市值：0.75      累涨：15.55     7.43      6.03      3.61      2.41      1.91      7
        KEJI_ELECTRICITY.put("562960", "科技-电力             ");//绿色电力ETF易方达     市值：0.81      累涨：15.23     7.38      6.28      3.38      2.39      1.89      8
        KEJI_ELECTRICITY.put("159625", "科技-电力             ");//绿色电力ETF           市值：2.85      累涨：15.39     7.69      6.46      3.30      2.39      2.11      9
        KEJI_ELECTRICITY.put("562350", "科技-电力             ");//电力指数ETF           市值：0.49      累涨：15.93     8.08      6.86      2.85      2.34      2.04      10
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_ELECTRICITY);
    }



    /**
     * 指数-科创板
     */
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板
    static {
        INDEX_688.put("588780", "指数-科创板           ");//科创芯片设计ETF       市值：1.98      累涨：60.76     3.40      26.55     31.40     22.03     7.89      1
        INDEX_688.put("588760", "指数-科创板           ");//人工智能ETF科创       市值：10.82     累涨：43.02               13.05     31.75     19.45     9.31      2
        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：18.08     累涨：55.29               25.42     31.80     19.28     9.23      3
        INDEX_688.put("588930", "指数-科创板           ");//科创板人工智能ETF     市值：5.97      累涨：52.01               23.18     30.11     18.76     9.25      4
        INDEX_688.put("588990", "指数-科创板           ");//科创芯片ETF博时       市值：2.25      累涨：62.59     16.13     19.31     27.53     18.54     7.05      5
        INDEX_688.put("588890", "指数-科创板           ");//科创芯片ETF南方       市值：4.99      累涨：63.15     15.73     20.24     27.65     18.44     7.34      6
        INDEX_688.put("588730", "指数-科创板           ");//科创人工智能ETF       市值：3.60      累涨：40.15               12.52     29.65     18.15     8.88      7
        INDEX_688.put("588290", "指数-科创板           ");//科创芯片ETF基金       市值：24.86     累涨：62.47     15.61     19.83     27.50     17.80     6.98      8
        INDEX_688.put("588200", "指数-科创板           ");//科创芯片ETF           市值：225.55    累涨：63.38     15.98     20.20     27.66     17.79     6.94      9
        INDEX_688.put("588750", "指数-科创板           ");//科创芯片50ETF         市值：12.78     累涨：49.28     1.67      21.07     26.74     17.52     6.42      10
        INDEX_688.put("588810", "指数-科创板           ");//科创芯片ETF富国       市值：0.72      累涨：56.65               14.34     42.78     16.69     6.00      11
        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.48      累涨：56.92     13.55     19.27     24.55     15.79     6.17      12
        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：3.10      累涨：57.23     13.35     19.79     24.38     15.56     6.47      13
        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：1.29      累涨：27.91               6.00      22.68     14.73     5.16      14
        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.32      累涨：49.33     10.00     16.05     24.28     14.70     5.94      15
        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.89      累涨：46.82     9.59      15.45     22.49     14.63     5.56      16
        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：607.02    累涨：47.59     10.10     15.03     23.23     14.59     5.62      17
        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：5.98      累涨：49.39     11.49     16.85     21.57     14.56     6.18      18
        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：130.93    累涨：47.65     9.89      15.58     23.05     14.54     5.60      19
        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：2.22      累涨：28.32               6.59      22.31     14.45     5.24      20
        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：45.99     累涨：46.64     9.66      15.05     22.70     14.41     5.59      21
        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：58.93     累涨：46.96     10.24     15.02     22.48     14.32     5.39      22
        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.38      累涨：46.39     9.89      14.67     22.79     14.21     5.28      23
        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：34.68     累涨：45.31     9.03      15.16     21.89     14.13     5.17      24
        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：807.24    累涨：47.44     10.31     15.37     22.60     14.03     5.47      25
        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：2.94      累涨：52.82     13.30     19.73     20.57     12.67     4.67      26
        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：2.21      累涨：52.88     12.57     20.23     20.43     12.62     4.35      27
        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.41      累涨：50.53     12.41     18.94     19.68     12.37     3.97      28
        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：0.98      累涨：44.22     9.88      14.52     20.66     12.34     4.75      29
        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.81      累涨：34.11     4.48      14.86     17.95     11.52     3.60      30
        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.30      累涨：12.97                         12.97     11.36     3.64      31
        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：2.99      累涨：50.22     11.40     18.95     21.02     11.30     5.63      32
        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.72      累涨：50.43     11.04     19.34     21.03     11.04     5.24      33
        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：2.89      累涨：50.54     11.04     19.23     21.13     11.02     5.38      34
        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：74.84     累涨：51.35     11.62     19.53     21.36     10.96     5.16      35
        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：43.77     累涨：50.51     10.99     19.96     20.61     10.91     5.28      36
        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.53      累涨：52.33     11.53     21.30     20.30     10.83     5.74      37
        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.34      累涨：42.70               21.20     22.79     10.71     5.50      38
        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：57.84     累涨：50.33     11.25     19.60     20.63     10.66     5.06      39
        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：37.48     累涨：50.34     11.22     19.71     20.60     10.62     5.03      40
        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：11.27     累涨：49.70     10.94     19.53     20.28     10.43     4.95      41
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.66      累涨：46.55     2.93      22.83     22.36     10.24     5.41      42
        INDEX_688.put("588860", "指数-科创板           ");//科创医药ETF           市值：5.29      累涨：34.29     4.14      10.58     20.75     10.16     3.40      43
        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：24.60     累涨：38.72     8.46      13.72     18.49     10.00     3.31      44
        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.44      累涨：50.04     11.30     19.65     20.12     9.62      4.73      45
        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：15.87     累涨：37.68     8.44      13.30     17.66     9.31      3.30      46
        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.72      累涨：38.54     8.40      14.22     17.89     9.28      2.99      47
        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：91.63     累涨：38.60     8.96      13.77     17.65     9.21      3.43      48
        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.52      累涨：36.08     5.28      14.36     18.00     9.18      3.19      49
        INDEX_688.put("588700", "指数-科创板           ");//科创医药指数ETF       市值：3.62      累涨：33.16     4.34      11.02     19.12     9.08      2.90      50
        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：48.38     累涨：36.30     7.99      13.62     16.45     8.97      3.06      51
        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：43.72     累涨：38.46     8.35      14.38     17.50     8.96      3.05      52
        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：18.56     累涨：37.64     8.29      13.84     17.58     8.90      2.81      53
        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.98      累涨：36.83     6.66      14.54     17.39     8.82      3.23      54
        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：25.12     累涨：37.32     8.17      13.89     16.99     8.79      3.00      55
        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.76      累涨：38.75     8.51      14.54     17.63     8.76      3.09      56
        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.60      累涨：36.08     8.26      13.34     16.10     8.74      2.82      57
        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：12.01     累涨：36.75     8.06      13.82     16.61     8.70      3.03      58
        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.89      累涨：35.66     8.18      12.58     16.85     8.63      2.89      59
        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：18.49     累涨：36.21     8.09      13.17     16.70     8.57      2.87      60
        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.28      累涨：36.00     8.53      13.21     15.81     8.06      2.76      61
        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：2.66      累涨：29.12     6.54      9.98      13.71     7.82      4.08      62
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：1.30      累涨：6.80                          6.80      6.80      5.25      63
        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：12.33     累涨：4.76                          4.76      4.76      4.76      64
        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：9.44      累涨：4.26                          4.26      4.26      4.26      65
        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：10.16     累涨：4.24                          4.24      4.24      4.24      66
        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：6.26      累涨：2.90                          2.90      2.90      2.90      67
        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：8.90      累涨：2.80                          2.80      2.80      2.80      68
        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：9.87      累涨：2.70                          2.70      2.70      2.70      69
        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：6.76      累涨：2.70                          2.70      2.70      2.70      70
        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：10.82     累涨：2.54                          2.54      2.54      2.54      71
        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：10.74     累涨：2.51                          2.51      2.51      2.51      72
        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：5.57      累涨：2.39                          2.39      2.39      2.39      73
        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：15.50     累涨：2.31                          2.31      2.31      2.31      74
        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：15.28     累涨：2.31                          2.31      2.31      2.31      75
        INDEX_688.put("589600", "指数-科创板           ");//N科创综指ETF富国      市值：18.60     累涨：                                                            76
    }
    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股
    static {
        INDEX_HK.put("159792", "指数-港股             ");//港股通互联网ETF       市值：388.73    累涨：72.87     10.36     23.70     41.42     22.65     11.10     1
        INDEX_HK.put("159568", "指数-港股             ");//港股互联网ETF         市值：3.74      累涨：74.28     11.36     23.39     41.80     22.22     11.44     2
        INDEX_HK.put("159688", "指数-港股             ");//恒生互联网ETF         市值：5.89      累涨：66.05     9.77      21.96     36.55     22.14     11.87     3
        INDEX_HK.put("513330", "指数-港股             ");//恒生互联网ETF         市值：246.47    累涨：65.95     9.04      21.85     37.02     22.14     11.71     4
        INDEX_HK.put("513040", "指数-港股             ");//港股通互联网ETF       市值：4.89      累涨：72.96     10.32     24.65     40.48     21.95     11.16     5
        INDEX_HK.put("513160", "指数-港股             ");//港股科技30ETF         市值：10.13     累涨：76.30     11.73     28.61     37.07     21.62     11.26     6
        INDEX_HK.put("159750", "指数-港股             ");//港股科技50ETF         市值：4.88      累涨：68.01     9.45      24.85     35.81     21.34     7.75      7
        INDEX_HK.put("513770", "指数-港股             ");//港股互联网ETF         市值：43.02     累涨：72.90     9.75      24.98     40.74     21.21     11.27     8
        INDEX_HK.put("159741", "指数-港股             ");//恒生科技ETF基金       市值：6.38      累涨：67.91     10.33     25.03     34.62     20.41     9.31      9
        INDEX_HK.put("513130", "指数-港股             ");//恒生科技ETF           市值：242.05    累涨：68.21     10.66     25.25     34.37     20.24     9.36      10
        INDEX_HK.put("159740", "指数-港股             ");//恒生科技ETF           市值：56.29     累涨：66.29     9.85      24.68     34.28     20.04     9.06      11
        INDEX_HK.put("513380", "指数-港股             ");//恒生科技ETF龙头       市值：35.84     累涨：68.23     10.54     25.85     34.48     19.95     9.03      12
        INDEX_HK.put("513580", "指数-港股             ");//恒生科技ETF指数基金   市值：21.59     累涨：68.06     11.15     25.33     33.90     19.82     9.04      13
        INDEX_HK.put("159636", "指数-港股             ");//港股通科技30ETF       市值：156.13    累涨：68.76     11.50     23.98     35.71     19.74     8.64      14
        INDEX_HK.put("513180", "指数-港股             ");//恒生科技指数ETF       市值：262.81    累涨：68.06     11.12     25.38     33.87     19.54     8.76      15
        INDEX_HK.put("513010", "指数-港股             ");//恒生科技ETF易方达     市值：102.71    累涨：66.65     10.37     25.09     33.59     19.45     8.94      16
        INDEX_HK.put("159742", "指数-港股             ");//恒生科技指数ETF       市值：15.54     累涨：66.41     10.33     25.18     33.34     19.39     8.83      17
        INDEX_HK.put("513260", "指数-港股             ");//恒生科技ETF基金       市值：27.00     累涨：67.84     11.29     25.48     33.49     19.38     8.96      18
        INDEX_HK.put("513890", "指数-港股             ");//恒生科技HKETF         市值：3.73      累涨：66.33     10.37     24.98     33.80     19.05     8.49      19
        INDEX_HK.put("513980", "指数-港股             ");//港股科技50ETF         市值：102.16    累涨：69.55     10.37     26.64     35.12     18.68     7.13      20
        INDEX_HK.put("159735", "指数-港股             ");//港股消费ETF           市值：5.31      累涨：63.13     11.15     20.18     34.59     18.26     7.77      21
        INDEX_HK.put("513860", "指数-港股             ");//港股通科技ETF         市值：12.63     累涨：68.27     10.36     26.06     34.92     18.03     7.45      22
        INDEX_HK.put("513150", "指数-港股             ");//港股通科技ETF华泰柏瑞 市值：1.72      累涨：69.95     11.65     27.19     33.93     17.94     7.16      23
        INDEX_HK.put("513230", "指数-港股             ");//港股消费ETF           市值：2.72      累涨：60.27     10.31     19.88     33.10     17.69     7.02      24
        INDEX_HK.put("520600", "指数-港股             ");//港股汽车ETF           市值：6.77      累涨：57.45               31.08     36.38     17.60     5.33      25
        INDEX_HK.put("513070", "指数-港股             ");//港股消费ETF易方达     市值：3.16      累涨：60.45     11.54     19.98     32.02     17.21     6.66      26
        INDEX_HK.put("513020", "指数-港股             ");//港股科技ETF           市值：5.46      累涨：68.69     10.31     26.92     34.26     17.15     7.09      27
        INDEX_HK.put("159751", "指数-港股             ");//港股科技ETF           市值：4.91      累涨：65.71     9.62      25.73     33.25     16.82     6.58      28
        INDEX_HK.put("513320", "指数-港股             ");//恒生新经济ETF         市值：2.66      累涨：64.04     10.25     24.66     32.73     16.41     6.43      29
        INDEX_HK.put("159323", "指数-港股             ");//港股通汽车ETF         市值：1.69      累涨：46.70               22.44     28.09     16.07     4.47      30
        INDEX_HK.put("513900", "指数-港股             ");//港股通100ETF          市值：1.59      累涨：47.72     7.68      14.15     27.64     15.84     6.93      31
        INDEX_HK.put("159788", "指数-港股             ");//港股通100ETF          市值：1.04      累涨：47.56     8.17      15.22     26.12     15.38     6.82      32
        INDEX_HK.put("513750", "指数-港股             ");//港股非银ETF           市值：10.43     累涨：45.21     10.38     12.58     23.54     15.15     6.23      33
        INDEX_HK.put("513550", "指数-港股             ");//港股通50ETF           市值：28.69     累涨：45.93     8.65      13.20     25.25     14.31     6.02      34
        INDEX_HK.put("159850", "指数-港股             ");//恒生国企ETF           市值：9.97      累涨：49.30     11.06     15.32     24.58     13.70     5.48      35
        INDEX_HK.put("159892", "指数-港股             ");//恒生医药ETF           市值：45.37     累涨：43.32     5.92      13.41     24.59     13.50     3.20      36
        INDEX_HK.put("513600", "指数-港股             ");//恒生指数ETF           市值：14.03     累涨：45.35     9.03      13.79     24.12     13.48     5.96      37
        INDEX_HK.put("513660", "指数-港股             ");//恒生ETF               市值：43.79     累涨：44.67     9.15      13.35     23.65     13.47     5.76      38
        INDEX_HK.put("159318", "指数-港股             ");//恒生港股通ETF         市值：0.59      累涨：44.57     8.25      14.12     23.75     13.32     5.58      39
        INDEX_HK.put("513990", "指数-港股             ");//港股通ETF             市值：0.91      累涨：44.87     7.10      14.56     24.58     13.27     5.71      40
        INDEX_HK.put("159920", "指数-港股             ");//恒生ETF               市值：179.03    累涨：43.68     8.79      12.84     23.61     13.21     5.69      41
        INDEX_HK.put("510900", "指数-港股             ");//H股ETF                市值：105.33    累涨：47.93     10.39     15.06     24.08     13.17     5.47      42
        INDEX_HK.put("513210", "指数-港股             ");//恒生ETF易方达         市值：0.58      累涨：44.26     8.83      13.33     23.33     13.17     5.69      43
        INDEX_HK.put("159954", "指数-港股             ");//H股ETF                市值：4.39      累涨：48.78     10.32     15.57     24.59     12.99     5.55      44
        INDEX_HK.put("159312", "指数-港股             ");//恒生ETF港股通         市值：0.59      累涨：43.03     8.53      12.45     23.70     12.97     5.28      45
        INDEX_HK.put("159567", "指数-港股             ");//港股创新药ETF         市值：4.92      累涨：42.73     5.83      14.10     24.22     12.82     2.82      46
        INDEX_HK.put("520500", "指数-港股             ");//恒生创新药ETF         市值：1.77      累涨：41.33     0.71      16.01     25.29     12.78     2.21      47
        INDEX_HK.put("159570", "指数-港股             ");//港股通创新药ETF       市值：14.60     累涨：45.78     6.44      15.87     24.88     12.54     2.69      48
        INDEX_HK.put("159712", "指数-港股             ");//港股通50ETF           市值：0.61      累涨：47.94     8.64      12.50     28.62     12.53     5.18      49
        INDEX_HK.put("159960", "指数-港股             ");//恒生中国企业ETF       市值：5.88      累涨：44.05     9.49      13.46     22.86     12.35     5.57      50
        INDEX_HK.put("159711", "指数-港股             ");//港股通ETF             市值：0.64      累涨：44.01     9.31      13.15     23.26     12.26     5.21      51
        INDEX_HK.put("513780", "指数-港股             ");//港股创新药50ETF       市值：1.68      累涨：44.56     6.82      14.86     23.50     11.72     2.34      53
        INDEX_HK.put("513200", "指数-港股             ");//港股通医药ETF         市值：31.90     累涨：44.02     5.65      14.85     24.23     11.66     3.41      54
        INDEX_HK.put("520520", "指数-港股             ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：37.62     11.39     10.66     16.86     11.44     4.71      55
        INDEX_HK.put("520700", "指数-港股             ");//港股创新药ETF基金     市值：0.89      累涨：43.26     5.29      12.91     25.17     11.41     2.14      56
        INDEX_HK.put("159776", "指数-港股             ");//港股通医药ETF         市值：1.27      累涨：41.52     5.27      13.73     23.02     11.38     3.45      57
        INDEX_HK.put("159303", "指数-港股             ");//恒生医疗ETF基金       市值：0.86      累涨：44.86     5.24      15.55     24.07     11.35     3.71      58
        INDEX_HK.put("159718", "指数-港股             ");//港股医药ETF           市值：2.25      累涨：41.89     5.56      13.48     23.35     11.24     3.57      59
        INDEX_HK.put("513060", "指数-港股             ");//恒生医疗ETF           市值：152.92    累涨：42.30     5.85      12.75     23.95     11.17     3.57      60
        INDEX_HK.put("513280", "指数-港股             ");//恒生生物科技ETF       市值：2.17      累涨：43.03     6.21      15.00     22.52     11.11     2.77      61
        INDEX_HK.put("159615", "指数-港股             ");//恒生生物科技ETF       市值：3.64      累涨：41.64     5.80      13.57     22.96     10.91     2.71      62
        INDEX_HK.put("513970", "指数-港股             ");//恒生消费ETF           市值：6.26      累涨：35.38     10.17     11.23     14.68     10.76     4.60      63
        INDEX_HK.put("513120", "指数-港股             ");//港股创新药ETF         市值：134.75    累涨：42.52     6.61      14.32     22.39     10.25     1.91      64
        INDEX_HK.put("159557", "指数-港股             ");//恒生医疗指数ETF       市值：2.35      累涨：42.60     7.20      13.89     21.51     10.09     3.24      65
        INDEX_HK.put("513140", "指数-港股             ");//港股金融ETF           市值：0.78      累涨：34.21     9.40      9.17      16.14     9.65      4.46      66
        INDEX_HK.put("159699", "指数-港股             ");//恒生消费ETF           市值：8.32      累涨：35.28     10.70     11.56     13.97     9.03      2.76      67
        INDEX_HK.put("513190", "指数-港股             ");//港股通金融ETF         市值：5.00      累涨：36.39     11.52     10.63     14.24     8.36      3.65      68
        INDEX_HK.put("513170", "指数-港股             ");//恒生央企ETF           市值：4.50      累涨：31.61     9.99      7.94      14.00     8.00      2.85      69
        INDEX_HK.put("159726", "指数-港股             ");//恒生红利ETF           市值：5.74      累涨：28.79     9.66      6.42      13.28     7.84      3.64      70
        INDEX_HK.put("513690", "指数-港股             ");//港股红利ETF博时       市值：36.67     累涨：27.35     10.36     5.45      11.54     7.13      2.94      71
        INDEX_HK.put("520550", "指数-港股             ");//港股红利低波ETF       市值：1.86      累涨：13.09               3.03      10.06     6.69      3.18      72
        INDEX_HK.put("513920", "指数-港股             ");//港股通央企红利ETF     市值：33.10     累涨：30.14     11.07     7.90      11.85     6.55      2.41      73
        INDEX_HK.put("513950", "指数-港股             ");//恒生红利ETF           市值：10.65     累涨：26.42     10.18     5.72      10.61     6.38      2.73      74
        INDEX_HK.put("159519", "指数-港股             ");//港股国企ETF           市值：2.00      累涨：31.17     11.92     7.71      11.54     6.29      2.79      75
        INDEX_HK.put("159545", "指数-港股             ");//恒生红利低波ETF       市值：8.70      累涨：25.33     8.78      6.66      9.97      6.13      2.68      76
        INDEX_HK.put("520890", "指数-港股             ");//港股通红利低波ETF     市值：0.72      累涨：38.16     21.58     6.92      9.83      6.12      2.72      77
        INDEX_HK.put("513810", "指数-港股             ");//港股国企ETF           市值：0.48      累涨：31.01     11.58     7.58      11.85     6.02      2.30      78
        INDEX_HK.put("513910", "指数-港股             ");//港股央企红利ETF       市值：25.97     累涨：29.85     13.67     7.00      9.80      5.84      2.48      79
        INDEX_HK.put("513630", "指数-港股             ");//港股红利指数ETF       市值：91.82     累涨：24.69     8.60      6.44      9.65      5.67      2.91      80
        INDEX_HK.put("159333", "指数-港股             ");//港股央企红利ETF       市值：4.88      累涨：39.17     24.09     6.35      8.82      4.75      1.67      81
        INDEX_HK.put("159569", "指数-港股             ");//港股红利低波ETF       市值：1.46      累涨：26.56     14.30     5.16      7.10      4.40      2.69      82
        INDEX_HK.put("513530", "指数-港股             ");//港股通红利ETF         市值：14.51     累涨：24.66     11.77     5.05      7.84      4.01      2.00      83
        INDEX_HK.put("159302", "指数-港股             ");//港股高股息ETF         市值：1.16      累涨：22.94     9.76      5.75      7.43      3.97      1.80      84
        INDEX_HK.put("520900", "指数-港股             ");//红利ETF港股           市值：29.29     累涨：26.43     11.24     6.76      8.54      3.95      2.42      85
        INDEX_HK.put("520990", "指数-港股             ");//港股央企红利50ETF     市值：48.33     累涨：27.26     12.63     6.80      8.27      3.82      2.52      86
        INDEX_HK.put("159331", "指数-港股             ");//红利港股ETF           市值：0.88      累涨：32.97     21.94     4.83      6.20      3.58      1.96      87
        INDEX_HK.put("159691", "指数-港股             ");//港股红利ETF           市值：59.67     累涨：20.70     9.74      4.96      6.28      3.23      1.85      88
        INDEX_HK.put("513820", "指数-港股             ");//港股红利ETF基金       市值：19.90     累涨：21.95     10.29     5.20      6.46      3.12      1.66      89
        INDEX_HK.put("520660", "指数-港股             ");//港股通央企红利ETF南方 市值：11.02     累涨：24.80     12.14     6.42      6.46      2.52      1.65      90
        INDEX_HK.put("513830", "指数-港股             ");//N港股红利ETF          市值：8.49      累涨：                                                            91
    }

    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘
    static {
        INDEX_CN_NOT.put("159529", "指数-外盘             ");//标普消费ETF           市值：6.24      累涨：110.17    53.30     36.23     22.54     18.29     18.29     1
        INDEX_CN_NOT.put("159612", "指数-外盘             ");//标普500ETF            市值：5.89      累涨：41.81     10.89     11.55     19.77     17.14     17.08     2
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.17     累涨：61.43     11.29     35.89     23.01     9.59      2.78      3
        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：10.55     累涨：84.44     20.48     53.91     15.88     7.07      2.30      4
        INDEX_CN_NOT.put("513350", "指数-外盘             ");//标普油气ETF           市值：5.52      累涨：65.08     29.03     35.98     9.50      6.60      6.60      5
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：6.87      累涨：62.59     24.39     30.52     12.30     5.97      4.73      6
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：9.08      累涨：45.69     8.16      29.43     12.94     5.28      0.73      7
        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：19.99     累涨：19.33     4.38      8.18      8.49      4.21      0.35      8
        INDEX_CN_NOT.put("159509", "指数-外盘             ");//纳指科技ETF           市值：88.84     累涨：31.65     15.38     10.11     7.83      3.75      2.02      9
        INDEX_CN_NOT.put("562060", "指数-外盘             ");//标普红利ETF           市值：15.56     累涨：16.72     2.84      7.76      6.12      3.75      2.52      10
        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：8.39      累涨：22.24     5.08      10.80     7.14      3.35      2.07      11
        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：7.31      累涨：66.48     17.83     42.63     7.34      2.98      1.85      12
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：11.80     累涨：27.23     6.92      15.29     6.19      2.95      1.30      13
        INDEX_CN_NOT.put("159518", "指数-外盘             ");//标普油气ETF           市值：10.44     累涨：50.95     30.03     25.69     4.81      2.91      2.91      14
        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：6.41      累涨：51.78     16.69     31.19     7.97      2.87      2.28      15
        INDEX_CN_NOT.put("513100", "指数-外盘             ");//纳指ETF               市值：138.21    累涨：25.47     11.55     8.36      6.36      2.87      1.61      16
        INDEX_CN_NOT.put("159941", "指数-外盘             ");//纳指ETF               市值：232.29    累涨：26.37     12.29     8.54      6.19      2.74      1.77      17
        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.49      累涨：33.03     7.16      21.60     6.99      2.52      1.22      18
        INDEX_CN_NOT.put("159502", "指数-外盘             ");//标普生物科技ETF       市值：10.94     累涨：27.40     11.27     10.97     5.86      2.13      0.86      19
        INDEX_CN_NOT.put("513300", "指数-外盘             ");//纳斯达克ETF           市值：60.44     累涨：26.44     14.00     7.99      5.27      2.11      1.01      20
        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：5.37      累涨：3.25                          3.25      2.06      0.55      21
        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：13.99     累涨：19.67     7.09      8.36      4.96      2.01      1.09      22
        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：11.63     累涨：25.81     9.85      12.57     4.41      1.91      0.64      23
        INDEX_CN_NOT.put("159632", "指数-外盘             ");//纳斯达克ETF           市值：91.68     累涨：27.44     14.86     8.33      4.95      1.91      0.86      24
        INDEX_CN_NOT.put("513290", "指数-外盘             ");//纳指生物科技ETF       市值：14.35     累涨：26.72     8.98      13.18     5.31      1.78      0.34      25
        INDEX_CN_NOT.put("159513", "指数-外盘             ");//纳斯达克100指数ETF    市值：56.51     累涨：26.02     11.21     10.90     4.94      1.39      0.92      26
        INDEX_CN_NOT.put("513390", "指数-外盘             ");//纳指100ETF            市值：16.51     累涨：26.78     14.38     9.51      3.98      1.12      0.82      27
        INDEX_CN_NOT.put("159659", "指数-外盘             ");//纳斯达克100ETF        市值：45.81     累涨：27.13     14.44     9.61      3.71      0.92      0.92      28
        INDEX_CN_NOT.put("159696", "指数-外盘             ");//纳指ETF易方达         市值：23.06     累涨：25.57     13.39     9.04      3.61      0.92      0.77      29
        INDEX_CN_NOT.put("159577", "指数-外盘             ");//美国50ETF             市值：11.19     累涨：24.21     12.48     8.40      4.02      0.87      0.87      30
        INDEX_CN_NOT.put("513650", "指数-外盘             ");//标普500ETF南方        市值：38.40     累涨：16.48     7.64      6.34      3.12      0.74      0.41      31
        INDEX_CN_NOT.put("159501", "指数-外盘             ");//纳斯达克指数ETF       市值：67.54     累涨：23.85     12.21     8.77      3.53      0.74      0.53      32
        INDEX_CN_NOT.put("513110", "指数-外盘             ");//纳斯达克100ETF        市值：33.90     累涨：26.57     13.92     9.39      3.96      0.73      0.67      33
        INDEX_CN_NOT.put("159660", "指数-外盘             ");//纳指100ETF            市值：24.65     累涨：28.18     16.27     8.81      3.78      0.72      0.72      34
        INDEX_CN_NOT.put("513850", "指数-外盘             ");//美国50ETF             市值：19.77     累涨：23.48     11.84     8.57      3.83      0.71      0.71      35
        INDEX_CN_NOT.put("159655", "指数-外盘             ");//标普ETF               市值：18.28     累涨：26.68     10.83     13.19     3.20      0.67      0.48      36
        INDEX_CN_NOT.put("513870", "指数-外盘             ");//纳指ETF富国           市值：15.14     累涨：26.06     13.20     9.81      3.70      0.60      0.60      37
        INDEX_CN_NOT.put("513400", "指数-外盘             ");//道琼斯ETF             市值：21.50     累涨：19.79     8.78      8.07      3.63      0.55      0.37      38
        INDEX_CN_NOT.put("513500", "指数-外盘             ");//标普500ETF            市值：162.24    累涨：15.03     7.71      5.40      2.61      0.05                39
    }
    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘
    static {
        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.59      累涨：43.88     8.24      17.57     18.66     9.32      5.19      1
        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.14      累涨：44.70     7.38      20.87     17.85     8.72      3.72      2
        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.21      累涨：38.87     8.03      15.99     15.04     8.46      3.08      3
        INDEX_CN_1000.put("159521", "指数-中小盘           ");//2000指数ETF           市值：0.23      累涨：39.20     8.82      16.30     15.28     8.25      2.97      4
        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.15      累涨：37.33     7.15      15.86     15.05     8.24      3.76      5
        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.51      累涨：44.97     10.14     18.87     17.33     8.20      3.44      6
        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.15      累涨：44.50     10.56     18.40     17.12     8.01      2.88      7
        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.11      累涨：42.56     11.54     17.24     15.44     7.89      4.42      8
        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：7.25      累涨：41.13     7.35      19.24     15.48     7.83      3.14      9
        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.51      累涨：47.71     11.88     20.78     16.42     7.80      4.21      10
        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：5.74      累涨：46.12     10.34     20.87     16.96     7.69      3.26      11
        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：1.54      累涨：41.98     9.07      18.89     15.78     7.69      3.54      12
        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.16      累涨：34.79     5.71      15.98     13.37     7.63      3.25      13
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.17      累涨：44.66     11.18     19.27     15.67     7.59      3.04      14
        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.40      累涨：37.80     7.18      16.71     14.09     7.58      2.49      15
        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.12      累涨：38.90     6.42      17.77     15.75     7.58      3.10      16
        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：1.37      累涨：37.19     5.88      18.14     13.66     7.55      2.17      17
        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.79      累涨：45.61     10.35     20.30     16.61     7.52      3.29      18
        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.23      累涨：43.89     9.84      19.99     15.77     7.47      3.00      19
        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：30.25     累涨：44.99     9.61      20.47     17.04     7.42      3.00      20
        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF指数       市值：0.20      累涨：41.05     8.93      18.43     15.04     7.27      3.38      21
        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.59      累涨：42.90     10.01     18.97     15.77     7.16      2.87      22
        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.37      累涨：36.08     7.88      15.60     12.89     7.13      2.59      23
        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.75      累涨：42.02     8.40      20.55     14.77     7.05      2.59      24
        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：102.55    累涨：36.72     6.48      17.06     13.81     7.00      2.81      25
        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.56      累涨：43.03     9.86      17.87     16.64     6.99      2.01      26
        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.85      累涨：28.34     4.57      13.17     10.60     6.95      3.93      27
        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.47      累涨：36.45     5.74      17.68     13.47     6.94      2.95      28
        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：307.15    累涨：37.31     6.43      17.49     13.86     6.82      2.57      29
        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：560.49    累涨：37.85     6.82      17.73     13.74     6.80      2.62      30
        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：25.04     累涨：37.07     6.22      17.76     13.68     6.74      2.69      31
        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：254.84    累涨：37.07     6.62      17.34     13.54     6.68      2.58      32
        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：1.42      累涨：35.82     6.02      17.38     13.09     6.54      2.58      33
        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：3.52      累涨：38.06     6.69      19.31     12.82     6.39      2.91      34
        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.45      累涨：27.00     5.81      10.93     10.26     6.25      3.19      35
        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.58      累涨：27.67     4.84      11.80     11.37     6.25      3.17      36
        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.80      累涨：28.57     5.86      13.87     9.30      6.16      2.60      37
        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：4.21      累涨：28.57     4.20      13.46     11.97     6.13      2.42      38
        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.47      累涨：31.27     5.25      15.24     10.97     6.07      2.45      39
        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：7.31      累涨：30.77     5.85      14.25     10.67     6.04      2.99      40
        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.35      累涨：38.84     8.75      16.74     14.38     6.01      1.35      41
        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.86      累涨：28.60     4.21      13.41     11.80     5.99      2.29      42
        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：3.15      累涨：29.20     3.95      13.98     12.09     5.95      2.74      43
        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.23      累涨：33.69     4.76      19.00     10.57     5.92      2.59      44
        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.33      累涨：28.53     5.66      13.11     9.83      5.86      2.61      45
        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.95      累涨：29.94     6.49      13.47     10.64     5.80      3.09      46
        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.53      累涨：24.74     5.71      10.53     8.50      5.74      2.84      47
        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.66      累涨：29.34     6.46      12.95     10.51     5.68      2.69      48
        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.82      累涨：28.46     5.05      13.29     10.12     5.67      2.58      49
        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.18      累涨：26.20     6.80      10.22     9.18      5.66      2.51      50
        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.24      累涨：28.59     5.88      12.95     9.76      5.63      2.91      51
        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.62      累涨：25.64     6.09      10.88     8.67      5.55      2.75      52
        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.62      累涨：28.86     4.71      13.92     10.23     5.51      2.58      53
        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：7.27      累涨：28.85     5.11      13.48     10.27     5.51      2.51      54
        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.76      累涨：28.36     4.92      13.41     10.03     5.49      2.44      55
        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：116.48    累涨：29.70     5.19      14.13     10.38     5.47      2.34      56
        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：20.94     累涨：29.30     5.31      13.96     10.03     5.44      2.46      57
        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：22.87     累涨：28.62     4.86      13.77     9.99      5.34      2.20      58
        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1010.22   累涨：29.51     5.32      14.14     10.05     5.29      2.39      59
        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：7.18      累涨：27.81     4.97      12.88     9.96      5.27      1.88      60
        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.61      累涨：23.72     4.61      9.50      9.61      5.24      2.94      61
        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：11.40     累涨：27.92     4.50      13.65     9.77      5.23      2.42      62
        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.72      累涨：28.93     4.86      13.68     11.23     5.21      2.04      63
        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：12.97     累涨：28.21     4.93      13.25     10.03     5.20      2.28      64
        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：1.25      累涨：28.71     5.22      13.80     9.69      5.16      2.14      65
        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：139.19    累涨：29.09     5.29      14.17     9.63      5.16      2.29      66
        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：3.17      累涨：27.75     4.83      13.46     9.46      5.07      2.16      67
        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：32.78     累涨：28.52     4.99      13.94     9.59      5.05      2.32      68
        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.89      累涨：26.17     5.09      11.63     9.45      4.96      2.51      69
        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.81      累涨：29.52     6.96      13.67     9.26      4.94      3.00      70
        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.34      累涨：30.40     7.27      12.47     10.66     4.90      1.86      71
        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：4.30      累涨：31.06     7.30      15.11     8.65      4.85      2.47      72
        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.51      累涨：23.80     4.01      11.86     8.53      4.84      2.24      73
        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.64      累涨：23.89     5.13      10.17     8.59      4.80      2.38      74
        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.18      累涨：18.82     3.87      7.79      7.16      4.69      2.53      75
        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：245.07    累涨：23.15     4.20      10.65     8.40      4.67      2.70      76
        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：201.09    累涨：22.44     4.33      10.16     8.05      4.62      2.51      77
        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.97      累涨：24.23     5.03      10.40     8.80      4.61      1.60      78
        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.85      累涨：31.68     7.53      15.43     8.86      4.43      2.62      79
        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：82.81     累涨：22.32     4.26      10.42     7.84      4.43      2.41      80
        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：192.10    累涨：21.70     4.03      10.27     7.50      4.41      2.30      81
        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：51.49     累涨：21.82     3.73      10.65     7.44      4.40      2.34      82
        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：147.53    累涨：22.64     4.43      10.78     7.73      4.38      2.54      83
        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：118.74    累涨：22.26     4.42      10.46     7.48      4.37      2.39      84
        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500指数ETF           市值：144.58    累涨：22.22     4.51      10.42     7.49      4.36      2.33      85
        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：212.65    累涨：22.07     3.90      10.66     7.80      4.36      2.37      86
        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：86.74     累涨：21.19     4.26      9.74      7.29      4.32      2.36      87
        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.83      累涨：23.10     4.67      10.45     7.98      4.30      2.37      88
        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：4.87      累涨：17.68               10.45     7.61      4.30      2.38      89
        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：166.64    累涨：22.15     4.23      10.37     7.65      4.29      2.34      90
        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.54      累涨：26.62     4.94      12.59     9.09      4.29      1.64      91
        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：203.56    累涨：22.31     4.10      10.48     7.83      4.29      2.29      92
        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：12.36     累涨：9.51                1.99      7.52      4.27      2.38      93
        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：19.32     3.43      8.97      7.10      4.24      2.21      94
        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：28.95     累涨：21.99     4.24      10.53     7.32      4.20      2.24      95
        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：4.46      累涨：18.28     0.20      10.48     7.60      4.19      2.28      96
        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：34.44     累涨：21.26     3.91      10.10     7.25      4.18      2.28      97
        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：2.45      累涨：11.04               3.71      7.52      4.16      2.32      98
        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：51.90     累涨：21.46     4.09      10.35     7.22      4.16      2.17      99
        INDEX_CN_1000.put("560530", "指数-中小盘           ");//中证A500ETF摩根       市值：105.24    累涨：21.92     3.88      10.77     7.57      4.15      2.22      100
        INDEX_CN_1000.put("563360", "指数-中小盘           ");//中证A500ETF基金       市值：162.26    累涨：22.03     4.37      10.39     7.37      4.14      2.26      101
        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：42.60     累涨：21.57     3.98      10.41     7.28      4.14      2.26      102
        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：18.01     累涨：21.83     4.14      10.55     7.33      4.11      2.24      103
        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：60.84     累涨：21.19     4.22      9.90      7.27      4.09      2.29      104
        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：75.49     累涨：20.69     3.57      10.26     7.07      4.06      2.29      105
        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：15.20     累涨：13.39               6.15      7.34      4.06      2.22      106
        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：1.67      累涨：8.78                1.91      6.87      3.99      2.19      107
        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：5.44      累涨：15.16               6.64      8.52      3.98      2.13      108
        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：41.20     累涨：21.82     4.16      10.58     7.28      3.94      2.16      109
        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.42      累涨：19.09     4.39      8.30      6.40      3.77      2.26      110
        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：39.47     累涨：21.57     4.20      10.36     7.31      3.76      1.97      111
        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.36      累涨：18.31     5.32      8.00      4.99      3.70      2.40      112
        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：1.22      累涨：15.80     5.24      6.65      4.01      2.50      1.50      113
    }
    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板
    static {
        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.40      累涨：52.86     8.38      25.97     18.61     9.57      3.45      1
        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.43      累涨：55.28     8.75      26.90     19.63     9.34      3.29      2
        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.61      累涨：54.22     8.85      27.01     18.55     9.33      3.23      3
        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.12      累涨：53.43     10.56     24.81     18.54     9.21      3.30      4
        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.70      累涨：42.40     7.87      18.72     15.81     8.85      3.70      5
        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.36      累涨：51.00     8.78      25.79     17.68     7.90      2.41      6
        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.49      累涨：38.65     5.43      20.05     13.43     6.27      2.64      7
        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.63      累涨：40.92     5.97      21.83     13.41     5.98      2.61      8
        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：6.67      累涨：34.00     2.88      18.51     12.61     5.53      3.14      9
        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.95      累涨：39.32     5.16      21.50     12.66     5.52      2.98      10
        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.23      累涨：16.75               3.57      13.18     5.51      3.52      11
        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：267.50    累涨：36.22     3.31      20.52     12.39     5.43      3.36      12
        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：2.40      累涨：38.54     4.37      21.59     12.58     5.32      2.28      13
        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：42.47     累涨：42.34     6.63      23.48     12.23     5.32      3.12      14
        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：17.45     累涨：35.64     3.73      20.58     11.56     5.22      3.32      15
        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：15.71     累涨：35.88     6.64      16.11     13.13     5.21      1.91      16
        INDEX_300.put("159836", "指数-创业板           ");//创300ETF              市值：1.76      累涨：37.47     3.76      21.03     12.68     5.12      2.45      17
        INDEX_300.put("159957", "指数-创业板           ");//创业板100ETF华夏      市值：19.19     累涨：33.84     2.95      19.21     11.76     5.11      3.07      18
        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.43      累涨：34.22     4.82      17.44     12.08     5.07      3.03      19
        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：50.74     累涨：35.75     3.43      20.62     11.82     5.07      3.25      20
        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.62      累涨：13.00               1.60      11.40     5.06      3.15      21
        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：24.99     累涨：35.95     6.76      16.50     12.69     5.03      2.03      22
        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.93      累涨：35.32     3.35      19.30     12.67     4.94      2.77      23
        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：1.08      累涨：15.14               3.53      11.61     4.93      3.07      24
        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：26.78     累涨：33.48     2.79      19.33     11.51     4.93      2.81      25
        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.30      累涨：34.87     3.27      18.22     13.38     4.93      2.85      26
        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：0.47      累涨：30.80     0.31      19.27     11.53     4.92      3.04      27
        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：95.44     累涨：33.37     2.88      18.89     11.70     4.91      2.82      28
        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：120.05    累涨：35.17     3.38      20.03     12.10     4.91      2.93      29
        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：0.53      累涨：25.52               12.92     12.60     4.91      3.19      30
        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.28      累涨：34.67     7.37      15.13     12.17     4.91      1.73      31
        INDEX_300.put("159721", "指数-创业板           ");//深创龙头ETF           市值：0.90      累涨：36.41     7.18      18.53     10.70     4.89      2.64      32
        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：21.13     累涨：33.63     3.22      19.09     11.59     4.89      2.86      33
        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.10      累涨：34.44     3.11      19.60     12.00     4.89      2.82      34
        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.64      累涨：34.83     4.20      18.58     12.05     4.88      2.56      35
        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：48.31     累涨：34.35     3.62      19.14     11.78     4.88      2.96      36
        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：5.43      累涨：33.92     3.21      19.15     11.64     4.87      2.81      37
        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.36      累涨：34.08     3.74      18.51     12.00     4.85      2.94      38
        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：872.45    累涨：34.79     3.34      19.82     11.84     4.82      2.87      39
        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.23      累涨：33.35     3.14      19.30     10.99     4.62      2.65      40
        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：1.07      累涨：35.56     6.94      18.67     9.95      4.59      2.42      41
        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.88      累涨：33.40     6.02      15.10     12.28     4.45      1.56      42
        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：5.27      累涨：31.60     3.36      19.08     9.38      4.03      1.83      43
        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.43      累涨：13.29               2.27      11.02     3.88      2.29      44
        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.48      累涨：34.47     3.66      19.72     11.09     3.79      1.69      45
    }

    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘
    static {
        INDEX_CN_BIG.put("159850", "指数-大盘             ");//恒生国企ETF           市值：10.24     累涨：45.86     4.75      22.75     19.18     9.44      3.96      1
        INDEX_CN_BIG.put("159960", "指数-大盘             ");//恒生中国企业ETF       市值：6.05      累涨：41.24     3.86      20.17     18.03     8.36      3.36      2
        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：12.35     累涨：40.63     10.04     15.94     14.65     7.81      1.90      3
        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：2.56      累涨：38.75     9.45      15.50     13.80     7.58      1.84      4
        INDEX_CN_BIG.put("159726", "指数-大盘             ");//恒生红利ETF           市值：5.90      累涨：27.91     4.02      10.83     13.52     7.39      4.05      5
        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：3.09      累涨：38.65     10.37     14.63     13.65     7.39      1.60      6
        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.44      累涨：29.37     4.56      16.40     8.41      6.43      4.69      7
        INDEX_CN_BIG.put("513920", "指数-大盘             ");//港股通央企红利ETF     市值：35.99     累涨：30.03     7.29      11.55     11.27     6.40      4.36      8
        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.65      累涨：24.03     5.99      8.95      9.09      6.23      4.04      9
        INDEX_CN_BIG.put("159569", "指数-大盘             ");//港股红利低波ETF       市值：1.52      累涨：25.92     10.67     6.61      8.91      6.03      2.66      10
        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：1.22      累涨：20.84     4.99      7.49      8.58      5.85      3.47      11
        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.69      累涨：22.73     2.61      11.09     9.03      5.80      2.79      12
        INDEX_CN_BIG.put("159519", "指数-大盘             ");//港股国企ETF           市值：1.96      累涨：29.85     8.61      11.19     10.20     5.79      3.08      13
        INDEX_CN_BIG.put("562530", "指数-大盘             ");//中证1000价值ETF       市值：0.61      累涨：22.80     3.18      9.50      10.12     5.75      3.01      14
        INDEX_CN_BIG.put("159545", "指数-大盘             ");//恒生红利低波ETF       市值：11.49     累涨：24.27     5.29      9.58      9.40      5.70      2.14      15
        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1483.67   累涨：21.23     5.02      7.51      8.70      5.68      3.38      16
        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.11      累涨：26.49     9.51      8.37      8.61      5.61      3.85      17
        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：39.17     累涨：20.80     4.95      7.34      8.51      5.58      3.30      18
        INDEX_CN_BIG.put("513690", "指数-大盘             ");//港股红利ETF博时       市值：39.33     累涨：25.29     5.55      9.31      10.54     5.58      2.64      19
        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：1.99      累涨：20.86     5.08      7.35      8.43      5.55      3.25      20
        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：6.53      累涨：21.23     5.04      7.67      8.52      5.53      3.16      21
        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：2.42      累涨：21.60     4.86      8.02      8.72      5.50      3.16      22
        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：20.48     累涨：22.25     5.55      7.56      9.14      5.45      3.09      23
        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：1.07      累涨：23.90     2.83      11.99     9.08      5.42      2.88      24
        INDEX_CN_BIG.put("560500", "指数-大盘             ");//500质量成长ETF        市值：5.48      累涨：23.87     4.53      10.53     8.81      5.40      2.83      25
        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF指数         市值：1.02      累涨：21.06     4.75      7.85      8.46      5.37      2.98      26
        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.43      累涨：21.36     2.70      10.21     8.45      5.32      3.73      27
        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.65      累涨：25.24     5.11      10.52     9.61      5.30      2.74      28
        INDEX_CN_BIG.put("513910", "指数-大盘             ");//港股央企红利ETF       市值：26.87     累涨：28.59     9.71      9.58      9.30      5.26      3.09      29
        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：27.47     累涨：25.14     3.28      11.82     10.04     5.26      2.75      30
        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.52      累涨：19.46     3.34      7.50      8.62      5.24      2.92      31
        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.66      累涨：21.56     3.36      9.70      8.50      5.19      3.04      32
        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：33.59     累涨：18.42     3.12      7.19      8.11      5.15      2.71      33
        INDEX_CN_BIG.put("513630", "指数-大盘             ");//港股红利指数ETF       市值：94.67     累涨：23.73     5.90      9.39      8.75      5.14      2.77      34
        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.40      累涨：19.54     4.12      8.12      7.30      5.14      3.46      35
        INDEX_CN_BIG.put("159335", "指数-大盘             ");//央企科创ETF           市值：2.61      累涨：28.00     4.94      12.43     10.63     5.13      1.48      36
        INDEX_CN_BIG.put("159836", "指数-大盘             ");//创300ETF              市值：1.76      累涨：37.47     3.76      21.03     12.68     5.12      2.45      37
        INDEX_CN_BIG.put("513810", "指数-大盘             ");//港股国企ETF           市值：0.49      累涨：28.28     7.50      11.63     9.75      5.12      2.55      38
        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：2.05      累涨：19.37     4.52      6.54      8.31      5.12      2.96      39
        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.27      累涨：21.61     3.86      9.73      8.02      5.08      3.35      40
        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.71      累涨：22.12     5.24      9.05      7.83      4.99      2.97      41
        INDEX_CN_BIG.put("159691", "指数-大盘             ");//港股红利ETF           市值：60.39     累涨：19.48     5.47      7.27      6.74      4.99      2.42      42
        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：43.75     累涨：22.32     5.24      9.34      7.74      4.98      2.91      43
        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：37.00     累涨：21.56     5.11      8.71      7.74      4.98      2.91      44
        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.54      累涨：21.27     5.39      7.39      8.49      4.96      2.69      45
        INDEX_CN_BIG.put("512550", "指数-大盘             ");//A50ETF基金            市值：3.91      累涨：20.58     4.40      8.32      7.86      4.94      3.32      46
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：9.44      累涨：22.37     2.89      10.97     8.51      4.91      2.96      47
        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：51.80     累涨：21.55     5.26      8.87      7.42      4.89      2.80      48
        INDEX_CN_BIG.put("513950", "指数-大盘             ");//恒生红利ETF           市值：11.27     累涨：24.82     6.18      9.27      9.37      4.88      2.33      49
        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.76      累涨：24.20     3.87      11.41     8.92      4.88      2.59      50
        INDEX_CN_BIG.put("520890", "指数-大盘             ");//港股通红利低波ETF     市值：0.74      累涨：36.58     17.87     9.44      9.27      4.87      2.08      51
        INDEX_CN_BIG.put("562890", "指数-大盘             ");//中证A50指数ETF        市值：6.31      累涨：21.15     3.71      9.52      7.92      4.85      3.08      52
        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.46      累涨：22.15     3.68      10.06     8.41      4.85      2.74      53
        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：11.79     累涨：22.27     5.23      9.15      7.89      4.83      2.84      54
        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：42.41     累涨：21.19     3.78      9.53      7.88      4.82      3.15      55
        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：65.96     累涨：21.18     3.50      9.81      7.87      4.82      3.15      56
        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：26.15     累涨：20.82     3.85      9.24      7.73      4.81      3.20      57
        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：22.37     累涨：19.40     3.08      8.39      7.93      4.81      2.34      58
        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：10.71     累涨：20.89     3.84      9.40      7.65      4.79      3.13      59
        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：13.14     累涨：21.18     3.63      9.71      7.84      4.77      3.09      60
        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.32      累涨：20.88     5.65      7.54      7.69      4.76      2.73      61
        INDEX_CN_BIG.put("513170", "指数-大盘             ");//恒生央企ETF           市值：4.88      累涨：29.13     5.65      12.04     11.75     4.75      2.29      62
        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：4.23      累涨：12.89               5.63      7.26      4.75      2.62      63
        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.87      累涨：19.38     3.22      8.93      7.23      4.74      2.75      64
        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：2.10      累涨：15.62     0.84      7.01      7.77      4.74      2.41      65
        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.51      累涨：18.51     2.28      8.90      7.33      4.73      3.22      66
        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1648.44   累涨：20.59     3.69      9.14      7.76      4.72      2.85      67
        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.62      累涨：23.15     3.14      11.81     8.20      4.69      2.92      68
        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.56      累涨：25.46     2.70      13.71     9.05      4.69      3.14      69
        INDEX_CN_BIG.put("159338", "指数-大盘             ");//中证A500ETF           市值：244.35    累涨：22.33     3.38      10.65     8.30      4.67      2.70      70
        INDEX_CN_BIG.put("520550", "指数-大盘             ");//港股红利低波ETF       市值：1.97      累涨：15.26               6.20      9.35      4.67      2.17      71
        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.70      累涨：21.92     4.51      9.28      8.13      4.66      2.71      72
        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：44.90     累涨：20.12     3.34      9.10      7.68      4.66      2.85      73
        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.27      累涨：26.76     4.21      13.47     9.08      4.66      2.71      74
        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：24.08     累涨：20.37     3.49      9.10      7.78      4.66      3.04      75
        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.50      累涨：21.65     4.20      9.00      8.45      4.65      2.78      76
        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：5.22      累涨：20.12     2.79      9.90      7.43      4.64      2.78      77
        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3514.84   累涨：20.24     3.38      9.23      7.63      4.63      2.82      78
        INDEX_CN_BIG.put("159333", "指数-大盘             ");//港股央企红利ETF       市值：5.04      累涨：38.09     20.91     9.39      7.96      4.63      2.79      79
        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.24      累涨：32.52     3.59      19.00     9.93      4.62      2.59      80
        INDEX_CN_BIG.put("512050", "指数-大盘             ");//A500ETF基金           市值：200.11    累涨：21.51     3.40      10.16     7.95      4.62      2.51      81
        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2432.92   累涨：20.27     3.43      9.23      7.61      4.61      2.76      82
        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：13.58     累涨：21.36     3.63      10.15     7.58      4.61      3.07      83
        INDEX_CN_BIG.put("560350", "指数-大盘             ");//中证A50ETF指数基金    市值：34.44     累涨：20.43     3.43      9.53      7.47      4.60      2.97      84
        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.29      累涨：17.21     4.86      6.27      6.16      4.59      3.18      85
        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.57      累涨：11.19               4.06      7.13      4.59      2.34      86
        INDEX_CN_BIG.put("562330", "指数-大盘             ");//中证500价值ETF        市值：0.18      累涨：18.45     3.20      7.79      7.46      4.58      2.83      87
        INDEX_CN_BIG.put("515330", "指数-大盘             ");//300ETF天弘            市值：110.50    累涨：20.12     3.46      9.28      7.38      4.56      2.73      88
        INDEX_CN_BIG.put("512360", "指数-大盘             ");//平安MSCI国际ETF       市值：0.69      累涨：19.55     3.76      8.02      7.77      4.56      2.74      89
        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：5.16      累涨：20.76     2.42      9.95      8.39      4.56      2.59      90
        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1562.27   累涨：20.50     3.50      9.39      7.61      4.56      2.75      91
        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：17.39     累涨：20.95     3.57      9.65      7.73      4.54      2.66      92
        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.59      累涨：24.41     3.87      13.11     7.43      4.52      2.43      93
        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.14      累涨：25.65     3.78      13.87     8.00      4.51      2.73      94
        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：6.80      累涨：19.92     3.26      9.54      7.12      4.51      2.61      95
        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：5.12      累涨：27.87     3.97      14.72     9.18      4.51      2.41      96
        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.36      累涨：21.13     4.32      9.24      7.57      4.48      2.77      97
        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：83.00     累涨：20.75     3.69      9.71      7.35      4.47      2.97      98
        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：1.12      累涨：21.36     3.83      10.11     7.42      4.46      2.47      99
        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：7.91      累涨：20.22     3.29      9.59      7.34      4.43      2.91      100
        INDEX_CN_BIG.put("563880", "指数-大盘             ");//中证A500指数ETF       市值：82.10     累涨：21.33     3.27      10.42     7.64      4.43      2.41      101
        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：44.33     累涨：20.30     3.34      9.29      7.67      4.43      2.58      102
        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：2.08      累涨：26.08     4.52      13.90     7.66      4.42      2.55      103
        INDEX_CN_BIG.put("563220", "指数-大盘             ");//中证A500ETF富国       市值：192.15    累涨：20.91     3.24      10.27     7.40      4.41      2.30      104
        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：45.38     累涨：20.29     3.82      9.13      7.34      4.40      2.58      105
        INDEX_CN_BIG.put("159353", "指数-大盘             ");//中证A500ETF景顺       市值：146.25    累涨：21.63     3.42      10.78     7.43      4.38      2.54      106
        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：3.04      累涨：26.63     4.97      13.67     7.99      4.38      2.66      107
        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：28.41     累涨：19.97     3.28      9.33      7.36      4.37      2.56      108
        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：1.66      累涨：20.21     3.60      8.94      7.67      4.37      2.83      109
        INDEX_CN_BIG.put("560610", "指数-大盘             ");//A500指数ETF           市值：118.52    累涨：21.23     3.39      10.46     7.38      4.37      2.39      110
        INDEX_CN_BIG.put("159352", "指数-大盘             ");//中证A500ETF南方       市值：210.90    累涨：21.19     3.02      10.66     7.51      4.36      2.37      111
        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：3.36      累涨：20.69     3.54      9.50      7.65      4.36      2.42      112
        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.85      累涨：26.09     4.33      13.52     8.24      4.36      2.57      113
        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：7.51      累涨：19.64     3.15      8.91      7.58      4.36      2.66      114
        INDEX_CN_BIG.put("159351", "指数-大盘             ");//A500指数ETF           市值：144.71    累涨：21.32     3.61      10.42     7.29      4.36      2.33      115
        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：6.02      累涨：19.92     3.46      9.36      7.10      4.34      2.62      116
        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：214.09    累涨：19.09     3.90      7.92      7.27      4.34      2.35      117
        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.17      累涨：19.34     3.26      8.61      7.47      4.34      2.58      118
        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.35      累涨：21.82     4.75      9.34      7.73      4.33      2.50      119
        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.20      累涨：20.68     3.47      9.47      7.74      4.32      2.34      120
        INDEX_CN_BIG.put("159339", "指数-大盘             ");//A500ETF               市值：85.04     累涨：20.38     3.45      9.74      7.19      4.32      2.36      121
        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：2.04      累涨：18.37     1.43      9.23      7.71      4.31      2.40      122
        INDEX_CN_BIG.put("159376", "指数-大盘             ");//A500ETF指数基金       市值：4.82      累涨：17.68               10.45     7.23      4.30      2.38      123
        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：41.16     累涨：19.59     3.38      8.93      7.28      4.30      2.65      124
        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.86      累涨：19.23     3.24      8.72      7.27      4.30      2.71      125
        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.31      累涨：20.93     3.90      9.28      7.75      4.30      2.33      126
        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：2.53      累涨：21.02     3.89      9.76      7.37      4.30      2.67      127
        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：27.11     累涨：21.72     4.14      10.14     7.44      4.30      2.51      128
        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.74      累涨：24.55     5.03      11.16     8.36      4.30      1.42      129
        INDEX_CN_BIG.put("159661", "指数-大盘             ");//中证A100指数ETF       市值：0.37      累涨：20.88     3.98      9.12      7.78      4.29      2.45      130
        INDEX_CN_BIG.put("563800", "指数-大盘             ");//中证A500ETF龙头       市值：203.44    累涨：21.38     3.17      10.48     7.73      4.29      2.29      131
        INDEX_CN_BIG.put("159361", "指数-大盘             ");//A500ETF易方达         市值：165.44    累涨：21.24     3.32      10.37     7.55      4.29      2.34      132
        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：7.58      累涨：14.11               7.14      6.97      4.29      2.49      133
        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：65.86     累涨：26.30     4.35      13.75     8.20      4.29      2.56      134
        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：86.93     累涨：19.84     3.58      9.39      6.87      4.28      2.48      135
        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.44      累涨：18.67     3.00      8.36      7.31      4.28      1.99      136
        INDEX_CN_BIG.put("563860", "指数-大盘             ");//A500ETF海富通         市值：12.14     累涨：9.51                1.99      7.52      4.27      2.38      137
        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：2.04      累涨：20.42     3.58      9.53      7.31      4.27      2.42      138
        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：4.29      累涨：19.94     3.40      9.36      7.18      4.26      2.73      139
        INDEX_CN_BIG.put("513820", "指数-大盘             ");//港股红利ETF基金       市值：20.83     累涨：21.71     8.11      7.61      6.55      4.26      2.52      140
        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.98      累涨：16.02     1.24      7.39      7.39      4.25      2.32      141
        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：3.09      累涨：20.32     3.51      9.69      7.12      4.23      2.56      142
        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：1.32      累涨：21.38     6.15      8.63      6.60      4.22      2.38      143
        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.50      累涨：19.51     3.06      9.45      7.00      4.21      2.54      144
        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.80      累涨：18.40     2.52      9.24      6.64      4.21      2.52      145
        INDEX_CN_BIG.put("159358", "指数-大盘             ");//中证A500ETF基金       市值：28.63     累涨：21.02     3.27      10.53     7.22      4.20      2.24      146
        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.51      累涨：19.78     3.37      9.24      7.17      4.19      2.75      147
        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：1.97      累涨：27.47     3.72      14.42     9.33      4.19      2.35      148
        INDEX_CN_BIG.put("159356", "指数-大盘             ");//A500ETF基金           市值：58.98     累涨：20.31     3.24      9.90      7.17      4.19      2.39      149
        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：11.12     累涨：18.74     2.99      8.68      7.07      4.18      2.47      150
        INDEX_CN_BIG.put("159362", "指数-大盘             ");//A500ETF工银           市值：33.52     累涨：20.28     2.93      10.10     7.25      4.18      2.28      151
        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.17      累涨：18.19     3.02      8.23      6.94      4.17      2.54      152
        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.59      累涨：19.33     2.97      9.14      7.22      4.17      2.22      153
        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.34      累涨：19.35     3.19      9.03      7.13      4.17      2.48      154
        INDEX_CN_BIG.put("159357", "指数-大盘             ");//中证A500指数ETF       市值：51.19     累涨：20.48     3.11      10.35     7.02      4.16      2.17      155
        INDEX_CN_BIG.put("560750", "指数-大盘             ");//A500ETF申万菱信       市值：2.33      累涨：11.04               3.71      7.33      4.16      2.32      156
        INDEX_CN_BIG.put("560530", "指数-大盘             ");//中证A500ETF摩根       市值：104.95    累涨：21.02     2.98      10.77     7.27      4.15      2.22      157
        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：2.36      累涨：15.02               7.65      7.37      4.14      2.16      158
        INDEX_CN_BIG.put("563360", "指数-大盘             ");//中证A500ETF基金       市值：161.19    累涨：21.06     3.40      10.39     7.27      4.14      2.26      159
        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.40      累涨：21.23     4.47      9.15      7.61      4.14      2.44      160
        INDEX_CN_BIG.put("512020", "指数-大盘             ");//A500ETF指数           市值：42.71     累涨：20.70     3.11      10.41     7.18      4.14      2.26      161
        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：18.37     累涨：19.11     3.30      8.89      6.92      4.13      2.54      162
        INDEX_CN_BIG.put("563500", "指数-大盘             ");//中证A500ETF华宝       市值：17.92     累涨：20.96     3.27      10.55     7.14      4.11      2.24      163
        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.78      累涨：24.61     4.32      13.15     7.14      4.11      2.48      164
        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.55      累涨：18.30     3.88      7.84      6.58      4.11      2.89      165
        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：0.16      累涨：13.52               5.03      8.49      4.10      2.64      166
        INDEX_CN_BIG.put("530080", "指数-大盘             ");//180指数ETF            市值：0.89      累涨：11.98               4.85      7.13      4.10      2.14      167
        INDEX_CN_BIG.put("159380", "指数-大盘             ");//A500ETF东财           市值：4.37      累涨：18.28     0.20      10.48     7.60      4.09      2.28      168
        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：3.45      累涨：14.67               7.94      6.73      4.08      2.13      169
        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.36      累涨：18.59     2.89      8.62      7.08      4.08      2.34      170
        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.19      累涨：24.62     3.40      13.47     7.75      4.07      2.38      171
        INDEX_CN_BIG.put("513530", "指数-大盘             ");//港股通红利ETF         市值：14.98     累涨：23.31     8.58      8.25      7.12      4.07      2.43      172
        INDEX_CN_BIG.put("512080", "指数-大盘             ");//A500ETF中金           市值：15.26     累涨：13.39               6.15      7.24      4.06      2.22      173
        INDEX_CN_BIG.put("560510", "指数-大盘             ");//中证A500ETF           市值：75.00     累涨：19.87     2.75      10.26     6.86      4.06      2.29      174
        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.48      累涨：18.71     4.15      7.82      6.74      4.05      1.90      175
        INDEX_CN_BIG.put("159360", "指数-大盘             ");//中证A500ETF天弘       市值：40.65     累涨：20.95     3.19      10.58     7.18      4.04      2.26      176
        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：3.20      累涨：17.89     3.01      8.55      6.33      4.04      2.36      177
        INDEX_CN_BIG.put("159966", "指数-大盘             ");//创业板价值ETF         市值：5.27      累涨：31.60     3.36      19.08     9.38      4.03      1.83      178
        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：12.99     累涨：18.85     3.30      8.77      6.78      4.01      2.36      179
        INDEX_CN_BIG.put("159386", "指数-大盘             ");//A500ETF永赢           市值：1.68      累涨：8.78                1.91      6.87      3.99      2.19      180
        INDEX_CN_BIG.put("159379", "指数-大盘             ");//A500ETF融通           市值：5.37      累涨：15.16               6.64      8.52      3.98      2.13      181
        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：3.07      累涨：18.82     3.21      9.46      6.15      3.98      2.42      182
        INDEX_CN_BIG.put("159331", "指数-大盘             ");//红利港股ETF           市值：0.92      累涨：31.19     17.97     7.09      6.22      3.97      2.55      183
        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：48.67     累涨：18.87     3.21      9.03      6.63      3.93      2.45      184
        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.80      累涨：5.13                0.10      5.03      3.92      2.41      185
        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.98      累涨：18.24     3.42      8.28      6.54      3.91      2.12      186
        INDEX_CN_BIG.put("520990", "指数-大盘             ");//港股央企红利50ETF     市值：49.50     累涨：24.88     9.60      9.52      6.09      3.91      1.94      187
        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.66      累涨：20.66     4.07      9.24      7.35      3.90      1.82      188
        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：2.06      累涨：19.52     6.36      7.61      5.55      3.88      2.47      189
        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：44.55     累涨：19.79     3.94      8.88      6.97      3.88      2.20      190
        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.36      累涨：17.73     4.57      8.00      5.16      3.87      2.57      191
        INDEX_CN_BIG.put("159617", "指数-大盘             ");//500价值ETF            市值：0.39      累涨：18.34     3.30      8.30      6.74      3.84      2.34      192
        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.92      累涨：20.24     6.55      8.37      5.32      3.79      2.45      193
        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：1.03      累涨：19.81     5.73      8.77      5.31      3.78      2.54      194
        INDEX_CN_BIG.put("159359", "指数-大盘             ");//中证A500ETF华安       市值：39.20     累涨：20.59     3.22      10.36     7.01      3.76      1.97      195
        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF基金       市值：19.11     累涨：20.40     4.20      8.99      7.21      3.75      1.90      196
        INDEX_CN_BIG.put("562060", "指数-大盘             ");//标普红利ETF           市值：15.56     累涨：16.72     2.84      7.76      6.12      3.75      2.52      197
        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：52.68     累涨：18.49     4.10      7.60      6.79      3.75      1.87      198
        INDEX_CN_BIG.put("159302", "指数-大盘             ");//港股高股息ETF         市值：1.18      累涨：22.00     7.62      8.02      6.63      3.74      2.12      199
        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.38      累涨：16.47     3.50      6.94      6.03      3.73      2.24      200
        INDEX_CN_BIG.put("520660", "指数-大盘             ");//港股通央企红利ETF南方 市值：11.33     累涨：22.04     8.85      8.62      5.02      3.71      1.84      201
        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：58.61     累涨：17.88     3.89      7.66      6.33      3.70      1.88      202
        INDEX_CN_BIG.put("520900", "指数-大盘             ");//红利ETF港股           市值：31.09     累涨：23.57     8.19      9.62      6.21      3.70      1.83      203
        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：21.40     累涨：16.01     2.25      7.21      6.55      3.67      1.98      204
        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：2.92      累涨：17.12     4.79      6.35      5.98      3.60      2.42      205
        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：1.04      累涨：14.99     3.12      6.27      5.60      3.59      2.31      206
        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.87      累涨：14.89     3.26      6.17      5.61      3.55      2.56      207
        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：1.04      累涨：16.93     3.86      6.81      6.26      3.53      2.13      208
        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：36.89     累涨：20.09     4.02      9.31      6.76      3.48      1.63      209
        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波50ETF         市值：0.63      累涨：18.40     5.87      7.61      4.92      3.48      2.76      210
        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：2.02      累涨：18.89     6.12      7.45      5.32      3.46      2.22      211
        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：11.36     累涨：18.98     7.78      6.07      5.13      3.44      2.27      212
        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：19.38     累涨：20.52     4.16      9.46      6.90      3.42      1.43      213
        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.31      累涨：18.45     6.01      7.49      5.16      3.41      2.57      214
        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：77.32     累涨：20.42     4.59      9.93      5.90      3.39      2.18      215
        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：29.34     累涨：18.31     4.14      8.31      5.86      3.35      1.60      216
        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：5.59      累涨：17.40     4.40      7.59      5.41      3.33      2.13      217
        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.39      累涨：17.01     5.63      6.40      4.98      3.31      1.83      218
        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.73      累涨：17.31     4.84      6.89      5.58      3.25      2.47      219
        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.38      累涨：16.89     3.69      7.58      5.62      3.21      1.63      220
        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：7.14      累涨：14.48     3.05      6.05      5.38      3.20      2.24      221
        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：77.60     累涨：17.09     4.03      7.44      5.62      3.18      2.25      222
        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：97.15     累涨：17.20     4.47      7.27      5.46      3.16      2.10      223
        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：2.71      累涨：18.00     6.97      6.35      4.68      3.15      2.01      224
        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：1.17      累涨：17.74     5.36      7.31      5.07      3.12      2.11      225
        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.47      累涨：16.94     3.35      8.34      5.25      3.09      1.81      226
        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：7.41      累涨：16.96     4.55      7.14      5.27      3.08      2.27      227
        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：3.32      累涨：19.13     6.60      8.08      4.55      3.06      2.27      228
        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：4.72      累涨：16.56     5.89      6.31      4.36      3.05      1.87      229
        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利100ETF            市值：0.75      累涨：16.84     4.32      7.16      5.36      3.05      2.05      230
        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：223.44    累涨：17.27     5.00      7.46      4.81      3.04      2.64      231
        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：10.58     累涨：16.92     4.23      6.98      5.71      3.03      1.75      232
        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：138.83    累涨：18.74     6.14      7.90      4.88      3.02      2.28      233
        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.83      累涨：19.12     6.18      8.23      4.71      3.01      2.21      234
        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：12.31     累涨：16.83     4.78      7.62      4.52      3.00      2.29      235
        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：27.46     累涨：17.06     4.66      7.29      5.11      2.98      1.98      236
        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.57      累涨：15.22     4.03      7.09      4.10      2.95      2.37      237
        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.05      累涨：16.66     5.01      7.16      4.68      2.95      2.09      238
        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：8.18      累涨：17.75     5.51      7.83      4.41      2.93      2.20      239
        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：16.51     累涨：15.99     5.05      6.88      4.16      2.77      2.66      240
        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：8.24      累涨：15.30     3.64      7.01      4.65      2.66      2.16      241
        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.81      累涨：12.40     3.17      5.83      3.40      2.65      1.79      242
        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：1.27      累涨：14.93     4.27      6.65      4.01      2.60      1.60      243
        INDEX_CN_BIG.put("513830", "指数-大盘             ");//港股红利ETF           市值：6.77      累涨：2.59                          2.59      2.59      1.89      244
        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.47      累涨：15.17     4.54      6.86      3.77      2.53      2.25      245
        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波动ETF         市值：34.90     累涨：15.17     4.34      6.79      4.04      2.50      1.87      246
        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：68.23     累涨：15.67     4.59      7.10      4.26      2.43      2.01      247
        INDEX_CN_BIG.put("515300", "指数-大盘             ");//红利低波ETF基金       市值：51.67     累涨：16.58     5.53      7.14      4.06      2.40      1.57      248
        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：66.29     累涨：16.68     5.40      7.14      4.50      2.39      1.88      249
        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.51      累涨：13.24     4.52      5.86      2.86      2.39      1.62      250
        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：1.42      累涨：13.03     4.31      5.38      3.34      2.39      1.91      251
        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：1.48      累涨：17.32     6.01      7.90      3.71      2.37      2.17      252
        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：5.12      累涨：2.20                          2.20      2.20      2.20      253
        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：4.48      累涨：1.79                          1.79      1.79      1.79      254
        INDEX_CN_BIG.put("515780", "指数-大盘             ");//浦银MSCI中国ETF       市值：0.08      累涨：14.41     3.91      8.60      1.90                          255
    }
    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_HK);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
    }

    /**
     * 金融-证券
     */
    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();
    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：78.96     累涨：42.13     3.92      17.43     20.92     7.15      1.25      1
        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.95      累涨：28.56     6.49      12.90     9.26      4.42      1.71      2
        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.93      累涨：27.17     5.03      11.92     10.52     4.11      1.00      3
        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：11.05     累涨：29.77     6.51      12.94     10.32     4.11      0.95      4
        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.14      累涨：28.73     6.69      12.37     9.67      4.07      1.24      5
        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：314.97    累涨：30.91     7.00      13.24     10.85     4.05      0.90      6
        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：71.46     累涨：28.96     6.13      13.12     9.71      4.01      0.91      7
        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：19.33     累涨：30.37     6.72      13.12     10.61     3.86      0.75      8
        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：4.13      累涨：29.03     6.28      12.90     10.03     3.85      0.75      9
        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：17.07     累涨：28.79     6.90      12.06     10.33     3.82      0.76      10
        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：20.00     累涨：28.75     6.23      12.66     9.86      3.81      0.86      11
        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：8.50      累涨：29.45     6.17      13.21     10.07     3.79      0.90      12
        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.39      累涨：26.00     5.23      11.60     9.17      3.79      1.48      13
        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：65.73     累涨：30.37     6.70      13.10     10.57     3.77      0.79      14
        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.42      累涨：29.53     6.64      13.28     9.68      3.76      0.89      15
        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：260.99    累涨：29.85     6.61      13.11     10.32     3.76      0.94      16
        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.48      累涨：28.93     6.30      12.50     10.23     3.75      0.79      17
        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：4.04      累涨：29.18     6.67      12.36     10.31     3.64      0.91      18
        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.92      累涨：27.46     5.58      13.06     9.45      3.51      0.72      19
        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.71      累涨：25.79     5.88      11.09     8.82      3.28      1.01      20
        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：82.81     累涨：26.79     5.81      12.68     9.20      3.25      0.52      21
    }
    public static Map<String, String> JINRONG_GOLD = new HashMap<>();
    static {
        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：0.52      累涨：34.60     7.98      15.31     11.63     10.00     4.28      1
        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：25.07     累涨：35.59     9.08      15.43     11.58     9.64      3.56      2
        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：2.62      累涨：33.84     7.67      15.27     11.31     9.62      3.83      3
        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：3.35      累涨：33.39     8.70      13.99     11.08     9.31      3.49      4
        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金产业ETF           市值：0.19      累涨：34.65     9.55      14.60     10.60     9.27      3.44      5
        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.39      累涨：33.68     8.92      14.91     10.28     9.14      3.74      6
        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：16.77     累涨：22.33     6.07      11.63     5.69      3.04      1.41      7
        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：104.89    累涨：21.92     6.06      11.41     5.46      2.98      1.32      8
        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：360.08    累涨：22.37     6.07      11.80     5.61      2.94      1.35      9
        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：9.81      累涨：22.56     6.03      11.91     5.80      2.93      1.44      10
        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：183.52    累涨：21.98     5.84      11.45     5.61      2.93      1.33      11
        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：4.91      累涨：21.74     5.64      11.50     5.61      2.90      1.36      12
        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：161.87    累涨：21.98     5.96      11.56     5.55      2.90      1.26      13
        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：23.43     累涨：22.12     6.04      11.55     5.68      2.87      1.31      14
    }
    public static Map<String, String> JINRONG_BANK = new HashMap<>();
    static {
        JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：1.18      累涨：37.72     17.46     12.76     7.50      3.90      2.30      1
        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF华夏           市值：3.66      累涨：25.97     10.68     9.31      6.17      2.92      1.26      2
        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：23.34     累涨：26.18     11.21     9.60      5.75      2.62      1.08      3
        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：12.46     累涨：26.72     11.40     9.84      5.74      2.60      1.13      4
        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：39.04     累涨：25.96     10.82     9.64      5.72      2.56      1.13      5
        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.19      累涨：24.95     11.57     8.07      5.62      2.53      1.02      6
        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：81.03     累涨：26.36     11.14     9.77      5.92      2.49      0.87      7
        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：12.15     累涨：24.82     10.30     9.10      5.58      2.46      1.07      8
        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：4.98      累涨：25.04     10.96     8.97      5.44      2.39      0.90      9
        JINRONG_BANK.put("512730", "金融-银行             ");//中证银行ETF           市值：0.85      累涨：25.23     10.88     9.57      5.24      2.37      0.92      10
    }
    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();
    static {
        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.67      累涨：23.90     5.84      9.34      8.72      4.86      1.86      1
        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：5.88      累涨：25.44     6.41      10.13     8.90      4.48      1.19      2
        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.55      累涨：22.72     6.16      9.08      7.48      4.09      1.71      3
        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.84      累涨：31.36     5.93      15.13     10.63     3.93                4
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：7.16      累涨：31.56     5.97      15.82     9.77      3.10                5
        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：5.10      累涨：30.93     5.58      16.51     8.84      2.98                6
        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：1.16      累涨：20.31     3.84      8.54      8.33      2.93      0.48      7
        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：61.47     累涨：30.35     5.85      15.82     8.82      2.86                8
        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF基金       市值：0.76      累涨：19.59     5.91      8.35      5.55      2.62      0.49      9
        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.55      累涨：19.86     6.74      8.93      4.66      2.41      0.66      10
        JINRONG_FANGDICHAN.put("561170", "金融-地产             ");//绿色电力ETF           市值：1.29      累涨：16.28     6.85      4.77      4.66      2.29      1.99      11
        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.36      累涨：20.92     3.86      9.15      8.33      2.28      0.31      12
        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.59     累涨：20.31     6.19      9.39      4.73      2.27      0.61      13
        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.41      累涨：20.62     7.50      8.60      5.04      2.20      0.52      15
        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：6.36      累涨：20.87     3.87      9.71      7.67      1.99                20
        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：27.19     累涨：20.34     4.04      9.02      7.37      1.87      0.94      22
        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.68      累涨：15.05     5.01      6.99      3.46      1.53      0.51      24
        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.90      累涨：9.90      0.73      5.45      3.72      1.51      1.08      25
        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.63      累涨：14.95     6.58      4.88      3.49      1.36      1.02      26
        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.72      累涨：13.41     4.91      6.10      2.94      1.20      0.22      27
        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.71      累涨：14.06     4.28      7.03      3.17      1.16      0.53      28
        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：0.67      累涨：14.21     6.55      4.46      3.31      1.15      0.92      29
    }
    public static Map<String, String> JINRONG_CASH = new HashMap<>();
    static {
        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：20.33     累涨：2.80                          2.80      2.30      1.10      1
        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：15.46     累涨：1.71                          1.71      1.61      0.60      2
        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.60      累涨：10.52     0.01      9.93      0.59      0.19      0.01      3
        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：31.95     累涨：0.57      0.02      0.34      0.21      0.16      0.11      4
        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：621.88    累涨：0.46      0.17      0.17      0.14      0.08      0.05      5
        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：0.33      0.10      0.14      0.09      0.07      0.05      6
        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.19      累涨：16.35     0.14      16.15     0.06      0.05      0.01      7
        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.22      累涨：13.24     0.22      12.97     0.05      0.04      0.01      8
        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.55      累涨：0.14      0.03      0.08      0.04      0.04      0.02      9
        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：13.48     累涨：0.19      0.05      0.10      0.05      0.04      0.02      10
        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.29      累涨：3.50      0.06      3.41      0.05      0.03                11
        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.16      累涨：7.77      0.26      7.47      0.05      0.03      0.01      12
        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.59      累涨：0.12      0.04      0.05      0.04      0.03      0.02      13
        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：6.05      累涨：0.18      0.08      0.07      0.03      0.03      0.02      14
        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：684.13    累涨：0.21      0.05      0.11      0.06      0.03      0.02      15
        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.45      累涨：16.23     0.02      16.18     0.03      0.02      0.01      16
        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.30      累涨：10.36     0.18      10.19     0.03      0.02                17
        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：1.67      累涨：0.24      0.05      0.15      0.05      0.02      0.01      18
        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：8.09      累涨：0.21      0.07      0.11      0.04      0.02      0.01      19
        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.23      累涨：9.33      0.05      9.25      0.03      0.02      0.01      20
        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：114.51    累涨：0.16      0.06      0.07      0.03      0.02      0.01      21
        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.45      累涨：0.11      0.05      0.05      0.01      0.01      0.01      22
        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.36      累涨：17.19     0.07      17.10     0.02      0.01                23
        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.39      累涨：0.10      0.03      0.06      0.02      0.01      0.01      24
        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.28      累涨：25.16     0.07      25.08     0.01      0.01                25
        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.94      累涨：0.10      0.04      0.06                                    26
        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：13.73     累涨：                                                            27
        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.94      累涨：                                                            28
        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.73      累涨：                                                            29
    }
    public static Map<String, String> JINRONG_COMMON = new HashMap<>();
    static {
        JINRONG_COMMON.put("513140", "金融-通用             ");//港股金融ETF           市值：0.78      累涨：30.33     5.49      13.23     11.61     4.84      0.38      4
        JINRONG_COMMON.put("513190", "金融-通用             ");//港股通金融ETF         市值：5.12      累涨：32.55     8.46      14.13     9.96      3.86      0.21      5
        JINRONG_COMMON.put("159931", "金融-通用             ");//金融ETF               市值：0.69      累涨：20.67     5.86      8.70      6.28      2.84      0.61      6
        JINRONG_COMMON.put("510230", "金融-通用             ");//金融ETF               市值：46.78     累涨：19.41     7.06      8.33      4.56      1.85      0.23      11
    }
    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();
    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
        JINRONG.putAll(JINRONG_COMMON);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }
    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     * 
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }
}
