package utils;

import ttjj.dto.CondEtfAdrCount;
import ttjj.dto.CondStockAdrCount;
import ttjj.dto.EtfAdrCountVo;
import ttjj.dto.Kline;
import ttjj.rank.EtfControl;
import ttjj.service.EtfAdrCountService;

import java.math.BigDecimal;
import java.util.*;
import java.util.stream.Collectors;

import static utils.Content.*;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {
    /**
     * 资源
     */
    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();//资源-石油
    public static Map<String, String> TOP_ZIYUAN_OIL = new HashMap<>();

    static {
        TOP_ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：6.12      累涨：51.90     12.17     23.09     16.64     10日：5.15      3.80      2.36      -2.19     1         累涨修正：65.57     净值区间：16      19      51      76      59      1
    }

    static {
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：6.12      累涨：51.90     12.17     23.09     16.64     10日：5.15      3.80      2.36      -2.19     1         累涨修正：65.57     净值区间：16      19      51      76      59      1
        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：8.22      累涨：50.20     10.39     23.39     16.42     10日：5.14      3.85      2.46      -2.41     2         累涨修正：64.11     净值区间：8       15      49      76      59      2
        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.22      累涨：24.76     8.61      9.47      6.68      10日：2.55      1.32      0.77      0.00      4         累涨修正：30.17     净值区间：77      87      91      97      69      3
        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：0.57      累涨：23.49     9.23      6.39      7.87      10日：3.09      1.91      0.42      0.21      3         累涨修正：29.33     净值区间：12      23      32      62      62      4
        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：0.60      累涨：22.33     7.79      8.01      6.53      10日：2.75      1.54      0.44      0.00      5         累涨修正：27.5      净值区间：71      79      96      83      72      5
        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：0.72      累涨：22.90     7.61      8.72      6.57      10日：2.39      1.45      0.31      -0.10     6         累涨修正：27.36     净值区间：58      76      81      94      60      6
        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.12      累涨：20.35     6.99      6.63      6.73      10日：2.55      1.48      0.63      -0.32     7         累涨修正：25.64     净值区间：67      81      80      84      72      7
        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：0.98      累涨：21.42     6.87      8.62      5.93      10日：1.90      1.00      0.50      0.20      8         累涨修正：25.32     净值区间：83      89      81      95      66      8
        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.32      累涨：18.05     5.26      8.08      4.71      10日：1.52      1.07      0.46      0.61      9         累涨修正：21.56     净值区间：100     71      45      81      51      9
        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.24      累涨：                                        10日：                              -0.22     10        累涨修正：0         净值区间：82      23      29      55      55      10
    }

    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();
    public static Map<String, String> TOP_ZIYUAN_NONGYE = new HashMap<>();

    static {
        TOP_ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.27      累涨：34.24     9.35      16.79     8.10      10日：4.74      3.94      3.62      -1.54     2         累涨修正：50.16     净值区间：59      62      67      63      63      1
    }

    static {
        ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.27      累涨：34.24     9.35      16.79     8.10      10日：4.74      3.94      3.62      -1.54     2         累涨修正：50.16     净值区间：59      62      67      63      63      1
        ZIYUAN_NONGYE.put("516670", "资源-农业             ");//畜牧养殖ETF           市值：6.24      累涨：33.09     8.74      15.90     8.45      10日：5.05      4.28      3.66      -1.93     1         累涨修正：49.74     净值区间：57      57      63      54      56      2
        ZIYUAN_NONGYE.put("159867", "资源-农业             ");//畜牧ETF               市值：5.50      累涨：32.02     8.91      15.11     8.00      10日：4.65      3.65      3.31      -1.45     5         累涨修正：46.94     净值区间：61      61      68      59      62      3
        ZIYUAN_NONGYE.put("159827", "资源-农业             ");//农业50ETF             市值：1.01      累涨：30.29     8.44      14.04     7.81      10日：5.10      4.15      3.61      -1.04     4         累涨修正：46.76     净值区间：74      76      77      72      72      4
        ZIYUAN_NONGYE.put("159825", "资源-农业             ");//农业ETF               市值：20.05     累涨：29.64     7.82      13.84     7.98      10日：5.19      4.32      3.44      -1.12     3         累涨修正：46.03     净值区间：74      74      75      71      71      5
        ZIYUAN_NONGYE.put("159865", "资源-农业             ");//养殖ETF               市值：34.41     累涨：31.23     8.16      14.95     8.12      10日：4.21      3.70      3.19      -1.48     6         累涨修正：45.52     净值区间：59      59      65      58      61      6
        ZIYUAN_NONGYE.put("516810", "资源-农业             ");//农业50ETF             市值：1.82      累涨：28.07     8.00      12.53     7.54      10日：4.95      3.94      3.37      -1.10     7         累涨修正：43.7      净值区间：73      74      76      71      71      7
        ZIYUAN_NONGYE.put("562900", "资源-农业             ");//农业ETF易方达         市值：0.72      累涨：27.87     7.64      12.36     7.87      10日：4.32      3.78      3.51      -1.45     9         累涨修正：42.99     净值区间：61      61      66      42      48      8
        ZIYUAN_NONGYE.put("159587", "资源-农业             ");//粮食50ETF             市值：0.49      累涨：31.68     5.60      18.03     8.05      10日：3.00      1.32      1.06      -0.52     8         累涨修正：38.12     净值区间：68      73      90      39      39      9
        ZIYUAN_NONGYE.put("159616", "资源-农业             ");//农牧ETF               市值：0.58      累涨：28.96     8.56      13.73     6.67      10日：3.87      1.79      1.65      -0.14     10        累涨修正：37.92     净值区间：86      88      91      62      62      10
        ZIYUAN_NONGYE.put("159698", "资源-农业             ");//粮食ETF               市值：3.60      累涨：29.92     4.57      17.82     7.53      10日：2.50      1.13      1.13      -0.34     11        累涨修正：35.81     净值区间：82      80      74      21      26      11
        ZIYUAN_NONGYE.put("516550", "资源-农业             ");//农业ETF               市值：2.01      累涨：22.99     7.67      9.19      6.13      10日：3.48      2.25      1.95      -0.74     12        累涨修正：32.62     净值区间：67      72      81      91      91      12
    }

    public static Map<String, String> ZIYUAN_XIYOU = new HashMap<>();
    public static Map<String, String> TOP_ZIYUAN_XIYOU = new HashMap<>();

    static {
        TOP_ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：18.74     累涨：36.80     10.75     16.02     10.03     10日：5.94      5.29      3.70      0.81      1         累涨修正：55.43     净值区间：88      88      82      92      69      1
    }

    static {
        ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：18.74     累涨：36.80     10.75     16.02     10.03     10日：5.94      5.29      3.70      0.81      1         累涨修正：55.43     净值区间：88      88      82      92      69      1
        ZIYUAN_XIYOU.put("516780", "资源-稀有             ");//稀土ETF               市值：9.23      累涨：35.28     10.15     13.96     11.17     10日：6.45      5.49      3.74      0.56      2         累涨修正：54.7      净值区间：88      88      80      92      71      2
        ZIYUAN_XIYOU.put("159715", "资源-稀有             ");//稀土ETF易方达         市值：1.97      累涨：35.42     9.89      15.38     10.15     10日：5.12      4.84      3.55      0.55      5         累涨修正：52.48     净值区间：84      84      78      91      72      3
        ZIYUAN_XIYOU.put("159713", "资源-稀有             ");//稀土ETF               市值：3.31      累涨：33.15     10.25     13.00     9.90      10日：5.58      5.06      3.49      0.50      4         累涨修正：50.77     净值区间：86      86      80      92      72      4
        ZIYUAN_XIYOU.put("159652", "资源-稀有             ");//有色50ETF             市值：2.51      累涨：35.54     10.79     16.20     8.55      10日：5.70      2.97      2.64      -0.32     3         累涨修正：49.49     净值区间：74      68      66      91      69      5
        ZIYUAN_XIYOU.put("159881", "资源-稀有             ");//有色60ETF             市值：0.50      累涨：32.43     9.75      14.17     8.51      10日：5.71      3.30      2.91      -0.76     6         累涨修正：47.26     净值区间：69      68      68      92      70      6
        ZIYUAN_XIYOU.put("512400", "资源-稀有             ");//有色金属ETF           市值：44.50     累涨：33.92     9.96      16.08     7.88      10日：5.23      2.96      2.48      -0.37     11        累涨修正：47.07     净值区间：71      69      69      92      70      7
        ZIYUAN_XIYOU.put("159876", "资源-稀有             ");//有色龙头ETF           市值：0.66      累涨：33.77     10.04     15.70     8.03      10日：5.23      2.80      2.44      -0.44     9         累涨修正：46.68     净值区间：71      68      68      92      69      8
        ZIYUAN_XIYOU.put("159608", "资源-稀有             ");//稀有金属ETF           市值：2.12      累涨：29.89     8.97      11.46     9.46      10日：5.29      4.59      3.35      0.17      7         累涨修正：46.47     净值区间：85      85      79      92      60      9
        ZIYUAN_XIYOU.put("516650", "资源-稀有             ");//有色金属ETF基金       市值：1.12      累涨：32.63     10.31     14.38     7.94      10日：5.14      2.82      2.33      -0.67     10        累涨修正：45.25     净值区间：67      58      58      90      68      10
        ZIYUAN_XIYOU.put("562800", "资源-稀有             ");//稀有金属ETF           市值：8.98      累涨：29.46     8.74      11.48     9.24      10日：4.85      4.25      3.23      0.20      14        累涨修正：45.02     净值区间：91      91      83      94      60      11
        ZIYUAN_XIYOU.put("159671", "资源-稀有             ");//稀有金属ETF基金       市值：5.00      累涨：30.52     9.02      13.27     8.23      10日：4.36      3.93      3.05      0.14      15        累涨修正：44.91     净值区间：83      83      76      91      59      12
        ZIYUAN_XIYOU.put("561800", "资源-稀有             ");//稀有金属ETF基金       市值：0.89      累涨：30.20     9.40      12.34     8.46      10日：4.35      3.98      3.03      0.37      16        累涨修正：44.59     净值区间：87      87      77      91      58      13
        ZIYUAN_XIYOU.put("159871", "资源-稀有             ");//有色金属ETF           市值：0.80      累涨：32.15     10.32     14.45     7.38      10日：4.80      2.59      2.40      0.00      13        累涨修正：44.34     净值区间：81      79      79      95      72      14
        ZIYUAN_XIYOU.put("560860", "资源-稀有             ");//工业有色ETF           市值：3.87      累涨：30.99     10.14     12.66     8.19      10日：5.26      3.31      2.32      -0.24     8         累涨修正：44.2      净值区间：73      74      74      92      59      15
        ZIYUAN_XIYOU.put("159880", "资源-稀有             ");//有色ETF基金           市值：0.91      累涨：32.04     10.11     14.03     7.90      10日：5.37      2.45      2.07      -0.37     12        累涨修正：44        净值区间：69      57      57      88      69      16
        ZIYUAN_XIYOU.put("159980", "资源-稀有             ");//有色ETF               市值：8.24      累涨：21.12     7.19      8.87      5.06      10日：2.53      1.45      1.15      0.06      17        累涨修正：27.4      净值区间：92      85      57      89      58      17
    }

    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();
    public static Map<String, String> TOP_ZIYUAN_COMMON = new HashMap<>();

    static {
        TOP_ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.16      累涨：35.70     10.12     17.57     8.01      10日：5.82      3.06      2.77      -0.66     2         累涨修正：50.12     净值区间：73      43      43      71      62      1
    }

    static {
        ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.16      累涨：35.70     10.12     17.57     8.01      10日：5.82      3.06      2.77      -0.66     2         累涨修正：50.12     净值区间：73      43      43      71      62      1
        ZIYUAN_COMMON.put("561330", "资源-通用             ");//矿业ETF               市值：0.80      累涨：34.14     9.63      15.77     8.74      10日：6.15      3.38      3.18      -0.78     1         累涨修正：50.03     净值区间：66      66      66      90      73      2
        ZIYUAN_COMMON.put("510410", "资源-通用             ");//资源ETF               市值：3.37      累涨：31.64     10.33     14.15     7.16      10日：4.41      2.08      1.24      -0.16     3         累涨修正：40.61     净值区间：71      65      68      91      80      3
        ZIYUAN_COMMON.put("588010", "资源-通用             ");//科创新材料ETF         市值：2.63      累涨：30.67     5.97      18.78     5.92      10日：3.42      2.22      0.85      1.02      35        累涨修正：38.01     净值区间：93      67      46      82      65      4
        ZIYUAN_COMMON.put("510170", "资源-通用             ");//大宗商品ETF           市值：1.50      累涨：29.57     10.12     13.24     6.21      10日：3.56      1.96      1.38      -0.23     4         累涨修正：37.85     净值区间：58      62      61      91      69      5
        ZIYUAN_COMMON.put("588160", "资源-通用             ");//科创材料ETF           市值：1.80      累涨：29.88     5.72      18.66     5.50      10日：3.20      2.20      0.85      0.84      43        累涨修正：36.98     净值区间：93      59      39      80      64      6
        ZIYUAN_COMMON.put("159981", "资源-通用             ");//能源化工ETF           市值：4.52      累涨：27.06     5.48      9.61      11.97     10日：4.28      2.89      1.33      -0.77     6         累涨修正：36.89     净值区间：31      29      26      54      38      7
        ZIYUAN_COMMON.put("515220", "资源-通用             ");//煤炭ETF               市值：39.05     累涨：27.72     11.80     8.28      7.64      10日：4.67      2.24      1.02      -0.61     5         累涨修正：36.67     净值区间：43      24      34      66      44      8
        ZIYUAN_COMMON.put("159944", "资源-通用             ");//材料ETF               市值：0.24      累涨：23.93     6.97      11.16     5.80      10日：3.23      1.94      1.51      -0.21     7         累涨修正：32.12     净值区间：78      48      48      85      58      9
        ZIYUAN_COMMON.put("159930", "资源-通用             ");//能源ETF               市值：2.51      累涨：24.04     8.29      9.13      6.62      10日：3.53      1.68      0.64      -0.40     8         累涨修正：30.53     净值区间：29      34      60      84      77      10
        ZIYUAN_COMMON.put("516480", "资源-通用             ");//新材料ETF基金         市值：0.12      累涨：26.29     7.96      11.69     6.64      10日：2.05      1.04      0.35      0.17      10        累涨修正：30.08     净值区间：37      37      33      61      32      11
        ZIYUAN_COMMON.put("159945", "资源-通用             ");//能源ETF基金           市值：0.27      累涨：24.22     8.74      9.10      6.38      10日：3.32      1.56      0.49      -0.29     9         累涨修正：30.08     净值区间：40      38      57      84      67      12
        ZIYUAN_COMMON.put("515210", "资源-通用             ");//钢铁ETF               市值：18.70     累涨：24.17     7.59      12.29     4.29      10日：1.68      1.60      1.10      0.08      19        累涨修正：29.65     净值区间：71      34      29      71      48      13
        ZIYUAN_COMMON.put("562010", "资源-通用             ");//绿色能源ETF           市值：0.14      累涨：23.55     5.56      9.39      8.60      10日：2.66      1.15      0.86      -0.28     11        累涨修正：29.08     净值区间：57      17      16      59      49      14
        ZIYUAN_COMMON.put("516120", "资源-通用             ");//化工50ETF             市值：1.83      累涨：21.51     5.82      10.54     5.15      10日：2.18      1.85      1.01      0.17      12        累涨修正：27.56     净值区间：69      50      38      76      48      15
        ZIYUAN_COMMON.put("516020", "资源-通用             ");//化工ETF               市值：4.42      累涨：21.86     5.74      10.70     5.42      10日：2.05      1.88      0.85      0.34      16        累涨修正：27.49     净值区间：100     63      42      75      45      16
        ZIYUAN_COMMON.put("516710", "资源-通用             ");//新材料50ETF           市值：0.40      累涨：21.38     5.56      9.45      6.37      10日：2.57      1.73      0.87      0.00      13        累涨修正：27.42     净值区间：80      22      17      60      39      17
        ZIYUAN_COMMON.put("159870", "资源-通用             ");//化工ETF               市值：14.02     累涨：21.61     5.88      10.19     5.54      10日：2.15      1.80      0.90      0.18      14        累涨修正：27.36     净值区间：90      53      39      74      43      18
        ZIYUAN_COMMON.put("159703", "资源-通用             ");//新材料ETF             市值：0.55      累涨：21.79     5.04      9.95      6.80      10日：2.46      1.60      0.71      0.18      15        累涨修正：27.27     净值区间：88      27      23      63      38      19
        ZIYUAN_COMMON.put("516220", "资源-通用             ");//化工龙头ETF           市值：1.13      累涨：20.95     5.50      10.10     5.35      10日：2.28      1.80      0.98      0.00      18        累涨修正：26.99     净值区间：90      56      38      74      43      20
        ZIYUAN_COMMON.put("516360", "资源-通用             ");//新材料ETF             市值：0.54      累涨：20.06     4.99      8.50      6.57      10日：2.62      2.02      0.93      0.15      17        累涨修正：26.56     净值区间：80      33      24      64      32      21
        ZIYUAN_COMMON.put("159761", "资源-通用             ");//新材料50ETF           市值：1.36      累涨：21.07     5.34      9.45      6.28      10日：2.44      1.24      0.62      0.20      20        累涨修正：25.99     净值区间：86      29      25      67      41      22
        ZIYUAN_COMMON.put("159763", "资源-通用             ");//新材料ETF基金         市值：0.52      累涨：20.70     4.24      10.82     5.64      10日：2.18      1.32      0.66      0.22      21        累涨修正：25.52     净值区间：100     32      25      53      38      23
        ZIYUAN_COMMON.put("516890", "资源-通用             ");//新材料ETF指数基金     市值：0.23      累涨：19.72     5.09      8.97      5.66      10日：2.44      1.44      0.82      -0.20     23        累涨修正：25.24     净值区间：71      25      21      63      37      24
        ZIYUAN_COMMON.put("159985", "资源-通用             ");//豆粕ETF               市值：26.94     累涨：19.93     7.51      9.17      3.25      10日：2.73      0.26      0.26      0.52      22        累涨修正：23.44     净值区间：53      42      60      18      18      25
        ZIYUAN_COMMON.put("516570", "资源-通用             ");//化工行业ETF           市值：0.62      累涨：18.63     5.80      7.76      5.07      10日：1.69      1.13      0.71      0.14      24        累涨修正：22.87     净值区间：89      42      22      65      51      26
        ZIYUAN_COMMON.put("561790", "资源-通用             ");//央企现代能源ETF       市值：0.47      累涨：18.49     5.11      9.03      4.35      10日：1.03      0.28      0.28      -0.19     27        累涨修正：20.36     净值区间：21      13      36      73      72      27
        ZIYUAN_COMMON.put("562850", "资源-通用             ");//央企能源ETF           市值：0.97      累涨：17.65     5.41      7.51      4.73      10日：1.31      0.37      0.09      0.00      26        累涨修正：19.51     净值区间：36      21      37      82      82      28
        ZIYUAN_COMMON.put("561260", "资源-通用             ");//能源ETF               市值：0.44      累涨：15.97     5.80      5.90      4.27      10日：1.32      0.47      0.19      -0.09     25        累涨修正：18.14     净值区间：21      19      34      78      77      29
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();

    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_NONGYE);
        ZIYUAN.putAll(ZIYUAN_XIYOU);
        ZIYUAN.putAll(ZIYUAN_COMMON);
    }

    public static Map<String, String> TOP_ZIYUAN = new HashMap<>();

    static {
        TOP_ZIYUAN.putAll(TOP_ZIYUAN_OIL);
        TOP_ZIYUAN.putAll(TOP_ZIYUAN_NONGYE);
        TOP_ZIYUAN.putAll(TOP_ZIYUAN_XIYOU);
        TOP_ZIYUAN.putAll(TOP_ZIYUAN_COMMON);
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用
    public static Map<String, String> TOP_XIAOFEI_COMMON = new HashMap<>();//消费-通用

    static {

    }

    static {
        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.06      累涨：25.62     7.73      9.69      8.20      10日：4.29      4.05      2.84      -1.04     3         累涨修正：39.64     净值区间：69      76      84      92      93      1
        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.35      累涨：28.58     11.04     11.84     5.70      10日：2.70      2.48      0.91      -0.11     1         累涨修正：35.58     净值区间：33      33      20      63      43      2
        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.81      累涨：25.66     6.32      13.28     6.06      10日：2.53      2.53      0.96      1.67      42        累涨修正：32.64     净值区间：92      79      47      63      52      3
        XIAOFEI_COMMON.put("159996", "消费-通用             ");//家电ETF               市值：13.57     累涨：26.84     8.44      11.32     7.08      10日：1.51      1.51      0.99      0.15      1         累涨修正：31.84     净值区间：40      26      24      75      55      4
        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.54      累涨：25.35     4.34      11.23     9.78      10日：2.87      1.82      0.19      -0.48     2         累涨修正：30.42     净值区间：14      42      54      80      80      5
        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.71      累涨：24.00     4.32      10.15     9.53      10日：3.44      2.22      0.22      -0.44     4         累涨修正：30.1      净值区间：18      46      68      86      86      6
        XIAOFEI_COMMON.put("561120", "消费-通用             ");//家电ETF               市值：1.01      累涨：25.55     8.14      10.82     6.59      10日：1.26      1.26      0.76      0.17      8         累涨修正：29.59     净值区间：38      24      21      73      58      7
        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：4.37      累涨：25.55     10.95     10.36     4.24      10日：1.56      1.35      0.42      -0.41     5         累涨修正：29.3      净值区间：45      37      28      68      52      8
        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.33      累涨：27.62     8.51      12.78     6.33      10日：1.08      0.59                0.00      9         累涨修正：29.29     净值区间：14      6       6       70      61      9
        XIAOFEI_COMMON.put("560880", "消费-通用             ");//家电ETF龙头           市值：4.12      累涨：25.34     7.99      10.70     6.65      10日：1.30      1.30      0.66      0.65      6         累涨修正：29.26     净值区间：50      32      29      75      60      10
        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.14      累涨：24.98     8.03      10.53     6.42      10日：1.81      1.09      0.50      0.15      7         累涨修正：28.88     净值区间：26      12      12      66      61      11
        XIAOFEI_COMMON.put("516600", "消费-通用             ");//消费服务ETF           市值：0.82      累涨：20.58     7.95      6.83      5.80      10日：2.14      1.98      0.82      0.00      10        累涨修正：26.34     净值区间：91      77      75      94      74      12
        XIAOFEI_COMMON.put("159730", "消费-通用             ");//龙头家电ETF           市值：0.38      累涨：23.76     8.85      8.00      6.91      10日：0.81      0.81      0.41      0.10      18        累涨修正：26.2      净值区间：24      13      13      67      52      13
        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：4.90      累涨：22.00     10.63     7.35      4.02      10日：1.59      1.01      0.72      -0.57     11        累涨修正：26.04     净值区间：55      54      32      65      54      14
        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：134.70    累涨：22.53     10.52     8.36      3.65      10日：1.22      0.98      0.49      -0.49     14        累涨修正：25.71     净值区间：46      47      31      65      55      15
        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.76      累涨：22.36     10.45     8.17      3.74      10日：1.04      1.04      0.52      -0.51     15        累涨修正：25.48     净值区间：45      43      25      63      50      16
        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.76      累涨：22.15     10.68     7.60      3.87      10日：1.17      1.04      0.52      -0.64     13        累涨修正：25.4      净值区间：40      43      26      63      54      17
        XIAOFEI_COMMON.put("159328", "消费-通用             ");//家电ETF易方达         市值：1.17      累涨：22.80     8.19      8.49      6.12      10日：0.93      0.73      0.42      0.41      20        累涨修正：25.3      净值区间：9       9       9       55      52      18
        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.24      累涨：21.90     10.21     8.11      3.58      10日：1.01      1.01      0.67      -0.78     19        累涨修正：25.26     净值区间：47      39      26      58      52      19
        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：22.63     累涨：22.72     8.69      8.92      5.11      10日：1.02      0.94      0.26      -0.34     12        累涨修正：25.2      净值区间：7       5       12      72      68      20
        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：0.77      累涨：21.60     9.02      7.75      4.83      10日：1.05      0.84      0.21      -0.42     17        累涨修正：23.91     净值区间：0       0       3       69      60      21
        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：16.34     累涨：20.52     8.58      7.43      4.51      10日：1.87      0.94      0.19      -0.37     16        累涨修正：23.71     净值区间：44      25      45      81      71      22
        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.32      累涨：20.81     7.94      8.16      4.71      10日：0.86      0.77                -0.19     22        累涨修正：22.44     净值区间：9       6       6       71      60      23
        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.59      累涨：20.36     8.22      7.38      4.76      10日：0.83      0.83      0.21      -0.31     21        累涨修正：22.44     净值区间：5       3       9       71      64      24
        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.00      累涨：19.13     8.47      6.66      4.00      10日：0.65      0.65      0.13      -0.39     23        累涨修正：20.69     净值区间：13      8       8       72      51      25
    }

    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒
    public static Map<String, String> TOP_XIAOFEI_MEDIA = new HashMap<>();

    static {
        TOP_XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.31      累涨：46.23     12.42     18.67     15.14     10日：10.70     5.56      3.55      1.68      1         累涨修正：69.59     净值区间：95      96      98      98      70      1
    }

    static {
        XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.31      累涨：46.23     12.42     18.67     15.14     10日：10.70     5.56      3.55      1.68      1         累涨修正：69.59     净值区间：95      96      98      98      70      1
        XIAOFEI_MEDIA.put("159869", "消费-文娱传媒         ");//游戏ETF               市值：67.70     累涨：44.48     11.07     18.37     15.04     10日：10.90     5.95      3.77      1.74      2         累涨修正：68.87     净值区间：95      96      97      98      68      2
        XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：16.12     累涨：45.68     11.50     19.23     14.95     10日：10.42     5.62      3.52      1.66      3         累涨修正：68.76     净值区间：94      95      96      98      69      3
        XIAOFEI_MEDIA.put("516620", "消费-文娱传媒         ");//影视ETF               市值：0.50      累涨：37.84     13.55     14.27     10.02     10日：5.61      4.22      2.31      1.44      5         累涨修正：52.29     净值区间：100     100     100     97      55      4
        XIAOFEI_MEDIA.put("159855", "消费-文娱传媒         ");//影视ETF               市值：0.56      累涨：37.82     14.01     14.27     9.54      10日：5.67      4.24      2.10      1.38      4         累涨修正：51.93     净值区间：98      98      98      88      53      5
        XIAOFEI_MEDIA.put("516190", "消费-文娱传媒         ");//文娱传媒ETF           市值：0.17      累涨：36.38     10.10     16.17     10.11     10日：5.74      3.68      2.04      1.40      6         累涨修正：49.88     净值区间：100     100     100     96      64      6
        XIAOFEI_MEDIA.put("512980", "消费-文娱传媒         ");//传媒ETF               市值：26.02     累涨：36.52     10.99     16.00     9.53      10日：5.78      3.38      1.87      1.35      7         累涨修正：49.42     净值区间：94      95      96      93      67      7
        XIAOFEI_MEDIA.put("159805", "消费-文娱传媒         ");//传媒ETF               市值：1.37      累涨：35.70     10.91     15.94     8.85      10日：5.90      3.48      1.96      1.22      8         累涨修正：49        净值区间：94      94      95      96      67      8
        XIAOFEI_MEDIA.put("517770", "消费-文娱传媒         ");//游戏传媒ETF           市值：0.29      累涨：35.29     12.38     15.39     7.52      10日：4.44      3.40      1.33      1.42      9         累涨修正：45.79     净值区间：97      97      77      91      47      9
    }

    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐
    public static Map<String, String> TOP_XIAOFEI_WINE = new HashMap<>();

    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.22      累涨：34.71     9.70      18.37     6.64      10日：3.69      2.20      1.76      -0.43     1         累涨修正：44.12     净值区间：74      76      77      56      56      1
        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：108.68    累涨：24.84     12.21     8.27      4.36      10日：1.36      0.85      0.17      0.17      5         累涨修正：27.39     净值区间：27      19      9       8       5       8
    }

    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.22      累涨：34.71     9.70      18.37     6.64      10日：3.69      2.20      1.76      -0.43     1         累涨修正：44.12     净值区间：74      76      77      56      56      1
        XIAOFEI_WINE.put("159766", "消费-吃喝玩乐         ");//旅游ETF               市值：29.58     累涨：33.66     9.34      18.34     5.98      10日：3.14      1.64      1.34      -0.29     2         累涨修正：41.12     净值区间：72      75      77      55      55      2
        XIAOFEI_WINE.put("159736", "消费-吃喝玩乐         ");//食品饮料ETF天弘       市值：47.55     累涨：25.46     10.66     9.80      5.00      10日：1.94      1.52      0.69      -0.69     3         累涨修正：30.3      净值区间：47      47      33      66      51      3
        XIAOFEI_WINE.put("516900", "消费-吃喝玩乐         ");//食品饮料ETF基金       市值：0.74      累涨：26.84     13.29     9.38      4.17      10日：1.13      0.97      0.16      -0.32     6         累涨修正：29.26     净值区间：31      24      14      52      31      4
        XIAOFEI_WINE.put("159862", "消费-吃喝玩乐         ");//食品ETF               市值：0.40      累涨：25.27     9.88      10.93     4.46      10日：1.45      1.16      0.44      -0.44     4         累涨修正：28.76     净值区间：27      24      13      51      41      5
        XIAOFEI_WINE.put("159843", "消费-吃喝玩乐         ");//食品饮料ETF           市值：2.66      累涨：24.35     11.47     8.70      4.18      10日：1.35      1.05      0.45      -0.45     8         累涨修正：27.65     净值区间：40      30      19      58      40      6
        XIAOFEI_WINE.put("515170", "消费-吃喝玩乐         ");//食品饮料ETF           市值：32.32     累涨：24.42     11.81     8.55      4.06      10日：1.19      1.19      0.34      -0.34     7         累涨修正：27.48     净值区间：36      29      18      57      41      7
        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：108.68    累涨：24.84     12.21     8.27      4.36      10日：1.36      0.85      0.17      0.17      5         累涨修正：27.39     净值区间：27      19      9       8       5       8
        XIAOFEI_WINE.put("515710", "消费-吃喝玩乐         ");//食品ETF               市值：8.61      累涨：25.29     11.77     9.53      3.99      10日：0.80      0.64      0.16      -0.32     9         累涨修正：27.05     净值区间：40      32      21      58      42      9
    }

    public static Map<String, String> XIAOFEI = new HashMap<>();

    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
        XIAOFEI.putAll(XIAOFEI_MEDIA);
        XIAOFEI.putAll(XIAOFEI_WINE);
//        XIAOFEI.putAll(XIAOFEI_HK);
//        XIAOFEI.putAll(XIAOFEI_HOUSE);
//        XIAOFEI.putAll(XIAOFEI_TRAVEL);
    }

    public static Map<String, String> TOP_XIAOFEI = new HashMap<>();

    static {
        XIAOFEI.putAll(TOP_XIAOFEI_COMMON);
        XIAOFEI.putAll(TOP_XIAOFEI_MEDIA);
        XIAOFEI.putAll(TOP_XIAOFEI_WINE);
    }


    /**
     * 医疗
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗
    public static Map<String, String> TOP_YILIAO_COMMON = new HashMap<>();

    static {
        TOP_YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：39.80     累涨：81.25     27.04     25.89     28.32     10日：17.05     10.37     5.85      -1.66     1         累涨修正：120.37    净值区间：71      76      84      90      90      1
    }

    static {
        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：39.80     累涨：81.25     27.04     25.89     28.32     10日：17.05     10.37     5.85      -1.66     1         累涨修正：120.37    净值区间：71      76      84      90      90      1
        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：16.69     累涨：79.26     27.32     25.63     26.31     10日：15.18     9.81      5.18      -1.40     2         累涨修正：114.61    净值区间：70      76      84      90      90      2
        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：5.34      累涨：78.25     25.96     26.59     25.70     10日：14.26     9.89      5.50      -1.28     4         累涨修正：113.4     净值区间：71      75      83      90      90      3
        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：5.67      累涨：79.10     26.61     25.10     27.39     10日：15.32     9.59      4.39      -1.24     3         累涨修正：112.79    净值区间：71      76      85      90      90      4
        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：2.82      累涨：77.77     25.77     25.39     26.61     10日：15.22     9.78      4.96      -1.29     5         累涨修正：112.69    净值区间：69      74      83      90      90      5
        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：97.77     累涨：77.03     25.71     24.46     26.86     10日：15.14     9.28      4.77      -1.12     6         累涨修正：110.99    净值区间：68      74      83      90      90      6
        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：19.71     累涨：75.54     25.91     24.32     25.31     10日：14.64     9.85      5.15      -1.01     7         累涨修正：110.33    净值区间：73      77      84      91      91      7
        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：42.68     累涨：69.22     22.51     24.37     22.34     10日：12.87     8.41      4.80      -0.72     8         累涨修正：100.1     净值区间：77      81      87      93      93      8
        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：3.03      累涨：69.62     23.46     24.41     21.75     10日：12.24     8.32      4.44      -1.73     10        累涨修正：99.06     净值区间：62      69      79      88      88      9
        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.06      累涨：69.62     23.12     24.66     21.84     10日：12.19     8.13      4.45      -1.50     9         累涨修正：98.84     净值区间：65      71      81      89      89      10
        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：2.45      累涨：63.42     20.92     21.45     21.05     10日：12.76     8.49      4.28      -1.38     11        累涨修正：93.23     净值区间：66      73      81      90      90      11
        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：27.09     累涨：63.63     20.02     22.56     21.05     10日：12.28     7.97      4.06      -1.28     12        累涨修正：92        净值区间：67      73      82      90      90      12
        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.19      累涨：63.44     20.95     22.08     20.41     10日：11.83     8.03      3.67      -1.22     13        累涨修正：90.64     净值区间：66      73      82      90      90      13
        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：9.98      累涨：62.59     20.17     22.66     19.76     10日：11.51     7.84      4.02      -1.42     14        累涨修正：89.98     净值区间：68      74      82      90      90      14
        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：83.49     累涨：64.11     20.21     23.98     19.92     10日：10.66     7.43      3.84      -1.48     16        累涨修正：89.88     净值区间：63      69      79      89      89      15
        YILIAO_COMMON.put("159217", "医疗-通用             ");//港股通创新药ETF工银   市值：42.18     累涨：                    25.73     28.12     10日：15.84     9.42      4.90      -1.37     17        累涨修正：88.91     净值区间：70      74      84      90              16
        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.64      累涨：63.85     20.96     24.50     18.39     10日：10.00     7.19      3.87      -1.33     15        累涨修正：88.78     净值区间：66      71      80      89      89      17
        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：0.57      累涨：60.94     19.59     22.57     18.78     10日：10.99     7.56      4.10      -1.67     18        累涨修正：87.69     净值区间：64      70      79      89      89      18
        YILIAO_COMMON.put("159316", "医疗-通用             ");//恒生创新药ETF         市值：2.11      累涨：                    24.47     25.16     10日：14.79     9.33      5.27      -1.35     21        累涨修正：84.29     净值区间：70      75      83      90              19
        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药ETF天弘         市值：4.24      累涨：48.48     16.22     14.63     17.63     10日：12.74     8.38      5.39      -1.68     19        累涨修正：80.38     净值区间：73      77      84      91      91      20
        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：2.81      累涨：52.06     18.00     16.29     17.77     10日：11.51     7.24      3.89      -1.31     20        累涨修正：78.59     净值区间：73      77      85      91      91      21
        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：1.96      累涨：51.24     17.50     16.14     17.60     10日：11.47     7.67      4.02      -1.64     22        累涨修正：78.42     净值区间：68      73      83      89      89      22
        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：3.88      累涨：52.08     18.49     16.49     17.10     10日：10.79     7.11      3.79      -1.18     23        累涨修正：77.56     净值区间：75      78      85      91      91      23
        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药ETF国泰         市值：2.72      累涨：50.97     17.64     15.25     18.08     10日：10.38     6.85      3.02      -1.24     24        累涨修正：74.24     净值区间：71      77      85      91      91      24
        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：99.00     累涨：40.89     14.08     12.14     14.67     10日：9.48      6.57      3.15      -1.36     25        累涨修正：63.24     净值区间：75      78      86      91      91      25
        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：2.66      累涨：43.55     13.83     16.97     12.75     10日：8.30      6.53      2.18      -0.58     29        累涨修正：62.74     净值区间：81      84      87      93      93      26
        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：2.90      累涨：43.03     14.68     15.77     12.58     10日：8.51      6.39      2.24      -0.51     30        累涨修正：62.41     净值区间：83      85      88      94      94      27
        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：1.94      累涨：39.50     14.54     10.19     14.77     10日：9.57      6.53      3.36      -1.25     27        累涨修正：62.32     净值区间：77      80      87      92      92      28
        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.39      累涨：39.52     13.85     10.70     14.97     10日：9.70      6.46      3.25      -1.11     26        累涨修正：62.18     净值区间：77      80      87      92      92      29
        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：35.23     累涨：39.84     15.15     10.56     14.13     10日：9.21      6.37      3.03      -1.16     28        累涨修正：61.48     净值区间：77      79      87      92      92      30
        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.32      累涨：39.21     13.98     11.51     13.72     10日：9.05      6.35      3.17      -1.15     31        累涨修正：60.95     净值区间：75      79      88      92      92      31
        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：13.29     累涨：43.55     5.96      24.41     13.18     10日：6.55      4.09      2.79      -0.34     39        累涨修正：59.77     净值区间：90      91      95      91      61      32
        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.15      累涨：37.69     14.19     9.74      13.76     10日：9.03      6.48      3.09      -1.27     32        累涨修正：59.38     净值区间：71      74      83      89      89      33
        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：0.95      累涨：37.71     14.26     9.63      13.82     10日：8.86      6.36      3.11      -1.26     33        累涨修正：59.15     净值区间：74      77      86      91      91      34
        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.35      累涨：37.70     13.23     12.33     12.14     10日：6.89      5.14      2.78      -0.95     34        累涨修正：55.29     净值区间：64      73      82      90      90      35
        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.69      累涨：33.96     11.17     9.04      13.75     10日：8.46      6.19      2.79      0.46      36        累涨修正：54.19     净值区间：88      89      92      94      94      36
        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.20      累涨：33.83     11.39     10.25     12.19     10日：7.93      6.22      2.82      0.44      35        累涨修正：53.62     净值区间：80      84      88      91      91      37
        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.42      累涨：31.55     12.71     7.44      11.40     10日：7.93      5.74      2.62      -0.77     38        累涨修正：50.46     净值区间：83      85      89      91      74      38
        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：12.49     累涨：39.96     5.71      22.33     11.92     10日：4.13      2.48      1.56      -0.72     57        累涨修正：49.69     净值区间：50      66      83      85      56      39
        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：33.59     累涨：30.72     12.33     7.07      11.32     10日：7.56      5.57      2.74      -0.54     43        累涨修正：49.33     净值区间：80      81      86      90      76      40
        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：12.85     累涨：32.40     12.40     9.24      10.76     10日：6.95      4.75      2.34      -0.42     41        累涨修正：48.78     净值区间：81      83      89      93      93      41
        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.74      累涨：32.55     11.89     9.28      11.38     10日：7.09      4.78      2.04      -0.20     40        累涨修正：48.5      净值区间：85      86      91      94      93      42
        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.18      累涨：31.51     12.07     8.41      11.03     10日：6.58      4.96      2.68      0.15      46        累涨修正：48.41     净值区间：85      85      89      91      78      43
        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.10      累涨：32.31     12.54     8.79      10.98     10日：6.61      4.90      2.16      -0.16     42        累涨修正：48.14     净值区间：88      89      93      95      92      44
        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.31      累涨：30.78     12.11     8.01      10.66     10日：6.98      4.58      2.72      -1.14     47        累涨修正：47.78     净值区间：72      77      85      92      92      45
        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.58      累涨：30.38     11.26     7.45      11.67     10日：6.65      5.24      2.75      0.00      48        累涨修正：47.77     净值区间：82      82      86      89      75      46
        YILIAO_COMMON.put("588250", "医疗-通用             ");//科创生物医药ETF       市值：1.29      累涨：                    16.26     12.58     10日：7.87      6.30      2.17      -0.46     37        累涨修正：47.35     净值区间：82      84      88      94              47
        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.35      累涨：31.77     11.79     9.12      10.86     10日：6.95      4.82      1.85      -0.40     44        累涨修正：47.24     净值区间：87      90      94      95      90      48
        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.19      累涨：29.95     9.95      8.90      11.10     10日：6.50      5.09      2.74      0.00      50        累涨修正：47.02     净值区间：76      78      83      88      77      49
        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：5.86      累涨：28.93     11.42     6.60      10.91     10日：6.89      5.37      2.34      -0.57     51        累涨修正：45.87     净值区间：77      80      85      89      74      50
        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.53      累涨：30.14     12.13     7.41      10.60     10日：6.52      4.41      2.06      -1.13     53        累涨修正：45.19     净值区间：70      74      83      90      90      51
        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：36.96     累涨：30.59     12.28     7.89      10.42     10日：6.40      4.06      1.95      -0.40     52        累涨修正：44.95     净值区间：82      85      91      95      95      52
        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：9.82      累涨：28.85     11.55     8.00      9.30      10日：5.55      4.22      2.09      -0.77     54        累涨修正：42.8      净值区间：79      80      84      94      58      53
        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：16.34     累涨：29.24     11.22     9.12      8.90      10日：5.29      4.05      1.94      -0.72     56        累涨修正：42.46     净值区间：78      79      83      93      57      54
        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：51.47     累涨：28.37     11.04     7.56      9.77      10日：5.70      3.94      2.02      -0.77     59        累涨修正：42.05     净值区间：75      78      86      92      92      55
        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：15.05     累涨：30.01     13.19     8.15      8.67      10日：5.44      3.42      1.41      -1.11     55        累涨修正：41.69     净值区间：64      69      82      89      89      56
        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：261.31    累涨：28.71     11.07     8.67      8.97      10日：5.23      3.99      1.82      -0.30     58        累涨修正：41.57     净值区间：85      85      88      95      57      57
        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：22.64     累涨：27.87     11.08     7.52      9.27      10日：5.48      3.98      1.72      -0.48     60        累涨修正：40.77     净值区间：81      81      85      94      57      58
        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.79      累涨：27.48     12.19     6.51      8.78      10日：5.44      3.73      1.84      -0.83     61        累涨修正：40.33     净值区间：86      86      86      92      92      59
        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：6.50      累涨：26.86     11.22     7.38      8.26      10日：5.39      3.80      2.10      -1.09     66        累涨修正：40.25     净值区间：69      73      83      91      91      60
        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：16.88     累涨：27.37     8.56      10.60     8.21      10日：4.82      3.55      2.07      -0.41     63        累涨修正：39.88     净值区间：83      85      88      95      71      61
        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.83      累涨：28.00     8.74      11.01     8.25      10日：4.65      3.39      1.77      -0.52     62        累涨修正：39.58     净值区间：83      86      86      91      57      62
        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：20.87     累涨：26.32     10.63     6.76      8.93      10日：5.46      3.68      1.97      -0.82     67        累涨修正：39.4      净值区间：75      78      86      92      92      63
        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.87      累涨：27.53     11.71     7.21      8.61      10日：4.97      3.58      1.53      -0.73     65        累涨修正：39.14     净值区间：73      79      87      93      93      64
        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：210.21    累涨：27.09     11.97     6.91      8.21      10日：4.88      3.24      1.88      -0.79     68        累涨修正：38.97     净值区间：73      75      85      91      91      65
        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.77      累涨：27.65     8.70      10.39     8.56      10日：4.84      3.09      1.53      0.00      64        累涨修正：38.64     净值区间：94      95      96      99      75      66
        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：1.99      累涨：25.68     11.91     6.22      7.55      10日：4.82      3.74      1.94      -1.04     70        累涨修正：38.12     净值区间：64      69      80      89      89      67
        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.71      累涨：26.45     9.67      8.41      8.37      10日：4.63      3.12      1.89      -0.13     72        累涨修正：37.98     净值区间：89      90      92      97      58      68
        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.15      累涨：26.55     8.76      10.27     7.52      10日：4.11      3.39      1.95      -0.35     69        累涨修正：37.95     净值区间：86      86      88      95      64      69
        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.83      累涨：26.53     9.03      9.83      7.67      10日：4.09      3.37      1.76      -0.35     71        累涨修正：37.51     净值区间：84      86      88      95      61      70
        YILIAO_COMMON.put("159377", "医疗-通用             ");//创业板医药ETF国泰     市值：0.24      累涨：                              13.64     10日：9.21      6.58      3.66      -0.91     45        累涨修正：36.75     净值区间：86      87      89                      71
        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.84      累涨：25.27     9.42      8.16      7.69      10日：4.25      3.40      1.90      -0.21     73        累涨修正：36.72     净值区间：93      94      95      94      60      72
        YILIAO_COMMON.put("560080", "医疗-通用             ");//中药ETF               市值：18.52     累涨：24.27     7.16      9.40      7.71      10日：4.34      3.01      2.06      -0.93     74        累涨修正：35.74     净值区间：63      67      75      87      87      73
        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.18      累涨：24.67     7.72      9.32      7.63      10日：3.57      3.33      1.89      -0.46     76        累涨修正：35.35     净值区间：85      88      89      93      53      74
        YILIAO_COMMON.put("159647", "医疗-通用             ");//中药ETF               市值：7.09      累涨：23.81     6.69      9.20      7.92      10日：4.49      2.94      2.02      -0.90     75        累涨修正：35.28     净值区间：67      71      77      88      88      75
        YILIAO_COMMON.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.86      累涨：23.80     6.62      9.07      8.11      10日：4.16      2.80      1.92      -1.14     77        累涨修正：34.6      净值区间：61      65      73      87      87      76
        YILIAO_COMMON.put("562390", "医疗-通用             ");//中药50ETF             市值：0.60      累涨：23.48     6.96      8.81      7.71      10日：4.23      2.77      1.84      -0.91     78        累涨修正：34.16     净值区间：61      67      74      87      87      77
        YILIAO_COMMON.put("159366", "医疗-通用             ");//港股医疗ETF           市值：0.35      累涨：                              13.80     10日：8.76      5.91      2.39      -1.00     49        累涨修正：33.25     净值区间：60      69      75                      78
        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.54      累涨：22.40     9.36      5.65      7.39      10日：3.84      3.12      1.91      -0.23     79        累涨修正：33.18     净值区间：92      94      95      98      71      79
        YILIAO_COMMON.put("588130", "医疗-通用             ");//科创医药ETF基金       市值：0.47      累涨：                                        10日：                    2.20      -0.09               累涨修正：          净值区间：85                                      80
    }

    public static Map<String, String> YILIAO = new HashMap<>();//医疗

    static {
        YILIAO.putAll(YILIAO_COMMON);
    }

    public static Map<String, String> TOP_YILIAO = new HashMap<>();//医疗

    static {
        TOP_YILIAO.putAll(TOP_YILIAO_COMMON);
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港
    public static Map<String, String> TOP_KEJI_HK = new HashMap<>();

    static {
        TOP_KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：138.54    累涨：52.15     16.07     24.97     11.11     10日：5.65      4.23      2.48      1.43      1         累涨修正：66.99     净值区间：94      68      65      90      63      2
        TOP_KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：6.88      累涨：62.68     32.56     14.69     15.43     10日：1.44      0.58      0.15      0.00      35        累涨修正：65        净值区间：21      10      20      49      38      3
    }

    static {
        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：17.56     累涨：51.32     14.46     25.89     10.97     10日：5.94      4.95      2.61      1.28      2         累涨修正：67.43     净值区间：91      70      69      91      64      1
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：138.54    累涨：52.15     16.07     24.97     11.11     10日：5.65      4.23      2.48      1.43      1         累涨修正：66.99     净值区间：94      68      65      90      63      2
        KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：6.88      累涨：62.68     32.56     14.69     15.43     10日：1.44      0.58      0.15      0.00      35        累涨修正：65        净值区间：21      10      20      49      38      3
        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.39      累涨：50.18     15.69     23.57     10.92     10日：5.03      4.32      2.57      1.08      4         累涨修正：64.67     净值区间：88      65      63      89      64      4
        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：12.48     累涨：48.92     14.45     23.89     10.58     10日：5.40      4.31      2.62      1.10      7         累涨修正：63.87     净值区间：88      68      64      90      63      5
        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：5.36      累涨：48.95     14.45     24.04     10.46     10日：5.40      4.26      2.44      1.01      6         累涨修正：63.49     净值区间：85      61      58      88      64      6
        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：222.94    累涨：48.79     14.73     23.73     10.33     10日：5.43      4.40      2.31      1.41      3         累涨修正：63.24     净值区间：88      84      76      89      58      7
        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：1.59      累涨：47.68     13.89     22.80     10.99     10日：5.52      4.58      2.60      1.01      8         累涨修正：62.98     净值区间：88      77      71      92      64      8
        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：4.05      累涨：47.80     15.13     21.80     10.87     10日：5.30      4.35      2.63      0.96      5         累涨修正：62.71     净值区间：89      68      61      89      61      9
        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：5.71      累涨：47.23     14.82     22.75     9.66      10日：5.19      4.02      2.21      1.09      9         累涨修正：60.86     净值区间：85      60      59      89      63      10
        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：5.84      累涨：46.53     14.62     22.06     9.85      10日：4.89      3.99      2.25      1.01      11        累涨修正：59.91     净值区间：89      68      61      89      61      11
        KEJI_HK.put("513070", "科技-香港             ");//港股消费ETF易方达     市值：6.45      累涨：44.63     14.36     20.50     9.77      10日：4.72      3.67      2.37      0.68      17        累涨修正：57.76     净值区间：88      54      54      86      60      12
        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：341.86    累涨：46.43     16.76     19.74     9.93      10日：4.02      3.44      1.76      1.31      15        累涨修正：57.41     净值区间：92      64      43      78      50      13
        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：10.93     累涨：46.23     16.95     19.46     9.82      10日：4.06      3.58      1.65      1.25      16        累涨修正：57.17     净值区间：89      63      42      80      52      14
        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：8.26      累涨：47.47     19.33     18.97     9.17      10日：4.52      3.59      0.74      2.09      19        累涨修正：57.06     净值区间：89      91      62      77      39      15
        KEJI_HK.put("159735", "科技-香港             ");//港股消费ETF           市值：6.51      累涨：44.88     13.89     21.16     9.83      10日：4.45      3.47      2.11      0.86      20        累涨修正：57.02     净值区间：84      63      52      86      62      16
        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：238.01    累涨：46.50     18.64     18.12     9.74      10日：4.92      3.86      0.86      2.12      12        累涨修正：57        净值区间：94      95      63      79      42      17
        KEJI_HK.put("513230", "科技-香港             ");//港股消费ETF           市值：3.44      累涨：43.03     13.87     19.30     9.86      10日：4.73      3.87      2.52      1.14      21        累涨修正：56.67     净值区间：89      68      62      89      63      18
        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：47.31     累涨：46.28     17.15     19.37     9.76      10日：3.74      3.36      1.44      1.34      23        累涨修正：56.26     净值区间：89      66      42      80      52      19
        KEJI_HK.put("513590", "科技-香港             ");//香港消费ETF           市值：3.74      累涨：44.56     14.16     21.25     9.15      10日：3.68      3.36      2.06      0.86      34        累涨修正：55.72     净值区间：86      60      59      89      64      20
        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：23.44     累涨：44.94     14.46     20.76     9.72      10日：4.33      3.61      1.15      1.43      14        累涨修正：55.18     净值区间：87      76      58      82      46      21
        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：7.11      累涨：45.66     14.10     22.96     8.60      10日：4.07      3.04      1.11      1.69      30        累涨修正：54.99     净值区间：87      86      61      83      52      22
        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：49.11     累涨：45.71     14.61     22.84     8.26      10日：4.01      3.04      1.08      2.04      27        累涨修正：54.92     净值区间：93      93      72      86      52      23
        KEJI_HK.put("520520", "科技-香港             ");//恒生消费ETF华泰柏瑞   市值：0.82      累涨：39.46     14.74     14.73     9.99      10日：6.01      4.44      2.45      -1.07     10        累涨修正：54.81     净值区间：33      50      59      86      80      24
        KEJI_HK.put("517360", "科技-香港             ");//沪港深科技ETF         市值：0.36      累涨：41.13     12.46     19.46     9.21      10日：5.09      3.84      2.36      0.48      26        累涨修正：54.78     净值区间：98      75      58      82      74      25
        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：460.96    累涨：44.96     14.23     22.15     8.58      10日：4.19      3.00      1.20      2.15      36        累涨修正：54.55     净值区间：94      94      76      83      51      26
        KEJI_HK.put("159728", "科技-香港             ");//在线消费ETF           市值：0.59      累涨：37.32     8.55      16.69     12.08     10日：7.10      4.33      2.80      2.11      13        累涨修正：54.35     净值区间：95      95      82      91      55      27
        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.23      累涨：45.25     14.37     22.68     8.20      10日：3.97      2.87      1.04      1.76      39        累涨修正：54.17     净值区间：88      88      68      85      53      28
        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：2.85      累涨：44.19     15.81     18.73     9.65      10日：3.46      3.05      1.32      1.39      37        累涨修正：53.34     净值区间：93      58      42      78      49      29
        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：49.44     累涨：44.40     14.40     20.64     9.36      10日：3.78      3.16      0.95      1.57      29        累涨修正：53.24     净值区间：89      74      55      82      10      30
        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：112.88    累涨：43.80     14.46     19.90     9.44      10日：3.93      3.51      0.98      1.53      25        累涨修正：53.2      净值区间：91      77      59      83      46      31
        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：8.01      累涨：43.73     13.85     20.37     9.51      10日：3.93      3.35      1.02      1.44      33        累涨修正：53.05     净值区间：90      78      57      85      47      32
        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：44.23     累涨：44.22     14.75     20.35     9.12      10日：3.60      3.23      0.83      1.56      31        累涨修正：52.71     净值区间：88      72      53      81      46      33
        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：271.02    累涨：43.65     14.28     20.18     9.19      10日：3.86      3.43      0.85      1.70      28        累涨修正：52.64     净值区间：90      76      58      83      46      34
        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：253.03    累涨：43.78     14.44     20.16     9.18      10日：3.77      3.34      0.87      1.59      32        累涨修正：52.63     净值区间：86      74      57      82      47      35
        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：20.00     累涨：43.24     14.02     20.15     9.07      10日：3.79      3.24      0.98      1.40      40        累涨修正：52.23     净值区间：86      73      55      83      47      36
        KEJI_HK.put("513970", "科技-香港             ");//恒生消费ETF           市值：17.86     累涨：38.61     15.43     14.10     9.08      10日：5.26      3.85      2.25      -0.52     22        累涨修正：52.22     净值区间：54      63      71      91      87      37
        KEJI_HK.put("159699", "科技-香港             ");//恒生消费ETF           市值：13.22     累涨：38.14     14.65     13.97     9.52      10日：5.52      4.12      2.06      -1.06     18        累涨修正：51.9      净值区间：41      57      68      89      87      38
        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：4.25      累涨：42.23     13.75     19.68     8.80      10日：3.44      3.25      0.96      1.52      42        累涨修正：50.84     净值区间：90      78      58      83      47      39
        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：74.41     累涨：42.21     13.90     19.68     8.63      10日：3.34      3.05      0.87      1.44      43        累涨修正：50.34     净值区间：85      74      55      84      47      40
        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：10.90     累涨：42.06     13.11     21.06     7.89      10日：3.43      2.96      0.67      2.57      46        累涨修正：49.79     净值区间：97      83      47      73      40      41
        KEJI_HK.put("159725", "科技-香港             ");//线上消费ETF           市值：0.52      累涨：34.53     8.25      16.66     9.62      10日：5.73      4.33      2.54      1.36      24        累涨修正：49.67     净值区间：95      95      85      92      54      42
        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：2.89      累涨：37.55     11.08     17.88     8.59      10日：4.22      4.22      1.59      2.00      38        累涨修正：49.17     净值区间：97      97      53      79      46      43
        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.16      累涨：37.58     13.35     17.19     7.04      10日：3.58      3.58      1.57      1.41      45        累涨修正：47.88     净值区间：96      96      52      78      41      44
        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.82      累涨：37.27     11.47     18.25     7.55      10日：3.53      3.53      1.21      1.68      47        累涨修正：46.75     净值区间：73      73      56      73      46      45
        KEJI_HK.put("517350", "科技-香港             ");//科技ETF沪港深         市值：0.87      累涨：34.88     9.96      16.68     8.24      10日：4.10      4.10      1.77      1.20      41        累涨修正：46.62     净值区间：100     96      86      78      52      46
        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：4.41      累涨：36.01     10.89     17.63     7.49      10日：3.75      3.62      1.55      1.91      44        累涨修正：46.48     净值区间：100     100     65      79      44      47
        KEJI_HK.put("159793", "科技-香港             ");//线上消费ETF基金       市值：0.34      累涨：36.20     11.88     18.01     6.31      10日：3.54      3.31      1.71      1.80      49        累涨修正：46.47     净值区间：97      97      52      76      49      48
        KEJI_HK.put("517550", "科技-香港             ");//消费ETF沪港深         市值：0.51      累涨：32.83     12.76     13.29     6.78      10日：1.91      1.66      0.64      0.64      51        累涨修正：37.68     净值区间：67      52      33      67      40      49
        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.51      累涨：27.42     6.32      14.65     6.45      10日：3.09      3.09      0.86      1.59      50        累涨修正：35.32     净值区间：96      71      50      80      46      50
        KEJI_HK.put("159202", "科技-香港             ");//恒生互联网科技ETF     市值：1.65      累涨：                              8.24      10日：4.25      3.28      0.30      2.27      48        累涨修正：16.37     净值区间：82      85      57                      51
    }

    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();//科技-军工
    public static Map<String, String> TOP_KEJI_JUNGONG = new HashMap<>();

    static {
        TOP_KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：96.34     累涨：42.46     10.38     13.86     18.22     10日：3.89      2.92      1.61      0.16      1         累涨修正：52.49     净值区间：60      63      38      74      74      1
    }

    static {
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：96.34     累涨：42.46     10.38     13.86     18.22     10日：3.89      2.92      1.61      0.16      1         累涨修正：52.49     净值区间：60      63      38      74      74      1
        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：46.91     累涨：42.19     11.43     13.75     17.01     10日：4.10      2.83      1.26      0.28      3         累涨修正：51.64     净值区间：66      67      35      70      65      2
        KEJI_JUNGONG.put("159378", "科技-军工             ");//通用航空ETF           市值：8.68      累涨：38.51     5.95      16.97     15.59     10日：4.93      3.80      1.18      0.45      2         累涨修正：49.6      净值区间：70      71      62      87      73      3
        KEJI_JUNGONG.put("159638", "科技-军工             ");//高端装备ETF           市值：12.56     累涨：40.52     8.60      15.02     16.90     10日：3.90      2.46      1.16      0.38      4         累涨修正：49.2      净值区间：68      69      38      73      66      4
        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：142.09    累涨：36.25     7.27      14.46     14.52     10日：3.22      2.15      0.10      0.48      6         累涨修正：41.82     净值区间：74      74      31      69      68      5
        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：46.82     累涨：35.10     6.82      13.77     14.51     10日：3.22      2.08      0.28      0.47      8         累涨修正：40.96     净值区间：72      72      30      70      68      6
        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.14      累涨：35.25     7.30      14.10     13.85     10日：2.85      1.93      0.25      0.33      7         累涨修正：40.53     净值区间：71      71      30      69      69      7
        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：7.02      累涨：35.24     7.45      14.02     13.77     10日：2.71      1.91      0.16      0.47      9         累涨修正：40.18     净值区间：77      77      32      70      70      8
        KEJI_JUNGONG.put("159231", "科技-军工             ");//通用航空ETF华宝       市值：0.36      累涨：                              16.20     10日：4.78      3.81      1.22      0.28      5         累涨修正：27.23     净值区间：64      69      64                      9
        KEJI_JUNGONG.put("516320", "科技-军工             ");//高端装备ETF           市值：0.73      累涨：21.81     3.94      10.01     7.86      10日：2.68      1.57      0.43      0.14      11        累涨修正：26.92     净值区间：56      16      11      59      44      10
        KEJI_JUNGONG.put("562910", "科技-军工             ");//高端制造ETF           市值：0.93      累涨：21.32     3.95      9.72      7.65      10日：1.96      1.32      0.33      0.49      12        累涨修正：25.26     净值区间：70      28      18      61      44      11
        KEJI_JUNGONG.put("159208", "科技-军工             ");//航天航空ETF           市值：0.61      累涨：                                        10日：2.97      2.57      0.49      0.19      10        累涨修正：6.52      净值区间：60      61                              12
        KEJI_JUNGONG.put("159230", "科技-军工             ");//通用航空ETF基金       市值：0.55      累涨：                                        10日：                    0.98      -0.20               累涨修正：          净值区间：                                        13
        KEJI_JUNGONG.put("159227", "科技-军工             ");//航空航天ETF           市值：2.46      累涨：                                        10日：3.74      2.83      0.70      0.10                累涨修正：          净值区间：60      61                              14
        KEJI_JUNGONG.put("159241", "科技-军工             ");//航空航天ETF天弘       市值：1.98      累涨：                                        10日：                    0.49      0.10                累涨修正：          净值区间：59                                      15
        KEJI_JUNGONG.put("159392", "科技-军工             ");//航空ETF               市值：1.31      累涨：                                        10日：4.92      3.99      1.21      -0.10               累涨修正：          净值区间：62      65                              16
    }

    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();//科技-通用
    public static Map<String, String> TOP_KEJI_GONG_YE = new HashMap<>();

    static {
        TOP_KEJI_GONG_YE.put("159667", "科技-通用             ");//工业母机ETF           市值：3.90      累涨：39.84     11.03     18.86     9.95      10日：2.83      2.65      0.91      1.63      8         累涨修正：47.14     净值区间：90      80      46      83      67      2
    }

    static {
        KEJI_GONG_YE.put("560990", "科技-通用             ");//中金科技先锋ETF       市值：0.27      累涨：29.39     7.77      10.47     11.15     10日：7.87      7.51      6.40      -4.17     2         累涨修正：57.57     净值区间：34      34      34      53      50      1
        KEJI_GONG_YE.put("159667", "科技-通用             ");//工业母机ETF           市值：3.90      累涨：39.84     11.03     18.86     9.95      10日：2.83      2.65      0.91      1.63      8         累涨修正：47.14     净值区间：90      80      46      83      67      2
        KEJI_GONG_YE.put("159663", "科技-通用             ");//机床ETF               市值：0.80      累涨：39.48     10.29     19.60     9.59      10日：2.85      2.67      1.01      1.64      7         累涨修正：47.02     净值区间：98      85      45      83      67      3
        KEJI_GONG_YE.put("512330", "科技-通用             ");//信息科技ETF           市值：5.65      累涨：35.38     7.97      19.13     8.28      10日：4.78      3.64      1.24      3.98      1         累涨修正：46.28     净值区间：95      95      86      90      57      4
        KEJI_GONG_YE.put("159786", "科技-通用             ");//VRETF                 市值：1.22      累涨：33.95     6.40      18.15     9.40      10日：4.09      3.49      1.44      1.78      5         累涨修正：44.41     净值区间：94      94      52      81      51      5
        KEJI_GONG_YE.put("159542", "科技-通用             ");//工程机械ETF           市值：0.07      累涨：39.06     9.72      12.36     16.98     10日：2.39      1.87                0.09      24        累涨修正：43.32     净值区间：26      19      4       30      30      6
        KEJI_GONG_YE.put("159723", "科技-通用             ");//科技龙头ETF           市值：0.73      累涨：33.13     9.87      16.59     6.67      10日：3.65      3.31      1.41      1.39      6         累涨修正：42.91     净值区间：100     97      65      85      54      7
        KEJI_GONG_YE.put("515860", "科技-通用             ");//科技ETF基金           市值：1.77      累涨：30.45     8.93      13.42     8.10      10日：3.92      3.83      1.76      1.83      3         累涨修正：41.72     净值区间：98      98      98      99      64      8
        KEJI_GONG_YE.put("516050", "科技-通用             ");//科技龙头ETF           市值：4.28      累涨：29.50     8.39      12.97     8.14      10日：4.71      3.80      1.51      2.39      4         累涨修正：41.03     净值区间：100     100     97      99      60      9
        KEJI_GONG_YE.put("159701", "科技-通用             ");//物联网ETF招商         市值：0.19      累涨：32.35     7.54      17.46     7.35      10日：3.15      2.89      1.05      1.69      12        累涨修正：40.49     净值区间：95      88      42      75      50      10
        KEJI_GONG_YE.put("563210", "科技-通用             ");//专精特新ETF           市值：0.28      累涨：29.99     6.25      17.47     6.27      10日：4.18      3.37      1.42      0.70      13        累涨修正：40.38     净值区间：93      86      51      76      56      11
        KEJI_GONG_YE.put("159896", "科技-通用             ");//物联网ETF南方         市值：1.61      累涨：31.14     6.43      16.43     8.28      10日：3.16      3.03      1.19      1.82      14        累涨修正：39.71     净值区间：96      93      48      79      50      12
        KEJI_GONG_YE.put("517660", "科技-通用             ");//物联网ETF沪港深       市值：0.46      累涨：31.68     7.93      16.26     7.49      10日：2.89      2.89      1.07      1.27      17        累涨修正：39.6      净值区间：39      40      40      78      52      13
        KEJI_GONG_YE.put("159777", "科技-通用             ");//创科技ETF             市值：0.93      累涨：30.66     5.27      15.31     10.08     10日：3.37      2.77      1.38      1.82      25        累涨修正：39.56     净值区间：96      97      74      92      62      14
        KEJI_GONG_YE.put("159773", "科技-通用             ");//创业板科技ETF         市值：2.03      累涨：29.57     6.40      13.75     9.42      10日：3.55      3.41      1.48      1.60      11        累涨修正：39.49     净值区间：97      97      68      89      58      15
        KEJI_GONG_YE.put("515000", "科技-通用             ");//科技ETF               市值：31.94     累涨：28.73     8.54      13.22     6.97      10日：3.76      3.44      1.67      1.81      9         累涨修正：39.27     净值区间：94      95      88      94      58      16
        KEJI_GONG_YE.put("159709", "科技-通用             ");//物联网ETF工银         市值：0.75      累涨：30.27     6.65      15.13     8.49      10日：3.71      3.13      1.04      1.72      10        累涨修正：39.19     净值区间：100     100     64      88      56      17
        KEJI_GONG_YE.put("159895", "科技-通用             ");//物联网ETF易方达       市值：0.66      累涨：30.37     6.34      16.92     7.11      10日：2.95      2.95      0.98      1.94      23        累涨修正：38.23     净值区间：100     96      48      78      36      18
        KEJI_GONG_YE.put("516330", "科技-通用             ");//物联网ETF             市值：0.14      累涨：30.47     6.14      16.62     7.71      10日：2.97      2.76      0.74      2.11      26        累涨修正：37.68     净值区间：100     88      48      79      49      19
        KEJI_GONG_YE.put("563050", "科技-通用             ");//央企科技50ETF         市值：2.66      累涨：29.95     5.57      13.34     11.04     10日：3.42      2.83      0.70      0.92      21        累涨修正：37.6      净值区间：89      91      51      76      54      20
        KEJI_GONG_YE.put("562380", "科技-通用             ");//央企科技引领ETF       市值：2.22      累涨：29.42     5.29      12.53     11.60     10日：3.80      2.97      0.70      0.81      18        累涨修正：37.59     净值区间：92      94      50      76      55      21
        KEJI_GONG_YE.put("512770", "科技-通用             ");//战略新兴ETF           市值：2.03      累涨：28.48     8.08      12.65     7.75      10日：3.21      2.98      1.41      1.23      16        累涨修正：37.49     净值区间：97      98      65      87      63      22
        KEJI_GONG_YE.put("516260", "科技-通用             ");//物联网50ETF           市值：0.98      累涨：29.60     5.72      16.14     7.74      10日：3.32      2.83      0.86      1.71      20        累涨修正：37.47     净值区间：92      90      46      77      49      23
        KEJI_GONG_YE.put("560170", "科技-通用             ");//央企科技ETF           市值：15.06     累涨：29.38     5.58      12.87     10.93     10日：3.45      2.83      0.73      0.97      22        累涨修正：37.12     净值区间：94      94      51      75      52      24
        KEJI_GONG_YE.put("159206", "科技-通用             ");//卫星ETF               市值：1.21      累涨：                    16.75     11.62     10日：4.68      2.71      0.54      2.44      15        累涨修正：36.84     净值区间：94      95      95      98              25
        KEJI_GONG_YE.put("515750", "科技-通用             ");//科技50ETF             市值：6.48      累涨：27.34     6.57      14.34     6.43      10日：3.26      3.18      1.31      1.60      27        累涨修正：36.4      净值区间：92      93      58      83      51      26
        KEJI_GONG_YE.put("515200", "科技-通用             ");//创新100ETF            市值：1.59      累涨：28.26     6.92      14.38     6.96      10日：2.71      2.52      1.35      0.70      29        累涨修正：36.19     净值区间：100     77      47      68      47      27
        KEJI_GONG_YE.put("515580", "科技-通用             ");//科技100ETF            市值：4.20      累涨：26.68     7.18      12.70     6.80      10日：3.48      3.24      1.36      0.85      19        累涨修正：36.12     净值区间：87      87      68      90      63      28
        KEJI_GONG_YE.put("159778", "科技-通用             ");//工业互联ETF           市值：0.51      累涨：27.42     6.32      14.65     6.45      10日：3.09      3.09      0.86      1.59      50        累涨修正：35.32     净值区间：96      71      50      80      46      29
        KEJI_GONG_YE.put("516800", "科技-通用             ");//智能制造ETF           市值：1.63      累涨：27.79     7.17      15.52     5.10      10日：2.97      2.60      0.83      1.84      30        累涨修正：35.02     净值区间：100     79      35      60      40      30
        KEJI_GONG_YE.put("510770", "科技-通用             ");//G60创新ETF            市值：0.16      累涨：26.33     7.28      13.45     5.60      10日：3.46      2.57                0.54      28        累涨修正：32.36     净值区间：86      61      41      79      60      31
        KEJI_GONG_YE.put("560280", "科技-通用             ");//工程机械ETF           市值：1.31      累涨：27.48     7.08      15.80     4.60      10日：2.61      2.14                0.16      32        累涨修正：32.23     净值区间：28      24      11      50      35      32
        KEJI_GONG_YE.put("159807", "科技-通用             ");//科技ETF               市值：9.75      累涨：22.33     5.34      11.68     5.31      10日：2.27      2.27      1.23      1.22      39        累涨修正：29.33     净值区间：94      94      65      86      52      33
        KEJI_GONG_YE.put("516720", "科技-通用             ");//ESGETF                市值：0.23      累涨：23.22     7.72      8.00      7.50      10日：2.48      1.02      0.57      0.34      31        累涨修正：27.86     净值区间：45      45      45      65      65      34
        KEJI_GONG_YE.put("159653", "科技-通用             ");//ESG300ETF             市值：0.54      累涨：22.78     8.53      6.96      7.29      10日：2.49      0.94      0.73      0.31      33        累涨修正：27.67     净值区间：43      43      24      52      52      35
        KEJI_GONG_YE.put("560810", "科技-通用             ");//央企ESGETF            市值：4.91      累涨：23.23     5.49      12.13     5.61      10日：1.37      0.84      0.63      -0.21     43        累涨修正：26.7      净值区间：70      71      75      46      46      36
        KEJI_GONG_YE.put("159886", "科技-通用             ");//机械ETF               市值：0.56      累涨：20.99     4.19      9.50      7.30      10日：2.98      1.51      0.41      -0.14     34        累涨修正：26.3      净值区间：38      14      12      54      39      37
        KEJI_GONG_YE.put("159621", "科技-通用             ");//MSCIESGETF            市值：0.35      累涨：21.43     6.50      7.94      6.99      10日：2.57      0.82      0.41      0.31      35        累涨修正：25.64     净值区间：100     43      35      74      74      38
        KEJI_GONG_YE.put("560650", "科技-通用             ");//核心50ETF             市值：0.10      累涨：20.70     7.25      10.44     3.01      10日：1.93      1.45      0.48      0.12      37        累涨修正：25.04     净值区间：88      57      64      84      67      39
        KEJI_GONG_YE.put("516960", "科技-通用             ");//机械ETF               市值：0.15      累涨：21.03     4.71      9.35      6.97      10日：2.23      0.85      0.14      0.14      40        累涨修正：24.39     净值区间：33      14      11      54      40      40
        KEJI_GONG_YE.put("561500", "科技-通用             ");//漂亮50ETF             市值：0.55      累涨：19.26     7.24      8.65      3.37      10日：2.15      1.54      0.61      0.15      38        累涨修正：24.17     净值区间：67      69      58      84      66      41
        KEJI_GONG_YE.put("159717", "科技-通用             ");//ESGETF                市值：0.50      累涨：20.37     6.59      7.06      6.72      10日：1.50      1.16      0.46      0.23      36        累涨修正：23.95     净值区间：80      41      11      46      46      42
        KEJI_GONG_YE.put("561130", "科技-通用             ");//国货ETF               市值：1.59      累涨：19.78     7.44      6.57      5.77      10日：1.03      0.78      0.26      0.39      41        累涨修正：22.11     净值区间：73      33      25      75      63      43
        KEJI_GONG_YE.put("510160", "科技-通用             ");//产业升级ETF           市值：2.29      累涨：18.23     4.20      8.12      5.91      10日：1.32      0.72      0.48      -0.36     48        累涨修正：21.23     净值区间：50      24      41      81      78      44
        KEJI_GONG_YE.put("560180", "科技-通用             ");//沪深300ESGETF南方     市值：0.23      累涨：17.89     4.96      7.30      5.63      10日：1.41      1.01      0.40      0.20      45        累涨修正：21.11     净值区间：83      37      37      80      70      45
        KEJI_GONG_YE.put("510090", "科技-通用             ");//ESGETF基金            市值：0.81      累涨：17.02     5.83      5.01      6.18      10日：1.28      1.04      0.80      -0.08     44        累涨修正：20.94     净值区间：36      36      49      68      68      46
        KEJI_GONG_YE.put("561900", "科技-通用             ");//沪深300ESGETF         市值：0.42      累涨：17.52     5.50      6.46      5.56      10日：1.20      0.72      0.36      0.12      50        累涨修正：20.16     净值区间：88      33      38      78      66      47
        KEJI_GONG_YE.put("516830", "科技-通用             ");//300ESGETF             市值：2.06      累涨：16.98     5.30      6.09      5.59      10日：1.43      0.96      0.36      0.36      46        累涨修正：20.09     净值区间：100     41      33      83      74      48
        KEJI_GONG_YE.put("159791", "科技-通用             ");//300ESGETF             市值：0.31      累涨：17.33     5.63      6.19      5.51      10日：1.40      0.65      0.32      0.22      49        累涨修正：20.02     净值区间：82      38      35      71      70      49
        KEJI_GONG_YE.put("515090", "科技-通用             ");//可持续发展ETF         市值：0.07      累涨：17.31     5.41      5.50      6.40      10日：1.43      0.68      0.17      0.25      47        累涨修正：19.76     净值区间：77      24      24      60      60      50
        KEJI_GONG_YE.put("510990", "科技-通用             ");//180ESGETF             市值：0.48      累涨：16.83     5.25      6.13      5.45      10日：1.21      0.77      0.44      0.22      51        累涨修正：19.69     净值区间：100     68      60      88      87      51
        KEJI_GONG_YE.put("588850", "科技-通用             ");//科创机械ETF           市值：0.24      累涨：                              6.22      10日：2.58      2.09      0.50      2.37      42        累涨修正：11.89     净值区间：94      85      44                      52
        KEJI_GONG_YE.put("159218", "科技-通用             ");//卫星产业ETF           市值：0.58      累涨：                                        10日：          2.62      0.60      0.79                累涨修正：          净值区间：81      84                              53
    }

    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件
    public static Map<String, String> TOP_KEJI_RUAN_JIAN = new HashMap<>();

    static {
        TOP_KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：44.30     累涨：48.64     12.74     20.06     15.84     10日：8.62      7.35      1.63      2.72      1         累涨修正：67.87     净值区间：92      92      88      93      65      1
        TOP_KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：14.92     累涨：49.00     9.45      25.57     13.98     10日：7.05      5.50      2.30      3.32      3         累涨修正：66.15     净值区间：94      95      86      95      59      2
    }

    static {
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：44.30     累涨：48.64     12.74     20.06     15.84     10日：8.62      7.35      1.63      2.72      1         累涨修正：67.87     净值区间：92      92      88      93      65      1
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：14.92     累涨：49.00     9.45      25.57     13.98     10日：7.05      5.50      2.30      3.32      3         累涨修正：66.15     净值区间：94      95      86      95      59      2
        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：9.01      累涨：46.53     12.07     19.57     14.89     10日：8.52      7.39      1.49      3.11      2         累涨修正：65.42     净值区间：94      94      88      93      65      3
        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.61      累涨：46.24     11.07     19.91     15.26     10日：7.99      7.36      1.55      2.56      4         累涨修正：64.69     净值区间：90      91      86      83      66      4
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：5.87      累涨：43.99     11.95     22.60     9.44      10日：4.80      3.74      1.42      3.07      10        累涨修正：55.37     净值区间：98      98      54      77      48      5
        KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：2.48      累涨：                    25.28     13.10     10日：6.66      5.25      2.21      3.86      5         累涨修正：54.71     净值区间：98      99      91      97              6
        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：9.41      累涨：32.35     8.17      13.68     10.50     10日：9.49      8.52      2.11      0.69      17        累涨修正：54.58     净值区间：39      41      41      57      31      7
        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.16      累涨：37.77     9.08      18.59     10.10     10日：6.55      5.44      1.58      2.35      6         累涨修正：52.92     净值区间：94      94      67      78      43      8
        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：2.41      累涨：37.39     7.69      19.12     10.58     10日：7.40      5.55      1.17      2.32      11        累涨修正：52.68     净值区间：95      95      68      73      33      9
        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.78      累涨：41.60     10.34     22.96     8.30      10日：4.12      3.75      1.49      3.77      18        累涨修正：52.45     净值区间：98      99      73      89      50      10
        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：35.01     累涨：38.84     9.02      20.11     9.71      10日：5.97      4.31      1.64      2.69      7         累涨修正：52.4      净值区间：92      93      68      80      42      11
        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//云计算50ETF           市值：1.33      累涨：39.47     9.86      20.96     8.65      10日：5.36      4.13      1.51      2.70      14        累涨修正：51.98     净值区间：95      95      64      53      41      12
        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：6.25      累涨：37.97     9.55      18.91     9.51      10日：6.09      4.47      1.60      2.69      8         累涨修正：51.73     净值区间：97      97      65      78      41      13
        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算ETF沪港深       市值：3.20      累涨：40.92     10.31     22.11     8.50      10日：4.31      3.48      1.50      2.97      20        累涨修正：51.71     净值区间：98      98      54      78      48      14
        KEJI_RUAN_JIAN.put("159586", "科技-软件             ");//计算机ETF南方         市值：3.30      累涨：38.58     8.80      20.19     9.59      10日：5.89      4.68      1.11      2.53      9         累涨修正：51.37     净值区间：96      96      70      71      43      15
        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：3.86      累涨：36.75     8.63      18.59     9.53      10日：6.52      5.38      1.36      2.29      12        累涨修正：51.37     净值区间：95      95      68      71      32      16
        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：3.26      累涨：36.78     9.64      18.44     8.70      10日：5.74      4.96      1.41      2.41      16        累涨修正：50.3      净值区间：96      96      68      73      37      17
        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：13.70     累涨：36.41     9.75      17.38     9.28      10日：5.97      5.06      1.40      2.27      13        累涨修正：50.24     净值区间：92      92      65      72      36      18
        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.57      累涨：36.53     10.00     18.21     8.32      10日：5.45      4.64      1.49      2.27      19        累涨修正：49.6      净值区间：95      95      64      67      35      19
        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：15.41     累涨：42.14     8.26      25.51     8.37      10日：2.72      2.41      1.13      1.44      44        累涨修正：49.53     净值区间：96      53      27      66      53      20
        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：16.92     累涨：35.86     8.89      17.83     9.14      10日：6.40      5.07      1.06      2.50      15        累涨修正：49.45     净值区间：60      64      64      69      31      21
        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：33.61     累涨：40.77     11.48     22.33     6.96      10日：3.53      3.02      0.89      2.64      30        累涨修正：49.1      净值区间：96      77      52      74      11      22
        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.56      累涨：37.27     8.88      19.84     8.55      10日：5.19      3.84      1.33      2.92      25        累涨修正：48.96     净值区间：97      97      63      78      42      23
        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：5.43      累涨：37.20     8.84      19.74     8.62      10日：5.27      3.91      1.26      2.84      23        累涨修正：48.9      净值区间：95      96      63      80      42      24
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人50ETF           市值：5.45      累涨：41.16     7.93      24.27     8.96      10日：2.86      2.60      1.08      1.51      42        累涨修正：48.78     净值区间：95      53      27      67      52      25
        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：14.30     累涨：39.13     10.70     22.52     5.91      10日：3.55      3.19      1.31      2.42      36        累涨修正：48.49     净值区间：92      76      51      73      51      26
        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：29.17     累涨：35.54     8.52      18.27     8.75      10日：5.53      4.48      1.43      2.06      24        累涨修正：48.41     净值区间：93      93      51      61      33      27
        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.55      累涨：34.55     8.26      17.56     8.73      10日：5.83      4.85      1.57      1.92      22        累涨修正：48.37     净值区间：90      90      51      63      34      28
        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.24      累涨：35.35     8.07      18.73     8.55      10日：5.80      3.71      1.27      2.17      31        累涨修正：47.4      净值区间：92      93      52      63      30      29
        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.37      累涨：33.94     7.87      17.85     8.22      10日：5.42      4.65      1.66      2.03      34        累涨修正：47.33     净值区间：95      95      53      63      34      30
        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：164.30    累涨：35.22     8.06      18.49     8.67      10日：4.56      4.01      1.66      2.30      33        累涨修正：47.11     净值区间：95      96      74      86      51      31
        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：8.73      累涨：39.68     10.94     22.72     6.02      10日：3.05      2.70      0.81      2.77      38        累涨修正：47.05     净值区间：100     81      55      69      52      32
        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：7.59      累涨：39.20     10.80     22.68     5.72      10日：3.09      2.81      0.97      2.69      41        累涨修正：47.04     净值区间：100     81      54      74      51      33
        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：35.50     累涨：35.43     7.20      19.56     8.67      10日：4.41      3.99      1.57      2.48      35        累涨修正：46.97     净值区间：96      96      70      85      49      34
        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：4.89      累涨：31.47     8.14      15.97     7.36      10日：5.60      4.64      2.61      0.17      39        累涨修正：46.93     净值区间：72      53      48      53      32      35
        KEJI_RUAN_JIAN.put("159998", "科技-软件             ");//计算机ETF             市值：29.78     累涨：33.87     8.71      16.34     8.82      10日：5.89      4.12      1.52      1.84      27        累涨修正：46.92     净值区间：97      98      58      71      35      36
        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：21.17     累涨：35.32     8.81      18.35     8.16      10日：5.38      3.79      1.09      2.40      32        累涨修正：46.67     净值区间：95      95      51      61      30      37
        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.80      累涨：34.83     7.97      16.95     9.91      10日：6.20      3.88      0.72      2.14      26        累涨修正：46.35     净值区间：89      90      65      78      36      38
        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：5.65      累涨：35.38     7.97      19.13     8.28      10日：4.78      3.64      1.24      3.98      1         累涨修正：46.28     净值区间：95      95      86      90      57      39
        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：4.33      累涨：34.69     8.20      18.50     7.99      10日：5.10      3.74      1.24      2.34      40        累涨修正：46.01     净值区间：95      95      50      55      30      40
        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：1.97      累涨：32.17     7.98      16.84     7.35      10日：5.73      4.03      1.87      1.23      43        累涨修正：45.67     净值区间：98      43      43      58      31      41
        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.58      累涨：34.85     8.31      16.91     9.63      10日：5.58      3.86      0.67      2.34      28        累涨修正：45.63     净值区间：96      96      68      78      37      42
        KEJI_RUAN_JIAN.put("513360", "科技-软件             ");//教育ETF               市值：6.03      累涨：36.04     12.04     14.88     9.12      10日：4.23      3.63      0.80      2.20      29        累涨修正：45.5      净值区间：100     74      61      86      48      43
        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：19.83     累涨：34.61     8.33      18.66     7.62      10日：3.92      3.61      1.41      2.54      45        累涨修正：44.96     净值区间：97      97      72      88      49      44
        KEJI_RUAN_JIAN.put("512720", "科技-软件             ");//计算机ETF             市值：11.81     累涨：33.75     9.14      16.25     8.36      10日：5.05      3.76      1.18      2.04      37        累涨修正：44.92     净值区间：95      96      54      65      33      45
        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：53.09     累涨：33.79     7.78      18.60     7.41      10日：3.86      3.51      1.40      2.51      51        累涨修正：43.96     净值区间：96      96      71      86      48      46
        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：54.25     累涨：37.64     9.41      21.25     6.98      10日：2.43      2.09      0.70      1.51      46        累涨修正：43.56     净值区间：89      51      27      70      46      47
        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：5.52      累涨：37.80     9.13      21.90     6.77      10日：2.38      2.14      0.58      1.64      50        累涨修正：43.48     净值区间：92      53      28      69      46      48
        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：130.55    累涨：37.73     9.85      21.13     6.75      10日：2.16      1.92      0.60      1.56      48        累涨修正：43.01     净值区间：89      52      28      70      46      49
        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.52      累涨：36.87     9.33      20.95     6.59      10日：2.23      2.05      0.75      1.49      52        累涨修正：42.65     净值区间：89      52      28      69      46      50
        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.29      累涨：36.44     9.29      20.18     6.97      10日：2.32      2.21      0.78      1.54      49        累涨修正：42.53     净值区间：97      58      31      70      47      51
        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.96      累涨：33.28     10.00     17.13     6.15      10日：3.75      3.48      0.83      2.06      47        累涨修正：42.17     净值区间：100     93      55      75      41      52
        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：3.93      累涨：31.44     7.91      16.91     6.62      10日：4.88      3.16      1.19      2.11      54        累涨修正：41.86     净值区间：100     46      46      66      33      53
        KEJI_RUAN_JIAN.put("560800", "科技-软件             ");//数字经济ETF           市值：7.73      累涨：29.22     7.44      15.08     6.70      10日：4.49      3.82      1.63      1.34      53        累涨修正：40.79     净值区间：96      86      46      55      32      54
        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：16.08     累涨：30.21     6.58      16.40     7.23      10日：4.34      3.34      1.33      2.30      55        累涨修正：40.55     净值区间：96      97      62      78      47      55
        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：2.51      累涨：30.20     9.15      15.57     5.48      10日：3.82      2.89      1.17      1.92      56        累涨修正：39.25     净值区间：98      98      51      71      48      56
        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.32      累涨：30.00     8.28      16.98     4.74      10日：3.31      2.84      1.18      1.94      59        累涨修正：38.51     净值区间：72      72      64      70      48      57
        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.47      累涨：29.25     5.37      17.04     6.84      10日：3.67      3.19      1.19      2.28      58        累涨修正：38.49     净值区间：90      44      40      66      47      58
        KEJI_RUAN_JIAN.put("159658", "科技-软件             ");//数字经济ETF           市值：2.00      累涨：27.60     7.80      13.83     5.97      10日：3.73      3.30      1.21      1.28      61        累涨修正：37.05     净值区间：94      88      45      56      32      59
        KEJI_RUAN_JIAN.put("589520", "科技-软件             ");//科创人工智能ETF华宝   市值：2.44      累涨：                    22.91     5.21      10日：2.48      2.36      0.71      2.57      57        累涨修正：34.38     净值区间：97      79      53      75              60
        KEJI_RUAN_JIAN.put("560630", "科技-软件             ");//机器人产业ETF         市值：4.94      累涨：                    20.54     6.19      10日：2.20      1.87      0.55      1.65      60        累涨修正：31.9      净值区间：96      53      27      70              61
        KEJI_RUAN_JIAN.put("159388", "科技-软件             ");//创业板人工智能ETF国泰 市值：2.00      累涨：                              13.40     10日：7.29      5.67      2.34      3.33      21        累涨修正：31.04     净值区间：96      96      88      96              62
        KEJI_RUAN_JIAN.put("588770", "科技-软件             ");//科创信息技术ETF摩根   市值：3.31      累涨：                    15.25     5.00      10日：3.24      2.81      1.07      1.93      62        累涨修正：28.44     净值区间：97      97      48      71              63
        KEJI_RUAN_JIAN.put("589010", "科技-软件             ");//科创人工智能ETF华夏   市值：1.00      累涨：                              5.75      10日：2.92      2.82      1.01      2.60      63        累涨修正：13.51     净值区间：95      78      50                      64
        KEJI_RUAN_JIAN.put("159213", "科技-软件             ");//机器人ETF基金         市值：0.63      累涨：                              6.84      10日：2.07      1.88      0.50      1.19      64        累涨修正：11.79     净值区间：81      42      21                      65
        KEJI_RUAN_JIAN.put("159385", "科技-软件             ");//数字经济ETF富国       市值：4.41      累涨：                                        10日：                    0.50      1.29                累涨修正：          净值区间：                                        66
        KEJI_RUAN_JIAN.put("159389", "科技-软件             ");//数字经济ETF基金       市值：3.66      累涨：                                        10日：                    0.70      1.19                累涨修正：          净值区间：                                        67
        KEJI_RUAN_JIAN.put("561220", "科技-软件             ");//数字经济ETF工银       市值：8.39      累涨：                                        10日：                              1.29                累涨修正：          净值区间：                                        68
        KEJI_RUAN_JIAN.put("159382", "科技-软件             ");//创业板人工智能ETF南方 市值：0.59      累涨：                                        10日：6.99      5.54      2.45      3.19                累涨修正：          净值区间：92      94                              69
    }

    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片
    public static Map<String, String> TOP_KEJI_XIN_PIAN = new HashMap<>();

    static {
        TOP_KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：4.97      累涨：37.05     8.63      17.54     10.88     10日：6.35      5.07      2.93      2.86      1         累涨修正：54.33     净值区间：95      95      95      98      92      1
        TOP_KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：2.56      累涨：40.30     11.43     22.83     6.04      10日：4.14      3.46      1.28      2.81      2         累涨修正：50.46     净值区间：98      98      60      70      60      2
    }

    static {
        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：4.97      累涨：37.05     8.63      17.54     10.88     10日：6.35      5.07      2.93      2.86      1         累涨修正：54.33     净值区间：95      95      95      98      92      1
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：2.56      累涨：40.30     11.43     22.83     6.04      10日：4.14      3.46      1.28      2.81      2         累涨修正：50.46     净值区间：98      98      60      70      60      2
        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：17.62     累涨：35.09     6.46      18.83     9.80      10日：4.39      3.99      1.73      2.62      3         累涨修正：46.93     净值区间：95      95      50      76      52      3
        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：4.00      累涨：33.72     7.86      18.16     7.70      10日：4.26      3.64      1.72      2.72      4         累涨修正：45.06     净值区间：98      98      76      78      57      4
        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.84      累涨：31.98     6.03      17.79     8.16      10日：4.10      3.97      1.85      2.33      7         累涨修正：43.75     净值区间：95      95      47      73      47      5
        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.74      累涨：33.69     10.19     16.87     6.63      10日：4.68      3.31      1.00      1.00      5         累涨修正：43.68     净值区间：97      85      41      62      46      6
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.61      累涨：33.32     7.55      20.13     5.64      10日：3.92      3.28      1.41      2.22      12        累涨修正：43.34     净值区间：97      92      49      65      48      7
        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：14.97     累涨：33.21     8.04      19.53     5.64      10日：3.77      3.26      1.42      2.40      16        累涨修正：43.08     净值区间：90      90      57      72      55      8
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.40      累涨：33.30     7.58      19.94     5.78      10日：3.89      3.34      1.27      2.12      8         累涨修正：43.07     净值区间：96      84      45      62      47      9
        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：262.35    累涨：33.30     9.57      18.02     5.71      10日：3.87      3.26      1.28      2.21      15        累涨修正：42.99     净值区间：98      98      52      68      53      10
        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：4.18      累涨：31.37     5.31      18.06     8.00      10日：3.83      3.83      1.98      2.30      13        累涨修正：42.99     净值区间：95      95      48      74      48      11
        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：22.55     累涨：32.18     10.84     14.46     6.88      10日：4.73      3.63      1.20      0.89      6         累涨修正：42.94     净值区间：93      82      40      56      40      12
        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.92      累涨：31.42     5.28      18.24     7.90      10日：3.90      3.90      1.82      2.55      9         累涨修正：42.86     净值区间：100     100     46      73      49      13
        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：23.87     累涨：32.74     9.73      17.76     5.25      10日：3.83      3.28      1.32      2.06      18        累涨修正：42.49     净值区间：98      98      51      69      53      14
        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.58      累涨：30.66     5.04      17.59     8.03      10日：3.82      3.82      1.77      2.14      17        累涨修正：41.84     净值区间：94      94      46      75      48      15
        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.91      累涨：31.91     8.75      18.18     4.98      10日：3.86      3.20      1.35      2.58      19        累涨修正：41.67     净值区间：100     100     83      78      62      16
        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.12      累涨：31.14     5.54      17.91     7.69      10日：3.65      3.65      1.40      2.90      20        累涨修正：41.24     净值区间：97      97      47      73      48      17
        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：226.73    累涨：31.29     7.48      17.66     6.15      10日：4.22      3.32      1.20      1.88      11        累涨修正：41.23     净值区间：95      88      46      61      45      18
        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：12.33     累涨：30.67     6.77      15.94     7.96      10日：4.55      3.70      1.13      2.33      14        累涨修正：41.18     净值区间：96      96      66      83      50      19
        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：5.56      累涨：31.62     9.42      16.92     5.28      10日：3.75      3.09      1.27      2.44      26        累涨修正：41        净值区间：97      97      58      72      56      20
        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.27      累涨：30.95     9.75      15.40     5.80      10日：4.31      3.45      1.14      0.66      10        累涨修正：40.99     净值区间：90      77      37      56      39      21
        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.47      累涨：32.34     9.25      18.18     4.91      10日：3.32      3.03      1.07      2.21      27        累涨修正：40.83     净值区间：100     98      48      61      45      22
        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：4.10      累涨：29.94     6.73      13.28     9.93      10日：3.89      3.57      1.45      2.40      21        累涨修正：40.3      净值区间：100     100     69      86      52      23
        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.23     累涨：30.38     7.38      17.28     5.72      10日：3.94      3.21      1.35      1.58      22        累涨修正：40.23     净值区间：94      88      44      61      44      24
        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.48      累涨：30.86     8.67      17.23     4.96      10日：3.52      3.13      1.23      2.18      29        累涨修正：39.97     净值区间：98      98      52      69      52      25
        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.45      累涨：30.95     10.44     15.08     5.43      10日：3.88      3.00      1.05      1.36      25        累涨修正：39.93     净值区间：95      89      39      52      37      26
        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：241.31    累涨：30.40     7.50      17.04     5.86      10日：3.99      3.07      1.19      1.51      23        累涨修正：39.84     净值区间：97      75      38      55      39      27
        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：11.81     累涨：30.62     7.46      18.00     5.16      10日：3.45      3.04      1.10      1.50      30        累涨修正：39.31     净值区间：89      75      39      57      41      28
        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：49.26     累涨：30.01     7.52      17.14     5.35      10日：3.45      3.19      1.19      1.44      31        累涨修正：39.03     净值区间：96      76      39      54      38      29
        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：4.56      累涨：29.20     6.44      14.83     7.93      10日：4.20      3.13      1.20      2.14      24        累涨修正：38.93     净值区间：97      97      51      73      44      30
        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：109.02    累涨：29.95     7.13      17.19     5.63      10日：3.53      3.08      1.08      1.79      34        累涨修正：38.72     净值区间：97      85      44      59      43      31
        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：1.47      累涨：29.31     7.21      15.19     6.91      10日：3.65      3.13      1.30      2.05      28        累涨修正：38.69     净值区间：100     100     52      75      43      32
        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.99      累涨：30.98     10.41     14.84     5.73      10日：3.50      2.65      0.68      1.01      32        累涨修正：38.49     净值区间：100     82      41      59      40      33
        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.21      累涨：29.45     6.58      17.14     5.73      10日：3.61      3.00      1.14      2.00      35        累涨修正：38.34     净值区间：100     90      43      59      43      34
        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.62      累涨：29.97     9.71      15.29     4.97      10日：3.79      2.85      0.86      0.77      33        累涨修正：38.33     净值区间：91      79      38      56      40      35
        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.72      累涨：29.27     6.96      17.47     4.84      10日：3.34      3.06      1.20      1.62      37        累涨修正：38.07     净值区间：96      81      41      62      47      36
        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.93      累涨：29.82     9.63      15.28     4.91      10日：3.43      2.71      1.02      1.16      36        累涨修正：38        净值区间：95      84      37      51      36      37
        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：4.87      累涨：29.59     7.27      17.32     5.00      10日：2.96      2.54      0.98      1.68      38        累涨修正：37.05     净值区间：92      80      40      57      41      38
        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.38     累涨：28.85     7.56      16.57     4.72      10日：3.08      2.91      1.02      1.35      39        累涨修正：36.88     净值区间：95      73      38      53      37      39
        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片ETF天弘           市值：9.60      累涨：29.24     7.14      17.23     4.87      10日：2.97      2.48      1.06      2.11      40        累涨修正：36.81     净值区间：98      89      42      60      42      40
        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.53      累涨：28.86     7.87      16.29     4.70      10日：3.04      2.22      0.57      1.63      41        累涨修正：35.26     净值区间：97      79      37      57      41      41
        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：1.81      累涨：25.66     6.32      13.28     6.06      10日：2.53      2.53      0.96      1.67      42        累涨修正：32.64     净值区间：92      79      47      63      52      42
        KEJI_XIN_PIAN.put("588170", "科技-芯片             ");//科创半导体ETF         市值：2.58      累涨：                              7.39      10日：5.03      4.09      2.09      1.14      19        累涨修正：20.69     净值区间：97      97      48                      43
        KEJI_XIN_PIAN.put("589100", "科技-芯片             ");//科创芯片ETF国泰       市值：1.24      累涨：                              4.80      10日：3.37      3.06      1.26      2.19      43        累涨修正：13.75     净值区间：100     100     53      72              44
        KEJI_XIN_PIAN.put("588710", "科技-芯片             ");//科创半导体设备ETF     市值：3.69      累涨：                                        10日：                              1.30                累涨修正：          净值区间：                                        45
    }

    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();
    public static Map<String, String> TOP_KEJI_TONG_XIN = new HashMap<>();

    static {
        TOP_KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：27.23     累涨：44.92     8.29      21.45     15.18     10日：6.91      6.08      2.11      3.18      1         累涨修正：62.13     净值区间：95      96      96      99      79      1
    }

    static {
        KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：27.23     累涨：44.92     8.29      21.45     15.18     10日：6.91      6.08      2.11      3.18      1         累涨修正：62.13     净值区间：95      96      96      99      79      1
        KEJI_TONG_XIN.put("515050", "科技-通信             ");//5G通信ETF             市值：64.83     累涨：41.88     7.74      20.53     13.61     10日：6.44      5.85      2.26      3.08      3         累涨修正：58.69     净值区间：96      96      85      94      62      2
        KEJI_TONG_XIN.put("159994", "科技-通信             ");//5GETF                 市值：15.29     累涨：42.21     8.19      21.15     12.87     10日：6.03      5.55      2.16      3.40      2         累涨修正：58.11     净值区间：98      98      86      95      62      3
        KEJI_TONG_XIN.put("159583", "科技-通信             ");//通信设备ETF           市值：0.65      累涨：39.69     8.09      17.66     13.94     10日：5.94      5.19      2.30      2.34      4         累涨修正：55.42     净值区间：100     100     80      92      73      4
        KEJI_TONG_XIN.put("159811", "科技-通信             ");//5G50ETF               市值：1.09      累涨：38.09     9.44      17.82     10.83     10日：5.01      4.58      1.98      3.13      5         累涨修正：51.64     净值区间：97      97      85      94      62      5
        KEJI_TONG_XIN.put("159695", "科技-通信             ");//通信ETF               市值：1.04      累涨：34.63     7.64      15.37     11.62     10日：4.81      3.93      1.56      2.05      6         累涨修正：46.49     净值区间：94      96      96      99      77      6
        KEJI_TONG_XIN.put("159507", "科技-通信             ");//电信ETF               市值：0.45      累涨：34.45     8.02      15.25     11.18     10日：4.60      3.73      1.71      2.15      7         累涨修正：46.2      净值区间：96      97      97      99      75      7
        KEJI_TONG_XIN.put("159511", "科技-通信             ");//通信ETF南方           市值：0.83      累涨：29.27     8.70      12.77     7.80      10日：3.82      2.93      1.36      1.72      8         累涨修正：38.74     净值区间：96      96      96      99      69      8
        KEJI_TONG_XIN.put("560300", "科技-通信             ");//电信50ETF             市值：0.73      累涨：23.94     5.34      10.41     8.19      10日：3.74      2.76      0.89      1.84      9         累涨修正：32.22     净值区间：98      98      98      99      62      9
        KEJI_TONG_XIN.put("560690", "科技-通信             ");//电信ETF基金           市值：0.26      累涨：24.10     6.74      9.42      7.94      10日：3.52      2.73      0.93      1.61      10        累涨修正：32.21     净值区间：96      97      97      99      63      10
        KEJI_TONG_XIN.put("563010", "科技-通信             ");//电信ETF               市值：1.48      累涨：24.63     7.02      10.01     7.60      10日：2.57      2.01      0.64      1.74      11        累涨修正：30.49     净值区间：96      96      94      98      63      11
    }

    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源
    public static Map<String, String> TOP_KEJI_NEW_ENERGY = new HashMap<>();

    static {
        TOP_KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：20.61     累涨：25.85     8.30      8.53      9.02      10日：2.76      2.40      1.11      0.55      6         累涨修正：33.23     净值区间：92      41      20      49      30      6
    }

    static {
        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.30      累涨：33.78     9.35      14.77     9.66      10日：3.15      3.15      1.57      0.33      1         累涨修正：43.22     净值区间：100     48      22      60      39      1
        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.68      累涨：33.56     9.67      14.37     9.52      10日：2.82      2.72      1.31      0.40      2         累涨修正：41.72     净值区间：92      49      22      60      38      2
        KEJI_NEW_ENERGY.put("560960", "科技-新能源           ");//碳中和60指数ETF       市值：0.12      累涨：26.77     11.19     6.85      8.73      10日：7.73      1.21      1.21      0.00      10        累涨修正：38.13     净值区间：100     91      48      44      44      3
        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.79      累涨：26.28     6.38      11.51     8.39      10日：3.56      3.45      1.51      1.49      4         累涨修正：36.31     净值区间：94      95      85      95      74      4
        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.35      累涨：26.62     6.27      11.74     8.61      10日：3.45      3.45      1.29      1.70      3         累涨修正：36.1      净值区间：97      97      83      95      72      5
        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：20.61     累涨：25.85     8.30      8.53      9.02      10日：2.76      2.40      1.11      0.55      6         累涨修正：33.23     净值区间：92      41      20      49      30      6
        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：90.52     累涨：26.47     9.32      8.64      8.51      10日：2.18      2.03      1.10      0.62      11        累涨修正：32.88     净值区间：100     44      21      48      29      7
        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.64      累涨：26.71     8.32      8.85      9.54      10日：2.16      1.97      0.99      0.59      8         累涨修正：32.82     净值区间：90      38      17      45      29      8
        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.59      累涨：26.55     7.85      9.49      9.21      10日：2.63      1.89      0.76      0.75      5         累涨修正：32.59     净值区间：92      44      20      48      29      9
        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.67      累涨：25.49     7.90      8.91      8.68      10日：2.69      2.16      1.08      0.27      7         累涨修正：32.5      净值区间：78      37      18      47      28      10
        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.48      累涨：27.12     10.02     9.23      7.87      10日：2.09      1.86      0.70      0.92      14        累涨修正：32.47     净值区间：100     42      22      48      31      11
        KEJI_NEW_ENERGY.put("159368", "科技-新能源           ");//创业板新能源ETF华夏   市值：1.22      累涨：                    16.37     8.42      10日：3.12      2.04      1.02      0.56      9         累涨修正：31.99     净值区间：86      38      26      69              12
        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：7.58      累涨：24.94     7.70      8.55      8.69      10日：2.41      1.86      1.12      0.55      15        累涨修正：31.45     净值区间：92      42      20      49      30      13
        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：0.90      累涨：23.46     6.67      7.62      9.17      10日：3.06      2.14      1.19      -0.24     12        累涨修正：31.04     净值区间：86      29      22      66      42      14
        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：3.52      累涨：25.39     7.97      7.78      9.64      10日：1.93      1.69      0.97      0.24      18        累涨修正：30.95     净值区间：89      38      19      47      29      15
        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：8.86      累涨：23.04     6.04      7.85      9.15      10日：3.06      2.14      1.19      0.00      13        累涨修正：30.62     净值区间：100     33      25      67      44      16
        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.36      累涨：24.84     8.31      8.97      7.56      10日：2.34      1.65      0.71      0.47      16        累涨修正：30.25     净值区间：89      38      18      46      28      17
        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：2.88      累涨：23.10     5.92      9.04      8.14      10日：2.94      1.61      1.15      0.00      17        累涨修正：29.95     净值区间：75      25      22      68      47      18
        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.31      累涨：25.70     7.57      9.37      8.76      10日：1.79      0.97      0.69      0.69      19        累涨修正：29.84     净值区间：100     43      20      50      31      19
        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：2.60      累涨：23.73     7.83      7.82      8.08      10日：1.76      1.76      1.01      0.50      22        累涨修正：29.27     净值区间：100     42      20      49      29      20
        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.14      累涨：23.55     5.56      9.39      8.60      10日：2.66      1.15      0.86      -0.28     11        累涨修正：29.08     净值区间：57      17      16      59      49      21
        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.11      累涨：22.41     5.59      8.45      8.37      10日：2.75      1.70      0.93      0.31      21        累涨修正：28.72     净值区间：91      24      24      66      43      22
        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：6.50      累涨：22.10     5.77      7.47      8.86      10日：2.86      1.74      0.87      0.29      20        累涨修正：28.44     净值区间：100     35      26      67      45      23
        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：2.00      累涨：23.07     5.88      9.29      7.90      10日：2.09      1.18      0.95      0.23      25        累涨修正：28.24     净值区间：88      32      27      69      48      24
        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：43.74     累涨：21.87     5.50      7.95      8.42      10日：2.66      1.68      1.01      0.22      23        累涨修正：28.23     净值区间：94      34      26      67      44      25
        KEJI_NEW_ENERGY.put("159625", "科技-新能源           ");//绿色电力ETF           市值：3.40      累涨：24.31     6.65      11.94     5.72      10日：1.75      0.35      0.26      -0.35     27        累涨修正：26.93     净值区间：22      14      23      69      69      26
        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.58      累涨：22.59     6.30      10.60     5.69      10日：2.02      1.54      0.29      1.34      24        累涨修正：26.73     净值区间：96      65      51      74      38      27
        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：2.64      累涨：20.73     5.31      8.82      6.60      10日：2.78      1.28      0.90      -0.38     26        累涨修正：26.59     净值区间：54      18      18      67      55      28
        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.63      累涨：21.41     5.43      7.74      8.24      10日：2.78      0.76      0.38      -0.19     30        累涨修正：25.71     净值区间：38      11      11      63      45      29
        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：10.47     累涨：20.98     4.89      9.43      6.66      10日：2.39      0.95      0.68      -0.13     31        累涨修正：25.68     净值区间：58      19      18      67      55      30
        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.84      累涨：21.63     5.23      10.05     6.35      10日：2.11      0.81      0.54      0.00      34        累涨修正：25.63     净值区间：50      17      16      67      54      31
        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：6.76      累涨：20.90     4.64      9.87      6.39      10日：2.39      0.95      0.68      0.00      29        累涨修正：25.6      净值区间：60      17      17      68      55      32
        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：1.82      累涨：21.38     5.22      9.69      6.47      10日：2.28      0.82      0.55      -0.14     33        累涨修正：25.58     净值区间：45      14      14      66      56      33
        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.16      累涨：21.03     4.96      9.31      6.76      10日：2.42      0.82      0.55      -0.14     32        累涨修正：25.37     净值区间：28      14      14      66      54      34
        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.09      累涨：20.41     5.54      8.37      6.50      10日：2.51      0.94      0.67      -0.27     35        累涨修正：25.2      净值区间：50      14      14      71      61      35
        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：6.31      累涨：20.23     5.15      8.97      6.11      10日：2.38      0.94      0.81      -0.13     39        累涨修正：25.17     净值区间：38      17      16      66      55      36
        KEJI_NEW_ENERGY.put("562960", "科技-新能源           ");//绿色电力ETF易方达     市值：0.85      累涨：23.31     7.74      10.57     5.00      10日：1.41      0.38                0.00      28        累涨修正：25.1      净值区间：14      13      10      68      68      37
        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：11.59     累涨：21.32     5.71      8.37      7.24      10日：1.96      0.88      0.33      0.22      38        累涨修正：24.82     净值区间：64      22      20      67      47      38
        KEJI_NEW_ENERGY.put("560580", "科技-新能源           ");//电力ETF南方           市值：0.54      累涨：23.22     7.77      10.67     4.78      10日：1.26      0.19                -0.10     36        累涨修正：24.67     净值区间：20      14      14      75      75      39
        KEJI_NEW_ENERGY.put("561170", "科技-新能源           ");//绿色电力ETF           市值：1.20      累涨：23.43     7.81      10.94     4.68      10日：0.94      0.19                -0.09     37        累涨修正：24.56     净值区间：26      19      17      67      67      40
        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：1.10      累涨：22.80     7.03      10.24     5.53      10日：1.71                          -0.19     41        累涨修正：24.51     净值区间：4       4       10      40      40      41
        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.54      累涨：23.38     8.41      10.36     4.61      10日：0.75      0.09                -0.19     40        累涨修正：24.22     净值区间：17      13      13      65      65      42
        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：19.33     累涨：21.30     5.64      7.97      7.69      10日：1.81      0.37      0.19      -0.18     45        累涨修正：23.86     净值区间：33      11      16      61      49      43
        KEJI_NEW_ENERGY.put("561700", "科技-新能源           ");//电力ETF基金           市值：1.57      累涨：22.40     7.08      11.31     4.01      10日：1.07      0.10                -0.29     44        累涨修正：23.57     净值区间：22      17      16      71      71      44
        KEJI_NEW_ENERGY.put("561560", "科技-新能源           ");//电力ETF               市值：6.23      累涨：21.94     7.14      10.18     4.62      10日：1.28      0.34                -0.17     42        累涨修正：23.56     净值区间：17      13      16      71      71      45
        KEJI_NEW_ENERGY.put("159611", "科技-新能源           ");//电力ETF               市值：34.76     累涨：22.00     7.67      10.01     4.32      10日：1.23      0.31                -0.10     43        累涨修正：23.54     净值区间：20      15      17      72      72      46
        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.45      累涨：20.13     4.90      8.07      7.16      10日：1.60      0.70      0.47      -0.23     48        累涨修正：23.37     净值区间：38      14      16      63      53      47
        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.54      累涨：20.33     5.91      7.55      6.87      10日：1.52      0.77      0.26      -0.13     46        累涨修正：23.14     净值区间：53      22      18      60      41      48
        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.44      累涨：19.68     4.78      7.47      7.43      10日：1.40      0.36      0.18      0.00      50        累涨修正：21.8      净值区间：44      15      16      63      52      49
        KEJI_NEW_ENERGY.put("562350", "科技-新能源           ");//电力指数ETF           市值：0.52      累涨：20.85     6.95      9.80      4.10      10日：0.78      0.10                -0.20     47        累涨修正：21.73     净值区间：20      15      19      72      72      50
        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.58      累涨：18.21     4.49      6.26      7.46      10日：1.47      0.38      0.38      0.00      49        累涨修正：20.82     净值区间：43      14      14      63      46      51
    }

    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车
    public static Map<String, String> TOP_KEJI_NEW_CAR = new HashMap<>();

    static {
        TOP_KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：1.87      累涨：55.90     15.95     22.82     17.13     10日：6.36      4.01      2.70      0.00      1         累涨修正：71.67     净值区间：74      35      48      76      74      1
    }

    static {
        KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：1.87      累涨：55.90     15.95     22.82     17.13     10日：6.36      4.01      2.70      0.00      1         累涨修正：71.67     净值区间：74      35      48      76      74      1
        KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：6.20      累涨：55.11     14.19     23.15     17.77     10日：6.18      3.82      2.63      -0.08     2         累涨修正：70.37     净值区间：75      32      44      76      74      2
        KEJI_NEW_CAR.put("159889", "科技-汽车             ");//智能汽车ETF           市值：0.51      累涨：35.88     6.70      19.51     9.67      10日：4.00      4.00      0.89      1.32      7         累涨修正：45.66     净值区间：72      64      45      78      49      3
        KEJI_NEW_CAR.put("515250", "科技-汽车             ");//智能汽车ETF           市值：6.87      累涨：35.50     7.21      18.60     9.69      10日：4.16      4.16      0.85      1.69      3         累涨修正：45.52     净值区间：78      66      51      81      50      4
        KEJI_NEW_CAR.put("159795", "科技-汽车             ");//智能汽车ETF基金       市值：0.41      累涨：34.82     6.68      18.69     9.45      10日：4.39      4.39      0.79      1.45      4         累涨修正：45.18     净值区间：69      61      48      70      47      5
        KEJI_NEW_CAR.put("159755", "科技-汽车             ");//电池ETF               市值：27.36     累涨：33.05     6.37      13.98     12.70     10日：4.87      2.71      1.96      0.00      8         累涨修正：44.55     净值区间：89      29      28      70      57      6
        KEJI_NEW_CAR.put("516520", "科技-汽车             ");//智能驾驶ETF           市值：3.56      累涨：35.07     7.40      18.72     8.95      10日：3.86      3.86      0.58      1.44      6         累涨修正：43.95     净值区间：64      58      46      80      50      7
        KEJI_NEW_CAR.put("159775", "科技-汽车             ");//新能源车电池ETF       市值：0.55      累涨：31.87     6.62      13.26     11.99     10日：5.10      2.69      1.98      -0.18     9         累涨修正：43.62     净值区间：69      23      27      70      58      8
        KEJI_NEW_CAR.put("159888", "科技-汽车             ");//智能车ETF             市值：0.84      累涨：34.33     6.73      18.51     9.09      10日：3.74      3.74      0.77      1.43      17        累涨修正：43.35     净值区间：71      59      47      81      48      9
        KEJI_NEW_CAR.put("159767", "科技-汽车             ");//电池龙头ETF           市值：1.14      累涨：32.51     5.61      14.20     12.70     10日：4.53      2.41      1.86      0.00      16        累涨修正：43.17     净值区间：86      23      26      66      56      10
        KEJI_NEW_CAR.put("159565", "科技-汽车             ");//汽车零部件ETF         市值：0.85      累涨：36.87     7.35      21.28     8.24      10日：2.78      2.46      0.33      0.74      22        累涨修正：42.77     净值区间：44      32      25      80      61      11
        KEJI_NEW_CAR.put("562700", "科技-汽车             ");//汽车零部件ETF         市值：0.42      累涨：35.83     6.84      20.52     8.47      10日：2.93      2.93      0.36      0.89      19        累涨修正：42.41     净值区间：45      35      24      77      63      12
        KEJI_NEW_CAR.put("159757", "科技-汽车             ");//电池30ETF             市值：3.05      累涨：31.55     5.55      14.41     11.59     10日：4.46      2.37      1.83      -0.18     18        累涨修正：42.04     净值区间：79      24      23      69      57      13
        KEJI_NEW_CAR.put("159840", "科技-汽车             ");//锂电池ETF             市值：8.56      累涨：31.62     5.88      14.30     11.44     10日：4.42      2.45      1.70      0.19      11        累涨修正：41.89     净值区间：92      27      26      70      58      14
        KEJI_NEW_CAR.put("159872", "科技-汽车             ");//智能网联汽车ETF       市值：0.49      累涨：32.62     6.75      15.40     10.47     10日：4.02      3.59      0.67      0.89      5         累涨修正：41.57     净值区间：54      44      44      86      55      15
        KEJI_NEW_CAR.put("159566", "科技-汽车             ");//储能电池ETF           市值：1.10      累涨：32.61     7.46      15.20     9.95      10日：3.49      2.41      1.53      1.03      14        累涨修正：41.57     净值区间：94      49      35      77      53      16
        KEJI_NEW_CAR.put("159306", "科技-汽车             ");//汽车零件ETF           市值：0.23      累涨：35.36     7.02      20.01     8.33      10日：2.79      2.43      0.36      0.99      26        累涨修正：41.3      净值区间：49      37      33      85      63      17
        KEJI_NEW_CAR.put("562260", "科技-汽车             ");//汽车配件ETF           市值：0.12      累涨：34.89     6.78      20.04     8.07      10日：2.61      2.52      0.45      1.08      27        累涨修正：40.92     净值区间：67      48      48      85      61      18
        KEJI_NEW_CAR.put("159512", "科技-汽车             ");//汽车ETF               市值：0.65      累涨：34.32     9.21      15.43     9.68      10日：4.92      1.22                0.00      10        累涨修正：40.46     净值区间：25      10      10      55      55      19
        KEJI_NEW_CAR.put("516660", "科技-汽车             ");//新能源车ETF基金       市值：3.06      累涨：30.30     5.75      14.36     10.19     10日：4.25      2.57      1.63      0.13      13        累涨修正：40.38     净值区间：78      27      26      71      52      20
        KEJI_NEW_CAR.put("159796", "科技-汽车             ");//电池50ETF             市值：9.50      累涨：30.36     6.08      14.20     10.08     10日：4.34      2.57      1.47      0.18      15        累涨修正：40.21     净值区间：85      31      24      70      51      21
        KEJI_NEW_CAR.put("159305", "科技-汽车             ");//储能电池50ETF         市值：0.42      累涨：31.34     6.93      14.93     9.48      10日：3.39      2.35      1.54      0.98      29        累涨修正：40.16     净值区间：97      48      34      75      51      22
        KEJI_NEW_CAR.put("516380", "科技-汽车             ");//智能电动车ETF         市值：0.93      累涨：31.36     7.02      14.37     9.97      10日：3.56      2.67      1.07      0.80      12        累涨修正：39.73     净值区间：90      32      64      71      54      23
        KEJI_NEW_CAR.put("515030", "科技-汽车             ");//新能源车ETF           市值：41.85     累涨：30.11     5.87      14.22     10.02     10日：4.17      2.33      1.50      0.25      28        累涨修正：39.61     净值区间：79      29      28      70      51      24
        KEJI_NEW_CAR.put("516390", "科技-汽车             ");//新能源汽车ETF         市值：3.19      累涨：29.63     5.57      14.27     9.79      10日：4.38      2.46      1.54      0.30      25        累涨修正：39.55     净值区间：88      30      28      71      53      25
        KEJI_NEW_CAR.put("159720", "科技-汽车             ");//智能车ETF泰康         市值：0.53      累涨：31.05     7.02      14.34     9.69      10日：3.76      2.39      1.12      0.32      24        累涨修正：39.44     净值区间：73      23      23      72      52      26
        KEJI_NEW_CAR.put("561160", "科技-汽车             ");//锂电池ETF             市值：5.84      累涨：30.09     5.42      14.48     10.19     10日：4.26      2.38      1.30      0.43      23        累涨修正：39.33     净值区间：92      38      30      72      51      27
        KEJI_NEW_CAR.put("515700", "科技-汽车             ");//新能车ETF             市值：22.19     累涨：29.72     5.67      14.15     9.90      10日：4.19      2.32      1.45      0.12      30        累涨修正：39.13     净值区间：74      27      26      70      52      28
        KEJI_NEW_CAR.put("516110", "科技-汽车             ");//汽车ETF               市值：3.94      累涨：33.63     8.46      15.92     9.25      10日：4.16      1.24                0.70      21        累涨修正：39.03     净值区间：42      17      17      61      61      29
        KEJI_NEW_CAR.put("561910", "科技-汽车             ");//电池ETF               市值：5.76      累涨：28.91     5.62      13.11     10.18     10日：4.68      2.60      1.30      0.21      20        累涨修正：38.79     净值区间：82      30      25      71      51      30
        KEJI_NEW_CAR.put("159637", "科技-汽车             ");//新能源车龙头ETF       市值：7.99      累涨：28.90     5.18      14.01     9.71      10日：4.13      2.19      1.35      0.17      32        累涨修正：37.92     净值区间：81      30      28      70      52      31
        KEJI_NEW_CAR.put("516590", "科技-汽车             ");//智能汽车ETF易方达     市值：0.90      累涨：30.66     6.56      14.48     9.62      10日：3.15      2.13      0.85      0.74      31        累涨修正：37.64     净值区间：85      31      31      70      54      32
        KEJI_NEW_CAR.put("159824", "科技-汽车             ");//新能车ETF             市值：1.60      累涨：28.80     5.56      14.01     9.23      10日：3.78      2.11      1.37      0.25      34        累涨修正：37.43     净值区间：67      28      26      70      54      33
        KEJI_NEW_CAR.put("562880", "科技-汽车             ");//电池ETF基金           市值：3.25      累涨：29.29     5.26      13.89     10.14     10日：3.73      2.11      1.06      0.84      33        累涨修正：37.25     净值区间：100     39      29      73      55      34
        KEJI_NEW_CAR.put("159806", "科技-汽车             ");//新能源车ETF           市值：9.73      累涨：29.02     5.54      13.94     9.54      10日：3.75      2.10      1.15      0.19      35        累涨修正：37.17     净值区间：73      28      27      70      52      35
        KEJI_NEW_CAR.put("560000", "科技-汽车             ");//智慧电车ETF           市值：0.11      累涨：29.31     6.48      13.95     8.88      10日：3.31      1.69      0.46      0.46      36        累涨修正：35.23     净值区间：80      31      17      49      48      36
        KEJI_NEW_CAR.put("159210", "科技-汽车             ");//港股汽车ETF           市值：2.28      累涨：                                        10日：                              0.10                累涨修正：          净值区间：                                        37
        KEJI_NEW_CAR.put("159239", "科技-汽车             ");//恒生汽车ETF           市值：1.95      累涨：                                        10日：          2.77      2.16      0.10                累涨修正：          净值区间：74                                      38
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_TONG_XIN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_NEW_CAR);
    }

    public static Map<String, String> TOP_KEJI = new HashMap<>();

    static {
        TOP_KEJI.putAll(TOP_KEJI_HK);
        TOP_KEJI.putAll(TOP_KEJI_XIN_PIAN);
        TOP_KEJI.putAll(TOP_KEJI_TONG_XIN);
        TOP_KEJI.putAll(TOP_KEJI_RUAN_JIAN);
        TOP_KEJI.putAll(TOP_KEJI_GONG_YE);
        TOP_KEJI.putAll(TOP_KEJI_JUNGONG);
        TOP_KEJI.putAll(TOP_KEJI_NEW_ENERGY);
        TOP_KEJI.putAll(TOP_KEJI_NEW_CAR);
    }

    /**
     * 指数
     */
    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘
    public static Map<String, String> TOP_INDEX_CN_NOT = new HashMap<>();
    static {
        TOP_INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.77     累涨：49.25     15.47     23.41     10.37     10日：2.77      1.70      1.01      -0.26     1         累涨修正：55.74     净值区间：54      45      76      94      90      1
        TOP_INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：10.63     累涨：38.85     18.00     9.52      11.33     10日：1.48      0.90      0.20      1.69      4         累涨修正：41.63     净值区间：71      35      23      43      34      5
        TOP_INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：12.63     累涨：34.73     5.67      23.87     5.19      10日：3.17      0.82                0.00      7         累涨修正：38.72     净值区间：19      62      63      94      94      6
    }
    static {
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.77     累涨：49.25     15.47     23.41     10.37     10日：2.77      1.70      1.01      -0.26     1         累涨修正：55.74     净值区间：54      45      76      94      90      1
        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：16.31     累涨：39.87     9.97      21.81     8.09      10日：2.48      1.80      1.20      0.15      2         累涨修正：46.55     净值区间：88      88      95      99      99      2
        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：15.70     累涨：40.81     8.48      25.37     6.96      10日：2.25      1.59                0.51      3         累涨修正：44.65     净值区间：23      21      13      76      76      3
        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：4.98      累涨：41.38     16.67     20.25     4.46      10日：1.18      0.10                0.40      13        累涨修正：42.66     净值区间：33      26      13      68      68      4
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：10.63     累涨：38.85     18.00     9.52      11.33     10日：1.48      0.90      0.20      1.69      4         累涨修正：41.63     净值区间：71      35      23      43      34      5
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：12.63     累涨：34.73     5.67      23.87     5.19      10日：3.17      0.82                0.00      7         累涨修正：38.72     净值区间：19      62      63      94      94      6
        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：7.83      累涨：32.82     6.43      21.06     5.33      10日：3.12      1.14      0.67      -0.67     6         累涨修正：38.42     净值区间：4       51      63      91      91      7
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：8.80      累涨：33.23     8.27      18.39     6.57      10日：2.02      0.95      0.36      0.18      10        累涨修正：36.92     净值区间：44      33      62      90      86      8
        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：4.69      累涨：31.27     5.65      19.39     6.23      10日：2.53      1.41      0.67      0.22      8         累涨修正：36.55     净值区间：75      78      88      97      97      9
        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.84      累涨：32.39     6.47      21.14     4.78      10日：2.84      0.82                -0.09     11        累涨修正：36.05     净值区间：8       57      57      93      86      10
        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：14.43     累涨：31.37     4.56      20.84     5.97      10日：3.35      1.19                -0.15     5         累涨修正：35.91     净值区间：6       57      57      93      93      11
        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：14.14     累涨：31.42     4.81      21.07     5.54      10日：2.90      0.96                -0.07     9         累涨修正：35.28     净值区间：12      56      56      93      93      12
        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：8.55      累涨：29.82     10.24     13.61     5.97      10日：0.92      0.82      0.10      0.41      12        累涨修正：31.76     净值区间：50      18      7       35      27      13
    }
    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股
    public static Map<String, String> TOP_INDEX_CN_NOT_USA = new HashMap<>();
    static {
        TOP_INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：6.40      累涨：90.20     43.86     22.67     23.67     10日：10.45     2.29      0.16      -1.07     4         累涨修正：103.26    净值区间：2       54      56      74      66      1
        TOP_INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：6.32      累涨：73.66     32.82     17.41     23.43     10日：3.10      1.45      0.77      -0.82     15        累涨修正：79.75     净值区间：8       26      61      71      64      2
        TOP_INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：98.75     累涨：54.78     12.65     25.03     17.10     10日：6.71      4.70      1.50      -0.13     1         累涨修正：69.19     净值区间：52      75      86      94      94      3
    }
    static {
        INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：6.40      累涨：90.20     43.86     22.67     23.67     10日：10.45     2.29      0.16      -1.07     4         累涨修正：103.26    净值区间：2       54      56      74      66      1
        INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：6.32      累涨：73.66     32.82     17.41     23.43     10日：3.10      1.45      0.77      -0.82     15        累涨修正：79.75     净值区间：8       26      61      71      64      2
        INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：98.75     累涨：54.78     12.65     25.03     17.10     10日：6.71      4.70      1.50      -0.13     1         累涨修正：69.19     净值区间：52      75      86      94      94      3
        INDEX_CN_NOT_USA.put("513350", "指数-外盘-美股        ");//标普油气ETF           市值：6.12      累涨：51.90     12.17     23.09     16.64     10日：5.15      3.80      2.36      -2.19     1         累涨修正：65.57     净值区间：16      19      51      76      59      4
        INDEX_CN_NOT_USA.put("159518", "指数-外盘-美股        ");//标普油气ETF           市值：8.22      累涨：50.20     10.39     23.39     16.42     10日：5.14      3.85      2.46      -2.41     2         累涨修正：64.11     净值区间：8       15      49      76      59      5
        INDEX_CN_NOT_USA.put("513390", "指数-外盘-美股        ");//纳指100ETF            市值：28.45     累涨：48.64     11.69     23.79     13.16     10日：4.65      4.06      1.63      0.06      6         累涨修正：60.61     净值区间：77      83      93      97      91      6
        INDEX_CN_NOT_USA.put("159502", "指数-外盘-美股        ");//标普生物科技ETF       市值：13.29     累涨：43.55     5.96      24.41     13.18     10日：6.55      4.09      2.79      -0.34     39        累涨修正：59.77     净值区间：90      91      95      91      61      7
        INDEX_CN_NOT_USA.put("159696", "指数-外盘-美股        ");//纳指ETF易方达         市值：29.68     累涨：46.59     8.90      24.51     13.18     10日：4.86      4.07      1.61      0.07      2         累涨修正：58.74     净值区间：73      80      91      97      97      8
        INDEX_CN_NOT_USA.put("159501", "指数-外盘-美股        ");//纳斯达克指数ETF       市值：75.31     累涨：46.19     8.63      24.32     13.24     10日：4.87      4.17      1.60      0.00      3         累涨修正：58.43     净值区间：72      81      91      97      97      9
        INDEX_CN_NOT_USA.put("513110", "指数-外盘-美股        ");//纳斯达克100ETF        市值：38.95     累涨：46.38     8.89      24.54     12.95     10日：4.75      4.12      1.58      0.06      5         累涨修正：58.41     净值区间：72      79      91      97      97      10
        INDEX_CN_NOT_USA.put("159513", "指数-外盘-美股        ");//纳斯达克100指数ETF    市值：61.14     累涨：47.01     8.89      25.20     12.92     10日：4.50      3.95      1.47      0.08      9         累涨修正：58.4      净值区间：74      80      91      97      97      11
        INDEX_CN_NOT_USA.put("159659", "指数-外盘-美股        ");//纳斯达克100ETF        市值：50.69     累涨：46.37     9.01      24.46     12.90     10日：4.79      4.05      1.51      0.00      7         累涨修正：58.23     净值区间：70      78      90      96      96      12
        INDEX_CN_NOT_USA.put("159632", "指数-外盘-美股        ");//纳斯达克ETF           市值：95.19     累涨：46.73     9.94      23.91     12.88     10日：4.52      3.83      1.49      -0.06     12        累涨修正：58.06     净值区间：64      74      88      96      96      13
        INDEX_CN_NOT_USA.put("513870", "指数-外盘-美股        ");//纳指ETF富国           市值：17.85     累涨：46.11     8.44      24.82     12.85     10日：4.74      4.04      1.50      0.00      11        累涨修正：57.89     净值区间：68      77      90      96      96      14
        INDEX_CN_NOT_USA.put("159941", "指数-外盘-美股        ");//纳指ETF               市值：257.78    累涨：46.51     10.63     22.61     13.27     10日：4.89      3.76      1.11      -0.34     8         累涨修正：57.38     净值区间：45      64      81      93      93      15
        INDEX_CN_NOT_USA.put("513100", "指数-外盘-美股        ");//纳指ETF               市值：149.23    累涨：45.95     9.96      22.71     13.28     10日：4.76      3.72      1.22      -0.25     10        累涨修正：56.87     净值区间：44      63      81      93      93      16
        INDEX_CN_NOT_USA.put("159660", "指数-外盘-美股        ");//纳指100ETF            市值：30.01     累涨：44.14     8.65      23.33     12.16     10日：4.78      4.12      1.61      0.00      13        累涨修正：56.26     净值区间：71      80      90      97      97      17
        INDEX_CN_NOT_USA.put("513300", "指数-外盘-美股        ");//纳斯达克ETF           市值：95.65     累涨：44.97     9.41      23.25     12.31     10日：4.42      3.58      1.35      0.05      14        累涨修正：55.67     净值区间：65      75      88      96      96      18
        INDEX_CN_NOT_USA.put("513850", "指数-外盘-美股        ");//美国50ETF             市值：18.95     累涨：44.16     8.21      24.31     11.64     10日：4.43      3.91      1.40      -0.07     16        累涨修正：55.3      净值区间：68      79      90      96      96      19
        INDEX_CN_NOT_USA.put("159577", "指数-外盘-美股        ");//美国50ETF             市值：11.27     累涨：44.40     8.32      24.57     11.51     10日：4.35      3.60      1.22      -0.08     17        累涨修正：54.79     净值区间：57      72      86      95      95      20
        INDEX_CN_NOT_USA.put("159655", "指数-外盘-美股        ");//标普ETF               市值：33.61     累涨：41.12     8.87      22.00     10.25     10日：4.03      3.38      1.43      -0.26     18        累涨修正：51.39     净值区间：64      77      88      96      93      21
        INDEX_CN_NOT_USA.put("513650", "指数-外盘-美股        ");//标普500ETF南方        市值：34.08     累涨：41.26     8.48      22.49     10.29     10日：3.74      3.21      1.31      -0.19     19        累涨修正：50.83     净值区间：67      79      89      97      97      22
        INDEX_CN_NOT_USA.put("513290", "指数-外盘-美股        ");//纳指生物科技ETF       市值：12.49     累涨：39.96     5.71      22.33     11.92     10日：4.13      2.48      1.56      -0.72     57        累涨修正：49.69     净值区间：50      66      83      85      56      23
        INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：190.69    累涨：39.50     7.30      22.20     10.00     10日：3.54      2.99      1.25      -0.20     20        累涨修正：48.53     净值区间：70      79      90      97      97      24
        INDEX_CN_NOT_USA.put("513400", "指数-外盘-美股        ");//道琼斯ETF             市值：16.42     累涨：34.67     6.37      20.31     7.99      10日：2.65      2.19      1.00      -0.36     21        累涨修正：41.51     净值区间：47      63      66      90      88      25
        INDEX_CN_NOT_USA.put("562060", "指数-外盘-美股        ");//标普红利ETF           市值：14.88     累涨：20.52     5.93      5.70      8.89      10日：4.38      3.39      2.40      -0.87     18        累涨修正：33.09     净值区间：69      76      86      93      93      26
    }
    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘
    public static Map<String, String> TOP_INDEX_CN_1000 = new HashMap<>();
    static {
        TOP_INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.46      累涨：50.47     10.56     22.84     17.07     10日：5.01      3.98      2.18      1.07      2         累涨修正：63.82     净值区间：96      96      86      97      97      1
    }
    static {
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.46      累涨：50.47     10.56     22.84     17.07     10日：5.01      3.98      2.18      1.07      2         累涨修正：63.82     净值区间：96      96      86      97      97      1
        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.19      累涨：43.42     11.66     19.79     11.97     10日：5.55      4.57      2.16      1.02      1         累涨修正：57.86     净值区间：98      98      98      100     64      2
        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.15      累涨：41.74     11.80     15.23     14.71     10日：5.60      3.92      2.03      1.11      6         累涨修正：55.32     净值区间：96      97      83      94      83      3
        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.23      累涨：40.72     8.90      21.09     10.73     10日：5.58      4.44      2.08      0.68      4         累涨修正：54.9      净值区间：97      98      98      97      91      4
        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：6.08      累涨：40.70     9.70      19.50     11.50     10日：5.30      3.92      1.82      0.81      7         累涨修正：53.56     净值区间：92      94      94      99      84      5
        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：1.79      累涨：40.67     9.96      19.38     11.33     10日：5.61      4.11      1.54      0.99      3         累涨修正：53.47     净值区间：99      99      99      100     100     6
        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.52      累涨：40.77     9.71      20.28     10.78     10日：5.58      3.78      1.60      0.63      8         累涨修正：53.33     净值区间：98      98      98      100     97      7
        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.44      累涨：41.79     11.40     20.66     9.73      10日：4.38      3.68      1.48      0.49      10        累涨修正：52.81     净值区间：80      84      84      87      56      8
        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：21.47     累涨：38.98     8.83      18.59     11.56     10日：5.59      4.02      1.82      0.36      5         累涨修正：52.23     净值区间：91      94      94      99      82      9
        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF指数       市值：0.23      累涨：37.81     9.06      18.37     10.38     10日：5.31      3.89      2.03      0.52      11        累涨修正：51.07     净值区间：94      96      96      99      84      10
        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.60      累涨：37.02     9.47      16.31     11.24     10日：5.11      3.82      1.86      0.50      12        累涨修正：49.67     净值区间：93      94      94      99      85      11
        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.51      累涨：36.65     9.35      15.87     11.43     10日：5.02      4.06      1.72      1.01      9         累涨修正：49.17     净值区间：100     100     100     93      85      12
        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.66      累涨：38.38     10.15     17.86     10.37     10日：4.34      3.18      1.32      0.61      13        累涨修正：48.54     净值区间：22      32      32      71      71      13
        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.12      累涨：38.17     9.04      20.53     8.60      10日：3.29      3.20      1.27      1.18      18        累涨修正：47.2      净值区间：89      92      58      89      86      14
        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.12      累涨：30.49     7.72      15.35     7.42      10日：4.71      4.25      2.42      0.26      16        累涨修正：44.29     净值区间：86      89      73      91      74      15
        INDEX_CN_1000.put("159521", "指数-中小盘           ");//国证2000ETF指数基金   市值：0.18      累涨：31.84     8.41      14.96     8.47      10日：4.26      3.75      2.12      0.30      17        累涨修正：44.09     净值区间：100     100     97      99      65      16
        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.61      累涨：33.09     8.14      16.26     8.69      10日：4.43      3.41      1.38      0.74      14        累涨修正：43.69     净值区间：86      88      88      91      73      17
        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.18      累涨：31.85     5.79      15.22     10.84     10日：4.19      3.54      1.98      1.63      24        累涨修正：43.54     净值区间：97      98      98      99      87      18
        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：3.36      累涨：31.81     6.77      17.13     7.91      10日：4.31      3.72      1.68      0.66      20        累涨修正：43.2      净值区间：93      93      81      96      82      19
        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：7.31      累涨：32.49     8.06      15.26     9.17      10日：4.22      3.45      1.33      0.75      19        累涨修正：42.82     净值区间：94      95      85      96      70      20
        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.12      累涨：30.48     7.84      13.62     9.02      10日：4.76      3.94      1.36      0.99      15        累涨修正：41.9      净值区间：100     100     63      84      61      21
        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.47      累涨：28.90     5.85      15.43     7.62      10日：4.29      4.19      2.13      0.95      23        累涨修正：41.64     净值区间：100     100     85      89      72      22
        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.42      累涨：31.00     8.09      15.61     7.30      10日：3.48      3.30      1.59      0.61      22        累涨修正：40.96     净值区间：100     100     88      68      68      23
        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.34      累涨：32.31     7.80      17.55     6.96      10日：3.05      2.44      1.32      0.90      33        累涨修正：40.44     净值区间：100     100     71      95      77      24
        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.36      累涨：29.08     6.78      15.24     7.06      10日：3.87      3.48      1.82      0.85      25        累涨修正：40.07     净值区间：100     100     100     100     80      25
        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.23      累涨：30.65     9.30      14.47     6.88      10日：3.49      3.00      1.35      0.86      27        累涨修正：39.84     净值区间：97      98      98      99      83      26
        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：1.05      累涨：28.25     7.08      13.65     7.52      10日：4.24      3.73      1.60      0.39      21        累涨修正：39.42     净值区间：91      92      71      91      70      27
        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：114.31    累涨：28.25     6.62      13.83     7.80      10日：3.96      3.30      1.58      0.80      26        累涨修正：38.67     净值区间：99      99      88      97      68      28
        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.11      累涨：31.77     8.05      16.04     7.68      10日：2.98      2.51      0.46      1.27      29        累涨修正：38.18     净值区间：98      98      98      100     61      29
        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.43      累涨：28.85     7.05      13.57     8.23      10日：3.63      2.95      1.24      0.78      28        累涨修正：37.91     净值区间：97      97      86      97      67      30
        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：293.76    累涨：27.72     6.18      13.60     7.94      10日：3.87      3.26      1.50      0.80      31        累涨修正：37.85     净值区间：93      93      89      97      68      31
        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：633.26    累涨：27.83     6.42      13.55     7.86      10日：3.81      3.23      1.44      0.81      30        累涨修正：37.75     净值区间：94      94      89      96      68      32
        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：372.52    累涨：27.66     6.26      13.90     7.50      10日：3.63      3.26      1.50      0.76      32        累涨修正：37.55     净值区间：93      93      87      97      68      33
        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：19.15     累涨：27.25     5.87      13.66     7.72      10日：3.72      3.15      1.40      0.75      34        累涨修正：36.92     净值区间：96      97      89      97      69      34
        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：0.89      累涨：26.74     6.27      12.69     7.78      10日：3.61      3.16      1.45      0.72      35        累涨修正：36.41     净值区间：95      95      84      96      54      35
        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.40      累涨：29.02     6.87      15.52     6.63      10日：2.98      2.21      0.77      0.66      38        累涨修正：35.75     净值区间：91      94      94      99      78      36
        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.46      累涨：26.56     6.48      13.02     7.06      10日：3.25      3.06      1.38      0.46      36        累涨修正：35.63     净值区间：90      92      92      98      86      37
        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.56      累涨：23.31     6.48      10.81     6.02      10日：3.40      3.40      1.83      0.57      39        累涨修正：33.77     净值区间：97      98      91      98      86      38
        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.61      累涨：25.51     8.16      10.98     6.37      10日：3.12      2.73      1.02      0.89      37        累涨修正：33.4      净值区间：100     100     78      93      60      39
        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.30      累涨：24.06     6.90      10.95     6.21      10日：3.21      2.78      1.28      0.95      40        累涨修正：32.61     净值区间：96      97      97      99      84      40
        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.73      累涨：24.99     7.41      10.17     7.41      10日：2.60      2.29      1.35      0.21      44        累涨修正：32.58     净值区间：85      43      60      84      74      41
        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.18      累涨：23.71     6.77      11.24     5.70      10日：3.01      2.79      1.22      0.66      41        累涨修正：31.95     净值区间：91      93      94      98      83      42
        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.85      累涨：23.44     5.47      10.50     7.47      10日：3.19      2.68      1.29      0.59      23        累涨修正：31.89     净值区间：100     100     83      95      61      43
        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：2.87      累涨：24.40     7.03      10.43     6.94      10日：2.89      1.98      0.93      0.23      45        累涨修正：31.13     净值区间：88      56      56      88      73      44
        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：3.97      累涨：23.69     6.30      10.73     6.66      10日：2.69      2.45      1.14      0.30      46        累涨修正：31.11     净值区间：89      66      69      90      61      45
        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.16      累涨：23.17     7.11      9.25      6.81      10日：2.75      2.26      1.37      0.68      47        累涨修正：30.92     净值区间：95      97      57      72      72      46
        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.65      累涨：22.87     6.42      9.88      6.57      10日：2.98      2.74      0.96      0.40      42        累涨修正：30.51     净值区间：91      91      86      64      63      47
        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：105.68    累涨：22.87     5.75      11.02     6.10      10日：3.13      2.47      1.01      0.65      43        累涨修正：30.49     净值区间：92      92      72      92      63      48
        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.66      累涨：24.12     6.62      10.90     6.60      10日：2.42      1.85      1.04      0.57      51        累涨修正：30.47     净值区间：85      81      73      95      83      49
        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.41      累涨：22.38     5.91      10.64     5.83      10日：2.76      2.56      1.37      0.39      48        累涨修正：30.44     净值区间：93      96      96      99      84      50
        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.74      累涨：24.41     5.30      11.75     7.36      10日：2.50      1.76      0.84      0.68      55        累涨修正：30.35     净值区间：100     14      15      52      52      51
        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.73      累涨：23.09     7.87      9.66      5.56      10日：2.68      2.46      1.04      0.74      50        累涨修正：30.31     净值区间：98      98      33      55      47      52
        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.31      累涨：23.14     6.59      11.33     5.22      10日：2.57      2.57      0.96      0.32      54        累涨修正：30.2      净值区间：89      91      93      94      72      53
        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.26      累涨：22.49     5.91      11.11     5.47      10日：2.95      2.39      0.98      0.49      52        累涨修正：29.79     净值区间：92      33      33      67      62      54
        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.23      累涨：23.46     6.14      11.68     5.64      10日：2.50      2.16      0.79      0.45      57        累涨修正：29.7      净值区间：70      77      69      58      58      55
        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：3.86      累涨：23.92     7.58      10.38     5.96      10日：1.88      1.76      1.06      0.35      58        累涨修正：29.68     净值区间：94      73      70      93      74      56
        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.50      累涨：20.44     6.41      7.94      6.09      10日：3.38      2.51      1.64      -0.51     49        累涨修正：29.61     净值区间：69      76      79      93      85      57
        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：7.01      累涨：20.51     4.79      9.69      6.03      10日：3.18      2.85      1.53      0.65      56        累涨修正：29.6      净值区间：94      94      94      98      65      58
        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：5.35      累涨：22.64     6.32      11.16     5.16      10日：2.65      2.21      0.94      0.60      68        累涨修正：29.38     净值区间：58      48      48      79      65      59
        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：10.25     累涨：21.89     5.22      10.74     5.93      10日：2.98      2.36      0.99      0.55      53        累涨修正：29.21     净值区间：90      91      68      91      63      60
        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：28.44     累涨：22.19     5.51      11.09     5.59      10日：2.70      2.31      0.97      0.59      59        累涨修正：29.14     净值区间：91      91      73      91      63      61
        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：119.64    累涨：22.07     5.44      11.01     5.62      10日：2.68      2.35      1.00      0.48      61        累涨修正：29.1      净值区间：89      90      71      91      63      62
        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：12.40     累涨：21.99     5.33      11.40     5.26      10日：2.80      2.40      0.95      0.63      63        累涨修正：29.09     净值区间：94      94      77      92      63      63
        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：18.59     累涨：22.30     5.69      11.07     5.54      10日：2.48      2.31      0.95      0.50      65        累涨修正：28.99     净值区间：87      88      71      91      63      64
        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.42      累涨：21.71     5.63      10.52     5.56      10日：2.66      2.48      1.03      0.59      60        累涨修正：28.91     净值区间：95      95      65      89      59      65
        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.28      累涨：20.48     4.60      9.75      6.13      10日：2.89      2.53      1.44      0.36      66        累涨修正：28.78     净值区间：96      96      93      98      67      66
        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.49      累涨：22.42     6.83      10.47     5.12      10日：2.25      2.18      0.91      0.42      71        累涨修正：28.67     净值区间：36      37      28      52      52      67
        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1117.13   累涨：21.66     5.37      10.75     5.54      10日：2.67      2.39      0.97      0.61      67        累涨修正：28.66     净值区间：90      91      73      91      63      68
        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：6.73      累涨：21.95     5.76      10.94     5.25      10日：2.51      2.20      0.90      0.61      72        累涨修正：28.46     净值区间：89      90      71      92      64      69
        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.79      累涨：21.98     6.39      10.31     5.28      10日：2.37      2.18      0.85      0.75      73        累涨修正：28.23     净值区间：86      90      74      88      72      70
        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.83      累涨：20.91     5.94      9.64      5.33      10日：2.72      2.30      1.04      0.21      69        累涨修正：28.01     净值区间：85      89      89      97      68      71
        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：2.96      累涨：21.20     5.53      10.05     5.62      10日：2.88      2.27      0.82      0.61      64        累涨修正：27.99     净值区间：94      95      71      92      65      72
        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.85      累涨：20.90     5.47      10.14     5.29      10日：2.74      2.34      0.98      0.59      70        累涨修正：27.94     净值区间：100     100     64      75      60      73
        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：21.27     累涨：21.48     5.12      11.11     5.25      10日：2.64      2.11      0.84      0.63      74        累涨修正：27.91     净值区间：88      89      74      92      63      74
        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：1.08      累涨：20.95     5.26      9.98      5.71      10日：2.81      2.36      0.89      0.55      62        累涨修正：27.9      净值区间：91      92      74      73      65      75
        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.35      累涨：18.85     5.38      7.73      5.74      10日：2.46      2.37      0.96      -0.35     75        累涨修正：25.6      净值区间：54      71      76      90      80      76
        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.15      累涨：19.56     5.98      8.00      5.58      10日：2.16      1.85      0.92      -0.20     76        累涨修正：25.41     净值区间：85      89      90      96      68      77
        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500指数ETF           市值：148.45    累涨：20.51     4.87      9.93      5.71      10日：1.87      1.36      0.42      0.31      77        累涨修正：24.58     净值区间：86      46      36      82      67      78
        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.45      累涨：19.51     4.75      8.99      5.77      10日：1.79      1.40      0.70      0.39      81        累涨修正：24.1      净值区间：95      55      53      87      74      79
        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：167.47    累涨：20.02     5.04      9.32      5.66      10日：1.72      1.32      0.51      0.30      79        累涨修正：24.08     净值区间：81      50      39      83      68      80
        INDEX_CN_1000.put("563360", "指数-中小盘           ");//中证A500ETF基金       市值：87.65     累涨：19.62     4.92      9.37      5.33      10日：1.81      1.31      0.40      0.50      83        累涨修正：23.54     净值区间：88      54      42      85      69      81
        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：202.50    累涨：19.20     5.51      8.05      5.64      10日：1.82      1.40      0.54      0.32      78        累涨修正：23.5      净值区间：86      48      38      82      68      82
        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：9.55      累涨：19.93     5.06      9.71      5.16      10日：1.52      1.02      0.51      0.30      94        累涨修正：23.49     净值区间：80      48      38      83      69      83
        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.59      累涨：17.84     4.92      8.14      4.78      10日：2.24      1.97      0.72      0.33      88        累涨修正：23.49     净值区间：100     100     67      89      61      84
        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：162.45    累涨：19.16     5.13      8.59      5.44      10日：1.82      1.40      0.54      0.32      80        累涨修正：23.46     净值区间：80      48      38      82      67      85
        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：101.04    累涨：19.08     4.90      8.43      5.75      10日：1.81      1.28      0.53      0.32      82        累涨修正：23.23     净值区间：81      50      41      83      68      86
        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：55.04     累涨：19.17     5.12      8.69      5.36      10日：1.66      1.25      0.52      0.41      86        累涨修正：23.12     净值区间：87      50      39      83      68      87
        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：25.26     累涨：19.44     4.78      9.17      5.49      10日：1.50      1.10      0.50      0.30      91        累涨修正：23.04     净值区间：87      50      37      82      68      88
        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：45.98     累涨：18.59     4.79      8.31      5.49      10日：1.80      1.30      0.60      0.30      87        累涨修正：22.89     净值区间：88      67      47      85      70      89
        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：52.94     累涨：18.85     4.88      8.57      5.40      10日：1.84      1.34      0.31      0.51      85        累涨修正：22.65     净值区间：87      50      39      83      68      90
        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：162.02    累涨：18.91     5.10      8.19      5.62      10日：1.63      1.23      0.41      0.41      84        累涨修正：22.59     净值区间：87      50      39      83      68      91
        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.32      累涨：18.62     4.68      7.84      6.10      10日：1.50      1.00      0.66      -0.08     95        累涨修正：22.44     净值区间：67      67      67      87      85      92
        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：23.40     累涨：18.86     4.77      8.90      5.19      10日：1.53      1.13      0.41      0.41      101       累涨修正：22.34     净值区间：88      54      42      84      68      93
        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：180.09    累涨：18.87     4.90      8.54      5.43      10日：1.49      1.07      0.43      0.32      97        累涨修正：22.29     净值区间：80      48      38      82      67      94
        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：58.83     累涨：18.98     4.93      8.68      5.37      10日：1.48      0.96      0.43      0.42      99        累涨修正：22.28     净值区间：86      48      39      83      68      95
        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：28.53     累涨：18.49     4.64      8.29      5.56      10日：1.62      1.12      0.51      0.30      96        累涨修正：22.25     净值区间：80      46      38      83      68      96
        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：13.75     累涨：17.84     5.07      7.57      5.20      10日：1.91      1.31      0.50      0.20      89        累涨修正：22.06     净值区间：75      48      32      80      66      97
        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：38.69     累涨：18.40     4.75      8.41      5.24      10日：1.61      1.21      0.40      0.40      100       累涨修正：22.02     净值区间：86      48      39      84      68      98
        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.49      累涨：18.50     5.86      8.08      4.56      10日：1.32      1.06      0.53      0.18      103       累涨修正：21.94     净值区间：93      81      60      79      65      99
        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：1.82      累涨：18.43     4.58      8.78      5.07      10日：1.42      1.02      0.41      0.51      109       累涨修正：21.69     净值区间：47      47      44      83      69      100
        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：129.52    累涨：17.83     4.78      7.64      5.41      10日：1.56      1.15      0.42      0.31      102       累涨修正：21.38     净值区间：79      44      33      82      68      101
        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：5.22      累涨：17.78     4.28      7.86      5.64      10日：1.65      1.17      0.39      0.49      92        累涨修正：21.38     净值区间：87      52      37      79      66      102
        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：32.82     累涨：18.19     4.32      8.55      5.32      10日：1.51      1.01      0.30      0.60      106       累涨修正：21.31     净值区间：87      52      41      83      67      103
        INDEX_CN_1000.put("560530", "指数-中小盘           ");//中证A500ETF摩根       市值：78.58     累涨：17.86     4.64      7.74      5.48      10日：1.45      1.14      0.41      0.31      104       累涨修正：21.27     净值区间：80      46      38      82      65      104
        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：17.14     4.96      6.75      5.43      10日：1.78      1.22      0.56      0.19      90        累涨修正：21.26     净值区间：87      67      48      73      73      105
        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：1.26      累涨：17.46     4.82      7.23      5.41      10日：1.77      1.18      0.39      0.49      98        累涨修正：21.19     净值区间：100     54      44      85      71      106
        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：4.02      累涨：18.31     4.95      8.50      4.86      10日：1.36      0.78      0.29      0.19      108       累涨修正：21.03     净值区间：76      45      36      82      67      107
        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：65.89     累涨：17.39     4.68      7.38      5.33      10日：1.60      1.18      0.43      0.32      105       累涨修正：21.03     净值区间：86      50      40      83      66      108
        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：14.45     累涨：16.81     4.63      7.03      5.15      10日：1.49      1.20      0.60      0.39      110       累涨修正：20.7      净值区间：88      56      21      64      64      109
        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：37.39     累涨：16.96     4.03      7.49      5.44      10日：1.51      1.11      0.50      0.20      107       累涨修正：20.58     净值区间：86      48      46      83      68      110
        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：2.13      累涨：16.18     3.29      6.90      5.99      10日：1.94      0.97      0.48      -0.29     93        累涨修正：20.05     净值区间：50      47      73      90      90      111
        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：143.16    累涨：16.68     4.79      6.78      5.11      10日：1.36      1.15      0.31      0.31      111       累涨修正：19.81     净值区间：73      44      34      82      68      112
        INDEX_CN_1000.put("563660", "指数-中小盘           ");//A500ETF银河           市值：2.87      累涨：                    7.48      5.30      10日：1.33      1.03      0.41      0.41      153       累涨修正：15.96     净值区间：85      46      37      84              113
        INDEX_CN_1000.put("159215", "指数-中小盘           ");//中证A500ETF指数基金   市值：21.68     累涨：                              5.05      10日：1.52      1.22      0.61      0.30      173       累涨修正：9.01      净值区间：86      48      38      84              114
        INDEX_CN_1000.put("563650", "指数-中小盘           ");//中证A500龙头ETF       市值：3.09      累涨：                              5.08      10日：1.32      0.82      0.41      0.40      189       累涨修正：8.04      净值区间：85      46      40      85              115
        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：5.25      累涨：                                        10日：                              0.99      112       累涨修正：0         净值区间：42      42      39      83      67      116
        INDEX_CN_1000.put("159226", "指数-中小盘           ");//中证A500增强ETF       市值：5.46      累涨：                                        10日：                    0.40      0.20                累涨修正：          净值区间：82                                      117
        INDEX_CN_1000.put("516460", "指数-中小盘           ");//现金流ETF800          市值：0.34      累涨：                                        10日：                              -0.39               累涨修正：          净值区间：                                        118
        INDEX_CN_1000.put("563990", "指数-中小盘           ");//800现金流ETF          市值：1.18      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        119
        INDEX_CN_1000.put("563680", "指数-中小盘           ");//800自由现金流ETF      市值：0.46      累涨：                                        10日：2.36      1.08      0.10      -0.10               累涨修正：          净值区间：25      36                              120
        INDEX_CN_1000.put("563550", "指数-中小盘           ");//A500增强ETF摩根       市值：6.33      累涨：                                        10日：1.83      1.43      0.51      0.20                累涨修正：          净值区间：86      57                              121
    }
    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板
    public static Map<String, String> TOP_INDEX_300 = new HashMap<>();
    static {
        TOP_INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.27      累涨：41.75     8.35      22.15     11.25     10日：5.45      4.47      1.47      1.20      2         累涨修正：54.61     净值区间：95      95      91      97      63      1
    }
    static {
        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.27      累涨：41.75     8.35      22.15     11.25     10日：5.45      4.47      1.47      1.20      2         累涨修正：54.61     净值区间：95      95      91      97      63      1
        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.13      累涨：40.97     8.76      20.59     11.62     10日：5.89      4.64      1.55      1.28      1         累涨修正：54.6      净值区间：95      96      96      99      63      2
        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.58      累涨：40.54     7.90      21.53     11.11     10日：5.89      4.66      1.70      1.09      3         累涨修正：54.49     净值区间：94      95      92      61      61      3
        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.18      累涨：41.79     7.83      23.52     10.44     10日：5.47      4.31      1.39      1.20      4         累涨修正：54.35     净值区间：94      95      83      68      62      4
        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.67      累涨：41.74     12.47     21.50     7.77      10日：3.97      3.58      1.50      1.26      7         累涨修正：52.29     净值区间：98      99      68      89      59      5
        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：39.95     累涨：34.56     6.90      17.81     9.85      10日：3.90      3.66      1.94      2.39      8         累涨修正：46        净值区间：91      92      69      88      65      6
        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.89      累涨：34.24     6.92      16.04     11.28     10日：4.20      3.76      1.87      2.27      5         累涨修正：45.94     净值区间：95      96      84      81      71      7
        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.23      累涨：37.39     6.94      21.58     8.87      10日：3.66      3.57      0.52      1.47      11        累涨修正：45.66     净值区间：95      95      77      88      56      8
        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.48      累涨：33.76     6.95      17.63     9.18      10日：3.45      3.27      1.72      1.16      12        累涨修正：43.92     净值区间：100     100     70      92      68      9
        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.44      累涨：32.97     7.78      15.40     9.79      10日：3.91      3.06      1.56      1.00      10        累涨修正：43.06     净值区间：98      98      81      96      73      10
        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.29      累涨：34.51     7.10      13.04     14.37     10日：3.13      2.39      1.30      1.28      19        累涨修正：42.63     净值区间：91      63      39      74      63      11
        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：6.83      累涨：31.76     6.72      13.06     11.98     10日：3.91      3.40      1.56      1.54      6         累涨修正：42.19     净值区间：94      94      68      89      65      12
        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：248.14    累涨：31.95     6.69      13.34     11.92     10日：3.94      2.73      1.36      1.45      9         累涨修正：41.34     净值区间：91      68      52      83      64      13
        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.40      累涨：32.17     6.01      13.78     12.38     10日：3.63      2.59      1.19      1.49      13        累涨修正：40.77     净值区间：92      74      52      83      66      14
        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：45.77     累涨：31.43     6.03      13.49     11.91     10日：3.70      2.57      1.40      1.38      15        累涨修正：40.5      净值区间：91      67      52      83      64      15
        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.35      累涨：29.57     4.64      13.49     11.44     10日：3.89      3.22      1.61      1.35      14        累涨修正：39.9      净值区间：89      89      69      88      65      16
        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：3.79      累涨：30.37     6.32      12.17     11.88     10日：3.71      2.57      1.50      1.26      21        累涨修正：39.65     净值区间：94      69      50      83      63      17
        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：2.36      累涨：30.50     6.32      12.06     12.12     10日：3.70      2.60      1.35      1.53      18        累涨修正：39.5      净值区间：98      74      66      87      68      18
        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：2.03      累涨：29.57     6.40      13.75     9.42      10日：3.55      3.41      1.48      1.60      11        累涨修正：39.49     净值区间：97      97      68      89      58      19
        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.85      累涨：30.39     5.63      14.62     10.14     10日：3.59      2.74      1.24      1.23      23        累涨修正：39.2      净值区间：93      87      59      87      63      20
        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：835.35    累涨：29.51     5.71      13.23     10.57     10日：3.73      2.94      1.41      1.15      16        累涨修正：39        净值区间：91      83      57      86      63      21
        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.80      累涨：30.90     6.57      12.65     11.68     10日：3.38      2.20      1.21      1.41      26        累涨修正：38.9      净值区间：97      73      51      56      56      22
        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.36      累涨：29.21     5.63      13.08     10.50     10日：3.65      2.92      1.41      1.07      22        累涨修正：38.6      净值区间：95      84      55      84      63      23
        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：14.09     累涨：30.58     6.38      12.88     11.32     10日：3.42      2.19      1.15      1.37      24        累涨修正：38.49     净值区间：91      69      52      83      64      24
        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：4.95      累涨：28.78     5.65      12.51     10.62     10日：3.78      2.95      1.47      1.07      20        累涨修正：38.45     净值区间：93      88      57      86      64      25
        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：99.27     累涨：29.24     5.98      13.03     10.23     10日：3.39      2.66      1.33      1.23      28        累涨修正：37.95     净值区间：93      88      58      86      63      26
        INDEX_300.put("159957", "指数-创业板           ");//创业板ETF华夏         市值：16.95     累涨：28.45     6.03      12.10     10.32     10日：3.68      2.85      1.38      1.14      25        累涨修正：37.74     净值区间：93      84      57      86      63      27
        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：91.43     累涨：28.07     5.57      12.01     10.49     10日：3.76      2.86      1.40      1.15      27        累涨修正：37.49     净值区间：93      83      56      85      62      28
        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：45.73     累涨：28.47     5.98      12.30     10.19     10日：3.58      2.69      1.32      1.21      29        累涨修正：37.38     净值区间：94      85      57      86      64      29
        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.07      累涨：28.19     5.50      12.38     10.31     10日：3.40      2.76      1.44      0.91      31        累涨修正：37.23     净值区间：92      80      56      63      63      30
        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.23      累涨：29.30     5.54      13.66     10.10     10日：4.13      3.21      0.26      1.19      17        累涨修正：37.16     净值区间：67      67      48      78      63      31
        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：23.48     累涨：27.85     5.79      11.88     10.18     10日：3.60      2.68      1.37      1.21      32        累涨修正：36.87     净值区间：96      85      59      86      63      32
        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.49      累涨：28.10     6.32      12.49     9.29      10日：3.58      2.52      1.32      0.71      33        累涨修正：36.84     净值区间：92      83      53      85      60      33
        INDEX_300.put("159377", "指数-创业板           ");//创业板医药ETF国泰     市值：0.24      累涨：                              13.64     10日：9.21      6.58      3.66      -0.91     45        累涨修正：36.75     净值区间：86      87      89                      34
        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：3.62      累涨：29.13     6.05      11.89     11.19     10日：3.15      2.05      1.13      1.52      36        累涨修正：36.59     净值区间：97      74      52      83      64      35
        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：20.44     累涨：27.98     5.78      12.13     10.07     10日：3.38      2.59      1.29      1.22      37        累涨修正：36.53     净值区间：92      85      58      86      64      36
        INDEX_300.put("159836", "指数-创业板           ");//创业板300ETF天弘      市值：1.84      累涨：28.04     5.47      13.10     9.47      10日：3.17      2.92      1.13      1.50      30        累涨修正：36.39     净值区间：100     100     74      90      63      37
        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.22      累涨：28.26     5.57      12.58     10.11     10日：3.09      2.47      1.11      1.81      39        累涨修正：36.04     净值区间：100     79      58      82      63      38
        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.23      累涨：27.22     6.25      12.23     8.74      10日：3.18      2.51      1.14      1.13      38        累涨修正：35.19     净值区间：86      87      58      87      68      39
        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：22.86     累涨：26.35     5.89      12.72     7.74      10日：2.99      2.99      1.30      1.10      34        累涨修正：34.93     净值区间：89      90      60      86      55      40
        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：14.37     累涨：25.91     5.68      12.84     7.39      10日：3.19      2.83      1.23      1.21      35        累涨修正：34.39     净值区间：92      93      58      86      55      41
        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：4.84      累涨：26.62     4.46      15.07     7.09      10日：2.67      2.45      0.88      1.10      41        累涨修正：33.5      净值区间：92      88      58      86      56      42
        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.21      累涨：25.06     5.46      12.54     7.06      10日：2.92      2.58      1.05      1.39      43        累涨修正：32.66     净值区间：92      93      64      88      57      43
        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：0.93      累涨：26.16     6.39      11.40     8.37      10日：2.79      1.92      0.77      0.89      42        累涨修正：32.41     净值区间：88      39      38      85      68      44
        INDEX_300.put("159368", "指数-创业板           ");//创业板新能源ETF华夏   市值：1.22      累涨：                    16.37     8.42      10日：3.12      2.04      1.02      0.56      9         累涨修正：31.99     净值区间：86      38      26      69              45
        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.14      累涨：24.51     5.00      12.77     6.74      10日：2.85      2.48      0.95      1.31      44        累涨修正：31.74     净值区间：89      89      59      86      55      46
    }
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板
    public static Map<String, String> TOP_INDEX_688 = new HashMap<>();
    static {
        TOP_INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：3.17      累涨：40.04     10.50     21.04     8.50      10日：4.80      4.06      1.54      1.52      1         累涨修正：51.98     净值区间：93      95      95      97      80      1
    }
    static {
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：3.17      累涨：40.04     10.50     21.04     8.50      10日：4.80      4.06      1.54      1.52      1         累涨修正：51.98     净值区间：93      95      95      97      80      1
        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.34      累涨：37.04     12.05     18.85     6.14      10日：4.96      4.76      1.95      1.44      4         累涨修正：50.66     净值区间：96      97      88      86      84      2
        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：2.18      累涨：37.25     12.77     18.62     5.86      10日：4.73      4.55      1.63      1.61      11        累涨修正：49.79     净值区间：95      96      92      86      82      3
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.35      累涨：38.61     9.29      20.82     8.50      10日：4.47      3.88      1.34      1.90      2         累涨修正：49.64     净值区间：93      94      94      91      80      4
        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：3.76      累涨：37.38     11.98     19.52     5.88      10日：4.61      4.27      1.51      1.74      9         累涨修正：49.28     净值区间：99      99      97      87      87      5
        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：33.61     累涨：40.77     11.48     22.33     6.96      10日：3.53      3.02      0.89      2.64      30        累涨修正：49.1      净值区间：96      77      52      74      11      6
        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.22      累涨：37.05     9.67      20.14     7.24      10日：4.38      3.92      1.72      1.96      5         累涨修正：48.79     净值区间：100     100     95      98      80      7
        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.38      累涨：35.59     8.00      20.50     7.09      10日：4.48      4.12      1.72      1.91      8         累涨修正：47.63     净值区间：98      99      93      91      79      8
        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：50.20     累涨：34.55     8.37      19.13     7.05      10日：4.77      4.35      1.68      1.55      3         累涨修正：47.03     净值区间：94      94      83      81      65      9
        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.31      累涨：33.68     7.95      18.76     6.97      10日：4.72      4.50      1.74      1.71      10        累涨修正：46.38     净值区间：98      98      84      85      66      10
        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：66.45     累涨：34.31     8.17      19.18     6.96      10日：4.77      4.35      1.47      1.76      6         累涨修正：46.37     净值区间：93      94      82      83      65      11
        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：2.77      累涨：34.48     7.87      19.31     7.30      10日：4.55      4.23      1.50      1.69      7         累涨修正：46.26     净值区间：96      96      84      85      66      12
        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：32.09     累涨：33.75     8.01      18.87     6.87      10日：4.48      4.27      1.48      1.77      12        累涨修正：45.46     净值区间：98      98      84      84      66      13
        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：3.03      累涨：33.68     8.42      18.24     7.02      10日：4.54      4.12      1.46      1.76      13        累涨修正：45.26     净值区间：98      98      80      86      67      14
        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：10.68     累涨：33.66     7.77      19.57     6.32      10日：4.35      4.14      1.47      1.76      14        累涨修正：45.09     净值区间：96      96      83      84      65      15
        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：32.36     累涨：33.47     7.44      19.32     6.71      10日：4.37      4.15      1.40      1.92      15        累涨修正：44.79     净值区间：98      98      85      85      67      16
        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.39      累涨：33.34     7.90      19.10     6.34      10日：4.27      3.74      1.06      2.47      16        累涨修正：43.47     净值区间：94      94      73      82      66      17
        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.30      累涨：33.78     9.35      14.77     9.66      10日：3.15      3.15      1.57      0.33      1         累涨修正：43.22     净值区间：100     48      22      60      39      18
        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：28.84     累涨：31.36     7.04      18.14     6.18      10日：4.04      3.49      1.52      0.96      18        累涨修正：41.93     净值区间：91      92      76      88      67      19
        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.68      累涨：33.56     9.67      14.37     9.52      10日：2.82      2.72      1.31      0.40      2         累涨修正：41.72     净值区间：92      49      22      60      38      20
        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：6.49      累涨：29.43     9.06      15.79     4.58      10日：3.89      3.62      1.52      1.68      20        累涨修正：39.98     净值区间：98      98      59      73      58      21
        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：22.80     累涨：30.25     7.84      16.46     5.95      10日：3.82      3.49      1.19      1.17      17        累涨修正：39.94     净值区间：94      95      74      86      66      22
        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：27.39     累涨：30.41     7.08      17.42     5.91      10日：3.48      3.48      1.19      1.17      22        累涨修正：39.75     净值区间：94      95      75      86      65      23
        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：2.51      累涨：30.20     9.15      15.57     5.48      10日：3.82      2.89      1.17      1.92      56        累涨修正：39.25     净值区间：98      98      51      71      48      24
        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：8.45      累涨：31.04     6.62      18.94     5.48      10日：3.24      2.81      1.07      1.06      29        累涨修正：39.23     净值区间：94      94      74      88      68      25
        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：7.35      累涨：30.14     7.31      17.45     5.38      10日：3.47      3.25      1.18      1.17      23        累涨修正：39.22     净值区间：95      95      71      86      66      26
        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：14.25     累涨：28.99     6.81      16.19     5.99      10日：3.67      3.67      1.39      1.06      21        累涨修正：39.11     净值区间：94      95      74      87      67      27
        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：8.41      累涨：30.02     7.31      17.23     5.48      10日：3.47      3.14      1.07      1.27      25        累涨修正：38.77     净值区间：97      97      78      88      68      28
        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：8.78      累涨：29.85     7.19      16.87     5.79      10日：3.46      3.14      1.07      1.06      27        累涨修正：38.59     净值区间：91      92      74      86      66      29
        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.32      累涨：30.00     8.28      16.98     4.74      10日：3.31      2.84      1.18      1.94      59        累涨修正：38.51     净值区间：72      72      64      70      48      30
        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.63      累涨：30.67     5.97      18.78     5.92      10日：3.42      2.22      0.85      1.02      35        累涨修正：38.01     净值区间：93      67      46      82      65      31
        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：8.56      累涨：28.39     6.59      16.35     5.45      10日：3.62      3.40      1.30      1.18      30        累涨修正：38.01     净值区间：97      97      68      87      66      32
        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：6.49      累涨：29.42     6.65      16.70     6.07      10日：3.45      3.13      0.85      1.16      28        累涨修正：37.7      净值区间：92      92      78      90      66      33
        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：7.78      累涨：29.59     7.35      17.17     5.07      10日：3.15      2.93      0.97      1.28      33        累涨修正：37.61     净值区间：94      94      76      85      68      34
        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.80      累涨：29.88     5.72      18.66     5.50      10日：3.20      2.20      0.85      0.84      43        累涨修正：36.98     净值区间：93      59      39      80      64      35
        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：13.94     累涨：27.59     6.62      16.00     4.97      10日：3.05      3.05      1.08      1.28      40        累涨修正：35.85     净值区间：94      95      73      88      67      36
        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.50      累涨：25.80     5.19      12.66     7.95      10日：3.66      3.32      1.39      1.03      26        累涨修正：35.56     净值区间：84      86      56      84      51      37
        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：22.86     累涨：26.35     5.89      12.72     7.74      10日：2.99      2.99      1.30      1.10      34        累涨修正：34.93     净值区间：89      90      60      86      55      38
        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：82.62     累涨：27.05     6.59      13.28     7.18      10日：2.87      2.68      0.95      1.32      36        累涨修正：34.5      净值区间：94      95      62      88      57      39
        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.40      累涨：25.09     5.41      12.21     7.47      10日：3.52      3.00      1.41      1.39      31        累涨修正：34.43     净值区间：100     100     57      85      56      40
        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：14.37     累涨：25.91     5.68      12.84     7.39      10日：3.19      2.83      1.23      1.21      35        累涨修正：34.39     净值区间：92      93      58      86      55      41
        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：810.29    累涨：26.69     7.49      14.28     4.92      10日：3.12      2.63      0.97      1.06      37        累涨修正：34.38     净值区间：93      94      49      74      50      42
        INDEX_688.put("589630", "指数-科创板           ");//科创综指ETF国泰       市值：12.28     累涨：                    18.59     5.50      10日：3.81      3.59      1.29      0.96      24        累涨修正：34.07     净值区间：94      94      69      84              43
        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：40.68     累涨：25.92     5.84      12.77     7.31      10日：2.85      2.85      1.14      1.31      38        累涨修正：33.9      净值区间：94      95      63      88      56      44
        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：17.52     累涨：26.32     6.20      13.20     6.92      10日：2.77      2.59      1.10      1.28      49        累涨修正：33.88     净值区间：94      95      60      86      54      45
        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：58.02     累涨：25.64     7.48      13.38     4.78      10日：3.06      2.74      1.12      0.79      42        累涨修正：33.68     净值区间：89      85      44      70      48      46
        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.26      累涨：25.41     7.27      13.51     4.63      10日：2.98      2.70      1.13      0.98      47        累涨修正：33.35     净值区间：95      95      47      71      49      47
        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：114.79    累涨：25.80     7.56      13.39     4.85      10日：3.21      2.51      0.80      0.99      41        累涨修正：33.12     净值区间：90      90      45      71      49      48
        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：617.42    累涨：25.55     7.49      13.11     4.95      10日：3.10      2.50      0.90      1.08      48        累涨修正：32.95     净值区间：96      97      49      74      51      49
        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：17.51     累涨：25.35     5.98      12.29     7.08      10日：2.83      2.46      1.13      1.30      56        累涨修正：32.9      净值区间：94      95      63      87      55      50
        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：43.86     累涨：25.13     5.67      12.35     7.11      10日：2.83      2.46      1.13      1.31      54        累涨修正：32.68     净值区间：89      90      60      86      55      51
        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.21      累涨：25.06     5.46      12.54     7.06      10日：2.92      2.58      1.05      1.39      43        累涨修正：32.66     净值区间：92      93      64      88      57      52
        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：32.38     累涨：25.16     7.11      13.51     4.54      10日：3.01      2.54      0.95      0.94      53        累涨修正：32.61     净值区间：89      85      44      71      49      53
        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：0.95      累涨：24.95     6.69      14.08     4.18      10日：2.93      2.69      0.97      1.20      57        累涨修正：32.51     净值区间：94      95      46      63      40      54
        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.02      累涨：25.25     8.25      11.67     5.33      10日：2.84      2.54      0.91      1.50      50        累涨修正：32.45     净值区间：97      97      52      64      60      55
        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：1.82      累涨：24.90     8.21      12.16     4.53      10日：3.09      2.59      0.89      0.88      44        累涨修正：32.36     净值区间：97      97      52      64      49      56
        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：2.33      累涨：24.91     7.66      12.80     4.45      10日：2.71      2.71      1.00      1.09      55        累涨修正：32.33     净值区间：96      91      47      64      52      57
        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：11.07     累涨：24.43     5.26      11.79     7.38      10日：2.61      2.61      1.30      1.11      52        累涨修正：32.25     净值区间：88      90      55      83      55      58
        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：21.98     累涨：25.08     6.15      11.62     7.31      10日：2.95      2.47      0.86      1.34      46        累涨修正：32.22     净值区间：88      89      51      91      71      59
        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：43.74     累涨：25.22     7.34      13.37     4.51      10日：2.88      2.29      0.80      1.28      59        累涨修正：31.99     净值区间：100     100     50      73      51      60
        INDEX_688.put("589060", "指数-科创板           ");//科创综指ETF东财       市值：2.01      累涨：                    17.61     5.47      10日：3.64      3.12      1.03      1.43      32        累涨修正：31.9      净值区间：95      95      77      89              61
        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.14      累涨：24.51     5.00      12.77     6.74      10日：2.85      2.48      0.95      1.31      44        累涨修正：31.74     净值区间：89      89      59      86      55      62
        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.72      累涨：24.39     7.48      12.73     4.18      10日：2.48      2.33      1.01      1.15      61        累涨修正：31.22     净值区间：100     100     36      71      51      63
        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.66      累涨：24.34     5.61      11.74     6.99      10日：2.77      2.43      0.69      1.54      58        累涨修正：30.92     净值区间：94      90      58      85      52      64
        INDEX_688.put("589600", "指数-科创板           ");//科创综指ETF富国       市值：17.76     累涨：                    16.86     5.16      10日：3.21      3.10      1.10      1.30      39        累涨修正：30.53     净值区间：94      95      73      87      67      65
        INDEX_688.put("588660", "指数-科创板           ");//科创创业50ETF基金     市值：3.37      累涨：                    14.24     7.77      10日：2.99      2.77      1.10      1.32      34        累涨修正：29.97     净值区间：93      94      57      86              66
        INDEX_688.put("588770", "指数-科创板           ");//科创信息技术ETF摩根   市值：3.31      累涨：                    15.25     5.00      10日：3.24      2.81      1.07      1.93      62        累涨修正：28.44     净值区间：97      97      48      71              67
        INDEX_688.put("588840", "指数-科创板           ");//科创板50ETF基金       市值：1.85      累涨：                    13.43     4.32      10日：2.58      2.47      0.78      1.10      62        累涨修正：24.36     净值区间：96      94      52      70              68
        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：3.18      累涨：19.65     4.56      7.98      7.11      10日：2.10      1.49      0.18      0.43      60        累涨修正：23.6      净值区间：75      75      45      82      53      69
        INDEX_688.put("588170", "指数-科创板           ");//科创半导体ETF         市值：2.58      累涨：                              7.39      10日：5.03      4.09      2.09      1.14      19        累涨修正：20.69     净值区间：97      97      48                      70
        INDEX_688.put("589300", "指数-科创板           ");//科创综指ETF嘉实       市值：0.55      累涨：                              5.35      10日：3.79      3.10      1.69      0.59      45        累涨修正：15.62     净值区间：85      87      69                      71
        INDEX_688.put("588910", "指数-科创板           ");//科创价值ETF           市值：9.36      累涨：                              6.04      10日：3.11      2.90      0.96      0.95      51        累涨修正：13.97     净值区间：87      83      49      84              72
        INDEX_688.put("588850", "指数-科创板           ");//科创机械ETF           市值：0.24      累涨：                              6.22      10日：2.58      2.09      0.50      2.37      42        累涨修正：11.89     净值区间：94      85      44                      73
        INDEX_688.put("588040", "指数-科创板           ");//科创50ETF指数         市值：0.23      累涨：                              4.38      10日：2.76      2.56      0.98      1.17      63        累涨修正：11.66     净值区间：97      97      14                      74
        INDEX_688.put("588720", "指数-科创板           ");//科创50ETF中银         市值：3.66      累涨：                              3.82      10日：2.54      2.54      0.60      1.20      64        累涨修正：10.1      净值区间：100     67      45                      75
        INDEX_688.put("589700", "指数-科创板           ");//N科创成长ETF南方      市值：3.85      累涨：                                        10日：                              1.48                累涨修正：          净值区间：                                        76
        INDEX_688.put("588710", "指数-科创板           ");//科创半导体设备ETF     市值：3.69      累涨：                                        10日：                              1.30                累涨修正：          净值区间：                                        77
        INDEX_688.put("589980", "指数-科创板           ");//科创100ETF汇添富      市值：7.63      累涨：                                        10日：4.65      4.24      1.54      1.72                累涨修正：          净值区间：96      96                              78
        INDEX_688.put("588940", "指数-科创板           ");//科创50ETF富国         市值：2.61      累涨：                                        10日：                              1.29                累涨修正：          净值区间：                                        79
    }
    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘
    public static Map<String, String> TOP_INDEX_CN_BIG = new HashMap<>();
    static {
        TOP_INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.36      累涨：27.96     8.88      9.15      9.93      10日：2.91      1.99      0.75      0.00      1         累涨修正：34.36     净值区间：10      10      19      45      45      6
        TOP_INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.58      累涨：21.15     6.68      7.53      6.94      10日：2.22      1.19      0.40      0.52      19        累涨修正：25.36     净值区间：91      36      42      80      65      46
        TOP_INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：39.68     累涨：20.43     6.40      7.39      6.64      10日：1.68      0.84      0.48      0.12      45        累涨修正：23.91     净值区间：71      31      35      79      74      64
    }
    static {
        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.18      累涨：31.85     5.79      15.22     10.84     10日：4.19      3.54      1.98      1.63      24        累涨修正：43.54     净值区间：97      98      98      99      87      1
        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：2.66      累涨：29.95     5.57      13.34     11.04     10日：3.42      2.83      0.70      0.92      21        累涨修正：37.6      净值区间：89      91      51      76      54      2
        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：2.22      累涨：29.42     5.29      12.53     11.60     10日：3.80      2.97      0.70      0.81      18        累涨修正：37.59     净值区间：92      94      50      76      55      3
        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：15.06     累涨：29.38     5.58      12.87     10.93     10日：3.45      2.83      0.73      0.97      22        累涨修正：37.12     净值区间：94      94      51      75      52      4
        INDEX_CN_BIG.put("159836", "指数-大盘             ");//创业板300ETF天弘      市值：1.84      累涨：28.04     5.47      13.10     9.47      10日：3.17      2.92      1.13      1.50      30        累涨修正：36.39     净值区间：100     100     74      90      63      5
        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.36      累涨：27.96     8.88      9.15      9.93      10日：2.91      1.99      0.75      0.00      1         累涨修正：34.36     净值区间：10      10      19      45      45      6
        INDEX_CN_BIG.put("159966", "指数-大盘             ");//创业板价值ETF         市值：4.84      累涨：26.62     4.46      15.07     7.09      10日：2.67      2.45      0.88      1.10      41        累涨修正：33.5      净值区间：92      88      58      86      56      7
        INDEX_CN_BIG.put("562060", "指数-大盘             ");//标普红利ETF           市值：14.88     累涨：20.52     5.93      5.70      8.89      10日：4.38      3.39      2.40      -0.87     18        累涨修正：33.09     净值区间：69      76      86      93      93      8
        INDEX_CN_BIG.put("560500", "指数-大盘             ");//500质量成长ETF        市值：5.30      累涨：24.06     6.90      10.95     6.21      10日：3.21      2.78      1.28      0.95      40        累涨修正：32.61     净值区间：96      97      97      99      84      9
        INDEX_CN_BIG.put("159721", "指数-大盘             ");//深证100ETF永赢        市值：0.84      累涨：25.72     7.13      9.02      9.57      10日：2.64      1.99      1.06      0.26      40        累涨修正：32.47     净值区间：100     46      63      71      63      10
        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波ETF基金       市值：1.96      累涨：22.46     5.32      9.32      7.82      10日：3.61      2.26      1.75      -0.74     2         累涨修正：31.83     净值区间：59      69      82      92      92      11
        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.65      累涨：25.44     6.84      12.90     5.70      10日：1.83      1.51      0.99      -0.28     17        累涨修正：30.76     净值区间：47      12      18      59      55      12
        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：171.27    累涨：21.03     4.98      8.05      8.00      10日：3.56      2.34      1.90      -0.77     8         累涨修正：30.73     净值区间：58      67      82      92      92      13
        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.73      累涨：20.78     4.82      8.28      7.68      10日：3.42      2.33      1.74      -0.66     15        累涨修正：30.01     净值区间：53      53      59      79      79      14
        INDEX_CN_BIG.put("562530", "指数-大盘             ");//中证1000价值ETF       市值：0.50      累涨：20.44     6.41      7.94      6.09      10日：3.38      2.51      1.64      -0.51     49        累涨修正：29.61     净值区间：69      76      79      93      85      15
        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：8.15      累涨：19.97     4.99      6.91      8.07      10日：3.46      2.16      1.81      -0.68     28        累涨修正：29.21     净值区间：61      73      82      91      91      16
        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：16.77     累涨：19.87     4.79      7.26      7.82      10日：3.56      2.23      1.73      -0.74     25        累涨修正：29.12     净值区间：61      69      83      92      92      17
        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：5.09      累涨：22.12     5.13      9.99      7.00      10日：2.57      2.24      0.91      0.49      5         累涨修正：28.75     净值区间：85      71      51      85      57      18
        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：3.34      累涨：23.41     6.24      10.11     7.06      10日：2.03      1.60      0.80      0.44      3         累涨修正：28.64     净值区间：86      41      40      79      61      19
        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.04      累涨：23.35     4.25      10.52     8.58      10日：2.06      1.69      0.75      -0.46     21        累涨修正：28.6      净值区间：41      57      32      41      41      20
        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：0.64      累涨：22.03     5.80      10.05     6.18      10日：2.19      2.04      1.00      0.33      13        累涨修正：28.26     净值区间：92      90      76      93      74      21
        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.12      累涨：22.08     6.30      7.37      8.41      10日：3.13      1.52      0.65      0.42      11        累涨修正：28.03     净值区间：86      45      39      77      36      22
        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：1.95      累涨：23.21     6.35      9.80      7.06      10日：1.91      1.40      0.70      0.35      10        累涨修正：27.92     净值区间：89      38      39      79      62      23
        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：1.94      累涨：21.80     5.33      9.77      6.70      10日：2.49      2.04      0.74      0.55      7         累涨修正：27.81     净值区间：91      72      55      86      59      24
        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.54      累涨：22.78     8.53      6.96      7.29      10日：2.49      0.94      0.73      0.31      33        累涨修正：27.67     净值区间：43      43      24      52      52      25
        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：2.44      累涨：19.36     4.78      7.17      7.41      10日：2.96      2.21      1.56      -0.64     33        累涨修正：27.65     净值区间：60      68      83      92      92      26
        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.71      累涨：22.04     5.88      9.05      7.11      10日：2.23      1.62      0.72      0.44      4         累涨修正：27.33     净值区间：89      44      37      78      46      27
        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.65      累涨：19.66     5.84      8.84      4.98      10日：2.64      2.39      1.32      0.50      32        累涨修正：27.33     净值区间：100     100     93      98      75      28
        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：63.20     累涨：21.71     5.85      8.53      7.33      10日：2.26      1.67      0.72      0.49      6         累涨修正：27.08     净值区间：86      44      40      78      58      29
        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.34      累涨：21.65     5.66      8.96      7.03      10日：2.26      1.58      0.69      0.31      12        累涨修正：26.87     净值区间：88      41      32      74      56      30
        INDEX_CN_BIG.put("512360", "指数-大盘             ");//MSCI中国A股ETF基金    市值：0.63      累涨：22.19     5.63      9.60      6.96      10日：1.51      1.51      0.82      0.27      23        累涨修正：26.85     净值区间：47      21      39      68      68      31
        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.16      累涨：21.13     5.25      8.81      7.07      10日：2.21      1.69      0.89      0.44      16        累涨修正：26.81     净值区间：89      44      13      48      47      32
        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.22      累涨：20.74     5.48      8.69      6.57      10日：2.34      1.91      0.88      0.58      14        累涨修正：26.75     净值区间：96      68      54      86      56      33
        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：4.91      累涨：23.23     5.49      12.13     5.61      10日：1.37      0.84      0.63      -0.21     43        累涨修正：26.7      净值区间：70      71      75      46      46      34
        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：1.13      累涨：20.35     6.11      7.27      6.97      10日：2.70      1.40      1.10      -0.89     20        累涨修正：26.65     净值区间：27      30      58      80      80      35
        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.66      累涨：21.86     6.08      9.07      6.71      10日：1.47      1.26      0.84      0.21      43        累涨修正：26.27     净值区间：84      46      21      57      57      36
        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.37      累涨：21.40     6.53      8.09      6.78      10日：2.26      1.44      0.36      0.48      9         累涨修正：25.82     净值区间：77      33      41      81      67      37
        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.35      累涨：19.43     4.47      8.95      6.01      10日：2.42      1.84      1.06      0.00      35        累涨修正：25.81     净值区间：100     100     68      92      72      38
        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.66      累涨：20.28     4.68      7.76      7.84      10日：2.36      1.18      0.98      0.10      37        累涨修正：25.78     净值区间：76      77      59      80      80      39
        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.35      累涨：21.43     6.50      7.94      6.99      10日：2.57      0.82      0.41      0.31      35        累涨修正：25.64     净值区间：100     43      35      74      74      40
        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.49      累涨：19.26     4.99      7.69      6.58      10日：2.34      1.78      1.12      -0.65     29        累涨修正：25.62     净值区间：46      48      69      86      86      41
        INDEX_CN_BIG.put("159617", "指数-大盘             ");//500价值ETF            市值：0.35      累涨：18.85     5.38      7.73      5.74      10日：2.46      2.37      0.96      -0.35     75        累涨修正：25.6      净值区间：54      71      76      90      80      42
        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：4.18      累涨：19.70     5.96      7.55      6.19      10日：2.55      1.51      0.85      -0.47     22        累涨修正：25.46     净值区间：33      22      45      79      79      43
        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.52      累涨：21.46     5.28      10.20     5.98      10日：1.88      1.29      0.39      -0.69     36        累涨修正：25.41     净值区间：36      59      66      79      79      44
        INDEX_CN_BIG.put("562330", "指数-大盘             ");//中证500价值ETF        市值：0.15      累涨：19.56     5.98      8.00      5.58      10日：2.16      1.85      0.92      -0.20     76        累涨修正：25.41     净值区间：85      89      90      96      68      45
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.58      累涨：21.15     6.68      7.53      6.94      10日：2.22      1.19      0.40      0.52      19        累涨修正：25.36     净值区间：91      36      42      80      65      46
        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：39.18     累涨：18.75     4.88      7.69      6.18      10日：2.65      2.17      0.84      0.24      30        累涨修正：25.25     净值区间：100     100     100     100     100     47
        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.48      累涨：20.32     6.05      7.57      6.70      10日：2.00      1.46      0.73      0.36      24        累涨修正：25.24     净值区间：89      40      36      78      56      48
        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：2.66      累涨：21.01     3.59      11.83     5.59      10日：1.79      1.24      0.55      -0.14     59        累涨修正：25.14     净值区间：57      69      78      94      93      49
        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.63      累涨：20.03     6.41      7.98      5.64      10日：2.04      1.50      0.75      -0.20     34        累涨修正：25.07     净值区间：76      59      64      91      91      50
        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：26.32     累涨：20.60     6.62      7.90      6.08      10日：1.52      1.40      0.76      0.50      42        累涨修正：25.04     净值区间：100     71      70      92      77      51
        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.51      累涨：20.28     5.81      7.37      7.10      10日：2.07      1.49      0.60      0.74      26        累涨修正：25.04     净值区间：100     52      34      61      58      52
        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：6.86      累涨：19.25     5.12      8.40      5.73      10日：2.23      1.30      0.94      -0.65     42        累涨修正：24.66     净值区间：47      42      55      86      86      53
        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：0.87      累涨：20.29     4.59      8.91      6.79      10日：1.64      0.95      0.86      -0.26     50        累涨修正：24.6      净值区间：50      48      65      87      87      54
        INDEX_CN_BIG.put("159351", "指数-大盘             ");//A500指数ETF           市值：148.45    累涨：20.51     4.87      9.93      5.71      10日：1.87      1.36      0.42      0.31      77        累涨修正：24.58     净值区间：86      46      36      82      67      55
        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.41      累涨：19.85     5.87      8.22      5.76      10日：2.20      1.65      0.44      0.65      27        累涨修正：24.58     净值区间：95      96      98      99      99      56
        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.21      累涨：19.77     7.08      6.55      6.14      10日：2.05      1.85      0.41      0.82      31        累涨修正：24.49     净值区间：89      69      41      73      46      57
        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：200.41    累涨：18.24     5.55      6.39      6.30      10日：2.47      1.51      1.09      -0.57     41        累涨修正：24.4      净值区间：52      46      66      85      85      58
        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：20.84     累涨：18.64     4.96      7.58      6.10      10日：2.06      1.87      0.84      0.09      40        累涨修正：24.25     净值区间：89      90      80      95      90      59
        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.48      累涨：18.29     4.10      7.83      6.36      10日：2.37      1.55      1.00      -0.64     39        累涨修正：24.21     净值区间：39      50      67      88      88      60
        INDEX_CN_BIG.put("159352", "指数-大盘             ");//中证A500ETF南方       市值：167.47    累涨：20.02     5.04      9.32      5.66      10日：1.72      1.32      0.51      0.30      79        累涨修正：24.08     净值区间：81      50      39      83      68      61
        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：15.74     累涨：17.80     5.27      6.12      6.41      10日：2.70      1.45      1.04      -0.83     43        累涨修正：24.03     净值区间：40      33      58      79      79      62
        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：16.01     累涨：18.37     5.31      6.89      6.17      10日：2.43      1.69      0.74      -0.10     38        累涨修正：23.97     净值区间：80      84      91      97      77      63
        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：39.68     累涨：20.43     6.40      7.39      6.64      10日：1.68      0.84      0.48      0.12      45        累涨修正：23.91     净值区间：71      31      35      79      74      64
        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：90.51     累涨：17.78     5.00      6.84      5.94      10日：2.36      1.39      1.18      -0.62     49        累涨修正：23.89     净值区间：45      48      69      88      88      65
        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.09      累涨：21.89     7.52      7.74      6.63      10日：1.28      0.19      0.19      0.00      64        累涨修正：23.74     净值区间：40      10      10      73      67      66
        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.61      累涨：21.13     6.54      8.71      5.88      10日：1.37      0.79      0.20      0.49      55        累涨修正：23.69     净值区间：44      44      46      81      81      67
        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.43      累涨：20.39     6.62      7.97      5.80      10日：1.64      0.73      0.41      -0.13     53        累涨修正：23.58     净值区间：51      19      41      55      55      68
        INDEX_CN_BIG.put("563360", "指数-大盘             ");//中证A500ETF基金       市值：87.65     累涨：19.62     4.92      9.37      5.33      10日：1.81      1.31      0.40      0.50      83        累涨修正：23.54     净值区间：88      54      42      85      69      69
        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.61      累涨：20.91     6.18      8.58      6.15      10日：1.35      0.68      0.29      0.39      60        累涨修正：23.52     净值区间：30      30      30      75      46      70
        INDEX_CN_BIG.put("159338", "指数-大盘             ");//中证A500ETF           市值：202.50    累涨：19.20     5.51      8.05      5.64      10日：1.82      1.40      0.54      0.32      78        累涨修正：23.5      净值区间：86      48      38      82      68      71
        INDEX_CN_BIG.put("563860", "指数-大盘             ");//A500ETF海富通         市值：9.55      累涨：19.93     5.06      9.71      5.16      10日：1.52      1.02      0.51      0.30      94        累涨修正：23.49     净值区间：80      48      38      83      69      72
        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：0.93      累涨：19.73     5.67      8.42      5.64      10日：2.43      0.75      0.28      0.19      46        累涨修正：23.47     净值区间：53      7       7       35      35      73
        INDEX_CN_BIG.put("512050", "指数-大盘             ");//A500ETF基金           市值：162.45    累涨：19.16     5.13      8.59      5.44      10日：1.82      1.40      0.54      0.32      80        累涨修正：23.46     净值区间：80      48      38      82      67      74
        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：7.36      累涨：18.29     5.46      6.57      6.26      10日：1.85      1.51      0.81      0.11      44        累涨修正：23.27     净值区间：94      68      65      89      85      75
        INDEX_CN_BIG.put("560610", "指数-大盘             ");//A500指数ETF           市值：101.04    累涨：19.08     4.90      8.43      5.75      10日：1.81      1.28      0.53      0.32      82        累涨修正：23.23     净值区间：81      50      41      83      68      76
        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.01      累涨：17.67     4.77      5.35      7.55      10日：2.33      1.20      1.00      -0.53     58        累涨修正：23.2      净值区间：52      47      66      86      86      77
        INDEX_CN_BIG.put("563880", "指数-大盘             ");//中证A500指数ETF       市值：55.04     累涨：19.17     5.12      8.69      5.36      10日：1.66      1.25      0.52      0.41      86        累涨修正：23.12     净值区间：87      50      39      83      68      78
        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：60.96     累涨：18.04     4.27      8.33      5.44      10日：2.03      1.28      0.87      -0.54     65        累涨修正：23.09     净值区间：52      56      70      90      90      79
        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：10.02     累涨：20.37     6.53      7.53      6.31      10日：1.35      0.62      0.37      0.12      68        累涨修正：23.08     净值区间：77      31      35      80      75      80
        INDEX_CN_BIG.put("159358", "指数-大盘             ");//中证A500ETF基金       市值：25.26     累涨：19.44     4.78      9.17      5.49      10日：1.50      1.10      0.50      0.30      91        累涨修正：23.04     净值区间：87      50      37      82      68      81
        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：46.88     累涨：20.80     6.33      8.50      5.97      10日：1.21      0.49      0.25      0.37      83        累涨修正：23        净值区间：92      33      35      80      75      82
        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：1.67      累涨：19.36     5.42      7.53      6.41      10日：1.28      0.80      0.72      -0.32     90        累涨修正：22.88     净值区间：62      52      60      86      86      83
        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：70.50     累涨：19.78     7.13      6.35      6.30      10日：1.39      0.79      0.44      0.00      79        累涨修正：22.84     净值区间：63      24      36      78      71      84
        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.37      累涨：19.38     5.98      7.24      6.16      10日：1.46      0.95      0.52      0.09      62        累涨修正：22.83     净值区间：89      54      22      48      48      85
        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.80      累涨：18.88     5.32      7.98      5.58      10日：1.74      1.13      0.52      0.00      54        累涨修正：22.79     净值区间：77      44      36      83      70      86
        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：10.51     累涨：19.55     6.67      6.36      6.52      10日：1.67      0.89      0.27      0.09      57        累涨修正：22.65     净值区间：59      24      33      77      70      87
        INDEX_CN_BIG.put("159356", "指数-大盘             ");//A500ETF基金           市值：52.94     累涨：18.85     4.88      8.57      5.40      10日：1.84      1.34      0.31      0.51      85        累涨修正：22.65     净值区间：87      50      39      83      68      88
        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.14      累涨：18.00     5.65      6.36      5.99      10日：1.91      1.28      0.73      0.00      52        累涨修正：22.65     净值区间：69      26      24      77      59      89
        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：2.42      累涨：19.60     5.36      9.26      4.98      10日：1.56      0.88      0.29      0.20      86        累涨修正：22.62     净值区间：61      44      35      84      80      90
        INDEX_CN_BIG.put("563220", "指数-大盘             ");//中证A500ETF富国       市值：162.02    累涨：18.91     5.10      8.19      5.62      10日：1.63      1.23      0.41      0.41      84        累涨修正：22.59     净值区间：87      50      39      83      68      91
        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：0.96      累涨：19.54     4.63      7.86      7.05      10日：1.40      0.63      0.49      -0.21     99        累涨修正：22.55     净值区间：60      38      65      86      86      92
        INDEX_CN_BIG.put("560350", "指数-大盘             ");//中证A50ETF指数基金    市值：27.90     累涨：20.46     6.80      7.72      5.94      10日：1.16      0.54      0.18      0.18      96        累涨修正：22.52     净值区间：63      24      35      78      71      93
        INDEX_CN_BIG.put("562890", "指数-大盘             ");//中证A50指数ETF        市值：4.35      累涨：20.02     6.82      7.21      5.99      10日：1.41      0.54      0.27      0.09      84        累涨修正：22.51     净值区间：63      24      32      77      71      94
        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.70      累涨：18.56     5.30      7.82      5.44      10日：1.58      0.84      0.75      -0.28     100       累涨修正：22.48     净值区间：11      16      26      63      63      95
        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.43      累涨：18.30     5.67      7.86      4.77      10日：1.52      1.22      0.71      0.20      71        累涨修正：22.46     净值区间：93      61      50      86      80      96
        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.47      累涨：19.69     5.40      8.71      5.58      10日：1.81      0.43      0.26      0.09      77        累涨修正：22.45     净值区间：48      16      16      57      46      97
        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.32      累涨：18.62     4.68      7.84      6.10      10日：1.50      1.00      0.66      -0.08     95        累涨修正：22.44     净值区间：67      67      67      87      85      98
        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：48.80     累涨：20.00     6.95      7.01      6.04      10日：1.30      0.61      0.26      0.18      97        累涨修正：22.43     净值区间：56      22      35      78      71      99
        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.10      累涨：19.61     5.87      7.39      6.35      10日：1.41      0.85      0.28      0.19      67        累涨修正：22.43     净值区间：64      32      32      60      60      100
        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.32      累涨：16.78     3.97      7.19      5.62      10日：1.95      1.56      1.07      0.05      73        累涨修正：22.43     净值区间：58      60      61      84      60      101
        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：17.61     累涨：20.27     6.77      7.40      6.10      10日：1.25      0.54      0.18      0.00      93        累涨修正：22.42     净值区间：50      20      30      74      66      102
        INDEX_CN_BIG.put("159362", "指数-大盘             ");//A500ETF工银           市值：23.40     累涨：18.86     4.77      8.90      5.19      10日：1.53      1.13      0.41      0.41      101       累涨修正：22.34     净值区间：88      54      42      84      68      103
        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.27      累涨：19.58     6.21      7.25      6.12      10日：1.45      0.73      0.27      0.09      74        累涨修正：22.3      净值区间：86      40      60      87      81      104
        INDEX_CN_BIG.put("563800", "指数-大盘             ");//中证A500ETF龙头       市值：180.09    累涨：18.87     4.90      8.54      5.43      10日：1.49      1.07      0.43      0.32      97        累涨修正：22.29     净值区间：80      48      38      82      67      105
        INDEX_CN_BIG.put("159339", "指数-大盘             ");//A500ETF               市值：58.83     累涨：18.98     4.93      8.68      5.37      10日：1.48      0.96      0.43      0.42      99        累涨修正：22.28     净值区间：86      48      39      83      68      106
        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：2.69      累涨：18.99     4.47      9.95      4.57      10日：1.42      1.02      0.41      0.20      127       累涨修正：22.25     净值区间：91      45      43      86      82      107
        INDEX_CN_BIG.put("159359", "指数-大盘             ");//中证A500ETF华安       市值：28.53     累涨：18.49     4.64      8.29      5.56      10日：1.62      1.12      0.51      0.30      96        累涨修正：22.25     净值区间：80      46      38      83      68      108
        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：1.08      累涨：18.08     5.02      7.61      5.45      10日：2.32      1.01      0.40      0.00      66        累涨修正：22.21     净值区间：80      38      38      65      65      109
        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：34.69     累涨：20.32     7.23      7.31      5.78      10日：1.04      0.44      0.18      0.00      123       累涨修正：22.16     净值区间：53      21      33      77      69      110
        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：0.99      累涨：18.46     4.75      9.31      4.40      10日：1.76      1.28      0.32      0.08      72        累涨修正：22.14     净值区间：41      48      48      79      79      111
        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：24.75     累涨：19.98     6.53      7.59      5.86      10日：1.06      0.54      0.27      -0.09     110       累涨修正：22.12     净值区间：44      19      29      74      68      112
        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.24      累涨：20.15     5.97      8.50      5.68      10日：1.28      0.38      0.15      -0.30     103       累涨修正：22.11     净值区间：64      31      51      82      82      113
        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：1.86      累涨：19.71     6.61      7.44      5.66      10日：1.27      0.69      0.20      0.10      105       累涨修正：22.07     净值区间：77      36      16      55      55      114
        INDEX_CN_BIG.put("563500", "指数-大盘             ");//中证A500ETF华宝       市值：13.75     累涨：17.84     5.07      7.57      5.20      10日：1.91      1.31      0.50      0.20      89        累涨修正：22.06     净值区间：75      48      32      80      66      115
        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：29.54     累涨：18.85     6.91      7.66      4.28      10日：1.47      0.99      0.37      -0.43     76        累涨修正：22.05     净值区间：5       2       2       71      55      116
        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1944.76   累涨：18.40     5.43      7.22      5.75      10日：1.56      1.11      0.48      0.28      69        累涨修正：22.03     净值区间：87      50      46      83      73      117
        INDEX_CN_BIG.put("159357", "指数-大盘             ");//中证A500指数ETF       市值：38.69     累涨：18.40     4.75      8.41      5.24      10日：1.61      1.21      0.40      0.40      100       累涨修正：22.02     净值区间：86      48      39      84      68      118
        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.31      累涨：17.62     4.53      7.28      5.81      10日：1.61      1.23      0.77      0.46      82        累涨修正：22        净值区间：84      30      32      75      68      119
        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：32.07     累涨：20.04     6.28      7.93      5.83      10日：1.08      0.36      0.24      0.24      115       累涨修正：21.96     净值区间：77      30      32      78      73      120
        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利100ETF            市值：0.75      累涨：16.60     4.56      6.51      5.53      10日：2.22      1.35      0.87      -0.38     95        累涨修正：21.91     净值区间：81      61      61      85      85      121
        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：86.95     累涨：17.25     5.22      6.46      5.57      10日：2.07      1.19      0.67      -0.44     80        累涨修正：21.85     净值区间：55      44      58      85      85      122
        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2633.48   累涨：18.51     5.49      7.42      5.60      10日：1.45      0.98      0.42      0.26      88        累涨修正：21.78     净值区间：83      49      45      82      69      123
        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：10.92     累涨：19.52     6.83      6.74      5.95      10日：1.16      0.54      0.27      0.09      124       累涨修正：21.76     净值区间：56      21      30      77      70      124
        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：10.69     累涨：17.85     5.03      7.00      5.82      10日：1.66      1.15      0.52      0.31      78        累涨修正：21.7      净值区间：81      50      46      83      74      125
        INDEX_CN_BIG.put("159386", "指数-大盘             ");//A500ETF永赢           市值：1.82      累涨：18.43     4.58      8.78      5.07      10日：1.42      1.02      0.41      0.51      109       累涨修正：21.69     净值区间：47      47      44      83      69      126
        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：5.62      累涨：18.81     5.18      8.63      5.00      10日：1.30      0.90      0.30      0.50      131       累涨修正：21.61     净值区间：100     57      46      87      82      127
        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.29      累涨：18.08     6.70      7.15      4.23      10日：1.41      1.03      0.52      -0.39     116       累涨修正：21.56     净值区间：10      5       4       73      58      128
        INDEX_CN_BIG.put("515330", "指数-大盘             ");//沪深300ETF天弘        市值：93.65     累涨：17.78     5.28      6.87      5.63      10日：1.57      1.11      0.55      0.18      92        累涨修正：21.56     净值区间：81      46      46      83      73      129
        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：5.93      累涨：18.52     5.67      7.28      5.57      10日：1.37      0.78      0.40      -0.19     130       累涨修正：21.47     净值区间：50      27      28      79      79      130
        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：23.71     累涨：18.27     5.53      7.12      5.62      10日：1.38      0.96      0.43      0.21      117       累涨修正：21.47     净值区间：83      32      29      77      66      131
        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：2.24      累涨：18.03     5.10      7.38      5.55      10日：1.46      0.98      0.49      0.24      113       累涨修正：21.45     净值区间：63      63      63      81      76      132
        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：70.90     累涨：16.90     5.02      6.48      5.40      10日：1.90      1.18      0.72      -0.39     106       累涨修正：21.42     净值区间：57      45      59      85      85      133
        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.11      累涨：16.37     4.74      5.75      5.88      10日：1.99      1.41      0.82      0.23      85        累涨修正：21.41     净值区间：96      73      64      83      67      134
        INDEX_CN_BIG.put("159353", "指数-大盘             ");//中证A500ETF景顺       市值：129.52    累涨：17.83     4.78      7.64      5.41      10日：1.56      1.15      0.42      0.31      102       累涨修正：21.38     净值区间：79      44      33      82      68      135
        INDEX_CN_BIG.put("159380", "指数-大盘             ");//A500ETF东财           市值：5.22      累涨：17.78     4.28      7.86      5.64      10日：1.65      1.17      0.39      0.49      92        累涨修正：21.38     净值区间：87      52      37      79      66      136
        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.82      累涨：17.59     5.26      7.42      4.91      10日：1.81      1.36      0.30      0.15      75        累涨修正：21.36     净值区间：79      67      67      88      82      137
        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.92      累涨：17.31     4.04      7.86      5.41      10日：1.94      1.08      0.50      0.14      91        累涨修正：21.33     净值区间：73      60      31      65      51      138
        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：18.09     累涨：19.43     6.83      7.31      5.29      10日：1.15      0.58      0.08      0.17      141       累涨修正：21.32     净值区间：65      33      43      79      79      139
        INDEX_CN_BIG.put("159360", "指数-大盘             ");//中证A500ETF天弘       市值：32.82     累涨：18.19     4.32      8.55      5.32      10日：1.51      1.01      0.30      0.60      106       累涨修正：21.31     净值区间：87      52      41      83      67      140
        INDEX_CN_BIG.put("560530", "指数-大盘             ");//中证A500ETF摩根       市值：78.58     累涨：17.86     4.64      7.74      5.48      10日：1.45      1.14      0.41      0.31      104       累涨修正：21.27     净值区间：80      46      38      82      65      141
        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：41.95     累涨：17.53     4.53      7.10      5.90      10日：1.75      1.03      0.47      0.47      101       累涨修正：21.25     净值区间：95      53      28      67      67      142
        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波ETF天弘       市值：38.17     累涨：16.49     4.09      7.15      5.25      10日：1.82      1.21      0.86      -0.43     129       累涨修正：21.24     净值区间：53      57      72      91      91      143
        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：5.63      累涨：17.67     3.98      7.98      5.71      10日：1.51      1.01      0.51      -0.42     102       累涨修正：21.21     净值区间：50      29      45      80      80      144
        INDEX_CN_BIG.put("560750", "指数-大盘             ");//A500ETF申万菱信       市值：1.26      累涨：17.46     4.82      7.23      5.41      10日：1.77      1.18      0.39      0.49      98        累涨修正：21.19     净值区间：100     54      44      85      71      145
        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：76.46     累涨：17.90     5.02      7.10      5.78      10日：1.46      0.98      0.42      0.28      108       累涨修正：21.18     净值区间：90      47      50      82      72      146
        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：6.97      累涨：17.41     4.62      7.89      4.90      10日：1.84      1.44      0.24      0.08      81        累涨修正：21.17     净值区间：71      65      58      88      81      147
        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.49      累涨：18.09     5.22      7.79      5.08      10日：1.32      0.91      0.42      0.49      138       累涨修正：21.16     净值区间：71      56      20      46      44      148
        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：38.42     累涨：18.00     5.30      7.18      5.52      10日：1.28      0.95      0.46      0.28      139       累涨修正：21.15     净值区间：82      50      45      83      74      149
        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：4.27      累涨：18.35     4.67      8.38      5.30      10日：1.30      0.82      0.33      0.49      145       累涨修正：21.13     净值区间：90      53      47      85      76      150
        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.23      累涨：17.89     4.96      7.30      5.63      10日：1.41      1.01      0.40      0.20      45        累涨修正：21.11     净值区间：83      37      37      80      70      151
        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：1.96      累涨：16.83     5.49      4.66      6.68      10日：2.16      0.98      0.56      0.19      63        累涨修正：21.09     净值区间：100     44      67      75      73      152
        INDEX_CN_BIG.put("159376", "指数-大盘             ");//A500ETF指数基金       市值：4.02      累涨：18.31     4.95      8.50      4.86      10日：1.36      0.78      0.29      0.19      108       累涨修正：21.03     净值区间：76      45      36      82      67      153
        INDEX_CN_BIG.put("560510", "指数-大盘             ");//中证A500ETF           市值：65.89     累涨：17.39     4.68      7.38      5.33      10日：1.60      1.18      0.43      0.32      105       累涨修正：21.03     净值区间：86      50      40      83      66      154
        INDEX_CN_BIG.put("530080", "指数-大盘             ");//上证180ETF天弘        市值：0.48      累涨：17.40     4.58      7.67      5.15      10日：1.56      1.08      0.49      0.10      119       累涨修正：21.02     净值区间：82      38      38      84      80      155
        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：6.73      累涨：16.86     4.12      7.30      5.44      10日：1.82      1.12      0.56      -0.07     114       累涨修正：20.92     净值区间：75      82      90      92      65      156
        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1639.66   累涨：18.83     6.53      6.82      5.48      10日：1.08      0.50      0.25      -0.04     157       累涨修正：20.91     净值区间：62      31      30      77      77      157
        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：2.82      累涨：17.90     5.30      7.21      5.39      10日：1.43      1.01      0.25      0.34      122       累涨修正：20.84     净值区间：81      46      36      83      71      158
        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：3.97      累涨：17.12     5.02      6.72      5.38      10日：1.47      1.09      0.58      0.19      132       累涨修正：20.84     净值区间：95      51      43      84      74      159
        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：17.95     累涨：18.12     3.96      9.44      4.72      10日：1.13      0.99      0.28      0.28      155       累涨修正：20.8      净值区间：89      69      41      82      62      160
        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：5.81      累涨：17.78     5.31      7.00      5.47      10日：1.36      0.91      0.36      0.36      140       累涨修正：20.77     净值区间：88      52      49      83      73      161
        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：35.92     累涨：17.39     4.91      6.67      5.81      10日：1.51      1.03      0.41      0.25      112       累涨修正：20.75     净值区间：83      47      46      81      73      162
        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.30      累涨：18.62     6.01      7.79      4.82      10日：1.03      0.63      0.23      0.29      149       累涨修正：20.74     净值区间：77      32      29      76      63      163
        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：1.89      累涨：17.86     5.29      7.01      5.56      10日：1.42      0.82      0.31      0.20      137       累涨修正：20.72     净值区间：85      35      31      77      65      164
        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1686.42   累涨：17.19     5.38      6.01      5.80      10日：1.45      1.08      0.50      0.27      109       累涨修正：20.72     净值区间：84      48      44      82      65      165
        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：5.74      累涨：17.12     5.18      6.23      5.71      10日：1.46      1.08      0.53      0.31      118       累涨修正：20.72     净值区间：86      46      40      82      74      166
        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：19.79     累涨：16.44     5.20      5.37      5.87      10日：1.83      1.22      0.61      -0.12     87        累涨修正：20.71     净值区间：75      45      48      82      74      167
        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：50.69     累涨：18.46     3.51      10.72     4.23      10日：1.04      0.88      0.16      0.32      168       累涨修正：20.7      净值区间：92      55      43      84      67      168
        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：7.77      累涨：17.50     4.08      7.35      6.07      10日：1.55      1.07      0.29      -0.48     94        累涨修正：20.7      净值区间：25      33      63      87      81      169
        INDEX_CN_BIG.put("512080", "指数-大盘             ");//A500ETF中金           市值：14.45     累涨：16.81     4.63      7.03      5.15      10日：1.49      1.20      0.60      0.39      110       累涨修正：20.7      净值区间：88      56      21      64      64      170
        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.42      累涨：17.39     4.63      7.42      5.34      10日：1.45      1.01      0.38      0.50      135       累涨修正：20.61     净值区间：100     56      41      85      73      171
        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.39      累涨：16.78     5.81      5.45      5.52      10日：1.53      1.34      0.48      0.00      98        累涨修正：20.61     净值区间：79      33      11      48      48      172
        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.10      累涨：17.01     5.46      6.13      5.42      10日：1.59      1.00      0.50      0.38      125       累涨修正：20.6      净值区间：88      51      42      78      64      173
        INDEX_CN_BIG.put("512020", "指数-大盘             ");//A500ETF指数           市值：37.39     累涨：16.96     4.03      7.49      5.44      10日：1.51      1.11      0.50      0.20      107       累涨修正：20.58     净值区间：86      48      46      83      68      174
        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF指数         市值：0.77      累涨：19.03     6.42      7.41      5.20      10日：0.89      0.27      0.18      0.00      159       累涨修正：20.55     净值区间：61      35      57      79      79      175
        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：9.16      累涨：16.82     4.86      6.07      5.89      10日：1.56      1.13      0.52      0.34      111       累涨修正：20.55     净值区间：89      52      48      83      71      176
        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.54      累涨：17.88     6.87      4.61      6.40      10日：1.07      0.97      0.29      0.39      104       累涨修正：20.5      净值区间：56      12      18      50      50      177
        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：3.70      累涨：17.68     6.08      6.02      5.58      10日：1.36      0.88      0.29      0.20      136       累涨修正：20.5      净值区间：86      36      38      77      65      178
        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：22.26     累涨：16.98     4.93      6.34      5.71      10日：1.51      1.04      0.48      0.30      128       累涨修正：20.49     净值区间：87      50      46      82      74      179
        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.74      累涨：17.17     4.87      6.76      5.54      10日：1.45      0.94      0.43      0.26      144       累涨修正：20.42     净值区间：87      50      38      82      67      180
        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：37.89     累涨：17.08     5.69      5.67      5.72      10日：1.39      1.03      0.46      0.23      120       累涨修正：20.42     净值区间：85      49      46      83      74      181
        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：205.29    累涨：17.35     5.35      7.42      4.58      10日：1.34      0.94      0.37      0.23      143       累涨修正：20.37     净值区间：91      47      38      83      67      182
        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.47      累涨：18.49     5.11      9.03      4.35      10日：1.03      0.28      0.28      -0.19     27        累涨修正：20.36     净值区间：21      13      36      73      72      183
        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：35.05     累涨：17.44     5.25      6.38      5.81      10日：1.35      0.97      0.29      0.29      134       累涨修正：20.34     净值区间：81      46      41      59      59      184
        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3806.85   累涨：16.98     5.39      5.93      5.66      10日：1.44      1.04      0.43      0.25      121       累涨修正：20.32     净值区间：84      49      45      82      73      185
        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：6.73      累涨：18.47     6.92      5.91      5.64      10日：1.11      0.34      0.17      0.17      158       累涨修正：20.26     净值区间：65      26      37      76      68      186
        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.83      累涨：16.68     4.70      7.25      4.73      10日：1.26      0.81      0.72      -0.27     180       累涨修正：20.19     净值区间：7       13      21      55      55      187
        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：9.82      累涨：16.33     4.56      6.46      5.31      10日：1.73      0.97      0.58      -0.38     148       累涨修正：20.19     净值区间：46      55      73      91      91      188
        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.42      累涨：17.52     5.50      6.46      5.56      10日：1.20      0.72      0.36      0.12      50        累涨修正：20.16     净值区间：88      33      38      78      66      189
        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：2.97      累涨：17.68     5.89      6.25      5.54      10日：1.25      0.58      0.29      0.20      160       累涨修正：20.09     净值区间：85      33      29      77      67      190
        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：2.06      累涨：16.98     5.30      6.09      5.59      10日：1.43      0.96      0.36      0.36      46        累涨修正：20.09     净值区间：100     41      33      83      74      191
        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：2.13      累涨：16.18     3.29      6.90      5.99      10日：1.94      0.97      0.48      -0.29     93        累涨修正：20.05     净值区间：50      47      73      90      90      192
        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.31      累涨：17.33     5.63      6.19      5.51      10日：1.40      0.65      0.32      0.22      49        累涨修正：20.02     净值区间：82      38      35      71      70      193
        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.85      累涨：16.89     5.07      6.40      5.42      10日：1.42      0.98      0.36      0.35      146       累涨修正：20.01     净值区间：83      48      44      82      69      194
        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：1.00      累涨：17.42     6.30      5.82      5.30      10日：1.19      0.70      0.30      0.20      169       累涨修正：19.91     净值区间：92      34      31      76      64      195
        INDEX_CN_BIG.put("159361", "指数-大盘             ");//A500ETF易方达         市值：143.16    累涨：16.68     4.79      6.78      5.11      10日：1.36      1.15      0.31      0.31      111       累涨修正：19.81     净值区间：73      44      34      82      68      196
        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.23      累涨：18.69     6.40      6.31      5.98      10日：0.84      0.12      0.06      0.24      156       累涨修正：19.77     净值区间：78      33      44      77      77      197
        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.48      累涨：16.83     5.25      6.13      5.45      10日：1.21      0.77      0.44      0.22      51        累涨修正：19.69     净值区间：100     68      60      88      87      198
        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：2.84      累涨：16.55     4.82      6.49      5.24      10日：1.43      0.85      0.40      0.25      166       累涨修正：19.63     净值区间：73      31      22      74      52      199
        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.43      累涨：17.08     4.09      8.00      4.99      10日：1.04      0.97      0.25      0.32      161       累涨修正：19.59     净值区间：89      69      46      85      61      200
        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.56      累涨：15.77     4.78      4.57      6.42      10日：1.85      1.17      0.39      -0.39     89        累涨修正：19.57     净值区间：33      52      65      88      82      201
        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：25.20     累涨：15.14     4.84      5.19      5.11      10日：1.85      1.17      0.68      -0.39     142       累涨修正：19.52     净值区间：58      48      54      86      86      202
        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：0.97      累涨：17.65     5.41      7.51      4.73      10日：1.31      0.37      0.09      0.00      26        累涨修正：19.51     净值区间：36      21      37      82      82      203
        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：1.84      累涨：17.71     5.99      6.21      5.51      10日：1.02      0.50      0.13      0.10      174       累涨修正：19.49     净值区间：71      35      44      77      77      204
        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：4.86      累涨：16.82     4.88      6.86      5.08      10日：1.17      0.86      0.31      0.39      177       累涨修正：19.47     净值区间：83      56      45      82      70      205
        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：0.85      累涨：15.93     4.25      5.26      6.42      10日：1.67      1.12      0.37      -0.56     107       累涨修正：19.46     净值区间：14      29      68      87      76      206
        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：0.94      累涨：16.91     3.91      7.34      5.66      10日：1.17      0.81      0.27      -0.09     171       累涨修正：19.43     净值区间：60      41      60      86      74      207
        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.28      累涨：16.89     4.87      5.87      6.15      10日：1.34      0.81      0.18      -0.09     151       累涨修正：19.4      净值区间：60      22      54      81      77      208
        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：54.70     累涨：16.76     3.92      8.05      4.79      10日：1.24      0.93      0.23      0.23      164       累涨修正：19.39     净值区间：92      57      46      86      66      209
        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：16.22     累涨：15.83     4.99      4.70      6.14      10日：1.70      0.90      0.45      0.45      126       累涨修正：19.33     净值区间：97      46      46      73      67      210
        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：1.99      累涨：18.19     6.31      7.01      4.87      10日：0.74      0.26      0.03      0.00      178       累涨修正：19.25     净值区间：49      31      32      77      76      211
        INDEX_CN_BIG.put("510800", "指数-大盘             ");//50ETF基金             市值：4.95      累涨：17.49     5.77      6.56      5.16      10日：0.88      0.40      0.24      0.08      181       累涨修正：19.25     净值区间：80      36      35      78      78      212
        INDEX_CN_BIG.put("159661", "指数-大盘             ");//中证A100指数ETF       市值：0.29      累涨：16.44     5.93      5.14      5.37      10日：1.31      0.79      0.35      0.27      162       累涨修正：19.24     净值区间：87      36      33      77      61      213
        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：33.14     累涨：16.24     3.62      7.63      4.99      10日：1.34      1.06      0.28      0.42      154       累涨修正：19.2      净值区间：95      80      52      84      62      214
        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.39      累涨：16.43     4.79      7.44      4.20      10日：1.37      0.79      0.30      0.00      172       累涨修正：19.19     净值区间：83      45      59      59      53      215
        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：1.11      累涨：16.74     3.88      7.84      5.02      10日：1.27      0.74      0.21      -0.13     175       累涨修正：19.17     净值区间：60      71      78      94      92      216
        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：28.07     累涨：16.58     3.49      8.67      4.42      10日：1.21      0.93      0.14      0.29      165       累涨修正：19        净值区间：80      50      41      86      67      217
        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：2.97      累涨：15.10     4.05      6.31      4.74      10日：1.40      1.23      0.61      0.26      170       累涨修正：18.95     净值区间：100     95      82      95      92      218
        INDEX_CN_BIG.put("159209", "指数-大盘             ");//中证红利质量ETF       市值：2.14      累涨：                    7.07      6.55      10日：2.20      1.70      0.70      -0.10     48        累涨修正：18.92     净值区间：78      79      91      96              219
        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF基金       市值：18.14     累涨：16.60     3.89      7.95      4.76      10日：0.98      0.91      0.21      0.42      176       累涨修正：18.91     净值区间：32      32      32      73      62      220
        INDEX_CN_BIG.put("512550", "指数-大盘             ");//A50ETF基金            市值：3.39      累涨：18.05     6.54      5.30      6.21      10日：0.78      0.07                0.26      152       累涨修正：18.9      净值区间：63      31      39      77      77      221
        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：0.99      累涨：17.31     6.84      5.25      5.22      10日：0.92      0.39      0.14      0.14      179       累涨修正：18.9      净值区间：74      37      34      74      81      222
        INDEX_CN_BIG.put("515300", "指数-大盘             ");//300红利低波ETF        市值：58.36     累涨：15.31     3.20      6.63      5.48      10日：1.78      0.64      0.50      -0.36     167       累涨修正：18.73     净值区间：14      10      53      81      81      223
        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.30      累涨：16.67     3.45      7.95      5.27      10日：1.08      0.28      0.24      0.20      183       累涨修正：18.51     净值区间：70      44      54      85      85      224
        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.55      累涨：15.82     5.93      4.76      5.13      10日：0.95      0.46      0.40      -0.03     186       累涨修正：18.03     净值区间：69      42      34      78      78      225
        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：1.56      累涨：15.20     4.72      6.07      4.41      10日：1.07      0.78      0.39      0.29      190       累涨修正：17.83     净值区间：86      55      56      63      60      226
        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：0.82      累涨：                    7.72      5.48      10日：1.30      1.30      0.50      0.00      133       累涨修正：16.8      净值区间：77      67      52      87              227
        INDEX_CN_BIG.put("563660", "指数-大盘             ");//A500ETF银河           市值：2.87      累涨：                    7.48      5.30      10日：1.33      1.03      0.41      0.41      153       累涨修正：15.96     净值区间：85      46      37      84              228
        INDEX_CN_BIG.put("159207", "指数-大盘             ");//高股息ETF             市值：3.74      累涨：                              7.20      10日：2.98      2.11      1.15      -0.57     47        累涨修正：14.59     净值区间：67      76      88                      229
        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：2.68      累涨：                    6.18      5.58      10日：1.27      0.86      0.34      0.34      182       累涨修正：14.57     净值区间：85      51      49      81              230
        INDEX_CN_BIG.put("159211", "指数-大盘             ");//深证100ETF富国        市值：0.16      累涨：                              7.50      10日：2.50      2.03      0.97      0.19      51        累涨修正：13.97     净值区间：88      39      31                      231
        INDEX_CN_BIG.put("563700", "指数-大盘             ");//红利价值ETF           市值：0.71      累涨：                              7.43      10日：2.73      1.56      1.07      -0.39     56        累涨修正：13.86     净值区间：67      71      85                      232
        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：42.84     累涨：117.98    106.46    6.16      5.36      10日：1.04      0.45      0.15      0.07      163       累涨修正：13.31     净值区间：65      34      36      77      95      233
        INDEX_CN_BIG.put("159216", "指数-大盘             ");//深证100ETF大成        市值：0.22      累涨：                              7.30      10日：2.16      1.70      0.66      0.47      61        累涨修正：12.48     净值区间：88      43      47                      234
        INDEX_CN_BIG.put("159212", "指数-大盘             ");//深100ETF南方          市值：1.25      累涨：                              7.10      10日：2.11      1.54      0.67      0.48      70        累涨修正：12.09     净值区间：89      42      43                      235
        INDEX_CN_BIG.put("159391", "指数-大盘             ");//大盘价值ETF           市值：0.23      累涨：                              7.00      10日：1.52      0.85      0.85      -0.28     147       累涨修正：11.07     净值区间：67      43      71                      236
        INDEX_CN_BIG.put("512250", "指数-大盘             ");//中证A50ETF招商        市值：0.14      累涨：                              6.45      10日：1.51      0.86      0.19      0.09      150       累涨修正：9.2       净值区间：15      15      25                      237
        INDEX_CN_BIG.put("159215", "指数-大盘             ");//中证A500ETF指数基金   市值：21.68     累涨：                              5.05      10日：1.52      1.22      0.61      0.30      173       累涨修正：9.01      净值区间：86      48      38      84              238
        INDEX_CN_BIG.put("560820", "指数-大盘             ");//中证A50ETF新华        市值：0.23      累涨：                              6.39      10日：1.24      0.48      0.29      0.19      184       累涨修正：8.69      净值区间：55      17      73                      239
        INDEX_CN_BIG.put("512240", "指数-大盘             ");//A50ETF龙头            市值：0.53      累涨：                              5.92      10日：1.29      0.60      0.30      0.10      185       累涨修正：8.41      净值区间：54      21      27      79              240
        INDEX_CN_BIG.put("159390", "指数-大盘             ");//A50指数ETF            市值：2.84      累涨：                              5.84      10日：1.22      0.57      0.29      0.19      187       累涨修正：8.21      净值区间：56      26      23                      241
        INDEX_CN_BIG.put("510320", "指数-大盘             ");//沪深300ETF中金        市值：4.81      累涨：                              5.47      10日：1.26      0.78      0.29      0.29      188       累涨修正：8.09      净值区间：92      59      51                      242
        INDEX_CN_BIG.put("563650", "指数-大盘             ");//中证A500龙头ETF       市值：3.09      累涨：                              5.08      10日：1.32      0.82      0.41      0.40      189       累涨修正：8.04      净值区间：85      46      40      85              243
        INDEX_CN_BIG.put("159379", "指数-大盘             ");//A500ETF融通           市值：5.25      累涨：                                        10日：                              0.99      112       累涨修正：0         净值区间：42      42      39      83      67      244
        INDEX_CN_BIG.put("563900", "指数-大盘             ");//沪深300自由现金流ETF  市值：1.86      累涨：                                        10日：1.46      0.49      0.29      -0.10               累涨修正：          净值区间：33      11      46                      245
        INDEX_CN_BIG.put("563060", "指数-大盘             ");//央企50ETF             市值：0.70      累涨：                                        10日：1.40      0.90      0.30      -0.30               累涨修正：          净值区间：79      61                              246
        INDEX_CN_BIG.put("159226", "指数-大盘             ");//中证A500增强ETF       市值：5.46      累涨：                                        10日：                    0.40      0.20                累涨修正：          净值区间：82                                      247
        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：77.49     累涨：                                        10日：                              -0.12               累涨修正：          净值区间：                                        248
        INDEX_CN_BIG.put("159219", "指数-大盘             ");//深证100ETF融通        市值：0.45      累涨：                                        10日：2.50      1.81      0.80      0.50                累涨修正：          净值区间：100     49                              249
        INDEX_CN_BIG.put("563550", "指数-大盘             ");//A500增强ETF摩根       市值：6.33      累涨：                                        10日：1.83      1.43      0.51      0.20                累涨修正：          净值区间：86      57                              250
        INDEX_CN_BIG.put("562080", "指数-大盘             ");//300现金流ETF          市值：1.73      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        251
        INDEX_CN_BIG.put("561750", "指数-大盘             ");//中证A50ETF博时        市值：3.05      累涨：                                        10日：                              0.10                累涨修正：          净值区间：                                        252
    }

    public static Map<String, String> INDEX_CN_CITY = new HashMap<>();//指数-国内城市

    static {
        INDEX_CN_CITY.put("159976", "指数-国内城市         ");//湾创ETF               市值：1.19      累涨：33.24     7.08      16.06     13.43     8.12      4.73      1
        INDEX_CN_CITY.put("512970", "指数-国内城市         ");//大湾区ETF             市值：0.75      累涨：29.62     9.03      14.23     9.72      6.35      4.34      2
        INDEX_CN_CITY.put("159623", "指数-国内城市         ");//成渝经济圈ETF         市值：32.83     累涨：29.66     7.39      17.26     8.94      5.74      3.04      3
        INDEX_CN_CITY.put("159743", "指数-国内城市         ");//湖北ETF               市值：1.57      累涨：40.34     12.22     20.84     14.69     5.67      2.86      4
        INDEX_CN_CITY.put("517160", "指数-国内城市         ");//长江保护主题ETF       市值：13.73     累涨：22.55     4.70      11.26     9.63      5.63      4.10      5
        INDEX_CN_CITY.put("512870", "指数-国内城市         ");//杭州湾区ETF           市值：0.41      累涨：33.69     11.23     17.08     12.09     5.51      3.32      6
        INDEX_CN_CITY.put("517330", "指数-国内城市         ");//长江保护ETF           市值：13.72     累涨：22.51     4.98      11.97     8.90      5.47      3.81      7
        INDEX_CN_CITY.put("515760", "指数-国内城市         ");//浙江国资ETF           市值：1.78      累涨：22.05     6.08      11.51     7.53      5.15      2.60      8
        INDEX_CN_CITY.put("517850", "指数-国内城市         ");//张江ETF               市值：0.63      累涨：47.34     14.21     25.01     15.55     5.06      2.61      9
        INDEX_CN_CITY.put("512650", "指数-国内城市         ");//长三角ETF             市值：3.94      累涨：25.38     7.56      13.08     9.40      5.01      3.10      10
        INDEX_CN_CITY.put("512190", "指数-国内城市         ");//浙商之江凤凰ETF       市值：0.61      累涨：19.24     6.80      9.42      7.09      3.58      2.79      15
        INDEX_CN_CITY.put("510810", "指数-国内城市         ");//上海国企ETF           市值：76.95     累涨：20.42     7.35      10.53     5.90      3.39      2.18      16
    }

    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_NOT_USA);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
        INDEX.putAll(INDEX_CN_CITY);
//        INDEX.putAll(INDEX_HK);
    }
    public static Map<String, String> TOP_INDEX = new HashMap<>();//指数-全部-etf

    static {
        TOP_INDEX.putAll(TOP_INDEX_CN_NOT);
        TOP_INDEX.putAll(TOP_INDEX_CN_NOT_USA);
        TOP_INDEX.putAll(TOP_INDEX_CN_BIG);
        TOP_INDEX.putAll(TOP_INDEX_CN_1000);
        TOP_INDEX.putAll(TOP_INDEX_688);
        TOP_INDEX.putAll(TOP_INDEX_300);
//        TOP_INDEX.putAll(TOP_INDEX_CN_CITY);
//        TOP_INDEX.putAll(INDEX_HK);
    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金
    public static Map<String, String> TOP_JINRONG_GOLD = new HashMap<>();

    static {
        TOP_JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：1.02      累涨：64.94     18.53     32.81     13.60     10日：10.08     4.53      3.98      -1.61     1         累涨修正：87.51     净值区间：54      54      72      73      73      1
    }

    static {
        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：1.02      累涨：64.94     18.53     32.81     13.60     10日：10.08     4.53      3.98      -1.61     1         累涨修正：87.51     净值区间：54      54      72      73      73      1
        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：42.24     累涨：61.50     16.50     31.55     13.45     10日：10.19     4.29      4.15      -1.59     2         累涨修正：84.28     净值区间：61      61      78      75      75      2
        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金股票ETF基金       市值：0.32      累涨：63.05     19.73     30.73     12.59     10日：9.86      3.96      3.52      -1.11     7         累涨修正：83.91     净值区间：59      61      76      76      76      3
        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：1.39      累涨：62.09     16.29     32.60     13.20     10日：9.82      4.16      3.89      -1.48     4         累涨修正：83.85     净值区间：58      58      74      71      71      4
        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：6.18      累涨：61.90     16.73     32.06     13.11     10日：10.05     3.98      3.91      -1.52     5         累涨修正：83.75     净值区间：63      63      77      75      75      5
        JINRONG_GOLD.put("518600", "金融-黄金             ");//上海金ETF             市值：19.54     累涨：44.86     9.46      20.49     14.91     10日：11.86     8.55      8.41      0.14      3         累涨修正：82.09     净值区间：95      95      96      75      80      6
        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.46      累涨：58.52     16.03     29.15     13.34     10日：10.10     4.07      3.90      -1.76     6         累涨修正：80.49     净值区间：57      57      75      74      74      7
        JINRONG_GOLD.put("518680", "金融-黄金             ");//金ETF                 市值：26.45     累涨：41.94     8.99      23.99     8.96      10日：5.96      2.57      2.43      0.10      12        累涨修正：55.33     净值区间：85      85      66      60      67      8
        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：9.73      累涨：38.96     9.22      20.71     9.03      10日：5.96      2.63      2.52      0.15      8         累涨修正：52.59     净值区间：86      75      68      56      64      9
        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：20.91     累涨：38.36     9.28      19.89     9.19      10日：5.95      2.46      2.35      0.12      9         累涨修正：51.47     净值区间：85      54      66      54      64      10
        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：45.40     累涨：37.88     9.14      19.76     8.98      10日：5.97      2.61      2.47      0.12      10        累涨修正：51.4      净值区间：86      86      66      55      64      11
        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：34.83     累涨：38.05     9.30      19.83     8.92      10日：5.91      2.55      2.43      0.13      14        累涨修正：51.37     净值区间：86      86      66      55      65      12
        JINRONG_GOLD.put("159831", "金融-黄金             ");//上海金ETF基金         市值：6.69      累涨：37.87     9.19      19.83     8.85      10日：5.92      2.49      2.44      0.12      18        累涨修正：51.16     净值区间：85      67      66      54      64      13
        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：262.09    累涨：37.83     9.12      19.78     8.93      10日：5.92      2.57      2.42      0.15      15        累涨修正：51.16     净值区间：86      86      66      55      64      14
        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：597.39    累涨：37.71     9.04      19.69     8.98      10日：5.94      2.55      2.43      0.12      17        累涨修正：51.06     净值区间：86      86      66      55      64      15
        JINRONG_GOLD.put("159834", "金融-黄金             ");//金ETF                 市值：9.95      累涨：37.41     9.19      19.32     8.90      10日：6.00      2.60      2.51      0.10      13        累涨修正：51.03     净值区间：84      84      66      56      65      16
        JINRONG_GOLD.put("518890", "金融-黄金             ");//中银上海金ETF         市值：19.90     累涨：37.44     9.09      19.25     9.10      10日：5.96      2.63      2.49      0.16      11        累涨修正：51.01     净值区间：73      43      62      55      64      17
        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：289.10    累涨：37.50     9.18      19.41     8.91      10日：5.94      2.61      2.45      0.12      16        累涨修正：50.95     净值区间：85      85      66      55      65      18
        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：183.04    累涨：37.68     9.15      19.61     8.92      10日：5.90      2.51      2.37      0.16      19        累涨修正：50.83     净值区间：87      87      66      58      65      19
        JINRONG_GOLD.put("159830", "金融-黄金             ");//上海金ETF             市值：14.25     累涨：37.61     9.20      19.53     8.88      10日：5.89      2.48      2.41      0.14      20        累涨修正：50.8      净值区间：86      82      66      57      65      20
    }

    public static Map<String, String> JINRONG_BANK = new HashMap<>();
    public static Map<String, String> TOP_JINRONG_BANK = new HashMap<>();

    static {
        TOP_JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：2.46      累涨：28.52     8.27      8.45      11.80     10日：5.25      2.62      2.62      -0.26     1         累涨修正：41.63     净值区间：75      76      89      94      94      2
    }

    static {
        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：16.04     累涨：28.71     6.62      10.24     11.85     10日：4.98      2.86      2.86      -0.74     2         累涨修正：42.27     净值区间：74      75      88      94      94      1
        JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：2.46      累涨：28.52     8.27      8.45      11.80     10日：5.25      2.62      2.62      -0.26     1         累涨修正：41.63     净值区间：75      76      89      94      94      2
        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.26      累涨：28.21     6.78      9.97      11.46     10日：4.82      2.55      2.55      -0.72     4         累涨修正：40.68     净值区间：57      59      72      84      84      3
        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：42.83     累涨：28.08     7.03      9.51      11.54     10日：4.73      2.57      2.57      -0.61     3         累涨修正：40.52     净值区间：69      69      85      92      92      4
        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：14.50     累涨：27.28     7.14      8.72      11.42     10日：4.68      2.70      2.70      -0.72     5         累涨修正：40.06     净值区间：69      70      85      93      93      5
        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：6.66      累涨：27.48     6.94      9.36      11.18     10日：4.53      2.54      2.54      -0.69     7         累涨修正：39.63     净值区间：67      68      84      92      92      6
        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF基金           市值：3.91      累涨：27.10     6.62      9.22      11.26     10日：4.59      2.53      2.53      -0.75     8         累涨修正：39.28     净值区间：65      67      84      92      92      7
        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：82.41     累涨：26.65     7.07      8.20      11.38     10日：4.66      2.54      2.54      -0.73     6         累涨修正：38.93     净值区间：66      67      84      92      92      8
        JINRONG_BANK.put("512730", "金融-银行             ");//中证银行ETF           市值：0.80      累涨：26.53     6.71      8.95      10.87     10日：4.43      2.42      2.42      -0.65     9         累涨修正：38.22     净值区间：63      64      82      91      85      9
        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：4.85      累涨：26.02     6.80      8.43      10.79     10日：4.04      2.21      2.21      -0.45     10        累涨修正：36.69     净值区间：71      72      87      93      93      10
    }

    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券
    public static Map<String, String> TOP_JINRONG_ZHENGQUAN = new HashMap<>();

    static {
        TOP_JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：76.43     累涨：43.00     11.75     16.35     14.90     10日：6.31      5.39      2.89      1.44      1         累涨修正：60.48     净值区间：87      89      91      96      80      1
    }

    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：76.43     累涨：43.00     11.75     16.35     14.90     10日：6.31      5.39      2.89      1.44      1         累涨修正：60.48     净值区间：87      89      91      96      80      1
        JINRONG_ZHENGQUAN.put("513140", "金融-证券             ");//港股金融ETF           市值：0.80      累涨：32.70     8.99      13.54     10.17     10日：3.08      2.49      1.75      0.50      6         累涨修正：41.77     净值区间：89      89      95      98      98      2
        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.34      累涨：27.60     8.02      8.94      10.64     10日：3.31      3.21      2.23      1.14      5         累涨修正：38.58     净值区间：98      98      59      75      56      3
        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.09      累涨：27.36     7.57      9.17      10.62     10日：3.36      3.24      2.03      0.82      3         累涨修正：38.02     净值区间：91      91      48      71      54      4
        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：294.52    累涨：26.91     7.47      9.18      10.26     10日：3.35      3.35      2.10      0.94      2         累涨修正：37.81     净值区间：87      87      48      70      53      5
        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：230.52    累涨：26.81     7.34      9.32      10.15     10日：3.30      3.30      2.09      0.98      4         累涨修正：37.59     净值区间：88      89      48      70      54      6
        JINRONG_ZHENGQUAN.put("513190", "金融-证券             ");//港股通金融ETF         市值：9.89      累涨：28.57     8.59      10.39     9.59      10日：2.77      2.24      1.91      0.71      16        累涨修正：37.4      净值区间：90      90      95      98      95      7
        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.49      累涨：27.04     7.65      9.29      10.10     10日：3.13      3.13      1.95      0.92      10        累涨修正：37.2      净值区间：91      91      49      71      55      8
        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：69.27     累涨：28.08     8.56      8.12      11.40     10日：2.90      2.77      1.71      0.91      15        累涨修正：37.17     净值区间：93      93      57      78      72      9
        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：9.99      累涨：26.59     7.25      9.19      10.15     10日：3.19      3.19      2.09      0.90      12        累涨修正：37.15     净值区间：88      88      48      70      54      10
        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：66.15     累涨：26.58     7.28      9.10      10.20     10日：3.20      3.20      2.03      0.85      9         累涨修正：37.04     净值区间：86      87      47      70      53      11
        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：3.65      累涨：26.40     7.53      9.33      9.54      10日：3.23      3.23      2.09      0.94      7         累涨修正：37.04     净值区间：88      88      50      72      56      12
        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：15.01     累涨：26.30     6.70      9.59      10.01     10日：3.24      3.24      2.06      0.88      8         累涨修正：36.9      净值区间：91      91      48      71      58      13
        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：17.68     累涨：26.36     7.14      9.18      10.04     10日：3.24      3.24      2.02      0.89      11        累涨修正：36.88     净值区间：90      90      47      71      54      14
        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：61.89     累涨：26.29     6.94      9.38      9.97      10日：3.17      3.17      2.00      1.04      14        累涨修正：36.63     净值区间：90      90      49      71      54      15
        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：7.75      累涨：25.94     6.94      9.11      9.89      10日：3.26      3.26      2.00      1.03      13        累涨修正：36.46     净值区间：91      91      48      71      55      16
        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：18.84     累涨：26.18     6.95      9.21      10.02     10日：3.03      3.03      1.86      1.14      18        累涨修正：35.96     净值区间：93      94      46      69      54      17
        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.75      累涨：25.87     6.91      9.04      9.92      10日：3.08      3.08      1.90      1.15      22        累涨修正：35.83     净值区间：95      95      52      73      56      18
        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：3.84      累涨：25.70     6.85      9.31      9.54      10日：3.00      3.00      1.99      0.78      24        累涨修正：35.68     净值区间：90      90      49      71      53      19
        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.46      累涨：24.96     6.73      9.53      8.70      10日：3.12      3.12      2.13      1.22      20        累涨修正：35.46     净值区间：94      94      60      79      59      20
        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.25      累涨：25.44     6.60      8.54      10.30     10日：3.04      3.04      1.88      0.92      21        累涨修正：35.28     净值区间：92      92      49      72      55      21
        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.71      累涨：25.93     7.72      7.51      10.70     10日：2.80      2.80      1.72      0.89      17        累涨修正：34.97     净值区间：92      92      52      75      65      22
        JINRONG_ZHENGQUAN.put("159940", "金融-证券             ");//金融地产ETF           市值：10.11     累涨：25.51     6.09      9.75      9.67      10日：3.34      2.57      1.62      -0.08     3         累涨修正：34.66     净值区间：85      86      79      91      91      23
        JINRONG_ZHENGQUAN.put("159933", "金融-证券             ");//国投金融地产ETF       市值：1.44      累涨：24.97     6.83      8.54      9.60      10日：3.38      2.31      1.84      0.21      1         累涨修正：34.34     净值区间：67      67      73      88      88      24
        JINRONG_ZHENGQUAN.put("159931", "金融-证券             ");//金融ETF               市值：0.58      累涨：24.42     6.78      7.47      10.17     10日：3.89      2.03      1.64      0.11      19        累涨修正：33.62     净值区间：88      89      69      85      84      25
        JINRONG_ZHENGQUAN.put("510650", "金融-证券             ");//金融地产ETF           市值：0.41      累涨：23.87     6.05      8.07      9.75      10日：3.24      1.92      1.92      0.11      8         累涨修正：32.87     净值区间：93      94      90      96      96      26
        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.85      累涨：23.44     5.47      10.50     7.47      10日：3.19      2.68      1.29      0.59      23        累涨修正：31.89     净值区间：100     100     83      95      61      27
        JINRONG_ZHENGQUAN.put("512640", "金融-证券             ");//金融地产ETF基金       市值：0.71      累涨：22.48     6.09      7.35      9.04      10日：2.82      2.08      1.69      0.17      9         累涨修正：30.76     净值区间：90      90      77      92      92      28
        JINRONG_ZHENGQUAN.put("510230", "金融-证券             ");//金融ETF               市值：48.14     累涨：21.92     5.74      6.74      9.44      10日：3.03      1.85      1.78      0.29      25        累涨修正：30.36     净值区间：90      90      88      95      95      29
    }

    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();
    public static Map<String, String> TOP_JINRONG_FANGDICHAN = new HashMap<>();

    static {
        TOP_JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：6.56      累涨：31.80     6.67      18.74     6.39      10日：2.84      2.05      1.10      0.16      2         累涨修正：38.89     净值区间：87      89      52      51      48      1
    }

    static {
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：6.56      累涨：31.80     6.67      18.74     6.39      10日：2.84      2.05      1.10      0.16      2         累涨修正：38.89     净值区间：87      89      52      51      48      1
        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：64.87     累涨：30.68     6.75      17.57     6.36      10日：2.55      1.95      0.97      0.07      5         累涨修正：37.12     净值区间：79      81      45      50      46      2
        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.11     累涨：25.51     6.09      9.75      9.67      10日：3.34      2.57      1.62      -0.08     3         累涨修正：34.66     净值区间：85      86      79      91      91      3
        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.44      累涨：24.97     6.83      8.54      9.60      10日：3.38      2.31      1.84      0.21      1         累涨修正：34.34     净值区间：67      67      73      88      88      4
        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.41      累涨：23.87     6.05      8.07      9.75      10日：3.24      1.92      1.92      0.11      8         累涨修正：32.87     净值区间：93      94      90      96      96      5
        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.52      累涨：24.32     7.25      12.08     4.99      10日：2.59      2.27      1.29      -0.48     4         累涨修正：31.76     净值区间：64      50      45      53      38      6
        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：5.33      累涨：24.38     6.76      12.18     5.44      10日：2.29      2.12      1.41      -0.52     6         累涨修正：31.61     净值区间：69      56      47      60      44      7
        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.52      累涨：23.64     6.97      12.16     4.51      10日：2.43      2.11      1.29      -0.48     7         累涨修正：30.76     净值区间：53      53      45      62      43      8
        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF基金       市值：0.71      累涨：22.48     6.09      7.35      9.04      10日：2.82      2.08      1.69      0.17      9         累涨修正：30.76     净值区间：90      90      77      92      92      9
        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.80      累涨：26.68     6.20      16.73     3.75      10日：1.22      1.22      0.35      0.17      11        累涨修正：29.82     净值区间：78      50      22      35      31      10
        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：6.54      累涨：25.40     5.13      16.68     3.59      10日：1.35      1.35      0.58      0.19      14        累涨修正：29.26     净值区间：86      43      21      32      29      11
        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.68      累涨：22.92     3.86      12.08     6.98      10日：2.17      1.08      0.10      -0.20     12        累涨修正：26.37     净值区间：7       32      63      88      88      12
        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.62      累涨：21.73     4.00      10.48     7.25      10日：2.91      1.24                -0.31     10        累涨修正：25.88     净值区间：30      45      67      87      87      13
        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：23.48     累涨：22.05     5.52      11.10     5.43      10日：1.63      1.16      0.29      0.00      13        累涨修正：25.42     净值区间：82      54      37      80      63      14
        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.65      累涨：21.29     3.67      8.87      8.75      10日：2.55      1.12      0.20      -0.10     15        累涨修正：25.36     净值区间：13      39      56      81      81      15
        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.54      累涨：20.65     5.82      10.04     4.79      10日：1.00      0.30      0.10      -0.41     17        累涨修正：22.15     净值区间：8       4       21      71      71      16
        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：0.94      累涨：18.21     3.92      9.94      4.35      10日：1.33      1.33      0.41      -0.20     16        累涨修正：21.69     净值区间：43      33      21      71      53      17
        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：5.30      累涨：17.62     3.60      9.28      4.74      10日：1.56      1.27      0.29      -0.10     18        累涨修正：21.03     净值区间：50      35      23      72      55      18
        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：0.53      累涨：19.93     6.01      9.75      4.17      10日：0.55      0.11                -0.11     19        累涨修正：20.59     净值区间：22      19      20      75      75      19
        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.51      累涨：18.45     5.84      8.81      3.80      10日：0.86      0.11                -0.33     20        累涨修正：19.42     净值区间：7       4       31      72      72      20
        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.05      累涨：                                        10日：                              -0.11     21        累涨修正：0         净值区间：46      35      20      73      55      21
    }

    public static Map<String, String> JINRONG_CASH = new HashMap<>();//金融-现金
    public static Map<String, String> TOP_JINRONG_CASH = new HashMap<>();

    static {
    }

    static {
        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：2.51      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        1
        JINRONG_CASH.put("563900", "金融-现金             ");//沪深300自由现金流ETF摩根市值：1.86      累涨：                                        10日：1.46      0.49      0.29      -0.10               累涨修正：          净值区间：33      11      46                      2
        JINRONG_CASH.put("563780", "金融-现金             ");//现金流全指ETF         市值：1.23      累涨：                                        10日：2.46      1.18                0.00                累涨修正：          净值区间：36      32                              3
        JINRONG_CASH.put("159221", "金融-现金             ");//现金流100ETF          市值：1.50      累涨：                                        10日：2.18      1.19      0.30      0.00                累涨修正：          净值区间：58      43                              4
        JINRONG_CASH.put("159233", "金融-现金             ");//自由现金流ETF基金     市值：6.52      累涨：                                        10日：                              -0.20               累涨修正：          净值区间：                                        5
        JINRONG_CASH.put("159232", "金融-现金             ");//现金流ETF南方         市值：6.00      累涨：                                        10日：                              -0.10               累涨修正：          净值区间：                                        6
        JINRONG_CASH.put("159229", "金融-现金             ");//自由现金流ETF广发     市值：0.68      累涨：                                        10日：3.46      1.09      0.10      -0.10               累涨修正：          净值区间：14      13                              7
        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：15.25     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        8
        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.71      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        9
        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.98      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        10
        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.24      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        11
        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.31      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        12
        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.90      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        13
        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：5.45      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        14
        JINRONG_CASH.put("561080", "金融-现金             ");//全指现金流ETF华安     市值：0.55      累涨：                                        10日：                              -0.10               累涨修正：          净值区间：                                        15
        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.20      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        16
        JINRONG_CASH.put("159225", "金融-现金             ");//现金流ETF基金         市值：0.58      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        17
        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：35.85     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        18
        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：                                        10日：                              -0.04               累涨修正：          净值区间：                                        19
        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：37.63     累涨：                                        10日：                              0.03                累涨修正：          净值区间：                                        20
        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：783.69    累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        21
        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.34      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        22
        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.40      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        23
        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.37      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        24
        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.66      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        25
        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：13.64     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        26
        JINRONG_CASH.put("159222", "金融-现金             ");//自由现金流ETF易方达   市值：5.58      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        27
        JINRONG_CASH.put("159235", "金融-现金             ");//中证现金流ETF         市值：4.37      累涨：                                        10日：                              -0.29               累涨修正：          净值区间：                                        28
        JINRONG_CASH.put("561870", "金融-现金             ");//自由现金流ETF全指     市值：1.83      累涨：                                        10日：3.03      1.37      0.20      -0.10               累涨修正：          净值区间：20      17                              29
        JINRONG_CASH.put("516460", "金融-现金             ");//现金流ETF800          市值：0.34      累涨：                                        10日：                              -0.39               累涨修正：          净值区间：                                        30
        JINRONG_CASH.put("159236", "金融-现金             ");//自由现金流ETF工银     市值：1.63      累涨：                                        10日：2.57      1.28      0.10      -0.30               累涨修正：          净值区间：15      13                              31
        JINRONG_CASH.put("563990", "金融-现金             ");//800现金流ETF          市值：1.18      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        32
        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：36.24     累涨：                                        10日：                              -0.10               累涨修正：          净值区间：                                        33
        JINRONG_CASH.put("563770", "金融-现金             ");//全指现金流ETF         市值：0.47      累涨：                                        10日：2.68      1.29                -0.10               累涨修正：          净值区间：21      17                              34
        JINRONG_CASH.put("563680", "金融-现金             ");//800自由现金流ETF      市值：0.46      累涨：                                        10日：2.36      1.08      0.10      -0.10               累涨修正：          净值区间：25      36                              35
        JINRONG_CASH.put("563830", "金融-现金             ");//全指现金流ETF基金     市值：0.95      累涨：                                        10日：          1.40      0.40      -0.30               累涨修正：          净值区间：15      17                              36
        JINRONG_CASH.put("563390", "金融-现金             ");//现金流ETF全指         市值：2.99      累涨：                                        10日：                              -0.29               累涨修正：          净值区间：                                        37
        JINRONG_CASH.put("562080", "金融-现金             ");//300现金流ETF          市值：1.73      累涨：                                        10日：                              -0.19               累涨修正：          净值区间：                                        38
        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：803.99    累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        39
        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.31      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        40
        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.29      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        41
        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.16      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        42
        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.35      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        43
        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.99      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        44
        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.52      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        45
        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.13      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        46
        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：11.17     累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        47
        JINRONG_CASH.put("511670", "金融-现金             ");//华泰天天金ETF         市值：0.16      累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        48
        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：109.89    累涨：                                        10日：                              0.00                累涨修正：          净值区间：                                        49
    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();

    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
    }

    public static Map<String, String> TOP_JINRONG = new HashMap<>();

    static {
        TOP_JINRONG.putAll(TOP_JINRONG_ZHENGQUAN);
        TOP_JINRONG.putAll(TOP_JINRONG_GOLD);
        TOP_JINRONG.putAll(TOP_JINRONG_BANK);
        TOP_JINRONG.putAll(TOP_JINRONG_FANGDICHAN);
        TOP_JINRONG.putAll(TOP_JINRONG_CASH);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }

    /**
     * TOP_BIZ
     */
    public static Map<String, String> TOP_BIZ = new HashMap<>();

    static {
        TOP_BIZ.putAll(TOP_XIAOFEI);
        TOP_BIZ.putAll(TOP_KEJI);
        TOP_BIZ.putAll(TOP_YILIAO);
        TOP_BIZ.putAll(TOP_JINRONG);
        TOP_BIZ.putAll(TOP_ZIYUAN);
    }

    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31 etf共收录：670
     * 2025-06-06 etf共收录：1068
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }

    /**
     *
     */
    public static Map<String, String> ETF_TOP_All = new HashMap<>();

    static {
        ETF_TOP_All.putAll(TOP_INDEX);
        ETF_TOP_All.putAll(TOP_BIZ);
    }


    /**
     * ETF涨幅数据：查询数据根据名称列表模糊查询
     */
    private static void findByTypeName(String date, List nameLikeList, List nameNoLikeList, String typeEn, String typeCn, Map<String, String> typeMap) {
//        String typeEn = "";
//        String typeCn = "";
        CondEtfAdrCount condition = new CondEtfAdrCount();
        condition.setDate(date);
        condition.setOrderBy(ADR_UP_SUM_1_60_DESC);
        condition.setLikeNameList(nameLikeList);
        condition.setNotLikeNameList(nameNoLikeList);

//
        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
//        EtfControl.saveOrUpdateListNetLastDay(condition, date, true);//保存或更新ETF涨幅次数-批量更新基础信息

        if (etfListLikeName == null) {
            System.out.println("数据为null");
        }
        int num = 0;//序号
        etfListLikeName = etfListLikeName.stream().filter(e -> e != null).sorted(Comparator.comparing(EtfAdrCountVo::getADR_UP_SUM_TOTAL, Comparator.nullsFirst(BigDecimal::compareTo)).reversed()).collect(Collectors.toList());

        System.out.println("    static {");
        for (EtfAdrCountVo vo : etfListLikeName) {
            StringBuffer sb = new StringBuffer();

            sb.append("        ");
            sb.append(typeEn + ".put(\"").append(StockUtil.formatStName(vo.getF12(), SIZE_6)).append("\"");
            sb.append(", \"" + StockUtil.formatStName(typeCn, SIZE_22) + "\");");
//            sb.append(", \"" + StockUtil.formatStName(vo.getF14(), SIZE_22) + "\");");
            sb.append("//");
            sb.append(StockUtil.formatStName(vo.getF14(), SIZE_22));
            sb.append(StockUtil.formatStName("市值：", SIZE_6));
            BigDecimal marketValue = null;
            if (vo.getF20() != null) {
                marketValue = vo.getF20().divide(NUM_YI_1, 2, BigDecimal.ROUND_HALF_UP);
            }
            sb.append(StockUtil.formatDouble(marketValue, SIZE_10));
            sb.append(StockUtil.formatStName("累涨：", SIZE_6));
            if (vo.getADR_UP_SUM_1_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_40_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_40_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_20_40() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_20_40().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_20() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_20().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatStName("10日：", SIZE_6));
            if (vo.getADR_UP_SUM_1_10() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_10().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_5() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_5().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_3() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_3().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getF3() != null) {
                sb.append(StockUtil.formatDouble(vo.getF3().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_ORDER_STAT(), SIZE_10));
            sb.append(StockUtil.formatStName("累涨修正：", SIZE_10));
//            sb.append(StockUtil.formatDouble(vo.getAdrUpSum_60_and_10c6(), SIZE_10));
            sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_TOTAL(), SIZE_10));

            sb.append(StockUtil.formatStName("净值区间：", SIZE_10));
            BigDecimal curArea = vo.getNET_AREA_DAY_5();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_10();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_20();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_40();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }
            curArea = vo.getNET_AREA_DAY_60();
            if (curArea != null) {
                sb.append(StockUtil.formatDouble(curArea.setScale(0, BigDecimal.ROUND_HALF_UP), SIZE_8));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_8));
            }

            sb.append(StockUtil.formatInt(++num, SIZE_6));


            System.out.println(sb);
        }
        System.out.println("    }");


    }

    public static void main(String[] args) {
        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
//        String date = "2025-06-05";

//        String name = "";
//        name = "INDEX_CN_NOT";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-外盘");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT, null, name, ContEtfTypeName.INDEX_CN_NOT, ContMapEtfAll.INDEX_CN_NOT);
//        name = "INDEX_CN_NOT_USA";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-外盘-美股");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_NOT_USA,  ContEtfNameKey.INDEX_CN_NOT_USA_NOLIKE, name, ContEtfTypeName.INDEX_CN_NOT_USA, ContMapEtfAll.INDEX_CN_NOT_USA);
//        name = "INDEX_CN_1000";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-中小盘");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_1000, ContEtfNameKey.INDEX_CN_1000_NOLIKE, name, ContEtfTypeName.INDEX_CN_1000, ContMapEtfAll.INDEX_CN_1000);
//        name = "INDEX_300";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-创业板");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_300, ContEtfNameKey.INDEX_300_NOLIKE, name, ContEtfTypeName.INDEX_300, ContMapEtfAll.INDEX_300);
//        name = "INDEX_688";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-科创板");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_688, ContEtfNameKey.INDEX_688_NOLIKE, name, ContEtfTypeName.INDEX_688, ContMapEtfAll.INDEX_688);
//        name = "INDEX_CN_BIG";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//指数-大盘");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.INDEX_CN_BIG, ContEtfNameKey.INDEX_CN_BIG_NOLIKE, name, ContEtfTypeName.INDEX_CN_BIG, ContMapEtfAll.INDEX_CN_BIG);

//        String name = "";
//        name = "KEJI_HK";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-香港");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_HK, null, name, ContEtfTypeName.KEJI_HK, ContMapEtfAll.KEJI_HK);
//        name = "KEJI_JUNGONG";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-军工");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_JUNGONG, null, name, ContEtfTypeName.KEJI_JUNGONG, ContMapEtfAll.KEJI_JUNGONG);
//        name = "KEJI_GONG_YE";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-通用");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_GONG_YE, ContEtfNameKey.KEJI_GONG_YE_NOLIKE, name, ContEtfTypeName.KEJI_GONG_YE, ContMapEtfAll.KEJI_GONG_YE);
//        name = "KEJI_RUAN_JIAN";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-软件");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_RUAN_JIAN, null, name, ContEtfTypeName.KEJI_RUAN_JIAN, ContMapEtfAll.KEJI_RUAN_JIAN);
//        name = "KEJI_XIN_PIAN";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-芯片");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_XIN_PIAN, null, name, ContEtfTypeName.KEJI_XIN_PIAN, ContMapEtfAll.KEJI_XIN_PIAN);
//        name = "KEJI_TONG_XIN";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_TONG_XIN, null, name, ContEtfTypeName.KEJI_TONG_XIN, ContMapEtfAll.KEJI_TONG_XIN);
//        name = "KEJI_NEW_ENERGY";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-新能源");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_ENERGY, null, name, ContEtfTypeName.KEJI_NEW_ENERGY, ContMapEtfAll.KEJI_NEW_ENERGY);
//        name = "KEJI_NEW_CAR";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//科技-汽车");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_CAR, null, name, ContEtfTypeName.KEJI_NEW_CAR, ContMapEtfAll.KEJI_NEW_CAR);

//        name = "ZIYUAN_OIL";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//资源-石油");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_OIL, null, name, ContEtfTypeName.ZIYUAN_OIL, ContMapEtfAll.ZIYUAN_OIL);//资源-石油
//        name = "ZIYUAN_NONGYE";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_NONGYE, null, name, ContEtfTypeName.ZIYUAN_NONGYE, ContMapEtfAll.ZIYUAN_NONGYE);
//        name = "ZIYUAN_XIYOU";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_XIYOU, null, name, ContEtfTypeName.ZIYUAN_XIYOU, ContMapEtfAll.ZIYUAN_XIYOU);
//        name = "ZIYUAN_COMMON";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.ZIYUAN_COMMON, ContEtfNameKey.ZIYUAN_COMMON_NOLIKE, name, ContEtfTypeName.ZIYUAN_COMMON, ContMapEtfAll.ZIYUAN_COMMON);
//        findByTypeName(date, ContEtfNameKey.ZIYUAN, ContEtfNameKey.ZIYUAN_NOLIKE, "ZIYUAN", ContEtfTypeName.ZIYUAN_STR, ContMapEtfAll.ZIYUAN);


//        String name = "YILIAO_COMMON";
//        System.out.println("    public static Map<String, String> " + name + " = new HashMap<>();//医疗");
//        System.out.println("    public static Map<String, String> TOP_" + name + " = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.YILIAO_COMMON, null, name, ContEtfTypeName.YILIAO_COMMON, ContMapEtfAll.YILIAO_COMMON);

//        System.out.println("    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_GOLD = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_GOLD,  ContEtfNameKey.JINRONG_GOLD_NOLIKE, "JINRONG_GOLD", ContEtfTypeName.JINRONG_GOLD, ContMapEtfAll.JINRONG_GOLD);
//        System.out.println("    public static Map<String, String> JINRONG_BANK = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_BANK = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_BANK,  null, "JINRONG_BANK", ContEtfTypeName.JINRONG_BANK, ContMapEtfAll.JINRONG_BANK);
//        System.out.println("    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_ZHENGQUAN = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_ZHENGQUAN,  ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE, "JINRONG_ZHENGQUAN", ContEtfTypeName.JINRONG_ZHENGQUAN, ContMapEtfAll.JINRONG_ZHENGQUAN);
//        System.out.println("    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_FANGDICHAN = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_FANGDICHAN,  null, "JINRONG_FANGDICHAN", ContEtfTypeName.JINRONG_FANGDICHAN, ContMapEtfAll.JINRONG_FANGDICHAN);
//        System.out.println("    public static Map<String, String> JINRONG_CASH = new HashMap<>();//金融-现金");
//        System.out.println("    public static Map<String, String> TOP_JINRONG_CASH = new HashMap<>();");
//        System.out.println("    static {");
//        System.out.println("    }");
//        findByTypeName(date, ContEtfNameKey.JINRONG_CASH,  null, "JINRONG_CASH", ContEtfTypeName.JINRONG_CASH, ContMapEtfAll.JINRONG_CASH);

//        System.out.println("    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_COMMON, ContEtfNameKey.XIAOFEI_COMMON_NOLIKE, "XIAOFEI_COMMON", ContEtfTypeName.XIAOFEI_COMMON, ContMapEtfAll.XIAOFEI_COMMON);
//        System.out.println("    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_MEDIA, null, "XIAOFEI_MEDIA", ContEtfTypeName.XIAOFEI_MEDIA, ContMapEtfAll.XIAOFEI_MEDIA);
//        System.out.println("    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐");
//        findByTypeName(date, ContEtfNameKey.XIAOFEI_WINE, null, "XIAOFEI_WINE", ContEtfTypeName.XIAOFEI_WINE, ContMapEtfAll.XIAOFEI_WINE);

////        //etf头部数据
//        List<String> zqdmList = new ArrayList<>(ContMapEtfAll.ETF_All.keySet());
//        int count = 0;
//        for (String zqdm : zqdmList) {
//            System.out.println(++count + ":" + zqdm + ":" + ETF_All.get(zqdm));
//        }
    }
}
