package utils;

import ttjj.dto.CondEtfAdrCount;
import ttjj.dto.CondStockAdrCount;
import ttjj.dto.EtfAdrCountVo;
import ttjj.dto.Kline;
import ttjj.rank.EtfControl;
import ttjj.service.EtfAdrCountService;

import java.math.BigDecimal;
import java.util.*;
import java.util.stream.Collectors;

import static utils.Content.*;

/**
 * 常量-ETF全部数据，来源东方财富
 * 2025-03-05：1065
 */
public class ContMapEtfAll {
    /**
     * 资源
     */
    public static Map<String, String> ZIYUAN_OIL = new HashMap<>();//资源-石油

    static {
        ZIYUAN_OIL.put("513350", "资源-石油             ");//标普油气ETF           市值：5.03      累涨：64.70     21.04     37.51     9.22      5.14      5.14      1
        ZIYUAN_OIL.put("159731", "资源-石油             ");//石化ETF               市值：0.33      累涨：16.29     3.30      8.59      4.40      2.93      1.46      2
        ZIYUAN_OIL.put("159697", "资源-石油             ");//油气ETF               市值：0.75      累涨：15.56     5.48      6.16      3.92      2.79      2.37      3
        ZIYUAN_OIL.put("561570", "资源-石油             ");//油气ETF华泰柏瑞       市值：0.08      累涨：16.11     4.84      7.03      4.24      2.75      1.79      4
        ZIYUAN_OIL.put("563150", "资源-石油             ");//油气资源ETF           市值：0.28      累涨：15.64     5.90      5.95      4.01      2.56      2.11      5
        ZIYUAN_OIL.put("561760", "资源-石油             ");//油气ETF博时           市值：0.25      累涨：16.23     6.31      5.82      4.10      2.55      1.88      6
        ZIYUAN_OIL.put("159588", "资源-石油             ");//石油天然气ETF         市值：0.64      累涨：13.92     5.63      4.98      3.31      2.54      1.87      7
        ZIYUAN_OIL.put("159309", "资源-石油             ");//油气资源ETF           市值：0.62      累涨：16.37     6.10      6.69      3.58      2.39      1.84      8
        ZIYUAN_OIL.put("561360", "资源-石油             ");//石油ETF               市值：0.93      累涨：16.70     5.50      7.01      4.19      2.39      1.59      9
        ZIYUAN_OIL.put("159518", "资源-石油             ");//标普油气ETF           市值：9.85      累涨：50.63     22.16     26.67     3.94      2.20      1.46      10
    }

    public static Map<String, String> ZIYUAN_NONGYE = new HashMap<>();

    static {
        ZIYUAN_NONGYE.put("516760", "资源-农业             ");//养殖ETF               市值：1.52      累涨：20.10     4.49      7.82      7.79      6.09      4.04      1
        ZIYUAN_NONGYE.put("159616", "资源-农业             ");//农牧ETF               市值：0.68      累涨：24.58     5.04      10.24     9.30      6.08      3.59      2
        ZIYUAN_NONGYE.put("159825", "资源-农业             ");//农业ETF               市值：18.79     累涨：23.18     5.05      9.11      9.32      5.79      3.02      3
        ZIYUAN_NONGYE.put("159867", "资源-农业             ");//畜牧ETF               市值：6.40      累涨：21.80     4.73      8.73      8.34      5.66      3.16      4
        ZIYUAN_NONGYE.put("516670", "资源-农业             ");//畜牧养殖ETF           市值：6.81      累涨：22.20     5.35      8.28      8.57      5.57      3.58      5
        ZIYUAN_NONGYE.put("516810", "资源-农业             ");//农业50ETF             市值：1.66      累涨：23.61     5.73      9.60      8.43      5.41      2.99      6
        ZIYUAN_NONGYE.put("159865", "资源-农业             ");//养殖ETF               市值：33.11     累涨：21.27     4.82      8.32      8.13      5.40      3.04      7
        ZIYUAN_NONGYE.put("516550", "资源-农业             ");//农业ETF               市值：2.14      累涨：20.02     4.20      7.73      8.09      5.32      3.37      8
        ZIYUAN_NONGYE.put("159827", "资源-农业             ");//农业50ETF             市值：1.12      累涨：23.98     5.30      9.68      9.43      5.28      2.69      9
        ZIYUAN_NONGYE.put("562900", "资源-农业             ");//农业ETF易方达         市值：0.82      累涨：21.51     5.21      8.44      8.57      5.00      2.70      10
        ZIYUAN_NONGYE.put("159587", "资源-农业             ");//粮食50ETF             市值：0.31      累涨：22.89     5.77      9.19      8.11      4.53      2.62      11
        ZIYUAN_NONGYE.put("159698", "资源-农业             ");//粮食ETF               市值：1.99      累涨：24.17     6.33      10.28     7.79      4.09      2.33      12
    }

    public static Map<String, String> ZIYUAN_XIYOU = new HashMap<>();

    static {
        ZIYUAN_XIYOU.put("512400", "资源-稀有             ");//有色金属ETF           市值：61.56     累涨：31.19     9.83      10.25     13.48     8.53      3.20      1
        ZIYUAN_XIYOU.put("159871", "资源-稀有             ");//有色金属ETF           市值：1.12      累涨：29.20     9.02      9.30      12.70     8.48      3.30      2
        ZIYUAN_XIYOU.put("159652", "资源-稀有             ");//有色50ETF             市值：3.19      累涨：29.28     8.83      9.51      12.98     8.31      3.48      3
        ZIYUAN_XIYOU.put("159876", "资源-稀有             ");//有色龙头ETF           市值：0.79      累涨：28.79     9.26      9.23      12.73     8.24      3.04      4
        ZIYUAN_XIYOU.put("516650", "资源-稀有             ");//有色金属ETF基金       市值：1.16      累涨：29.38     9.57      9.55      12.27     8.13      3.18      5
        ZIYUAN_XIYOU.put("159881", "资源-稀有             ");//有色60ETF             市值：0.60      累涨：29.22     9.66      9.12      12.55     8.11      2.89      6
        ZIYUAN_XIYOU.put("159880", "资源-稀有             ");//有色ETF基金           市值：1.13      累涨：28.77     8.80      9.56      12.14     7.95      3.17      7
        ZIYUAN_XIYOU.put("560860", "资源-稀有             ");//工业有色ETF           市值：5.48      累涨：30.47     10.48     9.53      12.90     7.86      1.71      8
        ZIYUAN_XIYOU.put("561800", "资源-稀有             ");//稀有金属ETF基金       市值：0.95      累涨：35.80     11.75     12.27     16.35     7.07      1.57      9
        ZIYUAN_XIYOU.put("516150", "资源-稀有             ");//稀土ETF基金           市值：19.05     累涨：40.41     13.14     18.27     16.39     6.93      2.00      10
        ZIYUAN_XIYOU.put("159671", "资源-稀有             ");//稀有金属ETF基金       市值：5.92      累涨：33.48     11.30     12.50     14.08     6.80      1.74      11
        ZIYUAN_XIYOU.put("159713", "资源-稀有             ");//稀土ETF               市值：3.31      累涨：37.79     13.10     16.02     15.69     6.76      1.94      12
        ZIYUAN_XIYOU.put("516780", "资源-稀有             ");//稀土ETF               市值：8.28      累涨：40.02     13.08     17.72     16.31     6.74      2.07      13
        ZIYUAN_XIYOU.put("159608", "资源-稀有             ");//稀有金属ETF           市值：2.46      累涨：32.84     11.22     11.83     13.71     6.61      1.46      14
        ZIYUAN_XIYOU.put("159715", "资源-稀有             ");//稀土ETF易方达         市值：2.03      累涨：39.12     13.38     17.53     15.33     6.47      1.60      15
        ZIYUAN_XIYOU.put("562800", "资源-稀有             ");//稀有金属ETF           市值：11.58     累涨：34.13     11.35     13.09     13.76     6.43      1.49      16
        ZIYUAN_XIYOU.put("159980", "资源-稀有             ");//有色ETF               市值：12.13     累涨：15.84     3.48      5.78      6.58      4.79      2.96      17
    }

    public static Map<String, String> ZIYUAN_COMMON = new HashMap<>();

    static {
        ZIYUAN_COMMON.put("516890", "资源-通用             ");//新材料ETF指数基金     市值：0.25      累涨：                                                            1
        ZIYUAN_COMMON.put("159761", "资源-通用             ");//新材料50ETF           市值：1.48      累涨：                                                            2
        ZIYUAN_COMMON.put("159703", "资源-通用             ");//新材料ETF             市值：0.56      累涨：                                                            3
        ZIYUAN_COMMON.put("562850", "资源-通用             ");//央企能源ETF           市值：1.42      累涨：                                                            4
        ZIYUAN_COMMON.put("561330", "资源-通用             ");//矿业ETF               市值：0.79      累涨：                                                            6
        ZIYUAN_COMMON.put("561260", "资源-通用             ");//能源ETF               市值：0.85      累涨：                                                            7
        ZIYUAN_COMMON.put("510170", "资源-通用             ");//大宗商品ETF           市值：1.68      累涨：                                                            8
        ZIYUAN_COMMON.put("159690", "资源-通用             ");//矿业ETF               市值：0.14      累涨：                                                            9
        ZIYUAN_COMMON.put("561790", "资源-通用             ");//央企现代能源ETF       市值：0.51      累涨：                                                            10
        ZIYUAN_COMMON.put("515220", "资源-通用             ");//煤炭ETF               市值：41.55     累涨：                                                            11
        ZIYUAN_COMMON.put("515210", "资源-通用             ");//钢铁ETF               市值：17.21     累涨：                                                            12
        ZIYUAN_COMMON.put("159981", "资源-通用             ");//能源化工ETF           市值：5.00      累涨：                                                            13
        ZIYUAN_COMMON.put("516220", "资源-通用             ");//化工龙头ETF           市值：1.21      累涨：                                                            14
        ZIYUAN_COMMON.put("516360", "资源-通用             ");//新材料ETF             市值：0.59      累涨：                                                            16
        ZIYUAN_COMMON.put("159870", "资源-通用             ");//化工ETF               市值：17.44     累涨：                                                            17
        ZIYUAN_COMMON.put("159930", "资源-通用             ");//能源ETF               市值：3.14      累涨：                                                            18
        ZIYUAN_COMMON.put("516020", "资源-通用             ");//化工ETF               市值：4.85      累涨：                                                            20
        ZIYUAN_COMMON.put("159985", "资源-通用             ");//豆粕ETF               市值：28.21     累涨：                                                            21
        ZIYUAN_COMMON.put("516120", "资源-通用             ");//化工50ETF             市值：1.98      累涨：                                                            22
        ZIYUAN_COMMON.put("516710", "资源-通用             ");//新材料50ETF           市值：0.45      累涨：                                                            23
        ZIYUAN_COMMON.put("562010", "资源-通用             ");//绿色能源ETF           市值：0.16      累涨：                                                            24
        ZIYUAN_COMMON.put("159763", "资源-通用             ");//新材料ETF基金         市值：0.58      累涨：                                                            25
        ZIYUAN_COMMON.put("516570", "资源-通用             ");//化工行业ETF           市值：0.60      累涨：                                                            26
        ZIYUAN_COMMON.put("159945", "资源-通用             ");//能源ETF基金           市值：0.35      累涨：                                                            27
        ZIYUAN_COMMON.put("516480", "资源-通用             ");//新材料ETF基金         市值：0.13      累涨：                                                            28
        ZIYUAN_COMMON.put("510410", "资源-通用             ");//资源ETF               市值：4.07      累涨：                                                            29
        ZIYUAN_COMMON.put("159944", "资源-通用             ");//材料ETF               市值：0.23      累涨：                                                            30
    }

    public static Map<String, String> ZIYUAN = new HashMap<>();

    static {
        ZIYUAN.putAll(ZIYUAN_OIL);
        ZIYUAN.putAll(ZIYUAN_NONGYE);
        ZIYUAN.putAll(ZIYUAN_XIYOU);
        ZIYUAN.putAll(ZIYUAN_COMMON);
    }

    /**
     * 消费
     */
    public static Map<String, String> XIAOFEI_COMMON = new HashMap<>();//消费-通用

    static {
        XIAOFEI_COMMON.put("510630", "消费-通用             ");//消费30ETF             市值：5.28      累涨：23.39     2.90      7.01      13.48     7.34      4.87      1
        XIAOFEI_COMMON.put("517880", "消费-通用             ");//品牌消费ETF           市值：0.39      累涨：28.08     6.48      7.59      14.24     7.32      4.75      2
        XIAOFEI_COMMON.put("159689", "消费-通用             ");//消费ETF南方           市值：0.87      累涨：23.23     4.00      7.39      11.97     7.28      4.13      3
        XIAOFEI_COMMON.put("512600", "消费-通用             ");//必选消费ETF           市值：5.15      累涨：22.09     3.28      7.03      12.08     7.27      4.19      4
        XIAOFEI_COMMON.put("560680", "消费-通用             ");//消费ETF龙头           市值：1.53      累涨：22.49     3.62      7.62      11.60     7.03      4.17      5
        XIAOFEI_COMMON.put("159928", "消费-通用             ");//消费ETF               市值：147.52    累涨：23.38     4.19      7.68      11.77     6.92      4.18      6
        XIAOFEI_COMMON.put("159672", "消费-通用             ");//主要消费ETF           市值：0.91      累涨：23.70     3.88      8.21      11.88     6.78      4.16      7
        XIAOFEI_COMMON.put("159798", "消费-通用             ");//消费ETF易方达         市值：1.12      累涨：20.99     5.07      5.61      10.53     6.13      4.95      8
        XIAOFEI_COMMON.put("562580", "消费-通用             ");//可选消费ETF           市值：0.30      累涨：35.70     14.86     11.70     11.95     5.86      5.28      9
        XIAOFEI_COMMON.put("515650", "消费-通用             ");//消费50ETF             市值：26.18     累涨：20.52     5.14      5.17      10.56     5.84      4.62      10
        XIAOFEI_COMMON.put("159670", "消费-通用             ");//消费ETF基金           市值：0.86      累涨：19.88     5.00      5.08      9.91      5.60      4.54      11
        XIAOFEI_COMMON.put("516130", "消费-通用             ");//消费龙头ETF           市值：1.09      累涨：19.21     4.61      6.21      8.65      5.48      4.44      12
        XIAOFEI_COMMON.put("159520", "消费-通用             ");//消费龙头ETF           市值：1.45      累涨：19.46     4.97      6.39      8.78      5.34      4.37      13
        XIAOFEI_COMMON.put("159936", "消费-通用             ");//可选消费ETF           市值：3.09      累涨：30.51     10.19     12.75     9.65      5.13      5.08      14
        XIAOFEI_COMMON.put("159793", "消费-通用             ");//线上消费ETF平安       市值：0.35      累涨：57.52     6.64      35.10     20.93     4.81      4.81      15
        XIAOFEI_COMMON.put("510150", "消费-通用             ");//消费ETF               市值：18.31     累涨：21.77     4.71      9.20      8.82      4.59      4.21      16
        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.09      累涨：20.26     5.04      8.48      7.76      3.98      2.60      17
        XIAOFEI_COMMON.put("516600", "消费-通用             ");//消费服务ETF           市值：0.94      累涨：23.38     5.10      11.33     9.43      3.63      2.97      18
        XIAOFEI_COMMON.put("159725", "消费-通用             ");//线上消费ETF           市值：0.50      累涨：54.26     11.83     31.63     14.58     3.37      2.25      19
        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.72      累涨：18.38     6.77      6.00      5.61      3.18      1.93      20
        XIAOFEI_COMMON.put("515920", "消费-通用             ");//智能消费ETF           市值：1.91      累涨：43.33     16.23     19.41     10.37     3.04      3.04      21
        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.57      累涨：17.48     6.53      5.80      5.25      2.95      1.76      22
        XIAOFEI_COMMON.put("159728", "消费-通用             ");//在线消费ETF           市值：0.61      累涨：56.35     14.25     31.76     14.32     2.86      2.10      23
        XIAOFEI_COMMON.put("516560", "消费-通用             ");//养老ETF               市值：1.14      累涨：23.24     8.67      6.71      8.64      3.78      1.39      1
        XIAOFEI_COMMON.put("516530", "消费-通用             ");//物流快递ETF           市值：0.71      累涨：18.50     6.53      7.61      5.63      2.43      1.27      1
        XIAOFEI_COMMON.put("516910", "消费-通用             ");//物流ETF               市值：0.56      累涨：17.85     6.39      7.37      5.19      2.30      1.10      2
        XIAOFEI_COMMON.put("159996", "消费-通用             ");//家电ETF               市值：16.64     累涨：34.63     10.38     15.76     10.10     6.03      2.86      1
        XIAOFEI_COMMON.put("561120", "消费-通用             ");//家电ETF               市值：1.12      累涨：34.03     10.10     15.84     9.57      5.48      2.81      2
        XIAOFEI_COMMON.put("159328", "消费-通用             ");//家电ETF易方达         市值：1.28      累涨：30.95     9.93      14.13     8.98      4.74      2.60      3
        XIAOFEI_COMMON.put("560880", "消费-通用             ");//家电ETF龙头           市值：4.52      累涨：32.26     10.43     15.21     9.04      4.68      2.54      4
        XIAOFEI_COMMON.put("159730", "消费-通用             ");//龙头家电ETF           市值：0.51      累涨：25.56     6.86      13.02     7.77      4.10      1.81      5
    }

    public static Map<String, String> XIAOFEI_HK = new HashMap<>();//消费-香港消费

    static {
        XIAOFEI_HK.put("159793", "消费-香港消费         ");//线上消费ETF平安       市值：0.38      累涨：53.28     2.50      34.36     17.96     9.44                1
        XIAOFEI_HK.put("159725", "消费-香港消费         ");//线上消费ETF           市值：0.50      累涨：53.61     5.93      34.00     17.93     8.53      1.12      2
        XIAOFEI_HK.put("159728", "消费-香港消费         ");//在线消费ETF           市值：0.63      累涨：54.70     8.74      31.56     19.07     8.50      0.76      3
        XIAOFEI_HK.put("159735", "消费-香港消费         ");//港股消费ETF           市值：5.49      累涨：58.19     7.60      28.19     24.79     7.88      0.11      4
        XIAOFEI_HK.put("513230", "消费-香港消费         ");//港股消费ETF           市值：2.79      累涨：55.43     6.11      28.83     22.93     7.20      0.18      5
        XIAOFEI_HK.put("513590", "消费-香港消费         ");//香港消费ETF           市值：5.65      累涨：58.00     5.60      27.11     27.97     7.03      0.10      6
        XIAOFEI_HK.put("513070", "消费-香港消费         ");//港股消费ETF易方达     市值：3.26      累涨：55.80     7.47      27.80     23.21     7.01      0.35      7
        XIAOFEI_HK.put("513970", "消费-香港消费         ");//恒生消费ETF           市值：9.10      累涨：32.70     5.79      14.00     13.50     6.78      2.18      8
        XIAOFEI_HK.put("520520", "消费-香港消费         ");//恒生消费ETF华泰柏瑞   市值：0.70      累涨：33.95     6.79      14.21     14.07     6.76      2.05      9
        XIAOFEI_HK.put("517550", "消费-香港消费         ");//消费ETF沪港深         市值：0.42      累涨：39.40     7.69      16.09     16.32     6.20      1.30      10
        XIAOFEI_HK.put("159699", "消费-香港消费         ");//恒生消费ETF           市值：11.70     累涨：33.04     6.63      14.72     12.56     5.36      2.60      11
        XIAOFEI_HK.put("517880", "消费-香港消费         ");//品牌消费ETF           市值：0.39      累涨：26.62     7.28      10.68     9.71      5.32      2.57      12
    }

    public static Map<String, String> XIAOFEI_MEDIA = new HashMap<>();//消费-文娱传媒

    static {
        XIAOFEI_MEDIA.put("159855", "消费-文娱传媒         ");//影视ETF               市值：0.60      累涨：56.53     9.41      33.61     13.51     6.89      0.10      1
        XIAOFEI_MEDIA.put("516620", "消费-文娱传媒         ");//影视ETF               市值：0.57      累涨：56.99     9.84      33.97     13.18     6.76                2
        XIAOFEI_MEDIA.put("516010", "消费-文娱传媒         ");//游戏ETF               市值：16.49     累涨：61.86     10.82     38.08     12.96     5.56                3
        XIAOFEI_MEDIA.put("516770", "消费-文娱传媒         ");//游戏ETF华泰柏瑞       市值：1.36      累涨：62.99     10.82     38.54     13.63     5.44                4
        XIAOFEI_MEDIA.put("159869", "消费-文娱传媒         ");//游戏ETF               市值：51.74     累涨：62.10     10.65     38.14     13.31     5.43                5
        XIAOFEI_MEDIA.put("517770", "消费-文娱传媒         ");//游戏传媒ETF           市值：0.30      累涨：51.15     8.60      26.72     15.83     5.34      1.41      6
        XIAOFEI_MEDIA.put("159805", "消费-文娱传媒         ");//传媒ETF               市值：1.78      累涨：49.33     10.90     25.53     12.90     4.66      0.33      7
        XIAOFEI_MEDIA.put("516190", "消费-文娱传媒         ");//文娱传媒ETF           市值：0.21      累涨：45.70     9.72      24.63     11.35     4.66                8
        XIAOFEI_MEDIA.put("512980", "消费-文娱传媒         ");//传媒ETF               市值：24.76     累涨：48.63     10.40     25.08     13.15     4.64      0.34      9
    }

    public static Map<String, String> XIAOFEI_WINE = new HashMap<>();//消费-吃喝玩乐

    static {
        XIAOFEI_WINE.put("562510", "消费-吃喝玩乐         ");//旅游ETF               市值：7.03      累涨：24.72     8.20      8.90      8.52      3.61      3.32      1
        XIAOFEI_WINE.put("159766", "消费-吃喝玩乐         ");//旅游ETF               市值：29.74     累涨：25.39     8.73      9.58      8.44      3.35      3.35      2
        XIAOFEI_WINE.put("515170", "消费-吃喝玩乐         ");//食品饮料ETF           市值：34.33     累涨：25.93     4.26      10.20     11.47     1.52      1.52      3
        XIAOFEI_WINE.put("159862", "消费-吃喝玩乐         ");//食品ETF               市值：0.46      累涨：25.84     4.22      10.83     10.79     1.44      1.44      4
        XIAOFEI_WINE.put("159736", "消费-吃喝玩乐         ");//饮食ETF               市值：48.74     累涨：24.60     4.53      9.83      10.24     1.39      1.39      5
        XIAOFEI_WINE.put("512690", "消费-吃喝玩乐         ");//酒ETF                 市值：122.74    累涨：32.32     7.10      13.17     12.05     1.28      1.28      6
        XIAOFEI_WINE.put("515710", "消费-吃喝玩乐         ");//食品ETF               市值：9.31      累涨：25.59     4.68      9.62      11.29     1.27      1.27      7
        XIAOFEI_WINE.put("516900", "消费-吃喝玩乐         ");//食品饮料ETF基金       市值：1.00      累涨：29.38     4.70      12.03     12.65     1.12      1.12      8
        XIAOFEI_WINE.put("159843", "消费-吃喝玩乐         ");//食品饮料ETF           市值：3.06      累涨：25.84     4.41      10.56     10.87     1.04      1.04      9
        XIAOFEI_WINE.put("159378", "消费-吃喝玩乐         ");//通用航空ETF           市值：5.82      累涨：34.85     7.13      21.17     8.90      0.53                10
    }

    public static Map<String, String> XIAOFEI_HOUSE = new HashMap<>();//消费-家电

    static {

    }

    public static Map<String, String> XIAOFEI = new HashMap<>();

    static {
        XIAOFEI.putAll(XIAOFEI_COMMON);
        XIAOFEI.putAll(XIAOFEI_HK);
        XIAOFEI.putAll(XIAOFEI_MEDIA);
        XIAOFEI.putAll(XIAOFEI_WINE);
        XIAOFEI.putAll(XIAOFEI_HOUSE);
//        XIAOFEI.putAll(XIAOFEI_TRAVEL);
    }


    /**
     * 医疗
     */
    public static Map<String, String> YILIAO_COMMON = new HashMap<>();//医疗

    static {
        YILIAO_COMMON.put("513780", "医疗-通用             ");//港股创新药50ETF       市值：4.17      累涨：76.53     21.06     25.38     33.91     21.75     14.48     1
        YILIAO_COMMON.put("520500", "医疗-通用             ");//恒生创新药ETF         市值：3.27      累涨：78.32     22.06     25.69     33.86     20.96     14.91     2
        YILIAO_COMMON.put("159567", "医疗-通用             ");//港股创新药ETF         市值：11.21     累涨：76.68     20.10     25.12     34.11     20.77     14.20     3
        YILIAO_COMMON.put("159570", "医疗-通用             ");//港股通创新药ETF       市值：25.48     累涨：78.15     21.40     26.08     33.50     20.63     14.19     4
        YILIAO_COMMON.put("520700", "医疗-通用             ");//港股创新药ETF基金     市值：2.19      累涨：75.87     21.78     27.00     32.08     19.93     13.81     5
        YILIAO_COMMON.put("513120", "医疗-通用             ");//港股创新药ETF         市值：117.35    累涨：73.79     20.92     23.17     32.66     19.62     13.42     6
        YILIAO_COMMON.put("513280", "医疗-通用             ");//恒生生物科技ETF       市值：2.46      累涨：71.84     21.47     22.69     30.10     19.01     13.67     7
        YILIAO_COMMON.put("159506", "医疗-通用             ");//恒生医疗ETF           市值：20.38     累涨：75.97     23.10     24.16     31.27     18.99     13.38     8
        YILIAO_COMMON.put("159615", "医疗-通用             ");//恒生生物科技ETF       市值：3.04      累涨：71.00     20.81     23.19     29.79     18.93     14.05     9
        YILIAO_COMMON.put("159892", "医疗-通用             ");//恒生医药ETF           市值：43.92     累涨：70.78     19.80     23.83     29.85     18.71     13.58     10
        YILIAO_COMMON.put("159316", "医疗-通用             ");//恒生创新药ETF         市值：1.78      累涨：25.71                         25.71     18.70     12.79     11
        YILIAO_COMMON.put("159557", "医疗-通用             ");//恒生医疗指数ETF       市值：2.41      累涨：67.54     21.35     20.59     28.12     18.61     13.56     12
        YILIAO_COMMON.put("513060", "医疗-通用             ");//恒生医疗ETF           市值：118.34    累涨：66.39     21.00     22.18     26.31     17.42     12.57     13
        YILIAO_COMMON.put("159718", "医疗-通用             ");//港股医药ETF           市值：2.15      累涨：67.02     21.52     21.35     26.52     17.39     12.33     14
        YILIAO_COMMON.put("513200", "医疗-通用             ");//港股通医药ETF         市值：35.58     累涨：68.73     22.25     22.69     25.81     17.18     12.65     15
        YILIAO_COMMON.put("513700", "医疗-通用             ");//香港医药ETF           市值：8.79      累涨：67.18     21.60     21.57     26.03     17.00     12.40     16
        YILIAO_COMMON.put("159776", "医疗-通用             ");//港股通医药ETF         市值：1.36      累涨：66.64     21.28     21.56     26.40     16.99     11.93     17
        YILIAO_COMMON.put("159303", "医疗-通用             ");//恒生医疗ETF基金       市值：1.25      累涨：67.32     24.05     22.42     23.79     15.25     10.83     18
        YILIAO_COMMON.put("588700", "医疗-通用             ");//科创医药指数ETF       市值：3.46      累涨：50.28     16.51     14.43     20.32     14.38     9.71      19
        YILIAO_COMMON.put("159217", "医疗-通用             ");//港股通创新药ETF工银   市值：18.22     累涨：14.02                         14.02     14.02     14.02     20
        YILIAO_COMMON.put("159748", "医疗-通用             ");//创新药ETF富国         市值：3.15      累涨：53.54     17.64     16.37     21.47     13.61     7.97      21
        YILIAO_COMMON.put("588860", "医疗-通用             ");//科创医药ETF           市值：3.78      累涨：50.54     16.05     16.49     18.74     13.11     8.29      22
        YILIAO_COMMON.put("588250", "医疗-通用             ");//科创生物医药ETF       市值：2.44      累涨：16.68                         16.68     12.97     8.96      23
        YILIAO_COMMON.put("159622", "医疗-通用             ");//创新药ETF沪港深       市值：2.08      累涨：52.90     17.63     15.88     21.12     12.92     8.31      24
        YILIAO_COMMON.put("517120", "医疗-通用             ");//创新药ETF华泰柏瑞     市值：2.76      累涨：52.61     16.42     16.84     21.11     12.92     8.08      25
        YILIAO_COMMON.put("513290", "医疗-通用             ");//纳指生物科技ETF       市值：12.66     累涨：34.73     12.43     5.31      16.99     12.89     12.89     26
        YILIAO_COMMON.put("159502", "医疗-通用             ");//标普生物科技ETF       市值：11.79     累涨：32.90     10.27     5.86      16.77     12.73     12.73     27
        YILIAO_COMMON.put("517110", "医疗-通用             ");//创新药沪深港ETF       市值：2.70      累涨：52.96     17.56     17.04     20.57     12.25     8.01      28
        YILIAO_COMMON.put("561920", "医疗-通用             ");//疫苗龙头ETF           市值：0.19      累涨：36.96     13.08     10.97     14.29     10.77     7.08      29
        YILIAO_COMMON.put("517380", "医疗-通用             ");//创新药沪港深ETF       市值：3.64      累涨：47.80     16.18     14.99     18.48     10.48     6.22      30
        YILIAO_COMMON.put("159992", "医疗-通用             ");//创新药ETF             市值：112.03    累涨：41.28     12.43     13.66     15.90     10.23     6.04      31
        YILIAO_COMMON.put("562860", "医疗-通用             ");//生物疫苗ETF           市值：2.63      累涨：36.25     12.72     11.83     13.47     10.09     5.88      32
        YILIAO_COMMON.put("517990", "医疗-通用             ");//医药ETF沪港深         市值：0.38      累涨：40.77     14.34     12.45     14.50     9.36      5.97      33
        YILIAO_COMMON.put("515120", "医疗-通用             ");//创新药ETF             市值：38.30     累涨：40.52     12.29     13.75     15.61     9.32      4.79      34
        YILIAO_COMMON.put("560900", "医疗-通用             ");//创新药企ETF           市值：0.38      累涨：38.86     12.37     12.55     15.25     9.21      5.06      35
        YILIAO_COMMON.put("159657", "医疗-通用             ");//生物疫苗ETF           市值：1.17      累涨：36.79     13.41     11.87     13.06     9.19      5.88      36
        YILIAO_COMMON.put("516080", "医疗-通用             ");//创新药ETF易方达       市值：4.21      累涨：39.65     12.66     12.88     15.21     9.16      4.80      37
        YILIAO_COMMON.put("159645", "医疗-通用             ");//疫苗ETF富国           市值：0.18      累涨：33.73     13.49     9.29      12.29     9.15      5.82      38
        YILIAO_COMMON.put("159877", "医疗-通用             ");//医疗ETF南方           市值：0.87      累涨：40.28     18.55     13.69     9.88      8.51      6.23      39
        YILIAO_COMMON.put("159883", "医疗-通用             ");//医疗器械ETF           市值：16.72     累涨：36.01     16.86     10.60     9.93      8.50      5.80      40
        YILIAO_COMMON.put("159898", "医疗-通用             ");//医疗器械指数ETF       市值：1.76      累涨：36.14     16.65     10.99     9.78      8.46      5.57      41
        YILIAO_COMMON.put("561510", "医疗-通用             ");//中药ETF华泰柏瑞       市值：0.88      累涨：21.62     6.50      5.69      9.53      8.36      5.21      42
        YILIAO_COMMON.put("516790", "医疗-通用             ");//医疗ETF华泰柏瑞       市值：1.11      累涨：39.25     18.34     13.06     9.19      8.33      6.05      43
        YILIAO_COMMON.put("159858", "医疗-通用             ");//创新药ETF南方         市值：2.16      累涨：38.63     11.86     12.69     14.97     8.31      4.36      44
        YILIAO_COMMON.put("516060", "医疗-通用             ");//创新药产业ETF         市值：1.02      累涨：39.57     12.95     13.10     14.54     8.30      4.37      45
        YILIAO_COMMON.put("159873", "医疗-通用             ");//医疗设备ETF           市值：0.80      累涨：38.76     17.05     13.95     9.59      8.23      5.79      46
        YILIAO_COMMON.put("159835", "医疗-通用             ");//创新药50ETF           市值：1.25      累涨：38.14     11.98     13.20     14.06     8.20      3.85      47
        YILIAO_COMMON.put("562390", "医疗-通用             ");//中药50ETF             市值：0.65      累涨：22.08     6.72      5.63      9.83      8.16      5.22      48
        YILIAO_COMMON.put("159837", "医疗-通用             ");//生物科技ETF           市值：12.36     累涨：40.55     16.75     12.89     12.66     8.11      4.65      49
        YILIAO_COMMON.put("159643", "医疗-通用             ");//疫苗ETF               市值：0.54      累涨：33.48     12.98     10.34     11.34     7.95      4.70      50
        YILIAO_COMMON.put("159647", "医疗-通用             ");//中药ETF               市值：7.77      累涨：21.83     6.75      6.00      9.08      7.94      4.72      51
        YILIAO_COMMON.put("516930", "医疗-通用             ");//生物科技ETF基金       市值：0.33      累涨：39.34     16.38     12.85     11.59     7.82      4.26      52
        YILIAO_COMMON.put("560080", "医疗-通用             ");//中药ETF               市值：21.09     累涨：21.86     6.73      6.24      8.89      7.74      4.57      53
        YILIAO_COMMON.put("159849", "医疗-通用             ");//生物科技指数ETF       市值：0.75      累涨：40.61     17.37     12.99     11.92     7.56      4.45      54
        YILIAO_COMMON.put("516500", "医疗-通用             ");//生物科技ETF           市值：1.05      累涨：40.62     16.81     13.26     11.91     7.53      4.16      55
        YILIAO_COMMON.put("159859", "医疗-通用             ");//生物医药ETF           市值：32.88     累涨：38.14     14.88     13.71     11.19     7.41      3.83      56
        YILIAO_COMMON.put("159938", "医疗-通用             ");//医药卫生ETF           市值：49.07     累涨：31.69     11.05     10.26     10.86     7.14      3.91      57
        YILIAO_COMMON.put("516820", "医疗-通用             ");//医疗创新ETF           市值：16.55     累涨：36.84     12.96     12.97     11.50     6.83      3.64      58
        YILIAO_COMMON.put("159839", "医疗-通用             ");//生物药ETF             市值：5.76      累涨：35.04     13.74     12.59     10.45     6.70      3.46      59
        YILIAO_COMMON.put("515960", "医疗-通用             ");//医药健康ETF           市值：2.21      累涨：31.44     10.68     10.34     10.96     6.63      3.41      60
        YILIAO_COMMON.put("159891", "医疗-通用             ");//医疗ETF基金           市值：1.15      累涨：36.04     18.74     11.88     7.42      6.52      4.20      61
        YILIAO_COMMON.put("159797", "医疗-通用             ");//医疗器械ETF基金       市值：0.71      累涨：35.91     16.88     11.12     8.17      6.45      4.02      62
        YILIAO_COMMON.put("159508", "医疗-通用             ");//生物医药ETF基金       市值：0.45      累涨：36.22     13.36     13.76     10.66     6.39      3.50      63
        YILIAO_COMMON.put("516610", "医疗-通用             ");//医疗服务ETF           市值：0.88      累涨：39.57     19.75     15.51     7.30      6.27      3.55      64
        YILIAO_COMMON.put("512290", "医疗-通用             ");//生物医药ETF           市值：37.54     累涨：38.15     16.09     12.21     10.81     6.25      3.29      65
        YILIAO_COMMON.put("159847", "医疗-通用             ");//医疗ETF易方达         市值：9.31      累涨：43.95     21.14     15.13     9.16      6.17      3.35      66
        YILIAO_COMMON.put("510660", "医疗-通用             ");//医药卫生ETF           市值：0.84      累涨：31.58     11.31     10.16     10.91     6.15      3.15      67
        YILIAO_COMMON.put("560260", "医疗-通用             ");//医疗ETF龙头           市值：15.85     累涨：45.50     21.77     15.72     9.03      6.13      3.63      68
        YILIAO_COMMON.put("512120", "医疗-通用             ");//医药50ETF             市值：3.47      累涨：31.44     10.17     10.83     10.69     6.09      2.75      69
        YILIAO_COMMON.put("159929", "医疗-通用             ");//医药ETF               市值：22.51     累涨：31.26     11.84     10.35     9.46      6.01      3.04      70
        YILIAO_COMMON.put("512170", "医疗-通用             ");//医疗ETF               市值：248.58    累涨：43.72     20.48     15.84     9.12      5.94      3.56      71
        YILIAO_COMMON.put("512010", "医疗-通用             ");//医药ETF               市值：219.47    累涨：33.67     12.71     11.98     9.53      5.93      2.62      72
        YILIAO_COMMON.put("515950", "医疗-通用             ");//医药龙头ETF           市值：6.52      累涨：30.44     10.39     10.72     9.67      5.88      3.14      73
        YILIAO_COMMON.put("159838", "医疗-通用             ");//医药50ETF             市值：2.08      累涨：31.18     11.08     10.89     9.57      5.57      2.48      74
        YILIAO_COMMON.put("159760", "医疗-通用             ");//医疗健康ETF泰康       市值：0.80      累涨：32.38     11.38     11.88     9.47      5.48      2.37      75
        YILIAO_COMMON.put("159828", "医疗-通用             ");//医疗ETF               市值：22.32     累涨：43.71     21.39     15.38     8.33      5.28      2.88      76
        YILIAO_COMMON.put("562600", "医疗-通用             ");//医疗器械ETF           市值：0.60      累涨：32.85     16.92     11.03     6.49      4.26      1.88      77
        YILIAO_COMMON.put("159366", "医疗-通用             ");//港股医疗ETF           市值：1.50      累涨：2.60                          2.60      2.60      2.60      78
        YILIAO_COMMON.put("159377", "医疗-通用             ");//创业板医药ETF国泰     市值：2.07      累涨：                                                            79
    }

    public static Map<String, String> YILIAO = new HashMap<>();//医疗

    static {
        YILIAO.putAll(YILIAO_COMMON);
    }

    public static Map<String, String> KEJI_JUNGONG = new HashMap<>();//科技-军工

    static {
        KEJI_JUNGONG.put("512670", "科技-军工             ");//国防ETF               市值：32.52     累涨：40.87     9.22      15.14     16.51     10.53     8.19      1
        KEJI_JUNGONG.put("512710", "科技-军工             ");//军工龙头ETF           市值：68.16     累涨：38.12     9.60      14.85     13.67     8.71      7.53      2
        KEJI_JUNGONG.put("512660", "科技-军工             ");//军工ETF               市值：116.81    累涨：38.59     9.36      15.61     13.62     8.02      6.56      3
        KEJI_JUNGONG.put("512560", "科技-军工             ");//军工ETF易方达         市值：8.42      累涨：38.34     9.48      15.59     13.27     7.63      6.51      4
        KEJI_JUNGONG.put("512810", "科技-军工             ");//国防军工ETF           市值：6.80      累涨：37.57     9.36      15.72     12.49     7.63      6.11      5
        KEJI_JUNGONG.put("512680", "科技-军工             ");//军工ETF龙头           市值：36.49     累涨：37.94     9.40      15.51     13.03     7.56      6.32      6
    }

    /**
     * 科技-通用
     */
    public static Map<String, String> KEJI_GONG_YE = new HashMap<>();

    static {
        KEJI_GONG_YE.put("517360", "科技-通用             ");//沪港深科技ETF         市值：0.49      累涨：54.39     9.39      24.04     20.96     9.98      6.17      1
        KEJI_GONG_YE.put("159723", "科技-通用             ");//科技龙头ETF           市值：0.77      累涨：53.03     10.09     24.38     18.56     8.34      4.54      2
        KEJI_GONG_YE.put("159667", "科技-通用             ");//工业母机ETF           市值：5.17      累涨：57.60     18.83     20.55     19.35     7.90      4.11      3
        KEJI_GONG_YE.put("159663", "科技-通用             ");//机床ETF               市值：0.86      累涨：55.74     18.35     20.36     18.53     7.51      3.69      4
        KEJI_GONG_YE.put("515860", "科技-通用             ");//科技ETF基金           市值：1.88      累涨：45.83     15.04     18.63     12.64     7.17      3.16      5
        KEJI_GONG_YE.put("515000", "科技-通用             ");//科技ETF               市值：32.35     累涨：48.50     16.38     19.25     12.87     6.87      3.30      6
        KEJI_GONG_YE.put("516050", "科技-通用             ");//科技龙头ETF           市值：4.36      累涨：48.89     16.32     19.09     13.61     6.81      3.35      8
        KEJI_GONG_YE.put("517660", "科技-通用             ");//物联网沪港深ETF       市值：0.44      累涨：50.10     12.41     21.04     16.65     6.43      3.66      9
        KEJI_GONG_YE.put("512770", "科技-通用             ");//战略新兴ETF           市值：2.17      累涨：37.35     10.39     15.43     11.68     6.31      3.51      10
        KEJI_GONG_YE.put("560990", "科技-通用             ");//中金科技先锋ETF       市值：0.31      累涨：37.98     12.78     14.62     10.80     6.13      2.62      11
        KEJI_GONG_YE.put("159709", "科技-通用             ");//物联网ETF工银         市值：0.81      累涨：50.67     15.75     22.13     13.83     6.10      2.74      12
        KEJI_GONG_YE.put("516800", "科技-通用             ");//智能制造ETF           市值：1.78      累涨：52.68     17.05     21.51     14.53     6.07      2.36      13
        KEJI_GONG_YE.put("561130", "科技-通用             ");//国货ETF               市值：1.74      累涨：25.96     7.40      9.38      9.18      6.06      3.78      14
        KEJI_GONG_YE.put("159638", "科技-通用             ");//高端装备ETF           市值：11.60     累涨：39.62     12.43     15.68     14.42     6.01      0.12      15
        KEJI_GONG_YE.put("510770", "科技-通用             ");//G60创新ETF            市值：0.17      累涨：37.02     10.73     15.47     10.82     5.90      2.35      16
        KEJI_GONG_YE.put("515750", "科技-通用             ");//科技50ETF             市值：6.88      累涨：45.13     13.60     19.48     12.39     5.85      2.69      17
        KEJI_GONG_YE.put("159773", "科技-通用             ");//创业板科技ETF         市值：2.36      累涨：39.46     8.88      19.74     11.23     5.71      2.94      18
        KEJI_GONG_YE.put("159896", "科技-通用             ");//物联网ETF南方         市值：0.53      累涨：49.84     16.86     20.59     12.85     5.71      3.06      19
        KEJI_GONG_YE.put("159895", "科技-通用             ");//物联网ETF易方达       市值：0.72      累涨：48.74     17.31     19.42     12.44     5.55      2.97      20
        KEJI_GONG_YE.put("515200", "科技-通用             ");//创新100ETF            市值：1.76      累涨：37.75     10.21     17.33     10.58     5.47      2.45      21
        KEJI_GONG_YE.put("159786", "科技-通用             ");//VRETF                 市值：1.36      累涨：53.62     18.13     25.55     11.37     5.31      3.25      22
        KEJI_GONG_YE.put("159621", "科技-通用             ");//MSCIESGETF            市值：0.27      累涨：22.11     6.32      7.78      8.01      5.17      3.14      23
        KEJI_GONG_YE.put("159717", "科技-通用             ");//ESGETF                市值：0.57      累涨：21.25     5.26      8.14      7.85      5.11      3.06      24
        KEJI_GONG_YE.put("560170", "科技-通用             ");//央企科技ETF           市值：14.26     累涨：40.63     13.65     14.76     12.68     5.10      1.01      25
        KEJI_GONG_YE.put("560280", "科技-通用             ");//工程机械ETF           市值：2.10      累涨：38.99     9.08      15.67     14.63     5.04      2.47      26
        KEJI_GONG_YE.put("515090", "科技-通用             ");//可持续发展ETF         市值：0.07      累涨：22.86     6.55      8.31      8.00      5.00      3.33      27
        KEJI_GONG_YE.put("159542", "科技-通用             ");//工程机械ETF           市值：0.11      累涨：40.46     9.77      16.13     14.82     5.00      2.36      28
        KEJI_GONG_YE.put("563050", "科技-通用             ");//央企科技50ETF         市值：2.93      累涨：38.86     13.60     14.07     11.63     5.00      0.85      29
        KEJI_GONG_YE.put("516720", "科技-通用             ");//ESGETF                市值：0.25      累涨：23.64     7.24      7.89      8.74      4.99      3.51      30
        KEJI_GONG_YE.put("515580", "科技-通用             ");//科技100ETF            市值：4.42      累涨：39.18     13.03     16.43     10.40     4.94      2.18      32
        KEJI_GONG_YE.put("159701", "科技-通用             ");//物联网ETF招商         市值：0.23      累涨：46.57     15.84     19.41     11.66     4.89      2.94      33
        KEJI_GONG_YE.put("516330", "科技-通用             ");//物联网ETF             市值：0.46      累涨：50.06     17.60     21.27     11.74     4.88      2.56      34
        KEJI_GONG_YE.put("159777", "科技-通用             ");//创科技ETF             市值：1.01      累涨：36.76     8.11      19.01     9.64      4.84      2.22      35
        KEJI_GONG_YE.put("560650", "科技-通用             ");//核心50ETF             市值：0.11      累涨：25.38     7.09      8.06      10.83     4.73      2.36      36
        KEJI_GONG_YE.put("562380", "科技-通用             ");//央企科技引领ETF       市值：2.52      累涨：38.86     12.96     14.69     11.76     4.61      0.98      37
        KEJI_GONG_YE.put("563210", "科技-通用             ");//专精特新ETF           市值：0.35      累涨：31.18               16.85     16.11     4.60      2.02      38
        KEJI_GONG_YE.put("516260", "科技-通用             ");//物联网50ETF           市值：1.07      累涨：47.94     16.89     20.30     11.18     4.59      2.86      39
        KEJI_GONG_YE.put("159653", "科技-通用             ");//ESG300ETF             市值：0.59      累涨：19.73     5.65      7.38      6.70      4.57      2.62      40
        KEJI_GONG_YE.put("159807", "科技-通用             ");//科技ETF               市值：9.65      累涨：37.08     12.54     14.21     10.33     4.54      1.90      41
        KEJI_GONG_YE.put("561500", "科技-通用             ");//漂亮50ETF             市值：0.71      累涨：25.72     7.41      8.79      10.13     4.51      2.10      42
        KEJI_GONG_YE.put("159791", "科技-通用             ");//300ESGETF             市值：0.35      累涨：21.44     6.57      8.31      7.45      4.36      2.76      43
        KEJI_GONG_YE.put("516830", "科技-通用             ");//300ESGETF             市值：1.64      累涨：20.56     5.98      7.27      7.43      4.36      2.71      44
        KEJI_GONG_YE.put("561900", "科技-通用             ");//沪深300ESGETF         市值：0.51      累涨：20.13     5.76      7.45      6.92      4.30      2.98      45
        KEJI_GONG_YE.put("560180", "科技-通用             ");//沪深300ESGETF南方     市值：0.34      累涨：19.64     5.71      7.11      6.82      4.06      2.77      46
        KEJI_GONG_YE.put("510990", "科技-通用             ");//180ESGETF             市值：0.48      累涨：19.26     6.38      6.15      6.73      3.92      2.45      47
        KEJI_GONG_YE.put("516960", "科技-通用             ");//机械ETF               市值：0.20      累涨：25.14     6.73      10.30     8.11      3.79      2.62      48
        KEJI_GONG_YE.put("516320", "科技-通用             ");//高端装备ETF           市值：0.86      累涨：25.53     6.64      10.83     8.06      3.54      1.84      49
        KEJI_GONG_YE.put("562910", "科技-通用             ");//高端制造ETF           市值：1.09      累涨：24.72     6.10      10.82     7.80      3.49      1.67      50
        KEJI_GONG_YE.put("510090", "科技-通用             ");//ESGETF基金            市值：0.80      累涨：19.16     6.05      6.25      6.86      3.46      2.09      51
        KEJI_GONG_YE.put("159886", "科技-通用             ");//机械ETF               市值：0.57      累涨：27.07     6.37      11.95     8.75      3.42      2.29      52
        KEJI_GONG_YE.put("510160", "科技-通用             ");//产业升级ETF           市值：2.42      累涨：18.50     6.86      6.83      4.81      2.76      2.16      53
        KEJI_GONG_YE.put("159206", "科技-通用             ");//卫星ETF               市值：1.47      累涨：1.20                          1.20      1.20      1.20      54
        KEJI_GONG_YE.put("511900", "科技-通用             ");//富国货币ETF           市值：1.59      累涨：0.11      0.03      0.05      0.03      0.02      0.01      55
    }

    public static Map<String, String> KEJI_RUAN_JIAN = new HashMap<>();//科技-软件

    static {
        KEJI_RUAN_JIAN.put("159559", "科技-软件             ");//机器人50ETF           市值：4.85      累涨：57.59     27.23     11.52     18.84     9.44      5日： 6.14      累涨修正：131.27    1
        KEJI_RUAN_JIAN.put("159530", "科技-软件             ");//机器人ETF易方达       市值：10.32     累涨：57.96     26.20     11.77     19.99     9.59      5日： 6.02      累涨修正：130.20    2
        KEJI_RUAN_JIAN.put("159363", "科技-软件             ");//创业板人工智能ETF华宝 市值：14.11     累涨：60.96     28.18     13.17     19.61     8.44      5日： 4.94      累涨修正：120.24    3
        KEJI_RUAN_JIAN.put("159526", "科技-软件             ");//机器人指数ETF         市值：6.00      累涨：60.93     31.90     11.98     17.05     7.86      5日： 4.94      累涨修正：120.21    4
        KEJI_RUAN_JIAN.put("562500", "科技-软件             ");//机器人ETF             市值：137.51    累涨：58.06     28.72     12.55     16.79     7.78      5日： 5.15      累涨修正：119.86    5
        KEJI_RUAN_JIAN.put("159738", "科技-软件             ");//云计算ETF华泰柏瑞     市值：5.89      累涨：67.77     37.77     14.29     15.71     8.15      5日： 4.26      累涨修正：118.89    6
        KEJI_RUAN_JIAN.put("513360", "科技-软件             ");//教育ETF               市值：6.49      累涨：66.06     38.71     16.09     11.26     7.42      5日： 4.30      累涨修正：117.66    7
        KEJI_RUAN_JIAN.put("562360", "科技-软件             ");//机器人ETF基金         市值：4.39      累涨：57.35     29.32     11.96     16.07     7.61      5日： 4.96      累涨修正：116.87    8
        KEJI_RUAN_JIAN.put("159770", "科技-软件             ");//机器人ETF             市值：56.04     累涨：57.97     29.02     12.23     16.72     7.90      5日： 4.87      累涨修正：116.41    9
        KEJI_RUAN_JIAN.put("560660", "科技-软件             ");//云50ETF               市值：0.78      累涨：64.85     34.86     13.24     16.75     8.02      5日： 4.28      累涨修正：116.21    10
        KEJI_RUAN_JIAN.put("159551", "科技-软件             ");//机器人产业ETF         市值：3.62      累涨：56.81     28.26     12.06     16.49     7.57      5日： 4.75      累涨修正：113.81    11
        KEJI_RUAN_JIAN.put("517390", "科技-软件             ");//云计算沪港深ETF       市值：2.90      累涨：70.73     42.72     13.56     14.45     6.67      5日： 3.46      累涨修正：112.25    12
        KEJI_RUAN_JIAN.put("159527", "科技-软件             ");//云计算50ETF           市值：1.23      累涨：62.74     36.67     11.42     14.65     6.62      5日： 3.49      累涨修正：104.62    13
        KEJI_RUAN_JIAN.put("516510", "科技-软件             ");//云计算ETF             市值：35.03     累涨：61.96     36.05     11.25     14.66     6.74      5日： 3.32      累涨修正：101.80    14
        KEJI_RUAN_JIAN.put("159739", "科技-软件             ");//大数据ETF             市值：5.24      累涨：61.19     35.82     11.29     14.08     6.06      5日： 3.08      累涨修正：98.15     15
        KEJI_RUAN_JIAN.put("588790", "科技-软件             ");//科创AIETF             市值：25.88     累涨：64.70     31.17     16.73     16.80     5.68      5日： 2.65      累涨修正：96.50     16
        KEJI_RUAN_JIAN.put("159890", "科技-软件             ");//云计算ETF             市值：4.96      累涨：61.61     36.70     10.89     14.02     6.18      5日： 2.90      累涨修正：96.41     17
        KEJI_RUAN_JIAN.put("588930", "科技-软件             ");//科创板人工智能ETF     市值：7.34      累涨：62.83     29.59     16.22     17.02     5.69      5日： 2.61      累涨修正：94.15     18
        KEJI_RUAN_JIAN.put("516630", "科技-软件             ");//云计算50ETF           市值：5.90      累涨：59.70     35.06     11.53     13.11     5.80      5日： 2.85      累涨修正：93.90     19
        KEJI_RUAN_JIAN.put("588730", "科技-软件             ");//科创人工智能ETF       市值：5.09      累涨：61.80     28.96     15.75     17.09     5.74      5日： 2.62      累涨修正：93.24     20
        KEJI_RUAN_JIAN.put("516000", "科技-软件             ");//数据ETF               市值：4.09      累涨：63.36     39.23     11.00     13.13     5.33      5日： 2.45      累涨修正：92.76     21
        KEJI_RUAN_JIAN.put("159852", "科技-软件             ");//软件ETF               市值：29.31     累涨：59.44     36.09     10.82     12.53     6.13      5日： 2.74      累涨修正：92.32     22
        KEJI_RUAN_JIAN.put("516700", "科技-软件             ");//大数据产业ETF         市值：1.15      累涨：62.02     37.95     11.05     13.02     5.59      5日： 2.52      累涨修正：92.26     23
        KEJI_RUAN_JIAN.put("515980", "科技-软件             ");//人工智能ETF           市值：34.25     累涨：52.80     28.22     10.14     14.44     5.98      5日： 3.20      累涨修正：91.20     24
        KEJI_RUAN_JIAN.put("515400", "科技-软件             ");//大数据ETF             市值：18.25     累涨：63.31     39.10     11.41     12.80     5.39      5日： 2.28      累涨修正：90.67     25
        KEJI_RUAN_JIAN.put("562930", "科技-软件             ");//软件ETF易方达         市值：1.34      累涨：58.05     35.55     10.28     12.22     5.64      5日： 2.70      累涨修正：90.45     26
        KEJI_RUAN_JIAN.put("562030", "科技-软件             ");//信创ETF基金           市值：0.59      累涨：63.36     37.71     11.34     14.31     6.04      5日： 2.12      累涨修正：88.80     27
        KEJI_RUAN_JIAN.put("562570", "科技-软件             ");//信创ETF               市值：4.32      累涨：65.12     39.89     12.29     12.94     5.35      5日： 1.95      累涨修正：88.52     28
        KEJI_RUAN_JIAN.put("560850", "科技-软件             ");//信创50ETF             市值：2.87      累涨：63.62     37.78     12.27     13.57     5.33      5日： 2.07      累涨修正：88.46     29
        KEJI_RUAN_JIAN.put("560360", "科技-软件             ");//软件指数ETF           市值：1.52      累涨：59.20     37.35     10.23     11.62     5.48      5日： 2.41      累涨修正：88.12     30
        KEJI_RUAN_JIAN.put("588760", "科技-软件             ");//人工智能ETF科创       市值：13.21     累涨：58.33     25.19     16.12     17.02     5.63      5日： 2.43      累涨修正：87.49     31
        KEJI_RUAN_JIAN.put("159586", "科技-软件             ");//计算机ETF南方         市值：2.86      累涨：60.12     34.96     11.68     13.48     5.66      5日： 2.25      累涨修正：87.12     32
        KEJI_RUAN_JIAN.put("159819", "科技-软件             ");//人工智能ETF           市值：156.54    累涨：53.02     28.36     10.72     13.94     5.44      5日： 2.71      累涨修正：85.54     33
        KEJI_RUAN_JIAN.put("512930", "科技-软件             ");//AI人工智能ETF         市值：18.87     累涨：52.85     27.85     11.31     13.69     5.07      5日： 2.44      累涨修正：82.13     34
        KEJI_RUAN_JIAN.put("515070", "科技-软件             ");//人工智能AIETF         市值：50.30     累涨：51.73     27.52     10.50     13.71     4.98      5日： 2.48      累涨修正：81.49     35
        KEJI_RUAN_JIAN.put("159899", "科技-软件             ");//软件龙头ETF           市值：3.08      累涨：54.35     30.25     11.27     12.83     6.10      5日： 2.20      累涨修正：80.75     36
        KEJI_RUAN_JIAN.put("517800", "科技-软件             ");//人工智能50ETF         市值：2.83      累涨：51.16     25.99     12.72     12.45     4.49      5日： 2.38      累涨修正：79.72     37
        KEJI_RUAN_JIAN.put("515230", "科技-软件             ");//软件ETF               市值：13.17     累涨：56.62     33.32     11.48     11.82     5.40      5日： 1.92      累涨修正：79.66     38
        KEJI_RUAN_JIAN.put("159998", "科技-软件             ");//计算机ETF             市值：29.10     累涨：54.26     32.00     10.90     11.36     4.56      5日： 2.11      累涨修正：79.58     39
        KEJI_RUAN_JIAN.put("512720", "科技-软件             ");//计算机ETF             市值：10.89     累涨：54.84     31.95     11.49     11.40     4.70      5日： 2.06      累涨修正：79.56     40
        KEJI_RUAN_JIAN.put("561010", "科技-软件             ");//软件ETF基金           市值：1.04      累涨：57.16     33.17     11.57     12.42     4.95      5日： 1.81      累涨修正：78.88     41
        KEJI_RUAN_JIAN.put("159590", "科技-软件             ");//软件50ETF             市值：2.57      累涨：56.62     31.91     11.93     12.78     5.61      5日： 1.79      累涨修正：78.10     42
        KEJI_RUAN_JIAN.put("159538", "科技-软件             ");//信创ETF富国           市值：0.56      累涨：52.41     29.23     10.81     12.37     3.39      5日： 1.79      累涨修正：73.89     43
        KEJI_RUAN_JIAN.put("159539", "科技-软件             ");//信创50ETF             市值：0.76      累涨：54.39     31.13     10.28     12.98     3.12      5日： 1.57      累涨修正：73.23     44
        KEJI_RUAN_JIAN.put("159381", "科技-软件             ");//创业板人工智能ETF华夏 市值：2.37      累涨：                              19.79     9.54      5日： 5.96      累涨修正：71.52     45
        KEJI_RUAN_JIAN.put("512330", "科技-软件             ");//信息科技ETF           市值：5.48      累涨：50.05     24.72     11.40     13.93     4.03      5日： 1.76      累涨修正：71.17     46
        KEJI_RUAN_JIAN.put("159388", "科技-软件             ");//创业板人工智能ETF国泰 市值：2.35      累涨：                                        9.31      5日： 5.92      累涨修正：71.04     47
        KEJI_RUAN_JIAN.put("516860", "科技-软件             ");//金融科技ETF           市值：8.65      累涨：58.33     30.55     13.15     14.63     5.54      5日： 1.02      累涨修正：70.57     48
        KEJI_RUAN_JIAN.put("159851", "科技-软件             ");//金融科技ETF           市值：42.27     累涨：59.05     29.97     14.06     15.02     5.41      5日： 0.87      累涨修正：69.49     49
        KEJI_RUAN_JIAN.put("516100", "科技-软件             ");//金融科技ETF华夏       市值：2.58      累涨：57.57     30.51     12.22     14.84     5.51      5日： 0.97      累涨修正：69.21     50
        KEJI_RUAN_JIAN.put("159540", "科技-软件             ");//信创ETF易方达         市值：1.71      累涨：53.61     30.32     10.35     12.94     3.43      5日： 1.18      累涨修正：67.77     51
        KEJI_RUAN_JIAN.put("159613", "科技-软件             ");//信息安全ETF           市值：0.73      累涨：53.56     31.09     10.79     11.68     3.60      5日： 1.07      累涨修正：66.40     52
        KEJI_RUAN_JIAN.put("159537", "科技-软件             ");//信创ETF               市值：0.91      累涨：50.30     29.86     10.57     9.87      2.75      5日： 1.21      累涨修正：64.82     53
        KEJI_RUAN_JIAN.put("562920", "科技-软件             ");//信息安全ETF           市值：0.58      累涨：52.26     29.66     10.55     12.05     3.17      5日： 1.02      累涨修正：64.50     54
        KEJI_RUAN_JIAN.put("562560", "科技-软件             ");//信息技术ETF           市值：0.33      累涨：42.03     21.15     7.98      12.90     3.72      5日： 1.82      累涨修正：63.87     55
        KEJI_RUAN_JIAN.put("159939", "科技-软件             ");//信息技术ETF           市值：15.21     累涨：44.85     22.97     9.23      12.65     3.14      5日： 1.49      累涨修正：62.73     56
        KEJI_RUAN_JIAN.put("159658", "科技-软件             ");//数字经济ETF           市值：2.08      累涨：45.86     25.33     9.70      10.83     2.78      5日： 1.18      累涨修正：60.02     57
        KEJI_RUAN_JIAN.put("560800", "科技-软件             ");//数字经济ETF           市值：7.55      累涨：47.35     26.19     9.61      11.55     2.90      5日： 1.05      累涨修正：59.95     58
        KEJI_RUAN_JIAN.put("588260", "科技-软件             ");//科创信息ETF           市值：1.34      累涨：49.92     25.34     10.62     13.96     2.80      5日： 0.38      累涨修正：54.48     59
        KEJI_RUAN_JIAN.put("588100", "科技-软件             ");//科创信息技术ETF       市值：2.65      累涨：49.58     25.30     11.55     12.73     2.79      5日： 0.39      累涨修正：54.26     60
        KEJI_RUAN_JIAN.put("560630", "科技-软件             ");//机器人产业ETF         市值：5.06      累涨：                              15.89     6.81      5日： 4.16      累涨修正：49.92     61
        KEJI_RUAN_JIAN.put("589520", "科技-软件             ");//科创人工智能ETF华宝   市值：2.51      累涨：                              17.05     5.54      5日： 2.71      累涨修正：32.52     62
        KEJI_RUAN_JIAN.put("589010", "科技-软件             ");//科创人工智能ETF华夏   市值：1.48      累涨：                                        5.12      5日： 2.40      累涨修正：28.80     63
        KEJI_RUAN_JIAN.put("588770", "科技-软件             ");//科创信息技术ETF摩根   市值：3.50      累涨：                              12.45     2.17      5日： 0.20      累涨修正：2.40      64
        KEJI_RUAN_JIAN.put("159213", "科技-软件             ");//机器人ETF基金         市值：2.33      累涨：                                                  5日：           累涨修正：0         65
    }

    public static Map<String, String> KEJI_XIN_PIAN = new HashMap<>();//科技-芯片

    static {
        KEJI_XIN_PIAN.put("588780", "科技-芯片             ");//科创芯片设计ETF       市值：1.98      累涨：60.76     3.40      26.55     31.40     22.03     7.89      1
        KEJI_XIN_PIAN.put("588990", "科技-芯片             ");//科创芯片ETF博时       市值：2.25      累涨：62.59     16.13     19.31     27.53     18.54     7.05      2
        KEJI_XIN_PIAN.put("588890", "科技-芯片             ");//科创芯片ETF南方       市值：4.99      累涨：63.15     15.73     20.24     27.65     18.44     7.34      3
        KEJI_XIN_PIAN.put("588290", "科技-芯片             ");//科创芯片ETF基金       市值：24.86     累涨：62.47     15.61     19.83     27.50     17.80     6.98      4
        KEJI_XIN_PIAN.put("588200", "科技-芯片             ");//科创芯片ETF           市值：225.55    累涨：63.38     15.98     20.20     27.66     17.79     6.94      5
        KEJI_XIN_PIAN.put("588750", "科技-芯片             ");//科创芯片50ETF         市值：12.78     累涨：49.28     1.67      21.07     26.74     17.52     6.42      6
        KEJI_XIN_PIAN.put("588810", "科技-芯片             ");//科创芯片ETF富国       市值：0.72      累涨：56.65               14.34     42.78     16.69     6.00      7
        KEJI_XIN_PIAN.put("159511", "科技-芯片             ");//通信ETF南方           市值：0.97      累涨：53.68     12.50     16.86     25.63     14.95     4.86      8
        KEJI_XIN_PIAN.put("159546", "科技-芯片             ");//集成电路ETF           市值：1.56      累涨：70.39     19.54     24.68     26.84     14.88     6.20      9
        KEJI_XIN_PIAN.put("159325", "科技-芯片             ");//半导体ETF南方         市值：1.12      累涨：60.38     15.32     19.67     26.05     14.27     6.47      10
        KEJI_XIN_PIAN.put("562820", "科技-芯片             ");//集成电路ETF           市值：0.72      累涨：68.33     19.17     24.74     25.02     14.26     6.17      11
        KEJI_XIN_PIAN.put("159310", "科技-芯片             ");//芯片产业ETF           市值：9.59      累涨：57.35     14.31     19.79     23.58     13.83     5.99      12
        KEJI_XIN_PIAN.put("159995", "科技-芯片             ");//芯片ETF               市值：256.43    累涨：57.63     14.57     19.80     23.81     13.51     5.60      13
        KEJI_XIN_PIAN.put("159801", "科技-芯片             ");//芯片ETF龙头           市值：32.47     累涨：56.19     14.11     18.95     23.77     13.50     5.77      14
        KEJI_XIN_PIAN.put("516640", "科技-芯片             ");//芯片龙头ETF           市值：12.78     累涨：58.45     14.85     20.39     23.47     13.41     5.64      15
        KEJI_XIN_PIAN.put("159813", "科技-芯片             ");//半导体ETF             市值：46.34     累涨：57.45     14.56     19.70     23.81     13.39     5.17      16
        KEJI_XIN_PIAN.put("159665", "科技-芯片             ");//半导体龙头ETF         市值：3.16      累涨：56.21     14.81     18.72     23.22     13.30     5.54      17
        KEJI_XIN_PIAN.put("512760", "科技-芯片             ");//芯片ETF               市值：117.03    累涨：57.51     14.35     20.03     23.56     13.23     5.68      18
        KEJI_XIN_PIAN.put("516350", "科技-芯片             ");//芯片ETF易方达         市值：10.10     累涨：57.21     15.08     19.68     22.91     13.18     5.41      19
        KEJI_XIN_PIAN.put("512480", "科技-芯片             ");//半导体ETF             市值：215.10    累涨：58.81     14.78     20.68     23.54     13.05     5.85      20
        KEJI_XIN_PIAN.put("516920", "科技-芯片             ");//芯片50ETF             市值：5.03      累涨：58.55     15.24     20.78     22.93     13.00     5.54      21
        KEJI_XIN_PIAN.put("159599", "科技-芯片             ");//芯片ETF基金           市值：6.78      累涨：55.43     14.29     19.44     22.50     12.43     5.40      22
        KEJI_XIN_PIAN.put("159560", "科技-芯片             ");//芯片50ETF             市值：1.41      累涨：54.04     13.83     18.93     21.61     12.27     5.26      23
        KEJI_XIN_PIAN.put("561980", "科技-芯片             ");//半导体设备ETF         市值：8.10      累涨：50.57     10.56     18.09     22.07     11.50     5.75      24
        KEJI_XIN_PIAN.put("159582", "科技-芯片             ");//半导体产业ETF         市值：1.58      累涨：47.83     10.08     16.36     21.39     11.14     5.33      25
        KEJI_XIN_PIAN.put("159695", "科技-芯片             ");//通信ETF               市值：1.15      累涨：52.36     12.00     20.83     21.20     10.66     5.11      26
        KEJI_XIN_PIAN.put("512220", "科技-芯片             ");//TMTETF                市值：4.30      累涨：54.64     13.34     21.83     20.77     10.25     5.02      27
        KEJI_XIN_PIAN.put("159327", "科技-芯片             ");//半导体设备ETF基金     市值：1.20      累涨：43.58     8.12      16.09     19.45     10.13     5.53      28
        KEJI_XIN_PIAN.put("159558", "科技-芯片             ");//半导体设备ETF易方达   市值：4.85      累涨：44.68     7.61      18.25     18.82     10.00     5.24      29
        KEJI_XIN_PIAN.put("159997", "科技-芯片             ");//电子ETF               市值：15.77     累涨：52.19     13.30     20.39     19.53     9.85      4.60      30
        KEJI_XIN_PIAN.put("159811", "科技-芯片             ");//5G50ETF               市值：1.14      累涨：56.42     14.70     22.28     21.48     9.72      4.12      31
        KEJI_XIN_PIAN.put("159583", "科技-芯片             ");//通信设备ETF           市值：0.77      累涨：57.12     15.00     23.72     20.20     9.58      4.59      32
        KEJI_XIN_PIAN.put("515320", "科技-芯片             ");//电子50ETF             市值：2.00      累涨：50.12     13.07     19.47     18.39     9.37      4.53      33
        KEJI_XIN_PIAN.put("515260", "科技-芯片             ");//电子ETF               市值：5.08      累涨：49.14     13.11     19.18     18.03     9.12      4.41      34
        KEJI_XIN_PIAN.put("560780", "科技-芯片             ");//芯片设备ETF           市值：1.89      累涨：42.52     8.01      16.87     17.82     9.10      5.00      35
        KEJI_XIN_PIAN.put("562590", "科技-芯片             ");//半导体材料ETF         市值：3.33      累涨：41.16     8.45      15.50     17.49     8.95      4.81      36
        KEJI_XIN_PIAN.put("159516", "科技-芯片             ");//半导体设备ETF         市值：21.04     累涨：42.68     8.17      16.58     18.12     8.85      4.96      37
        KEJI_XIN_PIAN.put("515880", "科技-芯片             ");//通信ETF               市值：33.58     累涨：60.41     16.05     27.24     19.93     8.82      4.38      38
        KEJI_XIN_PIAN.put("515050", "科技-芯片             ");//5G通信ETF             市值：65.17     累涨：60.51     16.88     26.32     19.36     8.42      4.05      39
        KEJI_XIN_PIAN.put("561600", "科技-芯片             ");//消费电子ETF           市值：1.77      累涨：52.32     14.64     21.51     17.09     8.31      3.58      40
        KEJI_XIN_PIAN.put("159779", "科技-芯片             ");//消费电子50ETF         市值：1.13      累涨：53.42     14.00     24.03     17.98     8.24      3.69      41
        KEJI_XIN_PIAN.put("159994", "科技-芯片             ");//5GETF                 市值：15.24     累涨：60.01     16.77     26.41     18.59     8.23      3.99      42
        KEJI_XIN_PIAN.put("562950", "科技-芯片             ");//消费电子ETF易方达     市值：2.90      累涨：52.67     14.77     21.76     16.94     7.78      3.32      43
        KEJI_XIN_PIAN.put("159909", "科技-芯片             ");//TMT50ETF              市值：4.27      累涨：45.83     11.60     18.65     16.72     7.73      4.44      44
        KEJI_XIN_PIAN.put("561100", "科技-芯片             ");//消费电子ETF富国       市值：5.20      累涨：52.21     14.50     21.35     17.55     7.71      3.35      45
        KEJI_XIN_PIAN.put("515920", "科技-芯片             ");//智能消费ETF           市值：2.07      累涨：44.42     12.23     18.44     14.97     7.33      3.71      46
        KEJI_XIN_PIAN.put("561310", "科技-芯片             ");//消电ETF               市值：0.76      累涨：49.83     14.75     20.27     16.13     6.43      2.42      47
        KEJI_XIN_PIAN.put("513310", "科技-芯片             ");//中韩半导体ETF         市值：5.94      累涨：41.00     8.95      17.76     14.75     5.90      1.95      48
        KEJI_XIN_PIAN.put("159732", "科技-芯片             ");//消费电子ETF           市值：23.86     累涨：53.79     14.83     24.60     14.93     5.27      3.07      49
        KEJI_XIN_PIAN.put("589100", "科技-芯片           ");//科创芯片ETF国泰       市值：2.54      累涨：                                                            86
    }

    public static Map<String, String> KEJI_TONG_XIN = new HashMap<>();

    static {
        KEJI_TONG_XIN.put("159811", "科技-通信             ");//5G50ETF               市值：1.14      累涨：58.19     19.59     23.22     15.67     7.71      4.13      1
        KEJI_TONG_XIN.put("159994", "科技-通信             ");//5GETF                 市值：15.44     累涨：59.58     20.75     25.37     14.25     7.21      4.08      2
        KEJI_TONG_XIN.put("515880", "科技-通信             ");//通信ETF               市值：33.92     累涨：59.98     19.15     26.77     14.06     7.18      3.81      3
        KEJI_TONG_XIN.put("159511", "科技-通信             ");//通信ETF南方           市值：0.90      累涨：52.21     13.53     19.65     19.03     7.18      2.81      4
        KEJI_TONG_XIN.put("515050", "科技-通信             ");//5G通信ETF             市值：65.93     累涨：59.49     20.21     25.97     13.96     6.94      3.77      5
        KEJI_TONG_XIN.put("159583", "科技-通信             ");//通信设备ETF           市值：0.88      累涨：56.88     18.23     24.10     15.04     6.94      3.02      6
        KEJI_TONG_XIN.put("159507", "科技-通信             ");//电信ETF               市值：0.46      累涨：53.00     15.32     23.05     14.63     6.60      3.29      7
        KEJI_TONG_XIN.put("159695", "科技-通信             ");//通信ETF               市值：1.17      累涨：52.24     14.94     22.32     14.98     6.52      3.26      8
        KEJI_TONG_XIN.put("563010", "科技-通信             ");//电信ETF               市值：1.91      累涨：47.56     11.60     19.22     16.74     5.99      3.16      9
        KEJI_TONG_XIN.put("560690", "科技-通信             ");//电信ETF基金           市值：0.30      累涨：48.96     12.01     20.71     16.24     5.59      2.84      10
        KEJI_TONG_XIN.put("560300", "科技-通信             ");//电信50ETF             市值：0.90      累涨：48.14     11.04     18.79     18.39     4.38      2.87      11
    }

    public static Map<String, String> KEJI_HK = new HashMap<>();//科技-香港科技

    static {
        KEJI_HK.put("513980", "科技-香港             ");//港股科技50ETF         市值：120.36    累涨：77.37     34.91     26.56     15.90     12.05     5.12      1
        KEJI_HK.put("513020", "科技-香港             ");//港股科技ETF           市值：8.44      累涨：75.62     36.13     24.12     15.37     11.91     5.31      2
        KEJI_HK.put("513560", "科技-香港             ");//香港科技ETF           市值：4.81      累涨：83.84     43.10     25.57     15.17     11.72     4.98      3
        KEJI_HK.put("513150", "科技-香港             ");//港股通科技ETF华泰柏瑞 市值：1.33      累涨：75.78     34.60     25.29     15.89     11.60     5.02      4
        KEJI_HK.put("513860", "科技-香港             ");//港股通科技ETF         市值：13.69     累涨：74.28     34.56     25.10     14.62     11.45     4.99      5
        KEJI_HK.put("159751", "科技-香港             ");//港股科技ETF           市值：5.46      累涨：72.91     33.92     23.68     15.31     11.12     4.95      6
        KEJI_HK.put("159636", "科技-香港             ");//港股通科技30ETF       市值：194.60    累涨：73.33     32.39     26.64     14.30     10.75     4.32      7
        KEJI_HK.put("159741", "科技-香港             ");//恒生科技ETF基金       市值：10.39     累涨：72.74     32.80     26.66     13.28     10.71     4.58      8
        KEJI_HK.put("159750", "科技-香港             ");//港股科技50ETF         市值：5.44      累涨：73.69     31.62     28.08     13.99     10.70     4.58      9
        KEJI_HK.put("159742", "科技-香港             ");//恒生科技指数ETF       市值：17.47     累涨：70.96     31.96     25.22     13.78     10.64     3.81      10
        KEJI_HK.put("513320", "科技-香港             ");//恒生新经济ETF         市值：2.21      累涨：69.43     32.24     23.18     14.01     10.62     4.69      11
        KEJI_HK.put("513130", "科技-香港             ");//恒生科技ETF           市值：239.31    累涨：72.68     32.76     26.38     13.54     10.57     4.22      12
        KEJI_HK.put("513260", "科技-香港             ");//恒生科技ETF基金       市值：39.56     累涨：72.01     32.63     25.69     13.69     10.51     4.12      13
        KEJI_HK.put("513380", "科技-香港             ");//恒生科技ETF龙头       市值：45.04     累涨：72.38     32.64     26.20     13.54     10.49     4.44      14
        KEJI_HK.put("513580", "科技-香港             ");//恒生科技ETF指数基金   市值：26.10     累涨：71.63     32.13     25.86     13.64     10.32     4.04      15
        KEJI_HK.put("159747", "科技-香港             ");//香港科技ETF           市值：4.23      累涨：69.69     30.97     24.75     13.97     10.30     4.32      16
        KEJI_HK.put("513180", "科技-香港             ");//恒生科技指数ETF       市值：258.56    累涨：71.66     32.81     25.56     13.29     10.25     4.16      17
        KEJI_HK.put("513010", "科技-香港             ");//恒生科技ETF易方达     市值：117.87    累涨：71.03     32.03     25.71     13.29     10.19     3.92      18
        KEJI_HK.put("159740", "科技-香港             ");//恒生科技ETF           市值：67.61     累涨：70.34     31.70     25.80     12.84     10.02     3.32      19
        KEJI_HK.put("513890", "科技-香港             ");//恒生科技HKETF         市值：3.91      累涨：70.27     32.45     25.16     12.66     10.02     3.56      20
        KEJI_HK.put("513040", "科技-香港             ");//港股通互联网ETF       市值：5.84      累涨：75.24     35.80     27.91     11.53     9.42      2.45      21
        KEJI_HK.put("159568", "科技-香港             ");//港股互联网ETF         市值：3.33      累涨：76.09     36.33     28.94     10.82     9.35      2.89      22
        KEJI_HK.put("513160", "科技-香港             ");//港股科技30ETF         市值：12.44     累涨：75.01     36.60     26.46     11.95     9.26      3.05      23
        KEJI_HK.put("513770", "科技-香港             ");//港股互联网ETF         市值：43.87     累涨：76.01     37.17     27.60     11.24     9.19      2.20      24
        KEJI_HK.put("159792", "科技-香港             ");//港股通互联网ETF       市值：432.85    累涨：74.58     35.00     29.06     10.52     8.59      1.92      25
        KEJI_HK.put("513330", "科技-香港             ");//恒生互联网ETF         市值：227.75    累涨：71.46     30.95     29.27     11.24     7.66      3.31      26
        KEJI_HK.put("517360", "科技-香港             ");//沪港深科技ETF         市值：0.35      累涨：55.10     24.04     20.96     10.10     7.62      3.09      27
        KEJI_HK.put("159688", "科技-香港             ");//恒生互联网ETF         市值：9.57      累涨：71.36     30.17     29.19     12.00     7.62      2.92      28
        KEJI_HK.put("517050", "科技-香港             ");//互联网ETF华泰柏瑞     市值：4.13      累涨：59.04     27.88     23.20     7.96      7.24      1.85      29
        KEJI_HK.put("159856", "科技-香港             ");//互联网龙头ETF         市值：2.73      累涨：60.68     29.54     23.25     7.89      7.22      1.79      30
        KEJI_HK.put("159607", "科技-香港             ");//中概互联网ETF         市值：13.72     累涨：69.88     29.96     30.63     9.29      7.04      3.84      31
        KEJI_HK.put("516050", "科技-香港             ");//科技龙头ETF           市值：4.04      累涨：41.17     19.09     13.61     8.60      7.02      2.49      32
        KEJI_HK.put("159778", "科技-香港             ");//工业互联ETF           市值：0.50      累涨：43.17     23.65     12.30     7.22      6.98      2.01      33
        KEJI_HK.put("159729", "科技-香港             ");//互联网ETF             市值：0.77      累涨：59.88     29.54     22.81     7.53      6.84      1.89      34
        KEJI_HK.put("513050", "科技-香港             ");//中概互联网ETF         市值：327.87    累涨：70.84     31.54     29.74     9.56      6.83      3.46      35
        KEJI_HK.put("159723", "科技-香港             ");//科技龙头ETF           市值：0.69      累涨：51.23     24.38     18.56     8.29      6.76      2.08      36
        KEJI_HK.put("159605", "科技-香港             ");//中概互联ETF           市值：50.25     累涨：69.87     29.94     30.78     9.15      6.73      3.33      37
        KEJI_HK.put("517200", "科技-香港             ");//互联网ETF             市值：1.12      累涨：62.14     29.76     25.08     7.30      6.50      1.77      38
        KEJI_HK.put("159822", "科技-香港             ");//新经济ETF             市值：4.89      累涨：87.33     44.20     13.95     29.18     6.44      2.77      39
        KEJI_HK.put("513220", "科技-香港             ");//中概互联ETF           市值：3.02      累涨：65.30     28.49     28.65     8.16      6.33      2.74      40
        KEJI_HK.put("159202", "科技-香港             ");//恒生互联网科技ETF     市值：1.49      累涨：1.46                          1.46      1.46      1.46      41
    }

    public static Map<String, String> KEJI_NEW_ENERGY = new HashMap<>();//科技-新能源

    static {
        KEJI_NEW_ENERGY.put("560980", "科技-新能源           ");//光伏ETF龙头           市值：1.58      累涨：28.22     8.21      13.32     8.36      3.64      2.43      1
        KEJI_NEW_ENERGY.put("562960", "科技-新能源           ");//绿色电力ETF易方达     市值：0.83      累涨：14.57     3.61      5.16      5.80      3.61      1.94      2
        KEJI_NEW_ENERGY.put("159863", "科技-新能源           ");//光伏ETF基金           市值：2.48      累涨：29.71     8.46      15.46     8.29      3.41      2.22      3
        KEJI_NEW_ENERGY.put("515790", "科技-新能源           ");//光伏ETF               市值：105.91    累涨：32.80     8.95      17.46     8.86      3.34      2.15      4
        KEJI_NEW_ENERGY.put("560580", "科技-新能源           ");//电力ETF南方           市值：0.52      累涨：14.40     3.41      5.31      5.78      3.31      1.90      5
        KEJI_NEW_ENERGY.put("562550", "科技-新能源           ");//绿电ETF               市值：1.18      累涨：14.70     3.79      4.73      6.18      3.30      1.93      6
        KEJI_NEW_ENERGY.put("561170", "科技-新能源           ");//绿色电力ETF           市值：1.63      累涨：15.19     4.07      5.24      5.88      3.30      1.93      7
        KEJI_NEW_ENERGY.put("159611", "科技-新能源           ");//电力ETF               市值：35.35     累涨：15.62     3.61      6.24      5.77      3.29      1.90      8
        KEJI_NEW_ENERGY.put("516180", "科技-新能源           ");//光伏ETF基金           市值：0.64      累涨：30.29     9.12      15.71     7.47      3.24      1.96      9
        KEJI_NEW_ENERGY.put("159857", "科技-新能源           ");//光伏ETF               市值：20.42     累涨：31.03     8.74      16.31     7.95      3.16      2.07      10
        KEJI_NEW_ENERGY.put("159669", "科技-新能源           ");//绿电ETF               市值：0.94      累涨：14.40     3.53      5.41      5.46      3.15      1.57      11
        KEJI_NEW_ENERGY.put("561700", "科技-新能源           ");//电力ETF基金           市值：1.46      累涨：14.60     3.70      5.31      5.59      3.02      1.70      12
        KEJI_NEW_ENERGY.put("516290", "科技-新能源           ");//光伏龙头ETF           市值：2.35      累涨：29.35     8.58      15.64     6.93      3.01      1.73      13
        KEJI_NEW_ENERGY.put("516880", "科技-新能源           ");//光伏50ETF             市值：7.53      累涨：29.96     8.81      16.28     7.18      3.01      1.91      14
        KEJI_NEW_ENERGY.put("561560", "科技-新能源           ");//电力ETF               市值：5.59      累涨：14.09     3.25      5.44      5.49      2.99      1.66      15
        KEJI_NEW_ENERGY.put("562350", "科技-新能源           ");//电力指数ETF           市值：0.51      累涨：14.17     3.62      5.30      5.25      2.91      1.70      16
        KEJI_NEW_ENERGY.put("159625", "科技-新能源           ");//绿色电力ETF           市值：3.31      累涨：14.16     3.83      5.13      5.20      2.90      1.35      17
        KEJI_NEW_ENERGY.put("159864", "科技-新能源           ");//光伏50ETF             市值：3.74      累涨：31.10     8.30      17.00     8.15      2.90      1.88      18
        KEJI_NEW_ENERGY.put("159618", "科技-新能源           ");//光伏ETF指数基金       市值：0.60      累涨：29.61     8.62      15.30     7.27      2.85      1.69      19
        KEJI_NEW_ENERGY.put("159609", "科技-新能源           ");//光伏龙头ETF           市值：2.43      累涨：29.21     8.44      15.04     7.40      2.76      1.85      20
        KEJI_NEW_ENERGY.put("562970", "科技-新能源           ");//光伏ETF易方达         市值：1.36      累涨：30.10     8.15      17.00     7.42      2.73      1.67      21
        KEJI_NEW_ENERGY.put("588830", "科技-新能源           ");//科创新能源ETF         市值：4.50      累涨：36.16     8.40      20.30     10.13     2.57      1.48      22
        KEJI_NEW_ENERGY.put("159861", "科技-新能源           ");//碳中和50ETF           市值：1.64      累涨：23.45     5.84      13.44     6.85      2.40      1.56      23
        KEJI_NEW_ENERGY.put("560560", "科技-新能源           ");//碳中和ETF泰康         市值：0.69      累涨：20.56     5.14      11.09     6.50      2.34      1.45      24
        KEJI_NEW_ENERGY.put("560550", "科技-新能源           ");//碳中和ETF龙头         市值：4.39      累涨：21.16     5.59      10.72     7.11      2.30      1.03      25
        KEJI_NEW_ENERGY.put("588960", "科技-新能源           ");//科创板新能源ETF       市值：0.20      累涨：18.82               10.37     9.49      2.30      1.17      26
        KEJI_NEW_ENERGY.put("159790", "科技-新能源           ");//碳中和ETF             市值：20.72     累涨：20.76     4.86      11.52     6.67      2.27      1.40      27
        KEJI_NEW_ENERGY.put("159641", "科技-新能源           ");//双碳ETF               市值：2.84      累涨：20.43     5.12      10.78     6.69      2.21      1.11      28
        KEJI_NEW_ENERGY.put("561190", "科技-新能源           ");//双碳ETF               市值：6.75      累涨：19.75     5.34      10.21     6.20      2.17      1.16      29
        KEJI_NEW_ENERGY.put("562300", "科技-新能源           ");//碳中和ETF基金         市值：0.64      累涨：19.13     5.46      10.28     5.91      2.15      1.62      30
        KEJI_NEW_ENERGY.put("159640", "科技-新能源           ");//碳中和龙头ETF         市值：1.94      累涨：20.17     5.69      10.23     6.29      2.07      1.04      31
        KEJI_NEW_ENERGY.put("159642", "科技-新能源           ");//碳中和100ETF          市值：0.93      累涨：20.76     5.83      10.78     6.66      2.02      0.89      32
        KEJI_NEW_ENERGY.put("516070", "科技-新能源           ");//低碳ETF易方达         市值：2.61      累涨：19.14     4.81      10.80     6.00      1.99      1.33      33
        KEJI_NEW_ENERGY.put("516580", "科技-新能源           ");//新能源主题ETF         市值：0.97      累涨：26.60     7.21      14.51     8.16      1.93      1.30      34
        KEJI_NEW_ENERGY.put("561380", "科技-新能源           ");//电网ETF               市值：0.83      累涨：30.01     14.30     10.42     7.03      1.93      0.71      35
        KEJI_NEW_ENERGY.put("159320", "科技-新能源           ");//电网ETF               市值：0.35      累涨：30.16     14.69     10.60     6.91      1.93      0.92      36
        KEJI_NEW_ENERGY.put("159639", "科技-新能源           ");//碳中和ETF南方         市值：7.26      累涨：20.02     5.87      10.33     6.08      1.92      1.16      37
        KEJI_NEW_ENERGY.put("562990", "科技-新能源           ");//碳中和ETF易方达       市值：11.10     累涨：20.14     5.85      10.35     6.47      1.91      1.03      38
        KEJI_NEW_ENERGY.put("159752", "科技-新能源           ");//新能源龙头ETF         市值：3.19      累涨：24.69     7.43      13.51     6.94      1.89      1.27      39
        KEJI_NEW_ENERGY.put("562010", "科技-新能源           ");//绿色能源ETF           市值：0.15      累涨：27.07     7.22      15.15     7.32      1.88      1.22      40
        KEJI_NEW_ENERGY.put("512580", "科技-新能源           ");//环保ETF               市值：12.33     累涨：21.99     5.06      12.39     6.94      1.86      1.04      41
        KEJI_NEW_ENERGY.put("560960", "科技-新能源           ");//碳中和60指数ETF       市值：0.24      累涨：22.77     5.69      13.02     6.10      1.85      0.87      42
        KEJI_NEW_ENERGY.put("516090", "科技-新能源           ");//新能源ETF易方达       市值：6.89      累涨：27.96     7.76      16.08     7.59      1.83      1.31      43
        KEJI_NEW_ENERGY.put("560060", "科技-新能源           ");//碳中和ETF             市值：2.35      累涨：20.18     5.55      10.77     6.43      1.81      0.91      44
        KEJI_NEW_ENERGY.put("516270", "科技-新能源           ");//新能源50ETF           市值：2.16      累涨：24.04     7.19      12.75     7.37      1.73      1.31      45
        KEJI_NEW_ENERGY.put("159885", "科技-新能源           ");//碳中和ETF基金         市值：2.59      累涨：19.18     5.36      10.43     5.78      1.70      1.02      46
        KEJI_NEW_ENERGY.put("516850", "科技-新能源           ");//新能源ETF基金         市值：1.23      累涨：26.53     7.33      15.36     7.51      1.67      1.26      47
        KEJI_NEW_ENERGY.put("516160", "科技-新能源           ");//新能源ETF             市值：47.03     累涨：26.83     7.14      15.79     7.62      1.58      1.23      48
        KEJI_NEW_ENERGY.put("159875", "科技-新能源           ");//新能源ETF             市值：9.38      累涨：26.19     6.80      15.15     7.51      1.51      1.30      49
        KEJI_NEW_ENERGY.put("159326", "科技-新能源           ");//电网设备ETF           市值：0.68      累涨：27.93     11.54     11.77     6.57      1.06      0.53      50
        KEJI_NEW_ENERGY.put("159368", "科技-新能源           ");//创业板新能源ETF华夏   市值：1.64      累涨：0.51                          0.51      0.51      0.51      51
    }

    public static Map<String, String> KEJI_NEW_CAR = new HashMap<>();//科技-汽车

    static {
        KEJI_NEW_CAR.put("159323", "科技-汽车             ");//港股通汽车ETF         市值：1.84      累涨：55.26     3.46      27.17     24.63     11.27     5.13      1
        KEJI_NEW_CAR.put("520600", "科技-汽车             ");//港股汽车ETF           市值：8.16      累涨：64.79     5.25      34.60     24.94     9.81      4.28      2
        KEJI_NEW_CAR.put("159512", "科技-汽车             ");//汽车ETF               市值：0.89      累涨：36.65     14.46     13.19     9.07      6.29      4.30      3
        KEJI_NEW_CAR.put("159872", "科技-汽车             ");//智能网联汽车ETF       市值：0.54      累涨：47.06     12.09     24.87     10.30     6.10      2.69      4
        KEJI_NEW_CAR.put("159565", "科技-汽车             ");//汽车零部件ETF         市值：0.99      累涨：47.82     14.85     20.36     13.14     5.71      3.30      5
        KEJI_NEW_CAR.put("159720", "科技-汽车             ");//智能车ETF泰康         市值：0.58      累涨：38.17     8.98      17.77     11.42     5.69      4.10      6
        KEJI_NEW_CAR.put("562700", "科技-汽车             ");//汽车零部件ETF         市值：0.38      累涨：47.45     14.83     20.09     12.78     5.58      3.24      7
        KEJI_NEW_CAR.put("516110", "科技-汽车             ");//汽车ETF               市值：6.65      累涨：35.46     12.62     14.47     8.37      5.58      3.98      8
        KEJI_NEW_CAR.put("516520", "科技-汽车             ");//智能驾驶ETF           市值：4.33      累涨：56.86     15.95     28.75     12.41     5.54      2.93      9
        KEJI_NEW_CAR.put("159566", "科技-汽车             ");//储能电池ETF           市值：1.32      累涨：40.58     13.11     14.42     13.05     5.54      1.84      10
        KEJI_NEW_CAR.put("159755", "科技-汽车             ");//电池ETF               市值：37.69     累涨：43.06     10.37     18.96     13.73     5.53      3.73      11
        KEJI_NEW_CAR.put("159775", "科技-汽车             ");//新能源车电池ETF       市值：0.64      累涨：39.85     10.14     16.30     13.41     5.45      3.47      12
        KEJI_NEW_CAR.put("560000", "科技-汽车             ");//智慧电车ETF           市值：0.11      累涨：42.19     11.61     18.42     12.16     5.34      3.67      13
        KEJI_NEW_CAR.put("562260", "科技-汽车             ");//汽车配件ETF           市值：0.14      累涨：44.55     13.68     19.00     12.04     5.33      2.86      14
        KEJI_NEW_CAR.put("159306", "科技-汽车             ");//汽车零件ETF           市值：0.30      累涨：45.82     14.40     19.43     12.16     5.30      3.14      15
        KEJI_NEW_CAR.put("515030", "科技-汽车             ");//新能源车ETF           市值：49.97     累涨：40.35     10.22     17.31     12.82     5.25      3.31      16
        KEJI_NEW_CAR.put("159305", "科技-汽车             ");//储能电池50ETF         市值：0.48      累涨：37.69     11.46     14.60     11.63     5.22      1.89      17
        KEJI_NEW_CAR.put("159840", "科技-汽车             ");//锂电池ETF             市值：11.09     累涨：40.67     10.04     17.63     13.00     5.19      3.47      18
        KEJI_NEW_CAR.put("516380", "科技-汽车             ");//智能电动车ETF         市值：1.03      累涨：41.69     10.22     21.00     10.47     5.16      3.95      19
        KEJI_NEW_CAR.put("515700", "科技-汽车             ");//新能车ETF             市值：25.44     累涨：40.28     9.81      17.26     13.21     5.09      3.29      20
        KEJI_NEW_CAR.put("515250", "科技-汽车             ");//智能汽车ETF           市值：9.11      累涨：57.98     16.80     29.34     11.84     5.08      2.85      21
        KEJI_NEW_CAR.put("159888", "科技-汽车             ");//智能车ETF             市值：0.93      累涨：55.41     16.54     27.73     11.39     5.08      2.83      22
        KEJI_NEW_CAR.put("516590", "科技-汽车             ");//智能汽车ETF易方达     市值：1.03      累涨：40.06     10.17     19.71     10.18     5.08      3.92      23
        KEJI_NEW_CAR.put("159757", "科技-汽车             ");//电池30ETF             市值：3.41      累涨：40.94     10.30     16.81     13.83     5.04      3.53      24
        KEJI_NEW_CAR.put("516390", "科技-汽车             ");//新能源汽车ETF         市值：3.80      累涨：39.27     9.08      16.91     13.28     5.00      3.07      25
        KEJI_NEW_CAR.put("516660", "科技-汽车             ");//新能源车ETF基金       市值：3.67      累涨：39.96     9.88      17.35     12.73     4.99      3.42      26
        KEJI_NEW_CAR.put("159824", "科技-汽车             ");//新能车ETF             市值：1.82      累涨：40.66     9.98      17.40     13.28     4.97      3.29      27
        KEJI_NEW_CAR.put("159767", "科技-汽车             ");//电池龙头ETF           市值：1.27      累涨：41.00     10.79     17.11     13.10     4.93      3.23      28
        KEJI_NEW_CAR.put("159795", "科技-汽车             ");//智能汽车ETF基金       市值：0.43      累涨：56.03     16.62     27.82     11.59     4.86      2.61      29
        KEJI_NEW_CAR.put("159806", "科技-汽车             ");//新能源车ETF           市值：10.97     累涨：39.25     9.34      17.59     12.32     4.83      2.94      30
        KEJI_NEW_CAR.put("159637", "科技-汽车             ");//新能源车龙头ETF       市值：9.11      累涨：37.99     8.91      16.73     12.35     4.70      3.04      31
        KEJI_NEW_CAR.put("159889", "科技-汽车             ");//智能汽车ETF           市值：0.58      累涨：55.94     16.63     28.64     11.05     4.59      2.37      32
        KEJI_NEW_CAR.put("159796", "科技-汽车             ");//电池50ETF             市值：11.12     累涨：35.69     8.26      15.09     12.34     4.06      2.45      33
        KEJI_NEW_CAR.put("561910", "科技-汽车             ");//电池ETF               市值：6.80      累涨：35.45     9.72      13.44     12.29     4.03      2.51      34
        KEJI_NEW_CAR.put("561160", "科技-汽车             ");//锂电池ETF             市值：6.77      累涨：37.62     10.54     14.22     12.86     3.84      2.32      35
        KEJI_NEW_CAR.put("562880", "科技-汽车             ");//电池ETF基金           市值：3.63      累涨：35.94     9.58      15.03     11.33     3.52      2.23      36
    }

    /**
     * 科技
     */
    public static Map<String, String> KEJI = new HashMap<>();

    static {
        KEJI.putAll(KEJI_HK);
        KEJI.putAll(KEJI_XIN_PIAN);
        KEJI.putAll(KEJI_TONG_XIN);
        KEJI.putAll(KEJI_RUAN_JIAN);
        KEJI.putAll(KEJI_GONG_YE);
        KEJI.putAll(KEJI_JUNGONG);
        KEJI.putAll(KEJI_NEW_ENERGY);
        KEJI.putAll(KEJI_NEW_CAR);
    }

    /**
     * 指数
     */
    public static Map<String, String> INDEX_688 = new HashMap<>();//指数-科创板

    static {
        INDEX_688.put("588680", "指数-科创板           ");//科创100ETF增强指数基金市值：0.40      累涨：50.14     21.22     12.42     16.50     13.68     5.31      1
        INDEX_688.put("589890", "指数-科创板           ");//科创综指ETF景顺       市值：8.48      累涨：19.84               4.63      15.21     13.22     4.44      2
        INDEX_688.put("589800", "指数-科创板           ");//科创综指ETF易方达     市值：16.85     累涨：22.14               6.98      15.16     13.16     4.23      3
        INDEX_688.put("589630", "指数-科创板           ");//科创综指ETF国泰       市值：12.89     累涨：17.52               2.34      15.18     13.06     4.35      4
        INDEX_688.put("588910", "指数-科创板           ");//科创价值ETF           市值：10.86     累涨：13.06                         13.06     13.06     4.61      5
        INDEX_688.put("588120", "指数-科创板           ");//科创板100ETF          市值：9.72      累涨：48.75     20.44     13.67     15.64     12.81     5.62      6
        INDEX_688.put("588240", "指数-科创板           ");//科创200ETF指数        市值：1.00      累涨：27.53               11.50     16.03     12.77     6.08      7
        INDEX_688.put("588210", "指数-科创板           ");//科创100ETF易方达      市值：3.18      累涨：49.95     21.34     14.05     15.49     12.69     5.32      8
        INDEX_688.put("588800", "指数-科创板           ");//科创100ETF华夏        市值：33.59     累涨：48.87     20.96     13.36     15.48     12.65     5.46      9
        INDEX_688.put("588260", "指数-科创板           ");//科创信息ETF           市值：1.38      累涨：52.92     20.00     18.18     14.74     12.61     5.49      10
        INDEX_688.put("589060", "指数-科创板           ");//科创综指ETF东财       市值：2.32      累涨：14.36                         14.36     12.55     3.94      11
        INDEX_688.put("588030", "指数-科创板           ");//科创100指数ETF        市值：59.00     累涨：50.23     21.59     13.90     15.44     12.51     5.42      12
        INDEX_688.put("588790", "指数-科创板           ");//科创AIETF             市值：24.57     累涨：70.63     31.23     23.08     16.81     12.37     5.26      13
        INDEX_688.put("589080", "指数-科创板           ");//科创综指ETF汇添富     市值：5.65      累涨：19.59               5.31      14.28     12.18     4.08      14
        INDEX_688.put("588190", "指数-科创板           ");//科创100ETF            市值：35.56     累涨：48.97     20.69     13.67     15.21     12.17     5.43      15
        INDEX_688.put("588220", "指数-科创板           ");//科创100ETF基金        市值：45.54     累涨：49.38     21.01     13.89     15.28     12.14     5.42      16
        INDEX_688.put("588230", "指数-科创板           ");//科创200ETF            市值：2.35      累涨：52.36     23.43     15.18     15.05     12.12     5.89      17
        INDEX_688.put("588010", "指数-科创板           ");//科创新材料ETF         市值：2.58      累涨：39.27     13.81     12.38     13.92     12.11     4.24      18
        INDEX_688.put("588160", "指数-科创板           ");//科创材料ETF           市值：1.50      累涨：39.92     14.36     12.53     13.70     12.08     4.34      19
        INDEX_688.put("589500", "指数-科创板           ");//科创综指ETF工银       市值：4.32      累涨：21.39               7.19      14.20     11.99     4.22      20
        INDEX_688.put("588880", "指数-科创板           ");//科创100ETF华泰柏瑞    市值：2.28      累涨：48.82     20.65     14.09     14.91     11.98     5.26      21
        INDEX_688.put("588020", "指数-科创板           ");//科创成长50ETF         市值：3.06      累涨：52.00     18.09     17.57     17.28     11.95     4.64      22
        INDEX_688.put("589000", "指数-科创板           ");//科创综指ETF华夏       市值：9.89      累涨：19.33               5.50      13.83     11.95     3.86      23
        INDEX_688.put("589660", "指数-科创板           ");//科创综指ETF南方       市值：5.84      累涨：19.26               5.32      13.94     11.85     3.98      24
        INDEX_688.put("588900", "指数-科创板           ");//科创100ETF南方        市值：2.92      累涨：48.73     20.10     14.81     14.72     11.80     5.32      25
        INDEX_688.put("588500", "指数-科创板           ");//科创100增强ETF易方达  市值：1.33      累涨：48.84     21.11     14.37     14.34     11.80     5.71      26
        INDEX_688.put("588820", "指数-科创板           ");//科创200ETF基金        市值：0.24      累涨：52.34     22.89     15.58     14.91     11.79     6.18      27
        INDEX_688.put("589770", "指数-科创板           ");//科创综指ETF招商       市值：8.01      累涨：19.10               5.50      13.60     11.61     3.99      28
        INDEX_688.put("588070", "指数-科创板           ");//科创板成长ETF         市值：0.35      累涨：51.14     17.91     16.48     17.34     11.45     4.17      29
        INDEX_688.put("588770", "指数-科创板           ");//科创信息技术ETF摩根   市值：3.58      累涨：13.44                         13.44     11.42     4.89      30
        INDEX_688.put("589600", "指数-科创板           ");//科创综指ETF富国       市值：16.83     累涨：16.14               2.95      13.19     11.37     4.18      31
        INDEX_688.put("588100", "指数-科创板           ");//科创信息技术ETF       市值：2.77      累涨：52.39     20.38     18.00     14.01     11.37     5.13      32
        INDEX_688.put("588110", "指数-科创板           ");//科创成长ETF           市值：1.94      累涨：53.04     19.25     17.19     17.21     11.31     3.95      33
        INDEX_688.put("589680", "指数-科创板           ");//科创综指ETF鹏华       市值：19.27     累涨：19.22               5.52      13.70     11.28     4.00      34
        INDEX_688.put("589860", "指数-科创板           ");//科创综指ETF天弘       市值：7.78      累涨：17.71               4.68      13.03     11.12     4.25      35
        INDEX_688.put("589900", "指数-科创板           ");//科创综指ETF博时       市值：13.77     累涨：17.65               4.73      12.92     11.03     3.99      36
        INDEX_688.put("589990", "指数-科创板           ");//科创综指ETF华泰柏瑞   市值：3.95      累涨：17.63               4.78      12.85     10.98     3.63      37
        INDEX_688.put("589880", "指数-科创板           ");//科创综指ETF建信       市值：8.64      累涨：19.88               6.75      13.13     10.93     4.19      38
        INDEX_688.put("588460", "指数-科创板           ");//科创50增强ETF         市值：6.19      累涨：46.34     16.40     17.39     12.64     10.75     4.68      39
        INDEX_688.put("588450", "指数-科创板           ");//科创50ETF增强         市值：1.00      累涨：42.33     15.95     14.47     11.91     10.62     3.41      40
        INDEX_688.put("588000", "指数-科创板           ");//科创50ETF             市值：779.43    累涨：45.59     16.99     16.34     12.26     10.50     3.23      41
        INDEX_688.put("588170", "指数-科创板           ");//科创半导体ETF         市值：2.22      累涨：10.34                         10.34     10.34     3.12      42
        INDEX_688.put("588050", "指数-科创板           ");//科创ETF               市值：113.69    累涨：45.36     16.84     16.81     11.71     10.01     3.41      43
        INDEX_688.put("588090", "指数-科创板           ");//科创板ETF             市值：44.62     累涨：44.39     16.31     16.67     11.41     10.00     3.41      44
        INDEX_688.put("588180", "指数-科创板           ");//科创50ETF基金         市值：32.81     累涨：43.72     15.93     16.16     11.63     9.98      3.58      45
        INDEX_688.put("588060", "指数-科创板           ");//科创50ETF龙头         市值：54.10     累涨：44.83     16.26     16.95     11.62     9.95      3.63      46
        INDEX_688.put("588280", "指数-科创板           ");//科创50ETF指数基金     市值：4.34      累涨：44.39     16.44     16.40     11.55     9.93      3.47      47
        INDEX_688.put("588840", "指数-科创板           ");//科创板50ETF基金       市值：1.93      累涨：13.46               2.12      11.34     9.86      3.61      48
        INDEX_688.put("588080", "指数-科创板           ");//科创板50ETF           市值：606.59    累涨：45.10     16.91     16.96     11.23     9.62      3.22      49
        INDEX_688.put("588870", "指数-科创板           ");//科创50指数ETF         市值：1.67      累涨：41.64     13.18     17.27     11.19     9.40      3.63      50
        INDEX_688.put("588150", "指数-科创板           ");//科创50ETF南方         市值：2.71      累涨：44.17     16.41     16.62     11.14     9.34      3.16      51
        INDEX_688.put("588660", "指数-科创板           ");//科创创业50ETF基金     市值：3.61      累涨：10.44               0.80      9.64      9.32      2.86      52
        INDEX_688.put("588960", "指数-科创板           ");//科创板新能源ETF       市值：0.24      累涨：28.57     1.61      16.04     10.92     8.85      2.13      53
        INDEX_688.put("588830", "指数-科创板           ");//科创新能源ETF         市值：4.47      累涨：40.01     12.39     16.57     11.05     8.76      2.21      54
        INDEX_688.put("588950", "指数-科创板           ");//科创50ETF景顺         市值：1.87      累涨：41.42     13.87     17.17     10.38     8.21      3.62      55
        INDEX_688.put("588300", "指数-科创板           ");//双创ETF               市值：17.16     累涨：35.99     15.03     11.92     9.04      8.17      2.84      56
        INDEX_688.put("588390", "指数-科创板           ");//科创创业50ETF         市值：2.39      累涨：33.17     13.65     11.27     8.25      8.09      2.87      57
        INDEX_688.put("588370", "指数-科创板           ");//科创50增强ETF南方     市值：1.10      累涨：45.86     18.40     17.15     10.31     8.06      3.68      58
        INDEX_688.put("159781", "指数-科创板           ");//科创创业ETF           市值：82.30     累涨：35.58     14.82     12.16     8.60      7.88      2.96      59
        INDEX_688.put("159780", "指数-科创板           ");//双创ETF               市值：39.94     累涨：35.62     15.40     11.89     8.50      7.79      2.93      60
        INDEX_688.put("588400", "指数-科创板           ");//科创创业指数ETF       市值：17.10     累涨：34.15     14.40     11.66     8.09      7.73      2.91      61
        INDEX_688.put("588380", "指数-科创板           ");//双创50ETF             市值：22.53     累涨：34.75     14.92     11.83     8.17      7.65      2.88      62
        INDEX_688.put("588350", "指数-科创板           ");//双创50ETF基金         市值：14.22     累涨：34.76     14.66     11.88     8.22      7.64      2.91      63
        INDEX_688.put("159782", "指数-科创板           ");//双创50ETF             市值：9.05      累涨：32.86     13.84     10.88     8.14      7.60      2.53      64
        INDEX_688.put("588360", "指数-科创板           ");//科创创业ETF           市值：4.35      累涨：35.25     15.16     12.16     7.93      7.60      2.90      65
        INDEX_688.put("159783", "指数-科创板           ");//科创创业50ETF         市值：42.90     累涨：33.48     13.98     11.38     8.12      7.58      2.92      66
        INDEX_688.put("588310", "指数-科创板           ");//双创ETF基金           市值：0.68      累涨：34.22     15.09     11.74     7.39      7.23      3.19      67
        INDEX_688.put("588320", "指数-科创板           ");//双创50ETF增强         市值：0.22      累涨：32.44     13.84     11.28     7.43      7.20      3.16      68
        INDEX_688.put("588330", "指数-科创板           ");//双创龙头ETF           市值：10.89     累涨：32.84     14.33     11.09     7.42      7.07      2.50      69
        INDEX_688.put("159603", "指数-科创板           ");//双创龙头ETF           市值：21.28     累涨：35.01     14.84     12.92     7.36      6.89      2.68      70
        INDEX_688.put("159335", "指数-科创板           ");//央企科创ETF           市值：3.69      累涨：27.15     11.08     9.54      6.53      5.59      0.78      71
        INDEX_688.put("588720", "指数-科创板           ");//科创50ETF中银         市值：1.84      累涨：1.19                          1.19      1.19      1.19      72
        INDEX_688.put("588040", "指数-科创板           ");//科创50ETF指数         市值：0.54      累涨：1.06                          1.06      1.06      1.06      73
        INDEX_688.put("589300", "指数-科创板           ");//科创综指ETF嘉实       市值：3.44      累涨：                                                            74
    }

    /**
     * 指数-香港指数
     */
    public static Map<String, String> INDEX_HK = new HashMap<>();//指数-港股

    static {
        INDEX_HK.put("159688", "指数-港股             ");//恒生互联网ETF         市值：7.71      累涨：65.40     6.04      33.78     29.19     17.46     7.05      1
        INDEX_HK.put("513330", "指数-港股             ");//恒生互联网ETF         市值：247.18    累涨：65.50     5.46      34.52     29.09     17.46     6.95      2
        INDEX_HK.put("159568", "指数-港股             ");//港股互联网ETF         市值：3.97      累涨：72.76     7.49      39.72     29.11     16.63     6.72      3
        INDEX_HK.put("513770", "指数-港股             ");//港股互联网ETF         市值：47.12     累涨：72.23     7.46      40.72     27.96     15.79     6.39      4
        INDEX_HK.put("159792", "指数-港股             ");//港股通互联网ETF       市值：432.05    累涨：71.92     7.86      38.37     29.61     15.68     6.41      5
        INDEX_HK.put("513040", "指数-港股             ");//港股通互联网ETF       市值：6.25      累涨：71.06     7.35      39.31     28.53     15.35     5.96      6
        INDEX_HK.put("513160", "指数-港股             ");//港股科技30ETF         市值：13.31     累涨：75.19     12.13     40.14     29.56     14.90     4.84      7
        INDEX_HK.put("513980", "指数-港股             ");//港股科技50ETF         市值：120.87    累涨：71.32     9.98      39.19     28.28     14.88     7.22      8
        INDEX_HK.put("159741", "指数-港股             ");//恒生科技ETF基金       市值：7.39      累涨：66.83     7.37      36.15     28.52     14.75     5.87      9
        INDEX_HK.put("513130", "指数-港股             ");//恒生科技ETF           市值：260.45    累涨：67.03     7.89      36.46     27.98     14.55     5.89      10
        INDEX_HK.put("513380", "指数-港股             ");//恒生科技ETF龙头       市值：43.38     累涨：66.82     7.98      36.26     27.92     14.50     5.93      11
        INDEX_HK.put("159750", "指数-港股             ");//港股科技50ETF         市值：5.39      累涨：67.81     8.11      35.57     29.06     14.49     6.74      12
        INDEX_HK.put("513010", "指数-港股             ");//恒生科技ETF易方达     市值：110.49    累涨：65.89     8.15      35.37     27.37     14.30     5.90      13
        INDEX_HK.put("513260", "指数-港股             ");//恒生科技ETF基金       市值：33.32     累涨：66.36     8.04      36.04     27.53     14.30     5.99      14
        INDEX_HK.put("513860", "指数-港股             ");//港股通科技ETF         市值：15.18     累涨：69.28     9.88      38.01     26.54     14.26     6.28      15
        INDEX_HK.put("159636", "指数-港股             ");//港股通科技30ETF       市值：174.08    累涨：69.53     10.50     36.32     28.47     14.25     6.90      16
        INDEX_HK.put("513150", "指数-港股             ");//港股通科技ETF华泰柏瑞 市值：1.77      累涨：70.17     10.60     38.71     27.02     14.19     6.69      17
        INDEX_HK.put("159735", "指数-港股             ");//港股消费ETF           市值：6.24      累涨：62.66     7.71      32.22     26.60     14.16     7.50      18
        INDEX_HK.put("513580", "指数-港股             ");//恒生科技ETF指数基金   市值：25.77     累涨：66.22     8.23      35.92     27.82     14.02     5.92      19
        INDEX_HK.put("513180", "指数-港股             ");//恒生科技指数ETF       市值：264.70    累涨：66.39     8.02      36.06     27.39     13.99     5.77      20
        INDEX_HK.put("513070", "指数-港股             ");//港股消费ETF易方达     市值：3.90      累涨：59.55     6.82      30.77     25.62     13.95     7.31      21
        INDEX_HK.put("513890", "指数-港股             ");//恒生科技HKETF         市值：3.80      累涨：65.35     7.74      35.79     26.55     13.90     5.95      22
        INDEX_HK.put("159740", "指数-港股             ");//恒生科技ETF           市值：64.62     累涨：65.21     7.71      35.03     27.53     13.88     5.51      23
        INDEX_HK.put("159742", "指数-港股             ");//恒生科技指数ETF       市值：16.28     累涨：65.14     7.96      35.37     27.17     13.87     5.83      24
        INDEX_HK.put("513020", "指数-港股             ");//港股科技ETF           市值：6.63      累涨：69.02     9.02      39.88     26.06     13.81     6.46      25
        INDEX_HK.put("513230", "指数-港股             ");//港股消费ETF           市值：2.96      累涨：59.73     6.37      31.45     25.53     13.73     7.09      26
        INDEX_HK.put("159751", "指数-港股             ");//港股科技ETF           市值：4.69      累涨：66.57     8.97      37.47     25.14     13.44     6.49      27
        INDEX_HK.put("513320", "指数-港股             ");//恒生新经济ETF         市值：2.71      累涨：64.45     9.03      35.74     24.99     13.20     6.77      28
        INDEX_HK.put("517550", "指数-港股             ");//消费ETF沪港深         市值：0.68      累涨：42.00     6.32      17.68     21.02     13.19     6.99      29
        INDEX_HK.put("159323", "指数-港股             ");//港股通汽车ETF         市值：1.82      累涨：55.26     3.46      30.63     26.80     13.03     5.92      30
        INDEX_HK.put("159506", "指数-港股             ");//恒生医疗ETF           市值：13.96     累涨：51.51     6.39      25.71     24.90     12.88     9.26      31
        INDEX_HK.put("513750", "指数-港股             ");//港股非银ETF           市值：14.46     累涨：44.86     5.86      19.33     23.10     12.62     7.21      32
        INDEX_HK.put("517360", "指数-港股             ");//沪港深科技ETF         市值：0.50      累涨：54.39     9.39      28.58     21.65     12.53     6.36      33
        INDEX_HK.put("520600", "指数-港股             ");//港股汽车ETF           市值：8.05      累涨：64.79     5.25      38.81     27.19     12.16     5.18      34
        INDEX_HK.put("517390", "指数-港股             ");//云计算沪港深ETF       市值：3.67      累涨：77.53     13.06     44.60     26.34     12.12     3.62      35
        INDEX_HK.put("513780", "指数-港股             ");//港股创新药50ETF       市值：1.76      累涨：50.33     7.50      23.70     24.61     11.83     8.47      36
        INDEX_HK.put("159788", "指数-港股             ");//港股通100ETF          市值：1.14      累涨：48.56     5.72      23.35     22.03     11.79     6.02      37
        INDEX_HK.put("159615", "指数-港股             ");//恒生生物科技ETF       市值：3.59      累涨：47.40     6.10      23.26     23.11     11.71     8.14      38
        INDEX_HK.put("159567", "指数-港股             ");//港股创新药ETF         市值：5.55      累涨：48.91     5.73      22.30     25.43     11.65     8.12      39
        INDEX_HK.put("159954", "指数-港股             ");//H股ETF                市值：4.53      累涨：48.17     6.48      24.87     20.11     11.64     5.90      40
        INDEX_HK.put("510900", "指数-港股             ");//H股ETF                市值：106.24    累涨：47.10     6.58      23.29     19.95     11.52     6.05      41
        INDEX_HK.put("520700", "指数-港股             ");//港股创新药ETF基金     市值：1.06      累涨：49.75     5.48      24.65     24.90     11.46     8.35      42
        INDEX_HK.put("159850", "指数-港股             ");//恒生国企ETF           市值：10.28     累涨：47.83     7.01      23.45     20.33     11.41     5.93      43
        INDEX_HK.put("513280", "指数-港股             ");//恒生生物科技ETF       市值：2.35      累涨：48.42     6.53      23.70     22.92     11.20     7.94      44
        INDEX_HK.put("159718", "指数-港股             ");//港股医药ETF           市值：2.25      累涨：46.58     6.62      24.00     21.57     11.12     7.85      45
        INDEX_HK.put("159570", "指数-港股             ");//港股通创新药ETF       市值：16.66     累涨：51.43     6.81      24.52     25.73     11.12     8.25      46
        INDEX_HK.put("159303", "指数-港股             ");//恒生医疗ETF基金       市值：1.14      累涨：49.32     6.33      25.90     21.74     11.09     7.38      47
        INDEX_HK.put("159557", "指数-港股             ");//恒生医疗指数ETF       市值：2.53      累涨：46.57     7.23      23.34     20.42     10.87     7.28      48
        INDEX_HK.put("520500", "指数-港股             ");//恒生创新药ETF         市值：1.90      累涨：49.95     4.98      24.43     25.28     10.83     8.19      49
        INDEX_HK.put("513200", "指数-港股             ");//港股通医药ETF         市值：36.08     累涨：48.95     6.26      25.14     22.58     10.82     7.54      50
        INDEX_HK.put("159892", "指数-港股             ");//恒生医药ETF           市值：47.31     累涨：47.84     6.63      22.05     23.86     10.77     7.75      51
        INDEX_HK.put("513900", "指数-港股             ");//港股通100ETF          市值：1.54      累涨：47.41     4.94      23.59     21.55     10.76     5.08      52
        INDEX_HK.put("513210", "指数-港股             ");//恒生ETF易方达         市值：0.59      累涨：43.28     4.80      21.78     19.32     10.58     5.45      53
        INDEX_HK.put("513120", "指数-港股             ");//港股创新药ETF         市值：117.80    累涨：48.44     6.96      23.55     23.08     10.54     8.64      54
        INDEX_HK.put("159711", "指数-港股             ");//港股通ETF             市值：0.59      累涨：43.71     4.54      21.87     18.54     10.45     5.13      55
        INDEX_HK.put("159776", "指数-港股             ");//港股通医药ETF         市值：1.40      累涨：46.43     6.36      23.59     21.54     10.41     7.63      56
        INDEX_HK.put("513060", "指数-港股             ");//恒生医疗ETF           市值：151.15    累涨：46.34     6.64      23.08     21.45     10.41     6.85      57
        INDEX_HK.put("513550", "指数-港股             ");//港股通50ETF           市值：29.78     累涨：45.64     5.68      21.95     19.83     10.39     5.33      58
        INDEX_HK.put("159920", "指数-港股             ");//恒生ETF               市值：180.51    累涨：42.81     5.04      21.19     19.17     10.38     5.32      59
        INDEX_HK.put("159699", "指数-港股             ");//恒生消费ETF           市值：16.04     累涨：34.67     4.13      14.78     18.38     10.35     5.92      60
        INDEX_HK.put("159960", "指数-港股             ");//恒生中国企业ETF       市值：6.20      累涨：43.09     5.94      21.67     19.06     10.21     5.21      61
        INDEX_HK.put("513970", "指数-港股             ");//恒生消费ETF           市值：12.67     累涨：35.13     4.14      13.97     19.30     10.20     5.91      62
        INDEX_HK.put("513600", "指数-港股             ");//恒生指数ETF           市值：15.06     累涨：43.61     4.72      22.40     18.98     10.18     4.93      63
        INDEX_HK.put("159312", "指数-港股             ");//恒生ETF港股通         市值：0.50      累涨：42.70     5.34      20.71     19.30     10.10     5.26      64
        INDEX_HK.put("520520", "指数-港股             ");//恒生消费ETF华泰柏瑞   市值：1.07      累涨：35.80     4.12      13.67     20.04     10.10     5.97      65
        INDEX_HK.put("513660", "指数-港股             ");//恒生ETF               市值：41.12     累涨：43.15     5.36      21.39     19.18     10.09     4.93      66
        INDEX_HK.put("513990", "指数-港股             ");//港股通ETF             市值：0.97      累涨：45.33     5.54      23.27     19.46     10.08     5.23      67
        INDEX_HK.put("159712", "指数-港股             ");//港股通50ETF           市值：0.59      累涨：47.12     4.98      26.37     17.82     9.61      5.12      68
        INDEX_HK.put("159318", "指数-港股             ");//恒生港股通ETF         市值：0.54      累涨：43.30     5.35      21.89     18.75     9.59      4.72      69
        INDEX_HK.put("513190", "指数-港股             ");//港股通金融ETF         市值：5.46      累涨：36.13     8.43      15.52     13.94     8.60      5.37      70
        INDEX_HK.put("159726", "指数-港股             ");//恒生红利ETF           市值：5.95      累涨：28.42     5.51      11.29     13.57     7.90      4.47      71
        INDEX_HK.put("517660", "指数-港股             ");//物联网沪港深ETF       市值：0.45      累涨：50.10     12.41     24.77     19.01     7.88      3.76      72
        INDEX_HK.put("513140", "指数-港股             ");//港股金融ETF           市值：0.82      累涨：32.96     5.53      14.81     14.50     7.36      4.38      73
        INDEX_HK.put("513920", "指数-港股             ");//港股通央企红利ETF     市值：36.96     累涨：31.00     8.62      11.83     12.24     7.30      5.33      74
        INDEX_HK.put("159622", "指数-港股             ");//创新药ETF沪港深       市值：2.11      累涨：38.81     7.88      18.61     16.61     7.27      5.96      75
        INDEX_HK.put("159519", "指数-港股             ");//港股国企ETF           市值：1.96      累涨：31.05     9.84      11.67     11.40     6.99      4.21      76
        INDEX_HK.put("159569", "指数-港股             ");//港股红利低波ETF       市值：1.52      累涨：26.77     11.49     6.61      9.49      6.88      3.16      77
        INDEX_HK.put("517000", "指数-港股             ");//沪港深500ETF          市值：3.86      累涨：28.37     5.34      13.76     12.10     6.88      3.41      78
        INDEX_HK.put("517080", "指数-港股             ");//沪港深500ETF基金      市值：4.22      累涨：28.35     5.32      13.93     11.92     6.79      3.43      79
        INDEX_HK.put("517170", "指数-港股             ");//沪港深ETF             市值：0.42      累涨：28.93     5.63      14.42     11.81     6.66      3.37      80
        INDEX_HK.put("517380", "指数-港股             ");//创新药沪港深ETF       市值：2.43      累涨：33.93     5.40      16.55     15.62     6.62      5.01      81
        INDEX_HK.put("517990", "指数-港股             ");//医药ETF沪港深         市值：0.40      累涨：29.56     4.28      14.60     13.84     6.61      4.92      82
        INDEX_HK.put("159545", "指数-港股             ");//恒生红利低波ETF       市值：11.66     累涨：25.36     6.95      9.83      10.49     6.54      2.59      83
        INDEX_HK.put("513170", "指数-港股             ");//恒生央企ETF           市值：4.90      累涨：30.85     7.17      13.04     13.24     6.47      4.01      84
        INDEX_HK.put("517010", "指数-港股             ");//沪港深500ETF易方达    市值：0.73      累涨：28.90     5.77      14.20     11.48     6.41      3.44      85
        INDEX_HK.put("513810", "指数-港股             ");//港股国企ETF           市值：0.50      累涨：29.36     8.42      11.80     10.69     6.20      3.63      86
        INDEX_HK.put("513910", "指数-港股             ");//港股央企红利ETF       市值：26.96     累涨：29.45     11.28     9.58      10.16     6.12      3.88      87
        INDEX_HK.put("513630", "指数-港股             ");//港股红利指数ETF       市值：95.65     累涨：24.61     6.95      9.39      9.32      6.02      2.97      88
        INDEX_HK.put("517300", "指数-港股             ");//沪港深300ETF          市值：27.38     累涨：25.87     5.76      12.45     10.77     5.99      3.48      89
        INDEX_HK.put("513690", "指数-港股             ");//港股红利ETF博时       市值：39.27     累涨：26.02     6.61      9.75      11.16     5.98      3.16      90
        INDEX_HK.put("517030", "指数-港股             ");//沪港深300ETF易方达    市值：0.66      累涨：23.13     4.55      11.30     9.43      5.89      3.19      91
        INDEX_HK.put("513950", "指数-港股             ");//恒生红利ETF           市值：11.41     累涨：25.77     7.59      9.69      10.32     5.75      2.55      92
        INDEX_HK.put("159333", "指数-港股             ");//港股央企红利ETF       市值：5.04      累涨：39.14     22.05     9.39      8.84      5.68      3.84      93
        INDEX_HK.put("520890", "指数-港股             ");//港股通红利低波ETF     市值：0.74      累涨：37.53     19.82     9.86      10.22     5.65      2.47      94
        INDEX_HK.put("159691", "指数-港股             ");//港股红利ETF           市值：60.74     累涨：20.19     6.32      7.27      7.45      5.51      2.86      95
        INDEX_HK.put("520550", "指数-港股             ");//港股红利低波ETF       市值：2.01      累涨：16.28               6.40      10.08     5.40      3.19      96
        INDEX_HK.put("513820", "指数-港股             ");//港股红利ETF基金       市值：20.86     累涨：22.24     9.06      7.51      6.62      4.79      2.78      97
        INDEX_HK.put("520900", "指数-港股             ");//红利ETF港股           市值：30.89     累涨：24.53     9.75      9.49      7.17      4.66      2.68      98
        INDEX_HK.put("520990", "指数-港股             ");//港股央企红利50ETF     市值：49.47     累涨：25.52     11.14     9.19      6.73      4.55      2.58      99
        INDEX_HK.put("159331", "指数-港股             ");//红利港股ETF           市值：0.92      累涨：31.71     19.00     7.00      6.74      4.49      2.63      100
        INDEX_HK.put("513530", "指数-港股             ");//港股通红利ETF         市值：15.01     累涨：23.71     9.58      7.75      7.38      4.47      2.69      101
        INDEX_HK.put("520660", "指数-港股             ");//港股通央企红利ETF南方 市值：11.32     累涨：22.79     10.18     8.28      5.77      4.46      2.59      102
        INDEX_HK.put("159302", "指数-港股             ");//港股高股息ETF         市值：1.17      累涨：22.52     8.65      7.93      6.97      4.26      2.55      103
        INDEX_HK.put("513830", "指数-港股             ");//港股红利ETF           市值：6.38      累涨：2.98                          2.98      2.98      2.08      104
    }

    public static Map<String, String> INDEX_CN_NOT = new HashMap<>();//指数-外盘

    static {
        INDEX_CN_NOT.put("513030", "指数-外盘             ");//德国ETF               市值：13.70     累涨：65.60     16.87     32.99     18.76     12.06     7.29      1
        INDEX_CN_NOT.put("159561", "指数-外盘             ");//德国ETF               市值：10.89     累涨：85.72     28.00     45.74     11.98     8.26      4.23      2
        INDEX_CN_NOT.put("159329", "指数-外盘             ");//沙特ETF               市值：7.09      累涨：62.59     29.71     29.80     7.68      5.97      2.97      3
        INDEX_CN_NOT.put("513080", "指数-外盘             ");//法国CAC40ETF          市值：9.18      累涨：47.50     9.24      28.89     9.91      5.62      2.54      4
        INDEX_CN_NOT.put("513800", "指数-外盘             ");//日本东证指数ETF       市值：8.51      累涨：23.36     5.97      10.58     7.48      4.47      3.12      5
        INDEX_CN_NOT.put("513000", "指数-外盘             ");//日经225ETF易方达      市值：12.19     累涨：27.73     7.06      15.15     5.52      3.45      1.80      6
        INDEX_CN_NOT.put("159687", "指数-外盘             ");//亚太精选ETF           市值：7.34      累涨：67.46     23.23     41.31     8.32      3.13      2.75      7
        INDEX_CN_NOT.put("513730", "指数-外盘             ");//东南亚科技ETF         市值：20.14     累涨：19.86     4.38      8.41      7.07      2.96      0.88      8
        INDEX_CN_NOT.put("520830", "指数-外盘             ");//沙特ETF               市值：6.60      累涨：51.78     20.92     31.28     3.90      2.87      1.68      9
        INDEX_CN_NOT.put("513880", "指数-外盘             ");//日经225ETF            市值：14.08     累涨：20.52     7.85      7.75      5.07      2.86      1.94      10
        INDEX_CN_NOT.put("159866", "指数-外盘             ");//日经ETF               市值：6.58      累涨：33.49     7.82      21.32     4.73      2.70      1.68      11
        INDEX_CN_NOT.put("513520", "指数-外盘             ");//日经ETF               市值：11.82     累涨：26.59     9.99      12.43     4.17      2.48      1.42      12
        INDEX_CN_NOT.put("520580", "指数-外盘             ");//新兴亚洲ETF           市值：5.37      累涨：3.79                          3.79      1.41      1.09      13
    }

    public static Map<String, String> INDEX_CN_NOT_USA = new HashMap<>();//指数-外盘-美股

    static {
        INDEX_CN_NOT_USA.put("159529", "指数-外盘-美股        ");//标普消费ETF           市值：6.24      累涨：110.29    52.73     36.23     21.33     18.98     9.58      1
        INDEX_CN_NOT_USA.put("159612", "指数-外盘-美股        ");//标普500ETF            市值：6.09      累涨：41.25     10.33     11.72     19.20     17.14     15.52     2
        INDEX_CN_NOT_USA.put("513350", "指数-外盘-美股        ");//标普油气ETF           市值：6.59      累涨：65.18     31.12     27.72     9.24      6.70      6.16      3
        INDEX_CN_NOT_USA.put("159518", "指数-外盘-美股        ");//标普油气ETF           市值：11.24     累涨：52.27     34.70     17.27     4.97      4.23      4.12      4
        INDEX_CN_NOT_USA.put("562060", "指数-外盘-美股        ");//标普红利ETF           市值：15.55     累涨：17.08     5.38      5.69      6.48      3.73      2.13      5
        INDEX_CN_NOT_USA.put("513290", "指数-外盘-美股        ");//纳指生物科技ETF       市值：14.25     累涨：28.60     10.63     12.03     6.44      3.49      2.14      6
        INDEX_CN_NOT_USA.put("159502", "指数-外盘-美股        ");//标普生物科技ETF       市值：11.11     累涨：28.17     11.99     10.46     6.22      2.98      1.81      7
        INDEX_CN_NOT_USA.put("513100", "指数-外盘-美股        ");//纳指ETF               市值：140.30    累涨：24.33     10.77     7.17      6.39      2.51      2.16      8
        INDEX_CN_NOT_USA.put("159941", "指数-外盘-美股        ");//纳指ETF               市值：236.79    累涨：25.14     11.82     7.14      6.18      2.50      1.85      9
        INDEX_CN_NOT_USA.put("159509", "指数-外盘-美股        ");//纳指科技ETF           市值：90.57     累涨：28.96     13.90     8.47      6.59      2.45      2.01      10
        INDEX_CN_NOT_USA.put("159513", "指数-外盘-美股        ");//纳斯达克100指数ETF    市值：57.66     累涨：26.09     11.23     9.61      5.25      2.26      2.01      11
        INDEX_CN_NOT_USA.put("513390", "指数-外盘-美股        ");//纳指100ETF            市值：16.68     累涨：27.00     14.87     8.12      4.01      2.24      1.88      12
        INDEX_CN_NOT_USA.put("159632", "指数-外盘-美股        ");//纳斯达克ETF           市值：92.44     累涨：27.24     14.75     7.07      5.42      2.09      2.03      13
        INDEX_CN_NOT_USA.put("513300", "指数-外盘-美股        ");//纳斯达克ETF           市值：62.11     累涨：25.75     13.63     6.62      5.50      2.06      2.06      14
        INDEX_CN_NOT_USA.put("513650", "指数-外盘-美股        ");//标普500ETF南方        市值：38.87     累涨：16.41     7.42      5.39      3.73      1.97      1.64      15
        INDEX_CN_NOT_USA.put("513110", "指数-外盘-美股        ");//纳斯达克100ETF        市值：34.48     累涨：26.96     14.71     7.89      4.36      1.83      1.77      16
        INDEX_CN_NOT_USA.put("159696", "指数-外盘-美股        ");//纳指ETF易方达         市值：23.49     累涨：25.39     13.89     7.45      4.05      1.83      1.68      17
        INDEX_CN_NOT_USA.put("159655", "指数-外盘-美股        ");//标普ETF               市值：19.30     累涨：27.18     12.62     10.75     3.81      1.82      1.63      18
        INDEX_CN_NOT_USA.put("159659", "指数-外盘-美股        ");//纳斯达克100ETF        市值：46.25     累涨：27.21     15.16     8.12      3.93      1.77      1.77      19
        INDEX_CN_NOT_USA.put("513400", "指数-外盘-美股        ");//道琼斯ETF             市值：22.45     累涨：20.33     10.39     6.31      4.15      1.76      1.58      20
        INDEX_CN_NOT_USA.put("159660", "指数-外盘-美股        ");//纳指100ETF            市值：25.50     累涨：27.93     16.73     7.13      4.07      1.69      1.69      21
        INDEX_CN_NOT_USA.put("159501", "指数-外盘-美股        ");//纳斯达克指数ETF       市值：68.62     累涨：24.09     12.69     7.48      3.92      1.58      1.58      22
        INDEX_CN_NOT_USA.put("513870", "指数-外盘-美股        ");//纳指ETF富国           市值：15.32     累涨：26.16     13.89     8.26      4.01      1.56      1.56      23
        INDEX_CN_NOT_USA.put("513850", "指数-外盘-美股        ");//美国50ETF             市值：19.94     累涨：24.26     13.67     6.74      3.85      1.49      1.49      24
        INDEX_CN_NOT_USA.put("159577", "指数-外盘-美股        ");//美国50ETF             市值：11.30     累涨：24.59     14.22     6.43      3.94      1.48      1.48      25
        INDEX_CN_NOT_USA.put("513500", "指数-外盘-美股        ");//标普500ETF            市值：165.54    累涨：14.13     6.91      4.32      2.90      1.03      0.98      26
    }

    public static Map<String, String> INDEX_CN_1000 = new HashMap<>();//指数-中小盘

    static {
        INDEX_CN_1000.put("159543", "指数-中小盘           ");//国证2000ETF基金       市值：0.59      累涨：43.88     8.24      17.57     18.66     9.32      5.19      1
        INDEX_CN_1000.put("561370", "指数-中小盘           ");//2000ETF               市值：0.14      累涨：44.70     7.38      20.87     17.85     8.72      3.72      2
        INDEX_CN_1000.put("159685", "指数-中小盘           ");//1000增强ETF天弘       市值：0.21      累涨：38.87     8.03      15.99     15.04     8.46      3.08      3
        INDEX_CN_1000.put("159521", "指数-中小盘           ");//2000指数ETF           市值：0.23      累涨：39.20     8.82      16.30     15.28     8.25      2.97      4
        INDEX_CN_1000.put("561780", "指数-中小盘           ");//1000增强ETF           市值：0.15      累涨：37.33     7.15      15.86     15.05     8.24      3.76      5
        INDEX_CN_1000.put("159536", "指数-中小盘           ");//中证2000指数ETF       市值：0.51      累涨：44.97     10.14     18.87     17.33     8.20      3.44      6
        INDEX_CN_1000.put("159533", "指数-中小盘           ");//中证2000ETF基金       市值：0.15      累涨：44.50     10.56     18.40     17.12     8.01      2.88      7
        INDEX_CN_1000.put("159553", "指数-中小盘           ");//2000ETF增强           市值：0.11      累涨：42.56     11.54     17.24     15.44     7.89      4.42      8
        INDEX_CN_1000.put("159628", "指数-中小盘           ");//国证2000ETF           市值：7.25      累涨：41.13     7.35      19.24     15.48     7.83      3.14      9
        INDEX_CN_1000.put("159555", "指数-中小盘           ");//2000增强ETF           市值：0.51      累涨：47.71     11.88     20.78     16.42     7.80      4.21      10
        INDEX_CN_1000.put("159531", "指数-中小盘           ");//中证2000ETF           市值：5.74      累涨：46.12     10.34     20.87     16.96     7.69      3.26      11
        INDEX_CN_1000.put("562660", "指数-中小盘           ");//中证2000ETF华夏       市值：1.54      累涨：41.98     9.07      18.89     15.78     7.69      3.54      12
        INDEX_CN_1000.put("560590", "指数-中小盘           ");//1000ETF增强           市值：0.16      累涨：34.79     5.71      15.98     13.37     7.63      3.25      13
        INDEX_CN_1000.put("159552", "指数-中小盘           ");//中证2000增强ETF       市值：0.17      累涨：44.66     11.18     19.27     15.67     7.59      3.04      14
        INDEX_CN_1000.put("561280", "指数-中小盘           ");//中证1000ETF增强       市值：0.40      累涨：37.80     7.18      16.71     14.09     7.58      2.49      15
        INDEX_CN_1000.put("159505", "指数-中小盘           ");//国证2000指数ETF       市值：0.12      累涨：38.90     6.42      17.77     15.75     7.58      3.10      16
        INDEX_CN_1000.put("159679", "指数-中小盘           ");//中证1000增强ETF       市值：1.37      累涨：37.19     5.88      18.14     13.66     7.55      2.17      17
        INDEX_CN_1000.put("159532", "指数-中小盘           ");//中证2000ETF易方达     市值：0.79      累涨：45.61     10.35     20.30     16.61     7.52      3.29      18
        INDEX_CN_1000.put("563200", "指数-中小盘           ");//中证2000ETF富国       市值：0.23      累涨：43.89     9.84      19.99     15.77     7.47      3.00      19
        INDEX_CN_1000.put("563300", "指数-中小盘           ");//中证2000ETF           市值：30.25     累涨：44.99     9.61      20.47     17.04     7.42      3.00      20
        INDEX_CN_1000.put("159535", "指数-中小盘           ");//中证2000ETF指数       市值：0.20      累涨：41.05     8.93      18.43     15.04     7.27      3.38      21
        INDEX_CN_1000.put("560220", "指数-中小盘           ");//中证2000ETF基金       市值：0.59      累涨：42.90     10.01     18.97     15.77     7.16      2.87      22
        INDEX_CN_1000.put("561590", "指数-中小盘           ");//中证1000增强ETF       市值：0.37      累涨：36.08     7.88      15.60     12.89     7.13      2.59      23
        INDEX_CN_1000.put("159907", "指数-中小盘           ");//2000ETF               市值：1.75      累涨：42.02     8.40      20.55     14.77     7.05      2.59      24
        INDEX_CN_1000.put("159629", "指数-中小盘           ");//1000ETF               市值：102.55    累涨：36.72     6.48      17.06     13.81     7.00      2.81      25
        INDEX_CN_1000.put("562520", "指数-中小盘           ");//中证1000成长ETF       市值：0.56      累涨：43.03     9.86      17.87     16.64     6.99      2.01      26
        INDEX_CN_1000.put("510560", "指数-中小盘           ");//国寿500ETF            市值：1.85      累涨：28.34     4.57      13.17     10.60     6.95      3.93      27
        INDEX_CN_1000.put("560110", "指数-中小盘           ");//中证1000ETF基金       市值：2.47      累涨：36.45     5.74      17.68     13.47     6.94      2.95      28
        INDEX_CN_1000.put("159845", "指数-中小盘           ");//中证1000ETF           市值：307.15    累涨：37.31     6.43      17.49     13.86     6.82      2.57      29
        INDEX_CN_1000.put("512100", "指数-中小盘           ");//中证1000ETF           市值：560.49    累涨：37.85     6.82      17.73     13.74     6.80      2.62      30
        INDEX_CN_1000.put("159633", "指数-中小盘           ");//中证1000ETF易方达     市值：25.04     累涨：37.07     6.22      17.76     13.68     6.74      2.69      31
        INDEX_CN_1000.put("560010", "指数-中小盘           ");//中证1000ETF指数       市值：254.84    累涨：37.07     6.62      17.34     13.54     6.68      2.58      32
        INDEX_CN_1000.put("516300", "指数-中小盘           ");//中证1000ETF华泰柏瑞   市值：1.42      累涨：35.82     6.02      17.38     13.09     6.54      2.58      33
        INDEX_CN_1000.put("159680", "指数-中小盘           ");//1000ETF增强           市值：3.52      累涨：38.06     6.69      19.31     12.82     6.39      2.91      34
        INDEX_CN_1000.put("560950", "指数-中小盘           ");//500ETF增强            市值：0.45      累涨：27.00     5.81      10.93     10.26     6.25      3.19      35
        INDEX_CN_1000.put("515590", "指数-中小盘           ");//500等权ETF            市值：0.58      累涨：27.67     4.84      11.80     11.37     6.25      3.17      36
        INDEX_CN_1000.put("515550", "指数-中小盘           ");//国联中证500ETF        市值：0.80      累涨：28.57     5.86      13.87     9.30      6.16      2.60      37
        INDEX_CN_1000.put("517080", "指数-中小盘           ");//沪港深500ETF基金      市值：4.21      累涨：28.57     4.20      13.46     11.97     6.13      2.42      38
        INDEX_CN_1000.put("159677", "指数-中小盘           ");//1000增强ETF           市值：0.47      累涨：31.27     5.25      15.24     10.97     6.07      2.45      39
        INDEX_CN_1000.put("510590", "指数-中小盘           ");//中证500ETF平安        市值：7.31      累涨：30.77     5.85      14.25     10.67     6.04      2.99      40
        INDEX_CN_1000.put("159556", "指数-中小盘           ");//中证2000ETF增强       市值：0.35      累涨：38.84     8.75      16.74     14.38     6.01      1.35      41
        INDEX_CN_1000.put("517000", "指数-中小盘           ");//沪港深500ETF          市值：3.86      累涨：28.60     4.21      13.41     11.80     5.99      2.29      42
        INDEX_CN_1000.put("517100", "指数-中小盘           ");//AH500ETF              市值：3.15      累涨：29.20     3.95      13.98     12.09     5.95      2.74      43
        INDEX_CN_1000.put("159906", "指数-中小盘           ");//深成长龙头ETF         市值：1.23      累涨：33.69     4.76      19.00     10.57     5.92      2.59      44
        INDEX_CN_1000.put("510550", "指数-中小盘           ");//方正中证500ETF        市值：0.33      累涨：28.53     5.66      13.11     9.83      5.86      2.61      45
        INDEX_CN_1000.put("515190", "指数-中小盘           ");//中银证券500ETF        市值：0.95      累涨：29.94     6.49      13.47     10.64     5.80      3.09      46
        INDEX_CN_1000.put("560500", "指数-中小盘           ");//500质量成长ETF        市值：5.53      累涨：24.74     5.71      10.53     8.50      5.74      2.84      47
        INDEX_CN_1000.put("159678", "指数-中小盘           ");//中证500增强ETF        市值：0.66      累涨：29.34     6.46      12.95     10.51     5.68      2.69      48
        INDEX_CN_1000.put("515530", "指数-中小盘           ");//中证500ETF泰康        市值：0.82      累涨：28.46     5.05      13.29     10.12     5.67      2.58      49
        INDEX_CN_1000.put("562340", "指数-中小盘           ");//中证500成长ETF        市值：0.18      累涨：26.20     6.80      10.22     9.18      5.66      2.51      50
        INDEX_CN_1000.put("510570", "指数-中小盘           ");//兴业中证500ETF        市值：0.24      累涨：28.59     5.88      12.95     9.76      5.63      2.91      51
        INDEX_CN_1000.put("159606", "指数-中小盘           ");//中证500成长ETF        市值：4.62      累涨：25.64     6.09      10.88     8.67      5.55      2.75      52
        INDEX_CN_1000.put("159935", "指数-中小盘           ");//中证500ETF景顺        市值：0.62      累涨：28.86     4.71      13.92     10.23     5.51      2.58      53
        INDEX_CN_1000.put("159968", "指数-中小盘           ");//中证500ETF博时        市值：7.27      累涨：28.85     5.11      13.48     10.27     5.51      2.51      54
        INDEX_CN_1000.put("510530", "指数-中小盘           ");//中证500ETF工银        市值：3.76      累涨：28.36     4.92      13.41     10.03     5.49      2.44      55
        INDEX_CN_1000.put("159922", "指数-中小盘           ");//中证500ETF            市值：116.48    累涨：29.70     5.19      14.13     10.38     5.47      2.34      56
        INDEX_CN_1000.put("510510", "指数-中小盘           ");//中证500ETF基金        市值：20.94     累涨：29.30     5.31      13.96     10.03     5.44      2.46      57
        INDEX_CN_1000.put("159820", "指数-中小盘           ");//中证500ETF天弘        市值：22.87     累涨：28.62     4.86      13.77     9.99      5.34      2.20      58
        INDEX_CN_1000.put("510500", "指数-中小盘           ");//中证500ETF            市值：1010.22   累涨：29.51     5.32      14.14     10.05     5.29      2.39      59
        INDEX_CN_1000.put("561550", "指数-中小盘           ");//500增强ETF            市值：7.18      累涨：27.81     4.97      12.88     9.96      5.27      1.88      60
        INDEX_CN_1000.put("562530", "指数-中小盘           ");//中证1000价值ETF       市值：0.61      累涨：23.72     4.61      9.50      9.61      5.24      2.94      61
        INDEX_CN_1000.put("512510", "指数-中小盘           ");//中证500ETF华泰柏瑞    市值：11.40     累涨：27.92     4.50      13.65     9.77      5.23      2.42      62
        INDEX_CN_1000.put("517010", "指数-中小盘           ");//沪港深500ETF易方达    市值：0.72      累涨：28.93     4.86      13.68     11.23     5.21      2.04      63
        INDEX_CN_1000.put("159337", "指数-中小盘           ");//中证500ETF基金        市值：12.97     累涨：28.21     4.93      13.25     10.03     5.20      2.28      64
        INDEX_CN_1000.put("561350", "指数-中小盘           ");//国泰中证500ETF        市值：1.25      累涨：28.71     5.22      13.80     9.69      5.16      2.14      65
        INDEX_CN_1000.put("512500", "指数-中小盘           ");//中证500ETF华夏        市值：139.19    累涨：29.09     5.29      14.17     9.63      5.16      2.29      66
        INDEX_CN_1000.put("159982", "指数-中小盘           ");//中证500ETF鹏华        市值：3.17      累涨：27.75     4.83      13.46     9.46      5.07      2.16      67
        INDEX_CN_1000.put("510580", "指数-中小盘           ");//中证500ETF易方达      市值：32.78     累涨：28.52     4.99      13.94     9.59      5.05      2.32      68
        INDEX_CN_1000.put("560100", "指数-中小盘           ");//中证500增强ETF        市值：0.89      累涨：26.17     5.09      11.63     9.45      4.96      2.51      69
        INDEX_CN_1000.put("561950", "指数-中小盘           ");//500指数增强ETF        市值：0.81      累涨：29.52     6.96      13.67     9.26      4.94      3.00      70
        INDEX_CN_1000.put("159620", "指数-中小盘           ");//500成长ETF            市值：0.34      累涨：30.40     7.27      12.47     10.66     4.90      1.86      71
        INDEX_CN_1000.put("159902", "指数-中小盘           ");//中小100ETF            市值：4.30      累涨：31.06     7.30      15.11     8.65      4.85      2.47      72
        INDEX_CN_1000.put("159800", "指数-中小盘           ");//中证800ETF            市值：0.51      累涨：23.80     4.01      11.86     8.53      4.84      2.24      73
        INDEX_CN_1000.put("512260", "指数-中小盘           ");//中证500低波动ETF      市值：0.64      累涨：23.89     5.13      10.17     8.59      4.80      2.38      74
        INDEX_CN_1000.put("562330", "指数-中小盘           ");//中证500价值ETF        市值：0.18      累涨：18.82     3.87      7.79      7.16      4.69      2.53      75
        INDEX_CN_1000.put("159338", "指数-中小盘           ");//中证A500ETF           市值：245.07    累涨：23.15     4.20      10.65     8.40      4.67      2.70      76
        INDEX_CN_1000.put("512050", "指数-中小盘           ");//A500ETF基金           市值：201.09    累涨：22.44     4.33      10.16     8.05      4.62      2.51      77
        INDEX_CN_1000.put("159610", "指数-中小盘           ");//500ETF增强            市值：4.97      累涨：24.23     5.03      10.40     8.80      4.61      1.60      78
        INDEX_CN_1000.put("159973", "指数-中小盘           ");//民企ETF               市值：2.85      累涨：31.68     7.53      15.43     8.86      4.43      2.62      79
        INDEX_CN_1000.put("563880", "指数-中小盘           ");//中证A500指数ETF       市值：82.81     累涨：22.32     4.26      10.42     7.84      4.43      2.41      80
        INDEX_CN_1000.put("563220", "指数-中小盘           ");//中证A500ETF富国       市值：192.10    累涨：21.70     4.03      10.27     7.50      4.41      2.30      81
        INDEX_CN_1000.put("515800", "指数-中小盘           ");//800ETF                市值：51.49     累涨：21.82     3.73      10.65     7.44      4.40      2.34      82
        INDEX_CN_1000.put("159353", "指数-中小盘           ");//中证A500ETF景顺       市值：147.53    累涨：22.64     4.43      10.78     7.73      4.38      2.54      83
        INDEX_CN_1000.put("560610", "指数-中小盘           ");//A500指数ETF           市值：118.74    累涨：22.26     4.42      10.46     7.48      4.37      2.39      84
        INDEX_CN_1000.put("159351", "指数-中小盘           ");//A500指数ETF           市值：144.58    累涨：22.22     4.51      10.42     7.49      4.36      2.33      85
        INDEX_CN_1000.put("159352", "指数-中小盘           ");//中证A500ETF南方       市值：212.65    累涨：22.07     3.90      10.66     7.80      4.36      2.37      86
        INDEX_CN_1000.put("159339", "指数-中小盘           ");//A500ETF               市值：86.74     累涨：21.19     4.26      9.74      7.29      4.32      2.36      87
        INDEX_CN_1000.put("515810", "指数-中小盘           ");//中证800ETF            市值：2.83      累涨：23.10     4.67      10.45     7.98      4.30      2.37      88
        INDEX_CN_1000.put("159376", "指数-中小盘           ");//A500ETF指数基金       市值：4.87      累涨：17.68               10.45     7.61      4.30      2.38      89
        INDEX_CN_1000.put("159361", "指数-中小盘           ");//A500ETF易方达         市值：166.64    累涨：22.15     4.23      10.37     7.65      4.29      2.34      90
        INDEX_CN_1000.put("563030", "指数-中小盘           ");//中证500增强ETF易方达  市值：1.54      累涨：26.62     4.94      12.59     9.09      4.29      1.64      91
        INDEX_CN_1000.put("563800", "指数-中小盘           ");//中证A500ETF龙头       市值：203.56    累涨：22.31     4.10      10.48     7.83      4.29      2.29      92
        INDEX_CN_1000.put("563860", "指数-中小盘           ");//A500ETF海富通         市值：12.36     累涨：9.51                1.99      7.52      4.27      2.38      93
        INDEX_CN_1000.put("159517", "指数-中小盘           ");//800增强ETF            市值：0.16      累涨：19.32     3.43      8.97      7.10      4.24      2.21      94
        INDEX_CN_1000.put("159358", "指数-中小盘           ");//中证A500ETF基金       市值：28.95     累涨：21.99     4.24      10.53     7.32      4.20      2.24      95
        INDEX_CN_1000.put("159380", "指数-中小盘           ");//A500ETF东财           市值：4.46      累涨：18.28     0.20      10.48     7.60      4.19      2.28      96
        INDEX_CN_1000.put("159362", "指数-中小盘           ");//A500ETF工银           市值：34.44     累涨：21.26     3.91      10.10     7.25      4.18      2.28      97
        INDEX_CN_1000.put("560750", "指数-中小盘           ");//A500ETF申万菱信       市值：2.45      累涨：11.04               3.71      7.52      4.16      2.32      98
        INDEX_CN_1000.put("159357", "指数-中小盘           ");//中证A500指数ETF       市值：51.90     累涨：21.46     4.09      10.35     7.22      4.16      2.17      99
        INDEX_CN_1000.put("560530", "指数-中小盘           ");//中证A500ETF摩根       市值：105.24    累涨：21.92     3.88      10.77     7.57      4.15      2.22      100
        INDEX_CN_1000.put("563360", "指数-中小盘           ");//中证A500ETF基金       市值：162.26    累涨：22.03     4.37      10.39     7.37      4.14      2.26      101
        INDEX_CN_1000.put("512020", "指数-中小盘           ");//A500ETF指数           市值：42.60     累涨：21.57     3.98      10.41     7.28      4.14      2.26      102
        INDEX_CN_1000.put("563500", "指数-中小盘           ");//中证A500ETF华宝       市值：18.01     累涨：21.83     4.14      10.55     7.33      4.11      2.24      103
        INDEX_CN_1000.put("159356", "指数-中小盘           ");//A500ETF基金           市值：60.84     累涨：21.19     4.22      9.90      7.27      4.09      2.29      104
        INDEX_CN_1000.put("560510", "指数-中小盘           ");//中证A500ETF           市值：75.49     累涨：20.69     3.57      10.26     7.07      4.06      2.29      105
        INDEX_CN_1000.put("512080", "指数-中小盘           ");//A500ETF中金           市值：15.20     累涨：13.39               6.15      7.34      4.06      2.22      106
        INDEX_CN_1000.put("159386", "指数-中小盘           ");//A500ETF永赢           市值：1.67      累涨：8.78                1.91      6.87      3.99      2.19      107
        INDEX_CN_1000.put("159379", "指数-中小盘           ");//A500ETF融通           市值：5.44      累涨：15.16               6.64      8.52      3.98      2.13      108
        INDEX_CN_1000.put("159360", "指数-中小盘           ");//中证A500ETF天弘       市值：41.20     累涨：21.82     4.16      10.58     7.28      3.94      2.16      109
        INDEX_CN_1000.put("159617", "指数-中小盘           ");//500价值ETF            市值：0.42      累涨：19.09     4.39      8.30      6.40      3.77      2.26      110
        INDEX_CN_1000.put("159359", "指数-中小盘           ");//中证A500ETF华安       市值：39.47     累涨：21.57     4.20      10.36     7.31      3.76      1.97      111
        INDEX_CN_1000.put("560030", "指数-中小盘           ");//800价值ETF            市值：0.36      累涨：18.31     5.32      8.00      4.99      3.70      2.40      112
        INDEX_CN_1000.put("159355", "指数-中小盘           ");//800红利低波ETF        市值：1.22      累涨：15.80     5.24      6.65      4.01      2.50      1.50      113
    }

    public static Map<String, String> INDEX_300 = new HashMap<>();//指数-创业板

    static {
        INDEX_300.put("159572", "指数-创业板           ");//创业板200ETF易方达    市值：8.40      累涨：52.86     8.38      25.97     18.61     9.57      3.45      1
        INDEX_300.put("159573", "指数-创业板           ");//创业板200ETF华夏      市值：2.43      累涨：55.28     8.75      26.90     19.63     9.34      3.29      2
        INDEX_300.put("159571", "指数-创业板           ");//创业板200ETF富国      市值：0.61      累涨：54.22     8.85      27.01     18.55     9.33      3.23      3
        INDEX_300.put("159575", "指数-创业板           ");//创业板200ETF银华      市值：0.12      累涨：53.43     10.56     24.81     18.54     9.21      3.30      4
        INDEX_300.put("159918", "指数-创业板           ");//中创400ETF            市值：0.70      累涨：42.40     7.87      18.72     15.81     8.85      3.70      5
        INDEX_300.put("159804", "指数-创业板           ");//创中盘88ETF           市值：1.36      累涨：51.00     8.78      25.79     17.68     7.90      2.41      6
        INDEX_300.put("159563", "指数-创业板           ");//创业板综ETF华夏       市值：0.49      累涨：38.65     5.43      20.05     13.43     6.27      2.64      7
        INDEX_300.put("159541", "指数-创业板           ");//创业板综ETF万家       市值：2.63      累涨：40.92     5.97      21.83     13.41     5.98      2.61      8
        INDEX_300.put("159814", "指数-创业板           ");//创业大盘ETF           市值：6.67      累涨：34.00     2.88      18.51     12.61     5.53      3.14      9
        INDEX_300.put("159597", "指数-创业板           ");//创业板成长ETF易方达   市值：0.95      累涨：39.32     5.16      21.50     12.66     5.52      2.98      10
        INDEX_300.put("159371", "指数-创业板           ");//创50ETF富国           市值：0.23      累涨：16.75               3.57      13.18     5.51      3.52      11
        INDEX_300.put("159949", "指数-创业板           ");//创业板50ETF           市值：267.50    累涨：36.22     3.31      20.52     12.39     5.43      3.36      12
        INDEX_300.put("159773", "指数-创业板           ");//创业板科技ETF         市值：2.40      累涨：38.54     4.37      21.59     12.58     5.32      2.28      13
        INDEX_300.put("159967", "指数-创业板           ");//创业板成长ETF         市值：42.47     累涨：42.34     6.63      23.48     12.23     5.32      3.12      14
        INDEX_300.put("159681", "指数-创业板           ");//创50ETF               市值：17.45     累涨：35.64     3.73      20.58     11.56     5.22      3.32      15
        INDEX_300.put("588350", "指数-创业板           ");//双创50ETF基金         市值：15.71     累涨：35.88     6.64      16.11     13.13     5.21      1.91      16
        INDEX_300.put("159836", "指数-创业板           ");//创300ETF              市值：1.76      累涨：37.47     3.76      21.03     12.68     5.12      2.45      17
        INDEX_300.put("159957", "指数-创业板           ");//创业板100ETF华夏      市值：19.19     累涨：33.84     2.95      19.21     11.76     5.11      3.07      18
        INDEX_300.put("159676", "指数-创业板           ");//创业板增强ETF富国     市值：2.43      累涨：34.22     4.82      17.44     12.08     5.07      3.03      19
        INDEX_300.put("159682", "指数-创业板           ");//创业50ETF             市值：50.74     累涨：35.75     3.43      20.62     11.82     5.07      3.25      20
        INDEX_300.put("159383", "指数-创业板           ");//创业板50ETF华泰柏瑞   市值：0.62      累涨：13.00               1.60      11.40     5.06      3.15      21
        INDEX_300.put("588380", "指数-创业板           ");//双创50ETF             市值：24.99     累涨：35.95     6.76      16.50     12.69     5.03      2.03      22
        INDEX_300.put("159810", "指数-创业板           ");//创业板ETF浦银         市值：0.93      累涨：35.32     3.35      19.30     12.67     4.94      2.77      23
        INDEX_300.put("159373", "指数-创业板           ");//创业板50ETF嘉实       市值：1.08      累涨：15.14               3.53      11.61     4.93      3.07      24
        INDEX_300.put("159971", "指数-创业板           ");//创业板ETF富国         市值：26.78     累涨：33.48     2.79      19.33     11.51     4.93      2.81      25
        INDEX_300.put("159821", "指数-创业板           ");//BOCI创业板ETF         市值：0.30      累涨：34.87     3.27      18.22     13.38     4.93      2.85      26
        INDEX_300.put("159375", "指数-创业板           ");//创业板50ETF国泰       市值：0.47      累涨：30.80     0.31      19.27     11.53     4.92      3.04      27
        INDEX_300.put("159977", "指数-创业板           ");//创业板ETF天弘         市值：95.44     累涨：33.37     2.88      18.89     11.70     4.91      2.82      28
        INDEX_300.put("159952", "指数-创业板           ");//创业板ETF广发         市值：120.05    累涨：35.17     3.38      20.03     12.10     4.91      2.93      29
        INDEX_300.put("159370", "指数-创业板           ");//创50ETF工银           市值：0.53      累涨：25.52               12.92     12.60     4.91      3.19      30
        INDEX_300.put("588320", "指数-创业板           ");//双创50ETF增强         市值：0.28      累涨：34.67     7.37      15.13     12.17     4.91      1.73      31
        INDEX_300.put("159721", "指数-创业板           ");//深创龙头ETF           市值：0.90      累涨：36.41     7.18      18.53     10.70     4.89      2.64      32
        INDEX_300.put("159908", "指数-创业板           ");//创业板ETF博时         市值：21.13     累涨：33.63     3.22      19.09     11.59     4.89      2.86      33
        INDEX_300.put("159808", "指数-创业板           ");//创100ETF融通          市值：1.10      累涨：34.44     3.11      19.60     12.00     4.89      2.82      34
        INDEX_300.put("159675", "指数-创业板           ");//创业板增强ETF         市值：1.64      累涨：34.83     4.20      18.58     12.05     4.88      2.56      35
        INDEX_300.put("159948", "指数-创业板           ");//创业板ETF南方         市值：48.31     累涨：34.35     3.62      19.14     11.78     4.88      2.96      36
        INDEX_300.put("159964", "指数-创业板           ");//创业板ETF平安         市值：5.43      累涨：33.92     3.21      19.15     11.64     4.87      2.81      37
        INDEX_300.put("159958", "指数-创业板           ");//创业板ETF工银         市值：4.36      累涨：34.08     3.74      18.51     12.00     4.85      2.94      38
        INDEX_300.put("159915", "指数-创业板           ");//创业板ETF             市值：872.45    累涨：34.79     3.34      19.82     11.84     4.82      2.87      39
        INDEX_300.put("159956", "指数-创业板           ");//创业板ETF建信         市值：1.23      累涨：33.35     3.14      19.30     10.99     4.62      2.65      40
        INDEX_300.put("159716", "指数-创业板           ");//深创100ETF            市值：1.07      累涨：35.56     6.94      18.67     9.95      4.59      2.42      41
        INDEX_300.put("159782", "指数-创业板           ");//双创50ETF             市值：9.88      累涨：33.40     6.02      15.10     12.28     4.45      1.56      42
        INDEX_300.put("159966", "指数-创业板           ");//创业板价值ETF         市值：5.27      累涨：31.60     3.36      19.08     9.38      4.03      1.83      43
        INDEX_300.put("159367", "指数-创业板           ");//创业板50ETF华夏       市值：0.43      累涨：13.29               2.27      11.02     3.88      2.29      44
        INDEX_300.put("159991", "指数-创业板           ");//创大盘ETF             市值：1.48      累涨：34.47     3.66      19.72     11.09     3.79      1.69      45
    }

    public static Map<String, String> INDEX_CN_BIG = new HashMap<>();//指数-大盘

    static {
        INDEX_CN_BIG.put("560810", "指数-大盘             ");//央企ESGETF            市值：4.94      累涨：27.26     7.84      8.17      11.25     10.73     0.42      1
        INDEX_CN_BIG.put("517090", "指数-大盘             ");//央企共赢ETF           市值：4.54      累涨：20.48     5.08      4.36      11.04     10.08     2.11      2
        INDEX_CN_BIG.put("159966", "指数-大盘             ");//创业板价值ETF         市值：4.74      累涨：35.34     17.28     7.98      10.47     9.84      3.01      3
        INDEX_CN_BIG.put("512960", "指数-大盘             ");//央企结构调整ETF       市值：50.77     累涨：22.11     5.90      6.40      9.81      9.34      0.96      4
        INDEX_CN_BIG.put("563050", "指数-大盘             ");//央企科技50ETF         市值：2.50      累涨：34.76     14.07     11.63     9.50      8.93      1.88      5
        INDEX_CN_BIG.put("560170", "指数-大盘             ");//央企科技ETF           市值：14.31     累涨：36.11     14.76     12.68     9.13      8.65      1.96      6
        INDEX_CN_BIG.put("562380", "指数-大盘             ");//央企科技引领ETF       市值：2.21      累涨：34.92     14.69     11.76     9.02      8.34      2.25      7
        INDEX_CN_BIG.put("530580", "指数-大盘             ");//上证180ETF南方        市值：2.98      累涨：21.53     6.01      6.42      9.10      8.29      1.46      8
        INDEX_CN_BIG.put("159336", "指数-大盘             ");//央企红利50ETF         市值：2.59      累涨：15.67     0.40      5.52      9.95      8.27      1.82      9
        INDEX_CN_BIG.put("515600", "指数-大盘             ");//央企创新ETF           市值：18.25     累涨：23.02     7.56      6.49      8.97      7.73      0.50      10
        INDEX_CN_BIG.put("159906", "指数-大盘             ");//深成长龙头ETF         市值：1.13      累涨：33.62     16.08     9.71      8.57      7.60      2.30      11
        INDEX_CN_BIG.put("563860", "指数-大盘             ");//A500ETF海富通         市值：9.72      累涨：18.13     2.88      7.12      8.13      7.53      1.04      12
        INDEX_CN_BIG.put("563650", "指数-大盘             ");//中证A500龙头ETF       市值：3.02      累涨：7.52                          7.52      7.52      1.15      13
        INDEX_CN_BIG.put("159528", "指数-大盘             ");//国企改革ETF           市值：0.42      累涨：21.41     6.74      6.54      8.13      7.36      0.98      14
        INDEX_CN_BIG.put("159959", "指数-大盘             ");//央企ETF               市值：28.25     累涨：19.86     6.42      5.58      7.86      7.30      0.93      15
        INDEX_CN_BIG.put("159351", "指数-大盘             ");//A500指数ETF           市值：149.42    累涨：23.43     8.54      6.79      8.10      7.28      1.08      16
        INDEX_CN_BIG.put("530280", "指数-大盘             ");//上证180ETF指数基金    市值：0.96      累涨：22.54     5.91      7.90      8.73      7.27      1.30      17
        INDEX_CN_BIG.put("159913", "指数-大盘             ");//深价值ETF             市值：0.65      累涨：24.37     6.64      9.30      8.52      7.17      1.12      18
        INDEX_CN_BIG.put("512360", "指数-大盘             ");//MSCI中国A股ETF基金    市值：0.60      累涨：22.17     6.87      7.23      8.07      7.13      1.33      19
        INDEX_CN_BIG.put("530680", "指数-大盘             ");//上证180指数ETF基金    市值：6.46      累涨：20.12     5.35      6.66      8.11      7.11      1.22      20
        INDEX_CN_BIG.put("510020", "指数-大盘             ");//超大盘ETF             市值：1.37      累涨：22.53     5.67      8.19      8.70      7.01      1.60      21
        INDEX_CN_BIG.put("512240", "指数-大盘             ");//A50ETF龙头            市值：1.94      累涨：7.01                          7.01      7.01      1.15      22
        INDEX_CN_BIG.put("515990", "指数-大盘             ");//国企一带一路ETF       市值：1.02      累涨：18.36     4.48      5.43      8.45      6.96      0.57      23
        INDEX_CN_BIG.put("561790", "指数-大盘             ");//央企现代能源ETF       市值：0.49      累涨：16.83     3.76      3.43      9.83      6.91      1.55      24
        INDEX_CN_BIG.put("563360", "指数-大盘             ");//中证A500ETF基金       市值：123.73    累涨：22.79     8.35      6.96      7.48      6.88      1.14      25
        INDEX_CN_BIG.put("560330", "指数-大盘             ");//沪深300价值ETF申万菱信市值：1.58      累涨：20.02     6.00      6.01      8.01      6.86      1.98      26
        INDEX_CN_BIG.put("515890", "指数-大盘             ");//红利ETF博时           市值：6.88      累涨：19.84     5.31      5.27      9.26      6.85      1.49      27
        INDEX_CN_BIG.put("159352", "指数-大盘             ");//中证A500ETF南方       市值：192.15    累涨：23.33     8.60      7.30      7.43      6.83      0.93      28
        INDEX_CN_BIG.put("512950", "指数-大盘             ");//央企改革ETF           市值：55.95     累涨：19.52     5.78      6.10      7.64      6.80      0.93      29
        INDEX_CN_BIG.put("510270", "指数-大盘             ");//国企ETF               市值：0.27      累涨：19.76     5.40      6.23      8.13      6.74      1.31      30
        INDEX_CN_BIG.put("159215", "指数-大盘             ");//中证A500ETF指数基金   市值：17.62     累涨：6.69                          6.69      6.69      1.36      31
        INDEX_CN_BIG.put("159686", "指数-大盘             ");//A100ETF易方达         市值：0.61      累涨：23.86     7.62      8.40      7.84      6.68      1.63      32
        INDEX_CN_BIG.put("560020", "指数-大盘             ");//红利ETF汇添富         市值：0.65      累涨：19.52     4.83      5.58      9.11      6.67      1.44      33
        INDEX_CN_BIG.put("517180", "指数-大盘             ");//中国国企ETF           市值：9.18      累涨：18.50     5.20      5.30      8.00      6.66      2.10      34
        INDEX_CN_BIG.put("159719", "指数-大盘             ");//国企共赢ETF           市值：2.10      累涨：18.06     5.36      4.68      8.02      6.62      2.19      35
        INDEX_CN_BIG.put("510950", "指数-大盘             ");//上证50ETF指数         市值：0.97      累涨：22.99     6.60      8.54      7.85      6.59      2.10      36
        INDEX_CN_BIG.put("510010", "指数-大盘             ");//180治理ETF            市值：2.38      累涨：31.75     14.41     8.41      8.93      6.54      2.76      37
        INDEX_CN_BIG.put("159836", "指数-大盘             ");//创300ETF              市值：1.76      累涨：35.37     18.16     10.78     6.78      6.54      2.26      38
        INDEX_CN_BIG.put("159332", "指数-大盘             ");//央企红利ETF           市值：1.06      累涨：18.80     5.52      5.28      8.18      6.54      2.06      39
        INDEX_CN_BIG.put("561180", "指数-大盘             ");//A100ETF               市值：1.13      累涨：22.65     7.65      7.64      7.36      6.52      1.57      40
        INDEX_CN_BIG.put("159358", "指数-大盘             ");//中证A500ETF基金       市值：23.16     累涨：22.42     8.39      6.73      7.30      6.52      1.03      41
        INDEX_CN_BIG.put("560500", "指数-大盘             ");//500质量成长ETF        市值：5.26      累涨：25.67     8.98      8.36      8.54      6.47      2.21      42
        INDEX_CN_BIG.put("560520", "指数-大盘             ");//红利低波100ETF基金    市值：0.04      累涨：18.80     5.69      4.49      8.62      6.46      1.53      43
        INDEX_CN_BIG.put("561930", "指数-大盘             ");//沪深300ETF招商        市值：6.58      累涨：21.19     7.08      7.09      7.02      6.46      1.27      44
        INDEX_CN_BIG.put("530050", "指数-大盘             ");//上证50ETF东财         市值：1.91      累涨：22.23     6.20      8.41      7.62      6.44      2.00      45
        INDEX_CN_BIG.put("515680", "指数-大盘             ");//央企创新ETF基金       市值：18.55     累涨：21.06     7.10      6.81      7.15      6.39      0.92      46
        INDEX_CN_BIG.put("560050", "指数-大盘             ");//MSCI中国A50ETF        市值：47.46     累涨：22.69     7.07      7.90      7.72      6.38      2.17      47
        INDEX_CN_BIG.put("560700", "指数-大盘             ");//央企红利50ETF         市值：9.71      累涨：18.56     4.96      6.09      7.51      6.35      1.50      48
        INDEX_CN_BIG.put("530180", "指数-大盘             ");//上证180ETF易方达      市值：1.61      累涨：20.60     5.98      6.78      7.84      6.32      1.35      49
        INDEX_CN_BIG.put("563180", "指数-大盘             ");//高股息ETF             市值：2.77      累涨：19.54     4.71      5.98      8.85      6.29      1.65      50
        INDEX_CN_BIG.put("159547", "指数-大盘             ");//红利低波50ETF         市值：1.28      累涨：19.97     6.05      5.27      8.65      6.20      2.91      51
        INDEX_CN_BIG.put("159758", "指数-大盘             ");//红利质量ETF           市值：5.70      累涨：20.64     6.22      6.25      8.17      6.19      1.25      52
        INDEX_CN_BIG.put("159362", "指数-大盘             ");//A500ETF工银           市值：25.25     累涨：21.78     8.15      6.84      6.79      6.19      1.16      53
        INDEX_CN_BIG.put("159339", "指数-大盘             ");//A500ETF               市值：68.25     累涨：21.30     7.72      6.77      6.81      6.19      1.10      54
        INDEX_CN_BIG.put("159386", "指数-大盘             ");//A500ETF永赢           市值：1.94      累涨：15.95     2.71      6.46      6.88      6.18      1.04      55
        INDEX_CN_BIG.put("530080", "指数-大盘             ");//180指数ETF            市值：0.45      累涨：19.23     5.54      6.63      7.06      6.18      1.20      56
        INDEX_CN_BIG.put("512050", "指数-大盘             ");//A500ETF基金           市值：167.22    累涨：22.56     8.33      7.42      6.81      6.18      0.89      57
        INDEX_CN_BIG.put("159905", "指数-大盘             ");//深红利ETF             市值：31.67     累涨：21.75     4.85      9.11      7.79      6.17      0.74      58
        INDEX_CN_BIG.put("563330", "指数-大盘             ");//A股ETF                市值：0.98      累涨：24.93     9.89      8.50      6.87      6.15      1.39      59
        INDEX_CN_BIG.put("159357", "指数-大盘             ");//中证A500指数ETF       市值：40.54     累涨：21.76     8.39      6.52      6.95      6.15      1.04      60
        INDEX_CN_BIG.put("560890", "指数-大盘             ");//红利低波ETF新华       市值：0.76      累涨：20.23     6.87      5.14      8.22      6.13      2.63      61
        INDEX_CN_BIG.put("515100", "指数-大盘             ");//红利低波100ETF        市值：67.51     累涨：18.04     5.68      3.98      8.38      6.12      1.40      62
        INDEX_CN_BIG.put("159523", "指数-大盘             ");//沪深300成长ETF        市值：0.58      累涨：25.46     8.21      9.98      7.27      6.10      1.95      63
        INDEX_CN_BIG.put("562810", "指数-大盘             ");//上证指数增强ETF       市值：1.27      累涨：9.29                2.09      7.20      6.10      1.84      64
        INDEX_CN_BIG.put("159601", "指数-大盘             ");//A50ETF                市值：34.47     累涨：22.54     7.30      7.85      7.39      6.07      2.28      65
        INDEX_CN_BIG.put("510180", "指数-大盘             ");//上证180ETF            市值：202.11    累涨：20.62     6.26      7.13      7.23      6.03      1.43      66
        INDEX_CN_BIG.put("159150", "指数-大盘             ");//深证50ETF易方达       市值：1.94      累涨：26.19     11.50     7.74      6.95      6.02      0.81      67
        INDEX_CN_BIG.put("563800", "指数-大盘             ");//中证A500ETF龙头       市值：194.85    累涨：22.38     8.54      7.30      6.54      6.02      1.10      68
        INDEX_CN_BIG.put("159350", "指数-大盘             ");//深证50ETF富国         市值：3.01      累涨：26.35     11.25     7.99      7.11      6.00      0.73      69
        INDEX_CN_BIG.put("561580", "指数-大盘             ");//央企红利ETF           市值：6.00      累涨：18.66     5.74      5.58      7.51      6.00      2.08      70
        INDEX_CN_BIG.put("159360", "指数-大盘             ");//中证A500ETF天弘       市值：34.47     累涨：21.39     8.54      6.48      6.37      5.98      1.24      71
        INDEX_CN_BIG.put("530800", "指数-大盘             ");//上证180ETF基金        市值：0.45      累涨：18.21     4.16      7.13      6.92      5.94      1.60      72
        INDEX_CN_BIG.put("563880", "指数-大盘             ");//中证A500指数ETF       市值：60.45     累涨：22.40     8.44      7.22      6.74      5.94      0.86      73
        INDEX_CN_BIG.put("560610", "指数-大盘             ");//A500指数ETF           市值：111.59    累涨：21.86     8.34      6.97      6.55      5.92      1.11      74
        INDEX_CN_BIG.put("159376", "指数-大盘             ");//A500ETF指数基金       市值：4.34      累涨：21.88     8.66      6.65      6.57      5.90      1.41      75
        INDEX_CN_BIG.put("159974", "指数-大盘             ");//央企创新ETF           市值：1.51      累涨：21.24     7.62      6.91      6.71      5.89      0.46      76
        INDEX_CN_BIG.put("510310", "指数-大盘             ");//沪深300ETF易方达      市值：2584.61   累涨：21.53     7.20      7.52      6.81      5.88      1.01      77
        INDEX_CN_BIG.put("560350", "指数-大盘             ");//中证A50ETF指数基金    市值：30.73     累涨：23.07     7.98      7.89      7.20      5.87      1.22      78
        INDEX_CN_BIG.put("159356", "指数-大盘             ");//A500ETF基金           市值：51.96     累涨：21.27     8.05      6.76      6.46      5.86      1.38      79
        INDEX_CN_BIG.put("510710", "指数-大盘             ");//上证50ETF博时         市值：6.22      累涨：21.23     6.46      8.40      6.37      5.86      1.86      80
        INDEX_CN_BIG.put("510040", "指数-大盘             ");//上证180ETF指数        市值：1.25      累涨：19.74     5.31      7.67      6.76      5.86      0.83      81
        INDEX_CN_BIG.put("561000", "指数-大盘             ");//沪深300ETF增强基金    市值：1.22      累涨：23.44     8.00      8.04      7.40      5.85      1.52      82
        INDEX_CN_BIG.put("517030", "指数-大盘             ");//沪港深300ETF易方达    市值：0.64      累涨：25.54     9.36      9.62      6.56      5.83      1.98      83
        INDEX_CN_BIG.put("159578", "指数-大盘             ");//深证主板50ETF南方     市值：0.96      累涨：20.16     6.55      6.86      6.84      5.83      1.25      84
        INDEX_CN_BIG.put("159359", "指数-大盘             ");//中证A500ETF华安       市值：29.60     累涨：21.51     8.40      6.60      6.51      5.81      1.15      85
        INDEX_CN_BIG.put("512890", "指数-大盘             ");//红利低波ETF           市值：158.63    累涨：19.60     6.39      5.24      7.97      5.81      2.73      86
        INDEX_CN_BIG.put("512180", "指数-大盘             ");//MSCIA股ETF基金        市值：0.90      累涨：19.09     6.54      6.39      6.16      5.81      0.96      87
        INDEX_CN_BIG.put("563220", "指数-大盘             ");//中证A500ETF富国       市值：176.20    累涨：21.67     8.19      6.99      6.49      5.79      0.96      88
        INDEX_CN_BIG.put("159592", "指数-大盘             ");//A50ETF基金            市值：23.68     累涨：22.58     7.52      8.05      7.01      5.78      1.30      89
        INDEX_CN_BIG.put("563000", "指数-大盘             ");//中国A50ETF            市值：39.97     累涨：22.61     7.54      8.09      6.98      5.78      2.27      90
        INDEX_CN_BIG.put("560180", "指数-大盘             ");//沪深300ESGETF南方     市值：0.27      累涨：20.59     7.11      6.82      6.66      5.76      0.83      91
        INDEX_CN_BIG.put("510050", "指数-大盘             ");//上证50ETF             市值：1634.67   累涨：21.79     6.11      8.76      6.92      5.75      1.71      92
        INDEX_CN_BIG.put("512280", "指数-大盘             ");//MSCIA股ETF景顺        市值：0.48      累涨：20.27     6.92      6.71      6.64      5.74      1.08      93
        INDEX_CN_BIG.put("561060", "指数-大盘             ");//国企红利ETF           市值：0.54      累涨：17.63     5.40      4.52      7.71      5.73      1.64      94
        INDEX_CN_BIG.put("530000", "指数-大盘             ");//上证50ETF天弘         市值：19.99     累涨：22.74     6.58      8.87      7.29      5.72      2.02      95
        INDEX_CN_BIG.put("515130", "指数-大盘             ");//沪深300ETF博时        市值：2.28      累涨：21.32     7.60      7.20      6.52      5.71      1.08      96
        INDEX_CN_BIG.put("159653", "指数-大盘             ");//ESG300ETF             市值：0.53      累涨：20.89     7.38      6.70      6.81      5.70      1.18      97
        INDEX_CN_BIG.put("562850", "指数-大盘             ");//央企能源ETF           市值：1.32      累涨：15.81     3.38      3.81      8.71      5.69      1.06      98
        INDEX_CN_BIG.put("159515", "指数-大盘             ");//国企红利ETF           市值：0.92      累涨：16.32     5.03      4.14      7.15      5.67      1.61      99
        INDEX_CN_BIG.put("159923", "指数-大盘             ");//中证A100ETF基金       市值：0.33      累涨：22.42     7.86      7.77      6.79      5.66      1.36      100
        INDEX_CN_BIG.put("510060", "指数-大盘             ");//央企ETF               市值：1.43      累涨：16.50     4.66      5.18      6.66      5.65      1.68      101
        INDEX_CN_BIG.put("515770", "指数-大盘             ");//摩根MSCIAETF          市值：0.78      累涨：20.82     7.18      6.62      7.02      5.65      0.72      102
        INDEX_CN_BIG.put("159589", "指数-大盘             ");//红利100ETF            市值：0.77      累涨：18.73     5.38      5.37      7.98      5.65      1.69      103
        INDEX_CN_BIG.put("510290", "指数-大盘             ");//上证380ETF            市值：1.59      累涨：24.77     10.11     7.60      7.21      5.64      1.56      104
        INDEX_CN_BIG.put("515900", "指数-大盘             ");//央企创新驱动ETF       市值：33.45     累涨：20.10     7.50      6.28      6.32      5.63      0.50      105
        INDEX_CN_BIG.put("510330", "指数-大盘             ");//沪深300ETF华夏        市值：1869.37   累涨：21.20     7.18      7.58      6.44      5.62      0.88      106
        INDEX_CN_BIG.put("560530", "指数-大盘             ");//中证A500ETF摩根       市值：86.81     累涨：21.77     8.79      6.76      6.22      5.62      0.97      107
        INDEX_CN_BIG.put("510350", "指数-大盘             ");//沪深300ETF工银        市值：39.48     累涨：21.31     7.27      7.58      6.46      5.60      1.19      108
        INDEX_CN_BIG.put("159916", "指数-大盘             ");//深F60ETF              市值：3.56      累涨：23.66     8.41      8.79      6.46      5.60      0.63      109
        INDEX_CN_BIG.put("510850", "指数-大盘             ");//上证50ETF工银         市值：2.07      累涨：21.96     6.47      8.80      6.69      5.56      1.86      110
        INDEX_CN_BIG.put("561230", "指数-大盘             ");//中证A50ETF基金        市值：22.34     累涨：22.57     7.57      8.03      6.97      5.55      1.12      111
        INDEX_CN_BIG.put("512750", "指数-大盘             ");//基本面50ETF           市值：1.01      累涨：19.39     6.90      5.66      6.83      5.53      2.28      112
        INDEX_CN_BIG.put("515150", "指数-大盘             ");//一带一路ETF           市值：6.86      累涨：16.65     4.32      5.14      7.27      5.53      0.16      113
        INDEX_CN_BIG.put("510030", "指数-大盘             ");//价值ETF               市值：1.67      累涨：19.56     6.80      5.62      7.14      5.52      2.57      114
        INDEX_CN_BIG.put("159903", "指数-大盘             ");//深成ETF               市值：5.18      累涨：26.59     12.39     8.45      5.83      5.51      1.11      115
        INDEX_CN_BIG.put("159602", "指数-大盘             ");//中国A50ETF            市值：10.22     累涨：22.68     7.57      8.12      6.99      5.51      2.19      116
        INDEX_CN_BIG.put("563080", "指数-大盘             ");//中证A50ETF易方达      市值：37.80     累涨：23.47     7.93      8.37      7.17      5.51      1.09      117
        INDEX_CN_BIG.put("563520", "指数-大盘             ");//沪深300ETF永赢        市值：11.67     累涨：19.90     6.69      6.67      6.54      5.51      1.08      118
        INDEX_CN_BIG.put("560030", "指数-大盘             ");//800价值ETF            市值：0.33      累涨：18.30     5.97      5.58      6.75      5.49      1.49      119
        INDEX_CN_BIG.put("510880", "指数-大盘             ");//红利ETF               市值：226.38    累涨：18.84     5.78      4.84      8.22      5.47      1.94      120
        INDEX_CN_BIG.put("159708", "指数-大盘             ");//红利ETF               市值：2.51      累涨：21.15     5.48      8.83      6.84      5.46      0.78      121
        INDEX_CN_BIG.put("515390", "指数-大盘             ");//沪深300ETF指数基金    市值：6.15      累涨：20.49     7.24      7.11      6.14      5.42      1.13      122
        INDEX_CN_BIG.put("510800", "指数-大盘             ");//50ETF基金             市值：5.29      累涨：20.48     6.02      7.99      6.47      5.41      1.58      123
        INDEX_CN_BIG.put("510360", "指数-大盘             ");//沪深300ETF基金        市值：82.94     累涨：20.21     7.20      6.87      6.14      5.39      0.94      124
        INDEX_CN_BIG.put("510130", "指数-大盘             ");//上证中盘ETF易方达     市值：2.23      累涨：17.56     5.70      5.31      6.55      5.39      1.12      125
        INDEX_CN_BIG.put("563280", "指数-大盘             ");//A50增强ETF            市值：0.10      累涨：22.54     7.46      8.42      6.66      5.38      1.53      126
        INDEX_CN_BIG.put("159549", "指数-大盘             ");//红利低波动ETF         市值：37.87     累涨：16.87     5.23      4.13      7.51      5.38      1.62      127
        INDEX_CN_BIG.put("562890", "指数-大盘             ");//中证A50指数ETF        市值：4.78      累涨：22.85     7.81      8.33      6.71      5.32      1.27      128
        INDEX_CN_BIG.put("159338", "指数-大盘             ");//中证A500ETF           市值：219.80    累涨：22.64     8.71      7.77      6.16      5.32      0.99      129
        INDEX_CN_BIG.put("512390", "指数-大盘             ");//平安MSCI低波ETF       市值：1.83      累涨：15.05     4.37      3.87      6.90      5.32      1.68      130
        INDEX_CN_BIG.put("159617", "指数-大盘             ");//500价值ETF            市值：0.35      累涨：19.93     6.96      6.21      7.11      5.30      0.45      131
        INDEX_CN_BIG.put("510760", "指数-大盘             ");//上证综指ETF           市值：22.04     累涨：20.29     6.82      7.35      6.21      5.28      1.76      132
        INDEX_CN_BIG.put("159380", "指数-大盘             ");//A500ETF东财           市值：4.00      累涨：21.27     8.89      6.83      5.55      5.26      1.31      133
        INDEX_CN_BIG.put("560380", "指数-大盘             ");//A100ETF南方           市值：1.86      累涨：21.45     7.71      7.69      6.05      5.25      1.25      134
        INDEX_CN_BIG.put("530880", "指数-大盘             ");//红利ETF国企           市值：1.36      累涨：18.72     6.24      3.72      8.76      5.23      2.59      135
        INDEX_CN_BIG.put("563500", "指数-大盘             ");//中证A500ETF华宝       市值：14.56     累涨：21.35     8.61      6.64      6.10      5.22      1.04      136
        INDEX_CN_BIG.put("159576", "指数-大盘             ");//深证100ETF广发        市值：0.72      累涨：25.12     11.00     7.97      6.15      5.21      0.83      137
        INDEX_CN_BIG.put("159209", "指数-大盘             ");//中证红利质量ETF       市值：2.52      累涨：6.11                          6.11      5.21      2.09      138
        INDEX_CN_BIG.put("159961", "指数-大盘             ");//深100ETF方正富邦      市值：4.21      累涨：23.64     10.53     7.07      6.04      5.20      0.71      139
        INDEX_CN_BIG.put("563020", "指数-大盘             ");//红利低波动ETF         市值：14.96     累涨：18.38     6.17      4.95      7.26      5.19      2.71      140
        INDEX_CN_BIG.put("515180", "指数-大盘             ");//红利ETF易方达         市值：94.40     累涨：18.57     5.49      5.53      7.55      5.18      1.52      141
        INDEX_CN_BIG.put("159969", "指数-大盘             ");//深100ETF银华          市值：0.17      累涨：23.95     10.61     7.66      5.68      5.17      1.10      142
        INDEX_CN_BIG.put("515330", "指数-大盘             ");//300ETF天弘            市值：101.79    累涨：20.42     7.33      6.92      6.17      5.17      1.24      143
        INDEX_CN_BIG.put("515080", "指数-大盘             ");//中证红利ETF           市值：81.15     累涨：18.93     5.63      5.84      7.46      5.15      1.41      144
        INDEX_CN_BIG.put("561200", "指数-大盘             ");//中证A100ETF工银       市值：0.47      累涨：21.95     7.61      8.26      6.08      5.15      0.88      145
        INDEX_CN_BIG.put("159965", "指数-大盘             ");//央视50ETF             市值：0.62      累涨：22.12     7.26      8.35      6.51      5.13      1.05      146
        INDEX_CN_BIG.put("159595", "指数-大盘             ");//中证A50ETF基金        市值：57.93     累涨：22.89     8.03      8.27      6.59      5.12      1.18      147
        INDEX_CN_BIG.put("159379", "指数-大盘             ");//A500ETF融通           市值：5.19      累涨：21.43     7.61      7.93      5.89      5.12      1.33      148
        INDEX_CN_BIG.put("159621", "指数-大盘             ");//MSCIESGETF            市值：0.22      累涨：22.02     7.78      8.01      6.23      5.11      1.06      149
        INDEX_CN_BIG.put("510190", "指数-大盘             ");//上证50ETF指数基金     市值：1.87      累涨：20.04     5.69      7.92      6.43      5.11      1.67      150
        INDEX_CN_BIG.put("512990", "指数-大盘             ");//MSCIA股ETF            市值：2.35      累涨：20.04     7.39      6.68      5.97      5.11      0.90      151
        INDEX_CN_BIG.put("561900", "指数-大盘             ");//沪深300ESGETF         市值：0.48      累涨：20.67     7.45      6.92      6.30      5.10      1.12      152
        INDEX_CN_BIG.put("560510", "指数-大盘             ");//中证A500ETF           市值：68.00     累涨：20.30     8.02      6.66      5.62      5.10      1.11      153
        INDEX_CN_BIG.put("159353", "指数-大盘             ");//中证A500ETF景顺       市值：132.47    累涨：21.38     8.67      7.01      5.70      5.09      1.31      154
        INDEX_CN_BIG.put("512380", "指数-大盘             ");//MSCI中国ETF           市值：1.32      累涨：19.40     6.92      6.70      5.78      5.09      0.79      155
        INDEX_CN_BIG.put("515380", "指数-大盘             ");//沪深300ETF泰康        市值：35.78     累涨：19.75     6.96      7.09      5.70      5.07      0.94      156
        INDEX_CN_BIG.put("510210", "指数-大盘             ");//上证指数ETF           市值：47.79     累涨：19.83     7.30      6.25      6.40      5.07      1.79      157
        INDEX_CN_BIG.put("560150", "指数-大盘             ");//红利低波ETF泰康       市值：7.96      累涨：18.73     6.42      5.09      7.22      5.06      2.56      158
        INDEX_CN_BIG.put("562000", "指数-大盘             ");//中证A100ETF基金       市值：24.97     累涨：21.54     8.13      7.74      5.67      5.05      1.10      159
        INDEX_CN_BIG.put("562320", "指数-大盘             ");//沪深300价值ETF        市值：1.47      累涨：18.96     6.00      6.28      6.68      5.04      1.93      160
        INDEX_CN_BIG.put("515110", "指数-大盘             ");//一带一路ETF易方达     市值：2.79      累涨：16.60     4.24      5.53      6.83      5.04      0.69      161
        INDEX_CN_BIG.put("517300", "指数-大盘             ");//沪港深300ETF          市值：25.01     累涨：26.39     9.97      10.14     6.28      5.02      1.32      162
        INDEX_CN_BIG.put("515450", "指数-大盘             ");//红利低波50ETF         市值：77.62     累涨：17.63     5.37      4.64      7.62      5.00      2.08      163
        INDEX_CN_BIG.put("159970", "指数-大盘             ");//深100ETF工银          市值：0.12      累涨：25.11     11.30     7.74      6.07      4.99      0.87      164
        INDEX_CN_BIG.put("563660", "指数-大盘             ");//A500ETF银河           市值：4.44      累涨：4.98                          4.98      4.98      1.17      165
        INDEX_CN_BIG.put("159596", "指数-大盘             ");//A50ETF华宝            市值：11.52     累涨：22.73     8.49      8.00      6.24      4.98      1.22      166
        INDEX_CN_BIG.put("512160", "指数-大盘             ");//MSCI中国A股ETF        市值：2.81      累涨：20.38     7.72      6.69      6.05      4.97      1.04      167
        INDEX_CN_BIG.put("159943", "指数-大盘             ");//深证成指ETF           市值：2.13      累涨：26.29     12.18     8.70      5.67      4.95      1.43      168
        INDEX_CN_BIG.put("512040", "指数-大盘             ");//价值100ETF            市值：20.51     累涨：18.27     5.47      5.91      6.89      4.93      1.21      169
        INDEX_CN_BIG.put("159656", "指数-大盘             ");//300成长ETF            市值：1.37      累涨：23.90     9.76      7.94      6.20      4.92      1.36      170
        INDEX_CN_BIG.put("510100", "指数-大盘             ");//上证50ETF易方达       市值：47.62     累涨：20.64     5.96      8.61      6.07      4.91      1.87      171
        INDEX_CN_BIG.put("512020", "指数-大盘             ");//A500ETF指数           市值：38.50     累涨：20.05     8.36      6.48      5.21      4.91      0.94      172
        INDEX_CN_BIG.put("560750", "指数-大盘             ");//A500ETF申万菱信       市值：1.37      累涨：17.00     4.58      6.93      5.49      4.91      1.23      173
        INDEX_CN_BIG.put("512910", "指数-大盘             ");//中证A100ETF           市值：2.96      累涨：21.46     7.62      8.02      5.82      4.85      1.31      174
        INDEX_CN_BIG.put("159307", "指数-大盘             ");//红利低波100ETF        市值：8.84      累涨：17.15     5.59      4.64      6.92      4.79      1.38      175
        INDEX_CN_BIG.put("515160", "指数-大盘             ");//MSCI中国ETF招商       市值：4.80      累涨：19.88     7.67      7.04      5.17      4.78      1.13      176
        INDEX_CN_BIG.put("510720", "指数-大盘             ");//红利国企ETF           市值：17.22     累涨：17.28     5.41      4.40      7.47      4.75      2.47      177
        INDEX_CN_BIG.put("512090", "指数-大盘             ");//MSCIA股ETF易方达      市值：3.89      累涨：19.87     7.57      6.60      5.70      4.74      0.99      178
        INDEX_CN_BIG.put("562330", "指数-大盘             ");//中证500价值ETF        市值：0.14      累涨：19.88     6.29      6.84      6.75      4.73      1.28      179
        INDEX_CN_BIG.put("562310", "指数-大盘             ");//沪深300成长ETF        市值：8.45      累涨：22.81     8.33      8.61      5.87      4.72      1.37      180
        INDEX_CN_BIG.put("159581", "指数-大盘             ");//红利ETF基金           市值：25.34     累涨：17.44     5.36      5.22      6.86      4.70      1.41      181
        INDEX_CN_BIG.put("159300", "指数-大盘             ");//300ETF                市值：23.99     累涨：19.82     7.33      7.18      5.31      4.69      1.12      182
        INDEX_CN_BIG.put("512150", "指数-大盘             ");//A50ETF                市值：1.35      累涨：20.00     6.37      7.78      5.85      4.69      1.96      183
        INDEX_CN_BIG.put("512520", "指数-大盘             ");//MSCIETF               市值：0.72      累涨：19.41     7.36      6.54      5.51      4.67      1.23      184
        INDEX_CN_BIG.put("159901", "指数-大盘             ");//深证100ETF            市值：61.49     累涨：24.73     11.23     7.90      5.60      4.67      0.94      185
        INDEX_CN_BIG.put("159393", "指数-大盘             ");//沪深300指数ETF        市值：3.01      累涨：7.95                2.57      5.38      4.67      1.23      186
        INDEX_CN_BIG.put("159593", "指数-大盘             ");//中证A50指数ETF        市值：77.87     累涨：22.06     7.93      7.93      6.20      4.64      1.09      187
        INDEX_CN_BIG.put("516830", "指数-大盘             ");//300ESGETF             市值：1.87      累涨：20.28     7.27      7.43      5.58      4.64      0.98      188
        INDEX_CN_BIG.put("159355", "指数-大盘             ");//800红利低波ETF        市值：2.33      累涨：15.42     5.22      4.21      5.99      4.60      1.41      189
        INDEX_CN_BIG.put("159630", "指数-大盘             ");//A100ETF基金           市值：0.18      累涨：21.12     7.81      7.81      5.50      4.60      1.03      190
        INDEX_CN_BIG.put("159673", "指数-大盘             ");//沪深300ETF鹏华        市值：35.33     累涨：19.59     7.09      7.14      5.36      4.59      1.00      191
        INDEX_CN_BIG.put("159525", "指数-大盘             ");//红利低波ETF           市值：3.23      累涨：18.11     6.66      4.64      6.81      4.59      2.83      192
        INDEX_CN_BIG.put("515310", "指数-大盘             ");//沪深300指数ETF        市值：2.81      累涨：18.96     6.67      7.09      5.20      4.59      1.10      193
        INDEX_CN_BIG.put("159510", "指数-大盘             ");//沪深300价值ETF        市值：1.30      累涨：18.32     6.62      5.78      5.92      4.57      0.93      194
        INDEX_CN_BIG.put("515660", "指数-大盘             ");//沪深300ETF国联安      市值：41.13     累涨：18.88     6.93      6.54      5.41      4.56      1.34      195
        INDEX_CN_BIG.put("510990", "指数-大盘             ");//180ESGETF             市值：0.45      累涨：18.76     6.15      6.73      5.88      4.55      1.14      196
        INDEX_CN_BIG.put("159791", "指数-大盘             ");//300ESGETF             市值：0.32      累涨：21.46     8.31      7.45      5.81      4.54      1.34      197
        INDEX_CN_BIG.put("512080", "指数-大盘             ");//A500ETF中金           市值：14.90     累涨：18.75     6.93      6.84      4.98      4.50      1.23      198
        INDEX_CN_BIG.put("510300", "指数-大盘             ");//沪深300ETF            市值：3744.01   累涨：19.96     7.18      7.48      5.30      4.48      0.89      199
        INDEX_CN_BIG.put("159330", "指数-大盘             ");//沪深300ETF基金        市值：9.40      累涨：18.91     7.03      6.64      5.24      4.47      1.08      200
        INDEX_CN_BIG.put("159591", "指数-大盘             ");//中证A50ETF            市值：11.95     累涨：22.04     8.27      8.16      5.61      4.47      1.19      201
        INDEX_CN_BIG.put("159919", "指数-大盘             ");//沪深300ETF            市值：1649.15   累涨：20.26     7.56      7.50      5.20      4.41      1.20      202
        INDEX_CN_BIG.put("510390", "指数-大盘             ");//沪深300ETF平安        市值：5.61      累涨：19.70     7.38      7.05      5.27      4.40      1.17      203
        INDEX_CN_BIG.put("515300", "指数-大盘             ");//红利低波ETF基金       市值：53.65     累涨：15.65     5.77      3.91      5.97      4.34      1.78      204
        INDEX_CN_BIG.put("515350", "指数-大盘             ");//民生加银300ETF        市值：1.11      累涨：19.46     6.87      7.13      5.46      4.33      1.39      205
        INDEX_CN_BIG.put("562530", "指数-大盘             ");//中证1000价值ETF       市值：0.54      累涨：22.40     7.61      9.04      6.29      4.30      1.26      206
        INDEX_CN_BIG.put("159361", "指数-大盘             ");//A500ETF易方达         市值：143.54    累涨：20.32     8.37      7.23      4.72      4.21      1.09      207
        INDEX_CN_BIG.put("159912", "指数-大盘             ");//深300ETF              市值：1.17      累涨：24.23     11.54     8.36      4.67      4.18      1.07      208
        INDEX_CN_BIG.put("510680", "指数-大盘             ");//上证50ETF基金         市值：1.21      累涨：19.85     5.76      8.75      5.34      4.15      1.87      209
        INDEX_CN_BIG.put("563350", "指数-大盘             ");//中证A50ETF            市值：8.55      累涨：21.19     7.64      8.14      5.41      4.12      1.26      210
        INDEX_CN_BIG.put("561960", "指数-大盘             ");//央企回报ETF           市值：0.93      累涨：16.86     5.05      6.61      5.29      4.09      1.35      211
        INDEX_CN_BIG.put("530300", "指数-大盘             ");//上证180ETF华泰柏瑞    市值：1.76      累涨：17.81     6.08      6.77      4.96      4.07      1.30      212
        INDEX_CN_BIG.put("510980", "指数-大盘             ");//上证综合ETF           市值：3.69      累涨：16.86     6.28      6.07      4.51      4.06      1.82      213
        INDEX_CN_BIG.put("515360", "指数-大盘             ");//方正沪深300ETF        市值：1.93      累涨：19.49     7.47      7.07      4.95      4.04      1.12      214
        INDEX_CN_BIG.put("515910", "指数-大盘             ");//质量ETF               市值：2.21      累涨：21.81     7.96      8.44      5.41      4.03      0.63      215
        INDEX_CN_BIG.put("561880", "指数-大盘             ");//A100ETF基金           市值：4.45      累涨：18.92     5.92      8.11      4.89      4.02      1.22      216
        INDEX_CN_BIG.put("159631", "指数-大盘             ");//中证A100ETF           市值：1.01      累涨：21.15     8.00      7.79      5.36      3.99      0.93      217
        INDEX_CN_BIG.put("159212", "指数-大盘             ");//深100ETF南方          市值：2.29      累涨：3.95                          3.95      3.95      1.20      218
        INDEX_CN_BIG.put("159925", "指数-大盘             ");//沪深300ETF南方        市值：38.38     累涨：19.47     7.07      7.46      4.94      3.92      1.10      219
        INDEX_CN_BIG.put("562060", "指数-大盘             ");//标普红利ETF           市值：14.71     累涨：18.01     5.69      6.57      6.12      3.92      1.79      220
        INDEX_CN_BIG.put("159706", "指数-大盘             ");//深证100ETF华安        市值：0.51      累涨：25.90     12.26     8.62      5.02      3.89      1.38      221
        INDEX_CN_BIG.put("561300", "指数-大盘             ");//300增强ETF            市值：21.03     累涨：18.68     6.95      6.79      4.94      3.86      1.27      222
        INDEX_CN_BIG.put("159975", "指数-大盘             ");//深100ETF招商          市值：0.50      累涨：22.92     10.29     8.27      4.36      3.84      2.10      223
        INDEX_CN_BIG.put("561990", "指数-大盘             ");//沪深300增强ETF        市值：8.16      累涨：19.67     7.60      7.32      4.75      3.82      1.09      224
        INDEX_CN_BIG.put("512550", "指数-大盘             ");//A50ETF基金            市值：4.00      累涨：20.01     6.57      8.29      5.15      3.77      1.97      225
        INDEX_CN_BIG.put("563090", "指数-大盘             ");//上证50增强ETF易方达   市值：0.60      累涨：21.17     7.92      8.32      4.93      3.71      0.89      226
        INDEX_CN_BIG.put("510370", "指数-大盘             ");//300指数ETF            市值：1.12      累涨：17.72     6.03      7.05      4.64      3.71      0.97      227
        INDEX_CN_BIG.put("510380", "指数-大盘             ");//国寿300ETF            市值：15.83     累涨：19.55     8.39      6.84      4.32      3.69      1.12      228
        INDEX_CN_BIG.put("510600", "指数-大盘             ");//申万上证50ETF         市值：0.62      累涨：19.49     6.48      8.20      4.81      3.64      1.91      229
        INDEX_CN_BIG.put("560070", "指数-大盘             ");//央企红利ETF基金       市值：3.47      累涨：16.05     5.01      6.31      4.92      3.56      1.31      230
        INDEX_CN_BIG.put("159627", "指数-大盘             ");//A100ETF               市值：0.40      累涨：19.64     7.51      7.59      4.54      3.51      1.09      231
        INDEX_CN_BIG.put("159910", "指数-大盘             ");//基本面120ETF          市值：2.80      累涨：17.77     7.31      6.57      3.98      3.47      0.51      232
        INDEX_CN_BIG.put("512530", "指数-大盘             ");//沪深300红利ETF        市值：2.24      累涨：16.39     6.02      5.22      5.15      3.36      2.44      233
        INDEX_CN_BIG.put("159207", "指数-大盘             ");//高股息ETF             市值：3.74      累涨：3.35                          3.35      3.35      2.22      234
        INDEX_CN_BIG.put("159661", "指数-大盘             ");//中证A100指数ETF       市值：0.30      累涨：19.82     7.51      7.94      4.37      3.24      1.09      235
        INDEX_CN_BIG.put("159390", "指数-大盘             ");//A50指数ETF            市值：6.42      累涨：2.89                          2.89      2.89      1.29      236
        INDEX_CN_BIG.put("159216", "指数-大盘             ");//深证100ETF大成        市值：0.88      累涨：0.78                          0.78      0.78      0.78      237
        INDEX_CN_BIG.put("512250", "指数-大盘             ");//中证A50ETF招商        市值：0.32      累涨：0.49                          0.49      0.49      0.49      238
        INDEX_CN_BIG.put("159211", "指数-大盘             ");//深证100ETF富国        市值：1.18      累涨：0.30                          0.30      0.30      0.30      239
        INDEX_CN_BIG.put("562080", "指数-大盘             ");//300现金流ETF          市值：2.14      累涨：                                                            240
        INDEX_CN_BIG.put("510810", "指数-大盘             ");//上海国企ETF           市值：74.57     累涨：                                                            241
        INDEX_CN_BIG.put("560820", "指数-大盘             ");//N中证A50ETF新华       市值：2.60      累涨：                                                            242
        INDEX_CN_BIG.put("515780", "指数-大盘             ");//浦银MSCI中国ETF       市值：0.08      累涨：8.92      7.86      1.44                                    243
    }

    public static Map<String, String> INDEX_CN_CITY = new HashMap<>();//指数-国内城市

    static {
        INDEX_CN_CITY.put("159976", "指数-国内城市         ");//湾创ETF               市值：1.19      累涨：33.24     7.08      16.06     13.43     8.12      4.73      1
        INDEX_CN_CITY.put("512970", "指数-国内城市         ");//大湾区ETF             市值：0.75      累涨：29.62     9.03      14.23     9.72      6.35      4.34      2
        INDEX_CN_CITY.put("159623", "指数-国内城市         ");//成渝经济圈ETF         市值：32.83     累涨：29.66     7.39      17.26     8.94      5.74      3.04      3
        INDEX_CN_CITY.put("159743", "指数-国内城市         ");//湖北ETF               市值：1.57      累涨：40.34     12.22     20.84     14.69     5.67      2.86      4
        INDEX_CN_CITY.put("517160", "指数-国内城市         ");//长江保护主题ETF       市值：13.73     累涨：22.55     4.70      11.26     9.63      5.63      4.10      5
        INDEX_CN_CITY.put("512870", "指数-国内城市         ");//杭州湾区ETF           市值：0.41      累涨：33.69     11.23     17.08     12.09     5.51      3.32      6
        INDEX_CN_CITY.put("517330", "指数-国内城市         ");//长江保护ETF           市值：13.72     累涨：22.51     4.98      11.97     8.90      5.47      3.81      7
        INDEX_CN_CITY.put("515760", "指数-国内城市         ");//浙江国资ETF           市值：1.78      累涨：22.05     6.08      11.51     7.53      5.15      2.60      8
        INDEX_CN_CITY.put("517850", "指数-国内城市         ");//张江ETF               市值：0.63      累涨：47.34     14.21     25.01     15.55     5.06      2.61      9
        INDEX_CN_CITY.put("512650", "指数-国内城市         ");//长三角ETF             市值：3.94      累涨：25.38     7.56      13.08     9.40      5.01      3.10      10
        INDEX_CN_CITY.put("512190", "指数-国内城市         ");//浙商之江凤凰ETF       市值：0.61      累涨：19.24     6.80      9.42      7.09      3.58      2.79      15
        INDEX_CN_CITY.put("510810", "指数-国内城市         ");//上海国企ETF           市值：76.95     累涨：20.42     7.35      10.53     5.90      3.39      2.18      16
    }

    public static Map<String, String> INDEX = new HashMap<>();//指数-全部-etf

    static {
        INDEX.putAll(INDEX_CN_NOT);
        INDEX.putAll(INDEX_CN_NOT_USA);
        INDEX.putAll(INDEX_CN_BIG);
        INDEX.putAll(INDEX_HK);
        INDEX.putAll(INDEX_CN_1000);
        INDEX.putAll(INDEX_688);
        INDEX.putAll(INDEX_300);
        INDEX.putAll(INDEX_CN_CITY);
    }

    /**
     * 金融-证券
     */
    public static Map<String, String> JINRONG_ZHENGQUAN = new HashMap<>();//金融-证券

    static {
        JINRONG_ZHENGQUAN.put("513090", "金融-证券             ");//香港证券ETF           市值：75.43     累涨：45.63     10.02     23.88     19.52     6.45      0.24      1
        JINRONG_ZHENGQUAN.put("513190", "金融-证券             ");//港股通金融ETF         市值：5.97      累涨：36.13     10.70     15.98     13.12     6.28      0.91      2
        JINRONG_ZHENGQUAN.put("512070", "金融-证券             ");//证券保险ETF           市值：76.19     累涨：30.07     8.75      13.28     10.63     5.44      0.39      3
        JINRONG_ZHENGQUAN.put("513140", "金融-证券             ");//港股金融ETF           市值：0.79      累涨：33.30     7.69      16.16     12.93     5.33      0.95      4
        JINRONG_ZHENGQUAN.put("159933", "金融-证券             ");//国投金融地产ETF       市值：1.50      累涨：21.91     7.63      7.35      8.10      4.82      1.43      5
        JINRONG_ZHENGQUAN.put("516980", "金融-证券             ");//证券ETF先锋           市值：0.37      累涨：26.50     7.43      12.26     9.73      4.78                6
        JINRONG_ZHENGQUAN.put("515630", "金融-证券             ");//保险证券ETF           市值：2.87      累涨：29.86     8.90      13.56     10.10     4.69                7
        JINRONG_ZHENGQUAN.put("515850", "金融-证券             ");//券商指数ETF           市值：2.64      累涨：31.47     10.77     13.28     10.13     4.55      0.36      8
        JINRONG_ZHENGQUAN.put("159848", "金融-证券             ");//证券ETF基金           市值：1.21      累涨：30.07     10.07     12.78     9.57      4.51                9
        JINRONG_ZHENGQUAN.put("510230", "金融-证券             ");//金融ETF               市值：46.48     累涨：21.76     7.71      7.15      8.07      4.35      1.36      10
        JINRONG_ZHENGQUAN.put("510650", "金融-证券             ");//金融地产ETF           市值：0.42      累涨：22.53     7.87      7.22      8.61      4.31      1.64      11
        JINRONG_ZHENGQUAN.put("512900", "金融-证券             ");//证券ETF南方           市值：69.93     累涨：30.78     10.01     13.40     9.99      4.18                12
        JINRONG_ZHENGQUAN.put("159931", "金融-证券             ");//金融ETF               市值：0.68      累涨：22.85     7.34      8.90      8.70      4.16      1.04      13
        JINRONG_ZHENGQUAN.put("159841", "金融-证券             ");//证券ETF               市值：65.82     累涨：31.85     10.53     14.29     10.09     4.15                14
        JINRONG_ZHENGQUAN.put("512000", "金融-证券             ");//券商ETF               市值：255.88    累涨：31.28     10.18     14.06     9.94      4.13                15
        JINRONG_ZHENGQUAN.put("512880", "金融-证券             ");//证券ETF               市值：310.87    累涨：32.37     10.77     14.41     10.41     4.13                16
        JINRONG_ZHENGQUAN.put("159692", "金融-证券             ");//证券ETF东财           市值：3.86      累涨：30.51     9.89      13.77     9.98      4.12                17
        JINRONG_ZHENGQUAN.put("515010", "金融-证券             ");//券商ETF基金           市值：10.67     累涨：31.06     10.04     13.70     10.23     4.08      0.15      18
        JINRONG_ZHENGQUAN.put("510200", "金融-证券             ");//上证券商ETF           市值：1.61      累涨：26.88     8.54      12.04     9.07      4.03                19
        JINRONG_ZHENGQUAN.put("516200", "金融-证券             ");//证券ETF指数基金       市值：4.05      累涨：30.79     10.17     13.40     9.94      4.03                20
        JINRONG_ZHENGQUAN.put("560090", "金融-证券             ");//证券ETF龙头           市值：19.26     累涨：31.44     10.32     14.09     10.12     4.01                21
        JINRONG_ZHENGQUAN.put("516730", "金融-证券             ");//证券公司ETF           市值：0.97      累涨：29.19     8.88      13.00     9.91      4.00      0.10      22
        JINRONG_ZHENGQUAN.put("159842", "金融-证券             ");//券商ETF               市值：19.57     累涨：30.36     9.98      13.34     9.88      3.99                23
        JINRONG_ZHENGQUAN.put("512570", "金融-证券             ");//证券ETF易方达         市值：8.38      累涨：31.15     10.39     13.82     9.81      3.96      0.09      24
        JINRONG_ZHENGQUAN.put("515560", "金融-证券             ");//证券ETF建信           市值：2.37      累涨：30.38     9.86      13.63     9.54      3.83                25
        JINRONG_ZHENGQUAN.put("159940", "金融-证券             ");//金融地产ETF           市值：10.30     累涨：21.99     7.95      7.87      7.85      3.82      1.03      26
        JINRONG_ZHENGQUAN.put("159993", "金融-证券             ");//证券ETF龙头           市值：16.77     累涨：30.06     10.34     12.85     9.32      3.81      0.08      27
        JINRONG_ZHENGQUAN.put("512640", "金融-证券             ");//金融地产ETF基金       市值：0.72      累涨：21.48     7.00      7.63      8.24      3.70      1.00      28
        JINRONG_ZHENGQUAN.put("515190", "金融-证券             ");//中银证券500ETF        市值：0.87      累涨：27.57     9.17      12.19     7.03      2.52      0.41      29
    }

    public static Map<String, String> JINRONG_GOLD = new HashMap<>();//金融-黄金

    static {
        JINRONG_GOLD.put("159321", "金融-黄金             ");//黄金股票ETF           市值：0.52      累涨：40.00     8.07      14.11     18.04     14.10     9.73      1
        JINRONG_GOLD.put("517520", "金融-黄金             ");//黄金股ETF             市值：28.67     累涨：40.22     8.97      13.88     18.15     13.70     9.29      2
        JINRONG_GOLD.put("159322", "金融-黄金             ");//黄金产业ETF           市值：0.19      累涨：39.60     9.52      12.61     17.57     13.63     9.29      3
        JINRONG_GOLD.put("159562", "金融-黄金             ");//黄金股ETF             市值：3.32      累涨：37.70     8.03      13.20     17.33     13.42     8.74      4
        JINRONG_GOLD.put("159315", "金融-黄金             ");//黄金股ETF基金         市值：0.40      累涨：38.15     9.01      12.48     16.87     13.25     8.91      5
        JINRONG_GOLD.put("517400", "金融-黄金             ");//黄金股票ETF           市值：2.24      累涨：38.05     7.54      13.45     17.49     13.22     8.54      6
        JINRONG_GOLD.put("518660", "金融-黄金             ");//黄金ETF基金           市值：16.69     累涨：23.27     5.59      11.74     6.72      4.59      3.44      7
        JINRONG_GOLD.put("159812", "金融-黄金             ");//黄金基金ETF           市值：4.45      累涨：22.63     5.25      11.56     6.49      4.48      3.43      8
        JINRONG_GOLD.put("159831", "金融-黄金             ");//上海金ETF基金         市值：2.27      累涨：22.55     5.29      11.40     6.48      4.44      3.36      9
        JINRONG_GOLD.put("518800", "金融-黄金             ");//黄金基金ETF           市值：105.41    累涨：22.67     5.43      11.55     6.38      4.43      3.32      10
        JINRONG_GOLD.put("518600", "金融-黄金             ");//上海金ETF             市值：8.75      累涨：22.68     5.05      11.80     6.50      4.43      3.38      11
        JINRONG_GOLD.put("518860", "金融-黄金             ");//黄金ETFAU             市值：9.98      累涨：23.30     5.38      12.14     6.45      4.43      3.40      12
        JINRONG_GOLD.put("159937", "金融-黄金             ");//黄金ETF基金           市值：186.23    累涨：22.85     5.34      11.65     6.49      4.42      3.40      13
        JINRONG_GOLD.put("159830", "金融-黄金             ");//上海金ETF             市值：5.91      累涨：22.15     5.18      11.31     6.38      4.41      3.36      14
        JINRONG_GOLD.put("518880", "金融-黄金             ");//黄金ETF               市值：367.67    累涨：23.15     5.46      11.91     6.44      4.39      3.37      15
        JINRONG_GOLD.put("159934", "金融-黄金             ");//黄金ETF               市值：162.14    累涨：22.85     5.42      11.70     6.42      4.37      3.36      16
        JINRONG_GOLD.put("518850", "金融-黄金             ");//黄金ETF华夏           市值：22.41     累涨：22.88     5.39      11.66     6.48      4.34      3.36      17
        JINRONG_GOLD.put("159834", "金融-黄金             ");//金ETF                 市值：5.10      累涨：22.00     5.04      11.36     6.32      4.32      3.28      18
        JINRONG_GOLD.put("518680", "金融-黄金             ");//金ETF                 市值：10.83     累涨：22.82     5.31      11.84     6.34      4.29      3.38      19
        JINRONG_GOLD.put("518890", "金融-黄金             ");//中银上海金ETF         市值：9.21      累涨：22.57     5.20      11.83     6.25      4.29      3.17      20
    }

    public static Map<String, String> JINRONG_BANK = new HashMap<>();

    static {
        JINRONG_BANK.put("517900", "金融-银行             ");//银行ETF优选           市值：1.18      累涨：37.72     17.46     12.76     7.50      3.90      2.30      1
        JINRONG_BANK.put("515020", "金融-银行             ");//银行ETF华夏           市值：3.66      累涨：25.97     10.68     9.31      6.17      2.92      1.26      2
        JINRONG_BANK.put("512820", "金融-银行             ");//银行ETF龙头           市值：23.34     累涨：26.18     11.21     9.60      5.75      2.62      1.08      3
        JINRONG_BANK.put("512700", "金融-银行             ");//银行ETF南方           市值：12.46     累涨：26.72     11.40     9.84      5.74      2.60      1.13      4
        JINRONG_BANK.put("515290", "金融-银行             ");//银行ETF天弘           市值：39.04     累涨：25.96     10.82     9.64      5.72      2.56      1.13      5
        JINRONG_BANK.put("516210", "金融-银行             ");//银行ETF指数基金       市值：1.19      累涨：24.95     11.57     8.07      5.62      2.53      1.02      6
        JINRONG_BANK.put("512800", "金融-银行             ");//银行ETF               市值：81.03     累涨：26.36     11.14     9.77      5.92      2.49      0.87      7
        JINRONG_BANK.put("516310", "金融-银行             ");//银行ETF易方达         市值：12.15     累涨：24.82     10.30     9.10      5.58      2.46      1.07      8
        JINRONG_BANK.put("159887", "金融-银行             ");//银行ETF               市值：4.98      累涨：25.04     10.96     8.97      5.44      2.39      0.90      9
        JINRONG_BANK.put("512730", "金融-银行             ");//中证银行ETF           市值：0.85      累涨：25.23     10.88     9.57      5.24      2.37      0.92      10
    }

    public static Map<String, String> JINRONG_FANGDICHAN = new HashMap<>();

    static {
        JINRONG_FANGDICHAN.put("516750", "金融-地产             ");//建材ETF               市值：0.67      累涨：23.90     5.84      9.34      8.72      4.86      1.86      1
        JINRONG_FANGDICHAN.put("159745", "金融-地产             ");//建材ETF               市值：5.88      累涨：25.44     6.41      10.13     8.90      4.48      1.19      2
        JINRONG_FANGDICHAN.put("159787", "金融-地产             ");//建材ETF易方达         市值：0.55      累涨：22.72     6.16      9.08      7.48      4.09      1.71      3
        JINRONG_FANGDICHAN.put("159707", "金融-地产             ");//地产ETF               市值：4.84      累涨：31.36     5.93      15.13     10.63     3.93                4
        JINRONG_FANGDICHAN.put("515060", "金融-地产             ");//房地产ETF基金         市值：7.16      累涨：31.56     5.97      15.82     9.77      3.10                5
        JINRONG_FANGDICHAN.put("159768", "金融-地产             ");//房地产ETF             市值：5.10      累涨：30.93     5.58      16.51     8.84      2.98                6
        JINRONG_FANGDICHAN.put("159635", "金融-地产             ");//基建50ETF             市值：1.16      累涨：20.31     3.84      8.54      8.33      2.93      0.48      7
        JINRONG_FANGDICHAN.put("512200", "金融-地产             ");//房地产ETF             市值：61.47     累涨：30.35     5.85      15.82     8.82      2.86                8
        JINRONG_FANGDICHAN.put("512640", "金融-地产             ");//金融地产ETF基金       市值：0.76      累涨：19.59     5.91      8.35      5.55      2.62      0.49      9
        JINRONG_FANGDICHAN.put("159933", "金融-地产             ");//国投金融地产ETF       市值：1.55      累涨：19.86     6.74      8.93      4.66      2.41      0.66      10
        JINRONG_FANGDICHAN.put("159619", "金融-地产             ");//基建ETF               市值：1.36      累涨：20.92     3.86      9.15      8.33      2.28      0.31      12
        JINRONG_FANGDICHAN.put("159940", "金融-地产             ");//金融地产ETF           市值：10.59     累涨：20.31     6.19      9.39      4.73      2.27      0.61      13
        JINRONG_FANGDICHAN.put("510650", "金融-地产             ");//金融地产ETF           市值：0.41      累涨：20.62     7.50      8.60      5.04      2.20      0.52      15
        JINRONG_FANGDICHAN.put("516950", "金融-地产             ");//基建ETF               市值：6.36      累涨：20.87     3.87      9.71      7.67      1.99                20
        JINRONG_FANGDICHAN.put("516970", "金融-地产             ");//基建50ETF             市值：27.19     累涨：20.34     4.04      9.02      7.37      1.87      0.94      22
        JINRONG_FANGDICHAN.put("159662", "金融-地产             ");//交运ETF               市值：0.68      累涨：15.05     5.01      6.99      3.46      1.53      0.51      24
        JINRONG_FANGDICHAN.put("560190", "金融-地产             ");//公用事业ETF           市值：0.90      累涨：9.90      0.73      5.45      3.72      1.51      1.08      25
        JINRONG_FANGDICHAN.put("159301", "金融-地产             ");//公用事业ETF           市值：0.63      累涨：14.95     6.58      4.88      3.49      1.36      1.02      26
        JINRONG_FANGDICHAN.put("561320", "金融-地产             ");//交运ETF               市值：0.72      累涨：13.41     4.91      6.10      2.94      1.20      0.22      27
        JINRONG_FANGDICHAN.put("159666", "金融-地产             ");//交通运输ETF           市值：0.71      累涨：14.06     4.28      7.03      3.17      1.16      0.53      28
        JINRONG_FANGDICHAN.put("560620", "金融-地产             ");//公用事业ETF基金       市值：0.67      累涨：14.21     6.55      4.46      3.31      1.15      0.92      29
    }

    public static Map<String, String> JINRONG_CASH = new HashMap<>();

    static {
        JINRONG_CASH.put("159201", "金融-现金             ");//自由现金流ETF         市值：15.73     累涨：3.41                          3.41      3.31      2.10      1
        JINRONG_CASH.put("159399", "金融-现金             ");//现金流ETF             市值：23.23     累涨：3.69                          3.69      2.89      1.19      2
        JINRONG_CASH.put("511160", "金融-现金             ");//国债ETF东财           市值：31.68     累涨：0.59      0.02      0.35      0.23      0.14      0.13      3
        JINRONG_CASH.put("511980", "金融-现金             ");//现金添富ETF           市值：0.24      累涨：0.36      0.10      0.12      0.14      0.10      0.07      4
        JINRONG_CASH.put("511880", "金融-现金             ");//银华日利ETF           市值：611.01    累涨：0.42      0.14      0.17      0.11      0.06      0.02      5
        JINRONG_CASH.put("511850", "金融-现金             ");//财富宝ETF             市值：12.90     累涨：0.19      0.05      0.09      0.05      0.04      0.01      6
        JINRONG_CASH.put("511800", "金融-现金             ");//易方达货币ETF         市值：1.54      累涨：0.15      0.03      0.07      0.05      0.03      0.02      7
        JINRONG_CASH.put("511990", "金融-现金             ");//华宝添益ETF           市值：683.98    累涨：0.19      0.03      0.11      0.05      0.02      0.01      8
        JINRONG_CASH.put("511910", "金融-现金             ");//融通货币ETF           市值：0.14      累涨：16.28     0.26      15.95     0.07      0.02      0.01      9
        JINRONG_CASH.put("511920", "金融-现金             ");//广发货币ETF           市值：0.44      累涨：16.24     0.06      16.18     0.04      0.02      0.01      10
        JINRONG_CASH.put("511900", "金融-现金             ");//富国货币ETF           市值：1.59      累涨：0.11      0.03      0.05      0.03      0.02      0.01      11
        JINRONG_CASH.put("511810", "金融-现金             ");//理财金货币ETF         市值：5.97      累涨：0.16      0.06      0.07      0.03      0.02      0.01      12
        JINRONG_CASH.put("511820", "金融-现金             ");//鹏华添利ETF           市值：0.54      累涨：10.52     0.04      9.90      0.58      0.01                13
        JINRONG_CASH.put("511830", "金融-现金             ");//华泰货币ETF           市值：0.16      累涨：7.74      0.25      7.45      0.04      0.01                14
        JINRONG_CASH.put("511670", "金融-现金             ");//华泰天天金ETF         市值：0.17      累涨：18.67     0.02      18.58     0.07      0.01                15
        JINRONG_CASH.put("511600", "金融-现金             ");//货币ETF               市值：0.28      累涨：3.49      0.06      3.39      0.04      0.01                16
        JINRONG_CASH.put("511950", "金融-现金             ");//添利货币ETF           市值：0.30      累涨：10.32     0.14      10.15     0.03      0.01                17
        JINRONG_CASH.put("511700", "金融-现金             ");//场内货币ETF           市值：7.58      累涨：0.20      0.07      0.10      0.03      0.01                18
        JINRONG_CASH.put("511960", "金融-现金             ");//嘉实快线ETF           市值：0.23      累涨：9.32      0.04      9.25      0.03      0.01                19
        JINRONG_CASH.put("511660", "金融-现金             ");//货币ETF建信添益       市值：109.28    累涨：0.14      0.05      0.06      0.03      0.01                20
        JINRONG_CASH.put("511930", "金融-现金             ");//国联日盈货币ETF       市值：0.21      累涨：13.09     0.08      12.96     0.05      0.01                21
        JINRONG_CASH.put("511620", "金融-现金             ");//货币基金ETF           市值：1.68      累涨：0.23      0.05      0.15      0.04      0.01                22
        JINRONG_CASH.put("511860", "金融-现金             ");//保证金货币ETF         市值：0.37      累涨：0.10      0.04      0.05      0.01      0.01                23
        JINRONG_CASH.put("511690", "金融-现金             ");//交易货币ETF           市值：8.43      累涨：0.10      0.05      0.04      0.01      0.01                24
        JINRONG_CASH.put("511970", "金融-现金             ");//国寿货币ETF           市值：0.35      累涨：17.18     0.06      17.10     0.02                          25
        JINRONG_CASH.put("159003", "金融-现金             ");//招商快线ETF           市值：2.60      累涨：                                                            26
        JINRONG_CASH.put("159005", "金融-现金             ");//汇添富快钱ETF         市值：0.82      累涨：                                                            27
        JINRONG_CASH.put("159001", "金融-现金             ");//货币ETF               市值：9.90      累涨：                                                            28
        JINRONG_CASH.put("511770", "金融-现金             ");//金鹰增益货币ETF       市值：0.26      累涨：25.15     0.07      25.07     0.01                          29
        JINRONG_CASH.put("511650", "金融-现金             ");//华夏快线ETF           市值：0.94      累涨：0.09      0.03      0.06                                    30
        JINRONG_CASH.put("562080", "金融-现金             ");//N300现金流ETF
        JINRONG_CASH.put("159225", "金融-现金             ");//现金流ETF基金         市值：3.99      累涨：                                                            1
        JINRONG_CASH.put("159222", "金融-现金             ");//自由现金流ETF易方达   市值：10.47     累涨：                                                            2
    }

    /**
     * 金融
     */
    public static Map<String, String> JINRONG = new HashMap<>();

    static {
        JINRONG.putAll(JINRONG_ZHENGQUAN);
        JINRONG.putAll(JINRONG_GOLD);
        JINRONG.putAll(JINRONG_BANK);
        JINRONG.putAll(JINRONG_FANGDICHAN);
        JINRONG.putAll(JINRONG_CASH);
    }

    /**
     * etf-行业-all
     */
    public static Map<String, String> BIZ_ALL = new HashMap<>();

    static {
        BIZ_ALL.putAll(XIAOFEI);
        BIZ_ALL.putAll(KEJI);
        BIZ_ALL.putAll(YILIAO);
        BIZ_ALL.putAll(JINRONG);
        BIZ_ALL.putAll(ZIYUAN);
    }

    /**
     * ETF_All 全部：指数、板块
     * 2022-10-31我的etf共收录：670
     */
    public static Map<String, String> ETF_All = new HashMap<>();

    static {
        ETF_All.putAll(INDEX);
        ETF_All.putAll(BIZ_ALL);
    }

    /**
     * ETF涨幅数据：查询数据根据名称列表模糊查询
     */
    private static void findByTypeName(String date, List nameLikeList, List nameNoLikeList, String typeEn, String typeCn) {
//        String typeEn = "";
//        String typeCn = "";
        CondEtfAdrCount condition = new CondEtfAdrCount();
        condition.setDate(date);
        condition.setOrderBy(ORDER_FIELD_ADR_UP_SUM_1_60 + DB_DESC);

        // 科技
        {

//            condition.setLikeNameList(ContEtfNameKey.KEJI_RUAN_JIAN);//科技-软件
//            typeEn = "KEJI_RUAN_JIAN";
//            typeCn = ContEtfTypeName.KEJI_RUAN_JIAN;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_GONG_YE);
//        condition.setNotLikeNameList(ContEtfNameKey.KEJI_GONG_YE_NOLIKE);
//        typeEn = "KEJI_GONG_YE";
//        typeCn = ContEtfTypeName.KEJI_GONG_YE;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_TONG_XIN);
//        condition.setNotLikeNameList(ContEtfNameKey.KEJI_GONG_YE_NOLIKE);
//        typeEn = "KEJI_TONG_XIN";
//        typeCn = ContEtfTypeName.KEJI_TONG_XIN;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_NEW_CAR);
//        typeEn = "KEJI_NEW_CAR";
//        typeCn = ContEtfTypeName.KEJI_NEW_CAR;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_NEW_ENERGY);
//        typeEn = "KEJI_NEW_ENERGY";
//        typeCn = ContEtfTypeName.KEJI_NEW_ENERGY;

//        condition.setLikeNameList(ContEtfNameKey.KEJI_HK);
//        typeEn = "KEJI_HK";
//        typeCn = ContEtfTypeName.KEJI_HK;
        }
        // 消费
        {
            //        condition.setLikeNameList(XIAOFEI_HK);

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_WINE);
//        typeEn = "XIAOFEI_WINE";
//        typeCn = ContEtfTypeName.XIAOFEI_WINE;

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_COMMON);
//        condition.setNotLikeNameList(ContEtfNameKey.XIAOFEI_COMMON_NOLIKE);
//        typeEn = "XIAOFEI_COMMON";
//        typeCn = ContEtfTypeName.XIAOFEI_COMMON;

//        condition.setLikeNameList(ContEtfNameKey.XIAOFEI_MEDIA);
//        typeEn = "XIAOFEI_MEDIA";
//        typeCn = ContEtfTypeName.XIAOFEI_MEDIA;
        }
        // 金融
        {
            //        condition.setNotLikeNameList(JINRONG);
//        condition.setLikeNameList(JINRONG_BANK);
//        condition.setLikeNameList(JINRONG_FANGDICHAN);
//        condition.setLikeNameList(ContEtfNameKey.JINRONG_ZHENGQUAN);
//        condition.setNotLikeNameList(ContEtfNameKey.JINRONG_ZHENGQUAN_NOLIKE);
//        typeEn = "JINRONG_ZHENGQUAN";
//        typeCn = ContEtfTypeName.JINRONG_ZHENGQUAN;

//            condition.setLikeNameList(ContEtfNameKey.JINRONG_CASH);
//            typeEn = "JINRONG_CASH";
//            typeCn = ContEtfTypeName.JINRONG_CASH;

//        condition.setLikeNameList(JINRONG_COMMON);
//        condition.setLikeNameList(ContEtfNameKey.JINRONG_GOLD);
//        condition.setNotLikeNameList(ContEtfNameKey.JINRONG_GOLD_NOLIKE);

//        typeEn = "JINRONG_GOLD";
//        typeCn = ContEtfTypeName.JINRONG_GOLD;
//        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
        }
        // 医疗
        {
            //
//            condition.setLikeNameList(ContEtfNameKey.YILIAO_COMMON);
//            typeEn = "YILIAO_COMMON";
//            typeCn = ContEtfTypeName.YILIAO_COMMON;
        }


        //指数
        {
            //        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT_USA);
//        typeEn = "INDEX_CN_NOT_USA";
//        typeCn = ContEtfTypeName.INDEX_CN_NOT_USA;

//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_NOT);
//        typeEn = "INDEX_CN_NOT";
//        typeCn = ContEtfTypeName.INDEX_CN_NOT;

//            condition.setLikeNameList(ContEtfNameKey.INDEX_CN_BIG);
//            condition.setNotLikeNameList(ContEtfNameKey.INDEX_CN_BIG_NOLIKE);
//            typeEn = "INDEX_CN_BIG";
//            typeCn = ContEtfTypeName.INDEX_CN_BIG;

//        condition.setLikeNameList(ContEtfNameKey.INDEX_HK);
//        typeEn = "INDEX_HK";
//        typeCn = ContEtfTypeName.INDEX_HK;

//        condition.setLikeNameList(INDEX_300);
//        condition.setNotLikeNameList(INDEX_300_NOLIKE);

//            condition.setLikeNameList(ContEtfNameKey.INDEX_688);
//            condition.setNotLikeNameList(ContEtfNameKey.INDEX_688_NOLIKE);
//            typeEn = "INDEX_688";
//            typeCn = ContEtfTypeName.INDEX_688;

//        condition.setLikeNameList(INDEX_CN_1000);
//        condition.setNotLikeNameList(INDEX_CN_NOT);

//        condition.setLikeNameList(ContEtfNameKey.INDEX_CN_CITY);
//        typeEn = "INDEX_CN_CITY";
//        typeCn = ContEtfTypeName.INDEX_CN_CITY;

//        condition.setLikeNameList(ZIYUAN_NONGYE);
//        condition.setLikeNameList(ZIYUAN_CAILIAO);
//        condition.setLikeNameList(ContEtfNameKey.ZIYUAN_XIYOU);
//        typeEn = "ZIYUAN_XIYOU";
//        typeCn = ContEtfTypeName.ZIYUAN_XIYOU;

//        condition.setLikeNameList(ContEtfNameKey.ZIYUAN_COMMON);
//        condition.setNotLikeNameList(ContEtfNameKey.ZIYUAN_COMMON_NOLIKE);
//        typeEn = "ZIYUAN_COMMON";
//        typeCn = ContEtfTypeName.ZIYUAN_COMMON;
        }

        //资源
        {

            condition.setLikeNameList(nameLikeList);
            condition.setNotLikeNameList(nameNoLikeList);
//        typeEn = "ZIYUAN_COMMON";
//        typeCn = ContEtfTypeName.ZIYUAN_COMMON;
        }

//
        List<EtfAdrCountVo> etfListLikeName = EtfAdrCountService.listEtfAdrCountLikeName(condition);//查询列表，模糊查询：名称列表
        EtfControl.updateTypeName(condition, date, true);//保存或更新ETF涨幅次数-批量更新基础信息

        if (etfListLikeName == null) {
            System.out.println("数据为null");
        }
        int num = 0;//序号
        //计算涨幅合计修正值：最近60日+最近5日乘12
        for (EtfAdrCountVo vo : etfListLikeName) {
            BigDecimal day60 = new BigDecimal("0");
            BigDecimal day5 = new BigDecimal("0");
            BigDecimal adr_up_sum_1_60 = vo.getADR_UP_SUM_1_60();
            BigDecimal adr_up_sum_1_5 = vo.getADR_UP_SUM_1_5();
            if (adr_up_sum_1_60 != null) {
                day60 = adr_up_sum_1_60.setScale(2, BigDecimal.ROUND_HALF_UP);
            }
            if (adr_up_sum_1_5 != null) {
                day5 = adr_up_sum_1_5.setScale(2, BigDecimal.ROUND_HALF_UP);
            }
            BigDecimal day5Cheng12 = day5.multiply(new BigDecimal("12"));
            BigDecimal day60and5Cheng12 = day60.add(day5Cheng12);
            vo.setAdrUpSum_60_and_10c6(day60and5Cheng12);
        }
        //排序
        etfListLikeName = etfListLikeName.stream().filter(e -> e != null).sorted(Comparator.comparing(EtfAdrCountVo::getAdrUpSum_60_and_10c6, Comparator.nullsFirst(BigDecimal::compareTo)).reversed()).collect(Collectors.toList());

        System.out.println("    static {");
        for (EtfAdrCountVo vo : etfListLikeName) {
            StringBuffer sb = new StringBuffer();

            sb.append("    ");
            sb.append("    ");
            sb.append(typeEn + ".put(\"").append(StockUtil.formatStName(vo.getF12(), SIZE_6)).append("\"");
            sb.append(", \"" + StockUtil.formatStName(typeCn, SIZE_22) + "\");");
//            sb.append(", \"" + StockUtil.formatStName(vo.getF14(), SIZE_22) + "\");");
            sb.append("//");
            sb.append(StockUtil.formatStName(vo.getF14(), SIZE_22));
            sb.append(StockUtil.formatStName("市值：", SIZE_6));
            BigDecimal marketValue = null;
            if (vo.getF20() != null) {
                marketValue = vo.getF20().divide(NUM_YI_1, 2, BigDecimal.ROUND_HALF_UP);
            }
            sb.append(StockUtil.formatDouble(marketValue, SIZE_10));
            sb.append(StockUtil.formatStName("累涨：", SIZE_6));
            if (vo.getADR_UP_SUM_1_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_40_60() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_40_60().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_20_40() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_20_40().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_20() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_20().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            if (vo.getADR_UP_SUM_1_10() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_10().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatStName("5日：", SIZE_6));
            if (vo.getADR_UP_SUM_1_5() != null) {
                sb.append(StockUtil.formatDouble(vo.getADR_UP_SUM_1_5().setScale(2, BigDecimal.ROUND_HALF_UP), SIZE_10));
            } else {
                sb.append(StockUtil.formatStName("", SIZE_10));
            }
            sb.append(StockUtil.formatStName("累涨修正：", SIZE_10));
            sb.append(StockUtil.formatDouble(vo.getAdrUpSum_60_and_10c6(), SIZE_10));

            sb.append(StockUtil.formatInt(++num, SIZE_6));
            System.out.println(sb);
        }
        System.out.println("    }");

    }

    public static void main(String[] args) {
//        String date = DateUtil.getToday(DateUtil.YYYY_MM_DD);
        String date = "2025-04-30";
//        findByTypeName(date,ContEtfNameKey.ZIYUAN_OIL,null,"ZIYUAN_OIL",ContEtfTypeName.ZIYUAN_OIL);//查询数据根据名称模糊查询

        //        findByTypeName(date, ContEtfNameKey.KEJI_JUNGONG, null, "KEJI_JUNGONG", ContEtfTypeName.KEJI_JUNGONG);
//        findByTypeName(date, ContEtfNameKey.KEJI_GONG_YE, ContEtfNameKey.KEJI_GONG_YE_NOLIKE, "KEJI_GONG_YE", ContEtfTypeName.KEJI_GONG_YE);
        findByTypeName(date, ContEtfNameKey.KEJI_RUAN_JIAN, null, "KEJI_RUAN_JIAN", ContEtfTypeName.KEJI_RUAN_JIAN);
//        findByTypeName(date, ContEtfNameKey.KEJI_XIN_PIAN, null, "KEJI_XIN_PIAN", ContEtfTypeName.KEJI_XIN_PIAN);
//        findByTypeName(date, ContEtfNameKey.KEJI_TONG_XIN, null, "KEJI_TONG_XIN", ContEtfTypeName.KEJI_TONG_XIN);
//        findByTypeName(date, ContEtfNameKey.KEJI_HK, null, "KEJI_HK", ContEtfTypeName.KEJI_HK);
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_ENERGY, null, "KEJI_NEW_ENERGY", ContEtfTypeName.KEJI_NEW_ENERGY);
//        findByTypeName(date, ContEtfNameKey.KEJI_NEW_CAR, null, "KEJI_NEW_CAR", ContEtfTypeName.KEJI_NEW_CAR);
    }
}
